; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/EtherHub.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.ExecuteOnStartup = type { void ()*, %class.ExecuteOnStartup* }
%class.cEnvir = type <{ %class.TOmnetApp*, i32, i32, [81 x i8], [7 x i8] }>
%class.TOmnetApp = type opaque
%class.cHead = type { %class.cObject }
%class.cObject = type { i32 (...)**, i8*, i8, i8, %class.cObject*, %class.cObject*, %class.cObject*, %class.cObject* }
%class.cModuleType = type { %class.cObject, i8*, %class.cModuleInterface*, %class.cModule* (i8*, %class.cModule*)* }
%class.cModuleInterface = type { %class.cObject, i32, %"struct.cModuleInterface::sGateInfo"*, i32, %"struct.cModuleInterface::sParamInfo"*, i32, %"struct.cModuleInterface::sMachineInfo"* }
%"struct.cModuleInterface::sGateInfo" = type { i8*, i8, i8 }
%"struct.cModuleInterface::sParamInfo" = type { i8*, i8* }
%"struct.cModuleInterface::sMachineInfo" = type { i8* }
%class.cModule = type { %class.cObject, i8*, %class.cModuleType*, i32, %class.cModule*, %class.cArray, %class.cArray, %class.cArray, %class.cHead, i32, i32, %class.opp_string, %class.opp_string, void (%class.cModule*, i1, i8*)*, i8* }
%class.cArray = type { %class.cObject, %class.cObject**, i32, i32, i32, i32 }
%class.opp_string = type { i8* }
%class.EtherHub = type { %class.cSimpleModule, i32, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !14, subprograms: !3476, globals: !3589, imports: !3591)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/EtherHub.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !{!15, !72, !76, !77, !84, !91, !106, !111, !115, !119, !258, !307, !383, !3, !534, !609, !610, !966, !1001, !1005, !1015, !1070, !1073, !1078, !1083, !1087, !1130, !1134, !1136, !1146, !1151, !1152, !1155, !1158, !1171, !1182, !1189, !1193, !1197, !1234, !1237, !1239, !1240, !1241, !1242, !1244, !1255, !1284, !1305, !1322, !1428, !9, !1429, !1448, !1466, !1568, !1742, !1921, !1965, !2009, !2014, !2018, !2021, !2027, !2112, !2145, !2179, !2353, !2578, !2591, !2595, !2602, !2605, !2608, !2620, !2623, !2701, !2742, !2782, !2785, !2798, !2815, !2819, !2857, !2867, !2870, !2876, !2879, !3011, !3084, !3118, !3124, !3155, !3156, !3236, !3241, !1464, !1929, !1457, !3279, !3367, !3475}
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !16, line: 122, size: 1216, align: 64, elements: !17, identifier: "_ZTS7__sFILE")
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!17 = !{!18, !21, !23, !24, !26, !27, !28, !29, !31, !35, !41, !51, !57, !58, !60, !61, !65, !69, !70, !71}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !16, line: 123, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !16, line: 124, baseType: !22, size: 32, align: 32, offset: 64)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !16, line: 125, baseType: !22, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !16, line: 126, baseType: !25, size: 16, align: 16, offset: 128)
!25 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !16, line: 127, baseType: !25, size: 16, align: 16, offset: 144)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !16, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !16, line: 129, baseType: !22, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !16, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !16, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!22, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !16, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!22, !30, !39, !22}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !16, line: 135, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !30, !45, !22}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !16, line: 77, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !16, line: 136, baseType: !52, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!22, !30, !55, !22}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !16, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !16, line: 140, baseType: !59, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !16, line: 141, baseType: !22, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !16, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !16, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !16, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !16, line: 151, baseType: !22, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !16, line: 152, baseType: !45, size: 64, align: 64, offset: 1152)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !16, line: 88, size: 128, align: 64, elements: !73, identifier: "_ZTS6__sbuf")
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !16, line: 89, baseType: !19, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !16, line: 90, baseType: !22, size: 32, align: 32, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !16, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !78, identifier: "_ZTS13__va_list_tag")
!78 = !{!79, !81, !82, !83}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !80, size: 32, align: 32)
!80 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !80, size: 32, align: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !30, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !30, size: 64, align: 64, offset: 128)
!84 = !DICompositeType(tag: DW_TAG_union_type, file: !49, line: 76, size: 1024, align: 64, elements: !85, identifier: "_ZTS11__mbstate_t")
!85 = !{!86, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !49, line: 77, baseType: !87, size: 1024, align: 8)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !49, line: 78, baseType: !50, size: 64, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !92, line: 73, size: 448, align: 64, elements: !93, identifier: "_ZTS2tm")
!92 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !92, line: 74, baseType: !22, size: 32, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !92, line: 75, baseType: !22, size: 32, align: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !92, line: 76, baseType: !22, size: 32, align: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !92, line: 77, baseType: !22, size: 32, align: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !92, line: 78, baseType: !22, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !92, line: 79, baseType: !22, size: 32, align: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !92, line: 80, baseType: !22, size: 32, align: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !92, line: 81, baseType: !22, size: 32, align: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !92, line: 82, baseType: !22, size: 32, align: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !92, line: 83, baseType: !104, size: 64, align: 64, offset: 320)
!104 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !92, line: 84, baseType: !39, size: 64, align: 64, offset: 384)
!106 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 82, size: 64, align: 32, elements: !108, identifier: "_ZTS5div_t")
!107 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !107, line: 83, baseType: !22, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !107, line: 84, baseType: !22, size: 32, align: 32, offset: 32)
!111 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 87, size: 128, align: 64, elements: !112, identifier: "_ZTS6ldiv_t")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !107, line: 88, baseType: !104, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !107, line: 89, baseType: !104, size: 64, align: 64, offset: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 93, size: 128, align: 64, elements: !116, identifier: "_ZTS7lldiv_t")
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !107, line: 94, baseType: !50, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !107, line: 95, baseType: !50, size: 64, align: 64, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ostream<char, std::__1::char_traits<char> >", scope: !121, file: !120, line: 1108, size: 1280, align: 64, elements: !124, vtableHolder: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", templateParams: !255, identifier: "_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!120 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ostream", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !DINamespace(name: "__1", scope: !123, file: !122, line: 369)
!122 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!123 = !DINamespace(name: "std", scope: null, file: !122, line: 368)
!124 = !{!125, !126, !131, !136, !139, !143, !148, !151, !157, !164, !171, !175, !178, !182, !185, !188, !191, !195, !198, !202, !206, !210, !214, !219, !222, !226, !234, !237, !245, !248, !254}
!125 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", offset: 24, flags: DIFlagPublic | DIFlagVirtual)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$basic_ostream", scope: !120, file: !120, baseType: !127, size: 64, flags: DIFlagArtificial)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!22}
!131 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 163, type: !132, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !135}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!136 = !DISubprogram(name: "~basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 164, type: !137, isLocal: false, isDefinition: false, scopeLine: 164, containingType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !134}
!139 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 176, type: !140, isLocal: false, isDefinition: false, scopeLine: 176, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !134, !142}
!142 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!143 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 182, type: !144, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !134, !146}
!146 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!148 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEEaSERKS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 183, type: !149, isLocal: false, isDefinition: false, scopeLine: 183, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{!142, !134, !146}
!151 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRS3_S4_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 191, type: !152, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!152 = !DISubroutineType(types: !153)
!153 = !{!142, !134, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!142, !142}
!157 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_9basic_iosIcS2_EES6_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 192, type: !158, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubroutineType(types: !159)
!159 = !{!142, !134, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !163}
!163 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!164 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_8ios_baseES5_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 194, type: !165, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!165 = !DISubroutineType(types: !166)
!166 = !{!142, !134, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !170}
!170 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__18ios_baseE")
!171 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEb", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 195, type: !172, isLocal: false, isDefinition: false, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!172 = !DISubroutineType(types: !173)
!173 = !{!142, !134, !174}
!174 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!175 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEs", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 196, type: !176, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!142, !134, !25}
!178 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEt", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 197, type: !179, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!179 = !DISubroutineType(types: !180)
!180 = !{!142, !134, !181}
!181 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!182 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEi", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 198, type: !183, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!142, !134, !22}
!185 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEj", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 199, type: !186, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!142, !134, !80}
!188 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 200, type: !189, isLocal: false, isDefinition: false, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!142, !134, !104}
!191 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEm", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 201, type: !192, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{!142, !134, !194}
!194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!195 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEx", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 202, type: !196, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{!142, !134, !50}
!198 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEy", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 203, type: !199, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{!142, !134, !201}
!201 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!202 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEf", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 204, type: !203, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{!142, !134, !205}
!205 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!206 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEd", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 205, type: !207, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{!142, !134, !209}
!209 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!210 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEe", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 206, type: !211, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubroutineType(types: !212)
!212 = !{!142, !134, !213}
!213 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!214 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPKv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 207, type: !215, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{!142, !134, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!219 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 208, type: !220, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!220 = !DISubroutineType(types: !221)
!221 = !{!142, !134, !135}
!222 = !DISubprogram(name: "put", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE3putEc", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 211, type: !223, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!223 = !DISubroutineType(types: !224)
!224 = !{!142, !134, !225}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 156, baseType: !40)
!226 = !DISubprogram(name: "write", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5writeEPKcl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 212, type: !227, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!227 = !DISubroutineType(types: !228)
!228 = !{!142, !134, !229, !231}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !121, file: !4, line: 229, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !233, line: 51, baseType: !104)
!233 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!234 = !DISubprogram(name: "flush", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5flushEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 213, type: !235, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{!142, !134}
!237 = !DISubprogram(name: "tellp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5tellpEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 216, type: !238, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !134}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 159, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 628, baseType: !243)
!242 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "streampos", scope: !121, file: !244, line: 176, baseType: !"_ZTSNSt3__14fposI11__mbstate_tEE")
!244 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!245 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpENS_4fposI11__mbstate_tEE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 217, type: !246, isLocal: false, isDefinition: false, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!142, !134, !240}
!248 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpExNS_8ios_base7seekdirE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 218, type: !249, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!249 = !DISubroutineType(types: !250)
!250 = !{!142, !134, !251, !"_ZTSNSt3__18ios_base7seekdirE"}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 160, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 627, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamoff", scope: !121, file: !244, line: 187, baseType: !50)
!254 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !120, line: 222, type: !137, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!255 = !{!256, !257}
!256 = !DITemplateTypeParameter(name: "_CharT", type: !40)
!257 = !DITemplateTypeParameter(name: "_Traits", type: !"_ZTSNSt3__111char_traitsIcEE")
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !121, file: !242, line: 623, size: 8, align: 8, elements: !259, templateParams: !306, identifier: "_ZTSNSt3__111char_traitsIcEE")
!259 = !{!260, !267, !270, !271, !276, !279, !282, !286, !287, !290, !294, !297, !300, !303}
!260 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignERcRKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 631, type: !261, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !263, !265}
!263 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 625, baseType: !40)
!265 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!267 = !DISubprogram(name: "eq", linkageName: "_ZNSt3__111char_traitsIcE2eqEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 633, type: !268, isLocal: false, isDefinition: false, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{!174, !264, !264}
!270 = !DISubprogram(name: "lt", linkageName: "_ZNSt3__111char_traitsIcE2ltEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 635, type: !268, isLocal: false, isDefinition: false, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "compare", linkageName: "_ZNSt3__111char_traitsIcE7compareEPKcS3_m", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 638, type: !272, isLocal: false, isDefinition: false, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{!22, !274, !274, !275}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 62, baseType: !194)
!276 = !DISubprogram(name: "length", linkageName: "_ZNSt3__111char_traitsIcE6lengthEPKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 640, type: !277, isLocal: false, isDefinition: false, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{!275, !274}
!279 = !DISubprogram(name: "find", linkageName: "_ZNSt3__111char_traitsIcE4findEPKcmRS2_", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 641, type: !280, isLocal: false, isDefinition: false, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true)
!280 = !DISubroutineType(types: !281)
!281 = !{!274, !274, !275, !265}
!282 = !DISubprogram(name: "move", linkageName: "_ZNSt3__111char_traitsIcE4moveEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 643, type: !283, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !285, !274, !275}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!286 = !DISubprogram(name: "copy", linkageName: "_ZNSt3__111char_traitsIcE4copyEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 645, type: !283, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true)
!287 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignEPcmc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 650, type: !288, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{!285, !285, !275, !264}
!290 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt3__111char_traitsIcE7not_eofEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 653, type: !291, isLocal: false, isDefinition: false, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 626, baseType: !22)
!294 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt3__111char_traitsIcE12to_char_typeEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 655, type: !295, isLocal: false, isDefinition: false, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!264, !293}
!297 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt3__111char_traitsIcE11to_int_typeEc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 657, type: !298, isLocal: false, isDefinition: false, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{!293, !264}
!300 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt3__111char_traitsIcE11eq_int_typeEii", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 659, type: !301, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{!174, !293, !293}
!303 = !DISubprogram(name: "eof", linkageName: "_ZNSt3__111char_traitsIcE3eofEv", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !242, line: 661, type: !304, isLocal: false, isDefinition: false, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!293}
!306 = !{!256}
!307 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ios<char, std::__1::char_traits<char> >", scope: !121, file: !308, line: 570, size: 1216, align: 64, elements: !309, vtableHolder: !"_ZTSNSt3__18ios_baseE", templateParams: !255, identifier: "_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!308 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/streambuf", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!309 = !{!310, !311, !313, !315, !320, !321, !325, !329, !330, !331, !332, !333, !334, !335, !336, !339, !342, !345, !348, !351, !354, !358, !362, !365, !370, !373, !376, !377, !378, !381, !382}
!310 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__18ios_baseE", flags: DIFlagPublic)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__tie_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 647, baseType: !312, size: 64, align: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__fill_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 648, baseType: !314, size: 32, align: 32, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 579, baseType: !293)
!315 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEcvbEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 585, type: !316, isLocal: false, isDefinition: false, scopeLine: 585, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubroutineType(types: !317)
!317 = !{!174, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!320 = !DISubprogram(name: "operator!", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEntEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 586, type: !316, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE7rdstateEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 587, type: !322, isLocal: false, isDefinition: false, scopeLine: 587, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{!324, !318}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "iostate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 256, baseType: !80)
!325 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5clearEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 588, type: !326, isLocal: false, isDefinition: false, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328, !324}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!329 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE8setstateEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 589, type: !326, isLocal: false, isDefinition: false, scopeLine: 589, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4goodEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 590, type: !316, isLocal: false, isDefinition: false, scopeLine: 590, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3eofEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 591, type: !316, isLocal: false, isDefinition: false, scopeLine: 591, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!332 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4failEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 592, type: !316, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3badEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 593, type: !316, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 595, type: !322, isLocal: false, isDefinition: false, scopeLine: 595, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 596, type: !326, isLocal: false, isDefinition: false, scopeLine: 596, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 600, type: !337, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !328, !135}
!339 = !DISubprogram(name: "~basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 601, type: !340, isLocal: false, isDefinition: false, scopeLine: 601, containingType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !328}
!342 = !DISubprogram(name: "tie", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 605, type: !343, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{!312, !318}
!345 = !DISubprogram(name: "tie", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEPNS_13basic_ostreamIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 607, type: !346, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!312, !328, !312}
!348 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 610, type: !349, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!135, !318}
!351 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 612, type: !352, isLocal: false, isDefinition: false, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!135, !328, !135}
!354 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE7copyfmtERKS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 614, type: !355, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!163, !328, !357}
!357 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !319)
!358 = !DISubprogram(name: "fill", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 617, type: !359, isLocal: false, isDefinition: false, scopeLine: 617, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !318}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 576, baseType: !40)
!362 = !DISubprogram(name: "fill", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 619, type: !363, isLocal: false, isDefinition: false, scopeLine: 619, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{!361, !328, !361}
!365 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5imbueERKNS_6localeE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 622, type: !366, isLocal: false, isDefinition: false, scopeLine: 622, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!"_ZTSNSt3__16localeE", !328, !368}
!368 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16localeE")
!370 = !DISubprogram(name: "narrow", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE6narrowEcc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 625, type: !371, isLocal: false, isDefinition: false, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubroutineType(types: !372)
!372 = !{!40, !318, !361, !40}
!373 = !DISubprogram(name: "widen", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5widenEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 627, type: !374, isLocal: false, isDefinition: false, scopeLine: 627, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{!361, !318, !40}
!376 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 631, type: !340, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!377 = !DISubprogram(name: "init", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4initEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 634, type: !337, isLocal: false, isDefinition: false, scopeLine: 634, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!378 = !DISubprogram(name: "move", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4moveERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 637, type: !379, isLocal: false, isDefinition: false, scopeLine: 637, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !328, !163}
!381 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 643, type: !379, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!382 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE9set_rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 645, type: !337, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!383 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !121, file: !4, line: 231, size: 1088, align: 64, elements: !384, vtableHolder: !"_ZTSNSt3__18ios_baseE", identifier: "_ZTSNSt3__18ios_baseE")
!384 = !{!385, !386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !411, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !432, !434, !435, !436, !437, !439, !440, !441, !443, !444, !445, !450, !454, !455, !458, !461, !464, !467, !468, !469, !472, !475, !476, !480, !484, !487, !490, !494, !497, !500, !503, !506, !507, !510, !511, !512, !513, !514, !515, !516, !517, !518, !521, !524, !525, !528, !529, !532, !533}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ios_base", scope: !4, file: !4, baseType: !127, size: 64, flags: DIFlagArtificial)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "boolalpha", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 237, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmtflags", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 236, baseType: !80)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 238, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 239, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 240, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 241, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 242, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "oct", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 243, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 244, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "scientific", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 245, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "showbase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 246, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "showpoint", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 247, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "showpos", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 248, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2048)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "skipws", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 249, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4096)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "unitbuf", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 250, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "uppercase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 251, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "adjustfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 252, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 176)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "basefield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 253, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 74)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "floatfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 254, baseType: !387, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 260)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "badbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 258, baseType: !407, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "eofbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 259, baseType: !407, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "failbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 260, baseType: !407, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "goodbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 261, baseType: !407, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 265, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "openmode", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 263, baseType: !80)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 266, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 267, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 268, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 269, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 270, baseType: !412, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__fmtflags_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 359, baseType: !388, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__precision_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 360, baseType: !231, size: 64, align: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__width_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 361, baseType: !231, size: 64, align: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__rdstate_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 362, baseType: !324, size: 32, align: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__exceptions_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 363, baseType: !324, size: 32, align: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__rdbuf_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 364, baseType: !30, size: 64, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__loc_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 365, baseType: !30, size: 64, align: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__fn_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 366, baseType: !427, size: 64, align: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 306, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !"_ZTSNSt3__18ios_base5eventE", !170, !22}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__index_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 367, baseType: !433, size: 64, align: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__event_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 368, baseType: !275, size: 64, align: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__event_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 369, baseType: !275, size: 64, align: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__xindex_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 373, baseType: !22, flags: DIFlagStaticMember)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 375, baseType: !438, size: 64, align: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 376, baseType: !275, size: 64, align: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 377, baseType: !275, size: 64, align: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 378, baseType: !442, size: 64, align: 64, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 379, baseType: !275, size: 64, align: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 380, baseType: !275, size: 64, align: 64, offset: 1024)
!445 = !DISubprogram(name: "flags", linkageName: "_ZNKSt3__18ios_base5flagsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 281, type: !446, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{!388, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__18ios_baseE")
!450 = !DISubprogram(name: "flags", linkageName: "_ZNSt3__18ios_base5flagsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 282, type: !451, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!451 = !DISubroutineType(types: !452)
!452 = !{!388, !453, !388}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__18ios_baseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!454 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 283, type: !451, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!455 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEjj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 284, type: !456, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!388, !453, !388, !388}
!458 = !DISubprogram(name: "unsetf", linkageName: "_ZNSt3__18ios_base6unsetfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 285, type: !459, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !453, !388}
!461 = !DISubprogram(name: "precision", linkageName: "_ZNKSt3__18ios_base9precisionEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 287, type: !462, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!231, !448}
!464 = !DISubprogram(name: "precision", linkageName: "_ZNSt3__18ios_base9precisionEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 288, type: !465, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{!231, !453, !231}
!467 = !DISubprogram(name: "width", linkageName: "_ZNKSt3__18ios_base5widthEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 289, type: !462, isLocal: false, isDefinition: false, scopeLine: 289, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubprogram(name: "width", linkageName: "_ZNSt3__18ios_base5widthEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 290, type: !465, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__18ios_base5imbueERKNS_6localeE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 293, type: !470, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!470 = !DISubroutineType(types: !471)
!471 = !{!"_ZTSNSt3__16localeE", !453, !368}
!472 = !DISubprogram(name: "getloc", linkageName: "_ZNKSt3__18ios_base6getlocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 294, type: !473, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!473 = !DISubroutineType(types: !474)
!474 = !{!"_ZTSNSt3__16localeE", !448}
!475 = !DISubprogram(name: "xalloc", linkageName: "_ZNSt3__18ios_base6xallocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 297, type: !129, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubprogram(name: "iword", linkageName: "_ZNSt3__18ios_base5iwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 298, type: !477, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !453, !22}
!479 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !104)
!480 = !DISubprogram(name: "pword", linkageName: "_ZNSt3__18ios_base5pwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 299, type: !481, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !453, !22}
!483 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !30)
!484 = !DISubprogram(name: "~ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 302, type: !485, isLocal: false, isDefinition: false, scopeLine: 302, containingType: !"_ZTSNSt3__18ios_baseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !453}
!487 = !DISubprogram(name: "register_callback", linkageName: "_ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 307, type: !488, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !453, !428, !22}
!490 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 310, type: !491, isLocal: false, isDefinition: false, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !453, !493}
!493 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !449)
!494 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__18ios_baseaSERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 311, type: !495, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!495 = !DISubroutineType(types: !496)
!496 = !{!170, !453, !493}
!497 = !DISubprogram(name: "sync_with_stdio", linkageName: "_ZNSt3__18ios_base15sync_with_stdioEb", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 314, type: !498, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{!174, !174}
!500 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__18ios_base7rdstateEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 316, type: !501, isLocal: false, isDefinition: false, scopeLine: 316, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!501 = !DISubroutineType(types: !502)
!502 = !{!324, !448}
!503 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__18ios_base5clearEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 317, type: !504, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !453, !324}
!506 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__18ios_base8setstateEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 318, type: !504, isLocal: false, isDefinition: false, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__18ios_base4goodEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 320, type: !508, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{!174, !448}
!510 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__18ios_base3eofEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 321, type: !508, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__18ios_base4failEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 322, type: !508, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__18ios_base3badEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 323, type: !508, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!513 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__18ios_base10exceptionsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 325, type: !501, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__18ios_base10exceptionsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 326, type: !504, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubprogram(name: "__set_badbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 328, type: !485, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubprogram(name: "__set_failbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 329, type: !485, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 333, type: !485, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!518 = !DISubprogram(name: "init", linkageName: "_ZNSt3__18ios_base4initEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 336, type: !519, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !453, !30}
!521 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__18ios_base5rdbufEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 337, type: !522, isLocal: false, isDefinition: false, scopeLine: 337, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!30, !448}
!524 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__18ios_base5rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 340, type: !519, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!525 = !DISubprogram(name: "__call_callbacks", linkageName: "_ZNSt3__18ios_base16__call_callbacksENS0_5eventE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 346, type: !526, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !453, !"_ZTSNSt3__18ios_base5eventE"}
!528 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__18ios_base7copyfmtERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 347, type: !491, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!529 = !DISubprogram(name: "move", linkageName: "_ZNSt3__18ios_base4moveERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 348, type: !530, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !453, !170}
!532 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__18ios_base4swapERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 349, type: !530, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!533 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__18ios_base9set_rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 352, type: !519, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!534 = !DICompositeType(tag: DW_TAG_class_type, name: "locale", scope: !121, file: !535, line: 60, size: 64, align: 64, elements: !536, identifier: "_ZTSNSt3__16localeE")
!535 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__locale", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!536 = !{!537, !540, !541, !542, !543, !544, !545, !546, !547, !549, !553, !556, !559, !565, !568, !571, !574, !575, !578, !582, !585, !586, !589, !592, !596, !600, !604}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "none", scope: !"_ZTSNSt3__16localeE", file: !535, line: 69, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "category", scope: !"_ZTSNSt3__16localeE", file: !535, line: 67, baseType: !22)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !"_ZTSNSt3__16localeE", file: !535, line: 70, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !"_ZTSNSt3__16localeE", file: !535, line: 71, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "monetary", scope: !"_ZTSNSt3__16localeE", file: !535, line: 72, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !"_ZTSNSt3__16localeE", file: !535, line: 73, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !"_ZTSNSt3__16localeE", file: !535, line: 74, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "messages", scope: !"_ZTSNSt3__16localeE", file: !535, line: 75, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !"_ZTSNSt3__16localeE", file: !535, line: 76, baseType: !538, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 63)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__locale_", scope: !"_ZTSNSt3__16localeE", file: !535, line: 109, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5__impE", size: 64, align: 64)
!549 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 79, type: !550, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16localeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!553 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 80, type: !554, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !552, !368}
!556 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 81, type: !557, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !552, !55}
!559 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 82, type: !560, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !552, !562}
!562 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !121, file: !244, line: 194, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!565 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 83, type: !566, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !552, !368, !55, !539}
!568 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 84, type: !569, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !552, !368, !562, !539}
!571 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 87, type: !572, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !552, !368, !368, !539}
!574 = !DISubprogram(name: "~locale", scope: !"_ZTSNSt3__16localeE", file: !535, line: 89, type: !550, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__16localeaSERKS0_", scope: !"_ZTSNSt3__16localeE", file: !535, line: 91, type: !576, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubroutineType(types: !577)
!577 = !{!368, !552, !368}
!578 = !DISubprogram(name: "name", linkageName: "_ZNKSt3__16locale4nameEv", scope: !"_ZTSNSt3__16localeE", file: !535, line: 96, type: !579, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{!564, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!582 = !DISubprogram(name: "operator==", linkageName: "_ZNKSt3__16localeeqERKS0_", scope: !"_ZTSNSt3__16localeE", file: !535, line: 97, type: !583, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{!174, !581, !368}
!585 = !DISubprogram(name: "operator!=", linkageName: "_ZNKSt3__16localeneERKS0_", scope: !"_ZTSNSt3__16localeE", file: !535, line: 98, type: !583, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubprogram(name: "global", linkageName: "_ZNSt3__16locale6globalERKS0_", scope: !"_ZTSNSt3__16localeE", file: !535, line: 104, type: !587, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubroutineType(types: !588)
!588 = !{!"_ZTSNSt3__16localeE", !368}
!589 = !DISubprogram(name: "classic", linkageName: "_ZNSt3__16locale7classicEv", scope: !"_ZTSNSt3__16localeE", file: !535, line: 105, type: !590, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{!368}
!592 = !DISubprogram(name: "__install_ctor", linkageName: "_ZNSt3__16locale14__install_ctorERKS0_PNS0_5facetEl", scope: !"_ZTSNSt3__16localeE", file: !535, line: 111, type: !593, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !552, !368, !595, !104}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5facetE", size: 64, align: 64)
!596 = !DISubprogram(name: "__global", linkageName: "_ZNSt3__16locale8__globalEv", scope: !"_ZTSNSt3__16localeE", file: !535, line: 112, type: !597, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16localeE")
!600 = !DISubprogram(name: "has_facet", linkageName: "_ZNKSt3__16locale9has_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !535, line: 113, type: !601, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true)
!601 = !DISubroutineType(types: !602)
!602 = !{!174, !581, !603}
!603 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16locale2idE")
!604 = !DISubprogram(name: "use_facet", linkageName: "_ZNKSt3__16locale9use_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !535, line: 114, type: !605, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !581, !603}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16locale5facetE")
!609 = !DICompositeType(tag: DW_TAG_class_type, name: "__imp", scope: !"_ZTSNSt3__16localeE", file: !535, line: 108, flags: DIFlagFwdDecl, identifier: "_ZTSNSt3__16locale5__impE")
!610 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >", scope: !121, file: !242, line: 4243, size: 192, align: 64, elements: !611, templateParams: !964, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!611 = !{!612, !613, !614, !621, !625, !631, !636, !639, !645, !648, !651, !654, !657, !660, !663, !664, !668, !671, !674, !678, !683, !684, !685, !689, !693, !694, !695, !696, !697, !698, !699, !702, !703, !704, !705, !706, !709, !710, !711, !712, !715, !720, !725, !726, !727, !728, !729, !730, !731, !734, !737, !738, !741, !744, !745, !748, !751, !752, !753, !754, !755, !756, !757, !758, !761, !764, !767, !770, !773, !776, !779, !782, !785, !788, !791, !794, !797, !800, !803, !806, !809, !812, !815, !819, !822, !825, !828, !829, !832, !835, !838, !841, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !867, !870, !873, !876, !879, !882, !883, !884, !888, !891, !892, !893, !894, !895, !896, !897, !898, !906, !909, !916, !917, !918, !919, !920, !921, !924, !927, !928, !929, !932, !935, !936, !937, !942, !946, !947, !950, !953, !956, !959, !962, !963}
!612 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", baseType: !"_ZTSNSt3__121__basic_string_commonILb1EEE")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__r_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1318, baseType: !"_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE", size: 192, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "npos", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1321, baseType: !615, flags: DIFlagPublic | DIFlagStaticMember, extraData: i64 -1)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1213, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__116allocator_traitsINS_9allocatorIcEEEE", file: !618, line: 1417, baseType: !619)
!618 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/memory", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !"_ZTSNSt3__111__size_typeINS_9allocatorIcEElLb1EEE", file: !618, line: 1074, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__19allocatorIcEE", file: !618, line: 1643, baseType: !275)
!621 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1323, type: !622, isLocal: false, isDefinition: false, scopeLine: 1323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!625 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1325, type: !626, isLocal: false, isDefinition: false, scopeLine: 1325, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !624, !628}
!628 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1211, baseType: !"_ZTSNSt3__19allocatorIcEE")
!631 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1326, type: !632, isLocal: false, isDefinition: false, scopeLine: 1326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !624, !634}
!634 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!636 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1327, type: !637, isLocal: false, isDefinition: false, scopeLine: 1327, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !624, !634, !628}
!639 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1335, type: !640, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !624, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1210, baseType: !264)
!645 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1337, type: !646, isLocal: false, isDefinition: false, scopeLine: 1337, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !624, !642, !628}
!648 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1339, type: !649, isLocal: false, isDefinition: false, scopeLine: 1339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !624, !642, !616}
!651 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1341, type: !652, isLocal: false, isDefinition: false, scopeLine: 1341, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !624, !642, !616, !628}
!654 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1343, type: !655, isLocal: false, isDefinition: false, scopeLine: 1343, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !624, !616, !644}
!657 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1345, type: !658, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !624, !616, !644, !628}
!660 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1346, type: !661, isLocal: false, isDefinition: false, scopeLine: 1346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !624, !634, !616, !616, !628}
!663 = !DISubprogram(name: "~basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1361, type: !622, isLocal: false, isDefinition: false, scopeLine: 1361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSERKS5_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1363, type: !665, isLocal: false, isDefinition: false, scopeLine: 1363, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !624, !634}
!667 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!668 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEPKc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1370, type: !669, isLocal: false, isDefinition: false, scopeLine: 1370, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!669 = !DISubroutineType(types: !670)
!670 = !{!667, !624, !642}
!671 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1371, type: !672, isLocal: false, isDefinition: false, scopeLine: 1371, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{!667, !624, !644}
!674 = !DISubprogram(name: "begin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1392, type: !675, isLocal: false, isDefinition: false, scopeLine: 1392, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !624}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1229, baseType: !"_ZTSNSt3__111__wrap_iterIPcEE")
!678 = !DISubprogram(name: "begin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1395, type: !679, isLocal: false, isDefinition: false, scopeLine: 1395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1230, baseType: !"_ZTSNSt3__111__wrap_iterIPKcEE")
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!683 = !DISubprogram(name: "end", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1398, type: !675, isLocal: false, isDefinition: false, scopeLine: 1398, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubprogram(name: "end", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1401, type: !679, isLocal: false, isDefinition: false, scopeLine: 1401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1405, type: !686, isLocal: false, isDefinition: false, scopeLine: 1405, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!686 = !DISubroutineType(types: !687)
!687 = !{!688, !624}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1232, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPcEEEE")
!689 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1408, type: !690, isLocal: false, isDefinition: false, scopeLine: 1408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !682}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1233, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPKcEEEE")
!693 = !DISubprogram(name: "rend", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1411, type: !686, isLocal: false, isDefinition: false, scopeLine: 1411, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubprogram(name: "rend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1414, type: !690, isLocal: false, isDefinition: false, scopeLine: 1414, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "cbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6cbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1418, type: !679, isLocal: false, isDefinition: false, scopeLine: 1418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "cend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4cendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1421, type: !679, isLocal: false, isDefinition: false, scopeLine: 1421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubprogram(name: "crbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7crbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1424, type: !690, isLocal: false, isDefinition: false, scopeLine: 1424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!698 = !DISubprogram(name: "crend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5crendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1427, type: !690, isLocal: false, isDefinition: false, scopeLine: 1427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!699 = !DISubprogram(name: "size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1430, type: !700, isLocal: false, isDefinition: false, scopeLine: 1430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{!616, !682}
!702 = !DISubprogram(name: "length", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6lengthEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1432, type: !700, isLocal: false, isDefinition: false, scopeLine: 1432, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!703 = !DISubprogram(name: "max_size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE8max_sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1433, type: !700, isLocal: false, isDefinition: false, scopeLine: 1433, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubprogram(name: "capacity", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE8capacityEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1434, type: !700, isLocal: false, isDefinition: false, scopeLine: 1434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubprogram(name: "resize", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEmc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1437, type: !655, isLocal: false, isDefinition: false, scopeLine: 1437, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!706 = !DISubprogram(name: "resize", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEm", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1438, type: !707, isLocal: false, isDefinition: false, scopeLine: 1438, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !624, !616}
!709 = !DISubprogram(name: "reserve", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7reserveEm", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1440, type: !707, isLocal: false, isDefinition: false, scopeLine: 1440, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubprogram(name: "shrink_to_fit", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE13shrink_to_fitEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1442, type: !622, isLocal: false, isDefinition: false, scopeLine: 1442, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!711 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5clearEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1444, type: !622, isLocal: false, isDefinition: false, scopeLine: 1444, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DISubprogram(name: "empty", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5emptyEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !242, line: 1445, type: !713, isLocal: false, isDefinition: false, scopeLine: 1445, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!713 = !DISubroutineType(types: !714)
!714 = !{!174, !682}
