; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/MACRelayUnitNP.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%class.ExecuteOnStartup = type { void ()*, %class.ExecuteOnStartup* }
%class.cEnvir = type <{ %class.TOmnetApp*, i32, i32, [81 x i8], [7 x i8] }>
%class.TOmnetApp = type opaque
%class.cHead = type { %class.cObject }
%class.cObject = type { i32 (...)**, i8*, i8, i8, %class.cObject*, %class.cObject*, %class.cObject*, %class.cObject* }
%class.cModuleType = type { %class.cObject, i8*, %class.cModuleInterface*, %class.cModule* (i8*, %class.cModule*)* }
%class.cModuleInterface = type { %class.cObject, i32, %"struct.cModuleInterface::sGateInfo"*, i32, %"struct.cModuleInterface::sParamInfo"*, i32, %"struct.cModuleInterface::sMachineInfo"* }
%"struct.cModuleInterface::sGateInfo" = type { i8*, i8, i8 }
%"struct.cModuleInterface::sParamInfo" = type { i8*, i8* }
%"struct.cModuleInterface::sMachineInfo" = type { i8* }
%class.cModule = type { %class.cObject, i8*, %class.cModuleType*, i32, %class.cModule*, %class.cArray, %class.cArray, %class.cArray, %class.cHead, i32, i32, %class.opp_string, %class.opp_string, void (%class.cModule*, i1, i8*)*, i8* }
%class.cArray = type { %class.cObject, %class.cObject**, i32, i32, i32, i32 }
%class.opp_string = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !24, subprograms: !4738, globals: !5153, imports: !5155)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/MACRelayUnitNP.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 305, size: 32, align: 32, elements: !5, identifier: "_ZTSNSt3__18ios_base5eventE")
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ios", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "erase_event", value: 0)
!7 = !DIEnumerator(name: "imbue_event", value: 1)
!8 = !DIEnumerator(name: "copyfmt_event", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "seekdir", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 272, size: 32, align: 32, elements: !10, identifier: "_ZTSNSt3__18ios_base7seekdirE")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "beg", value: 0)
!12 = !DIEnumerator(name: "cur", value: 1)
!13 = !DIEnumerator(name: "end", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EtherMessageKind", file: !15, line: 17, size: 32, align: 32, elements: !16, identifier: "_ZTS16EtherMessageKind")
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/EtherCtrl_m.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20, !21, !22, !23}
!17 = !DIEnumerator(name: "JAM_SIGNAL", value: 2000)
!18 = !DIEnumerator(name: "ETH_FRAME", value: 2001)
!19 = !DIEnumerator(name: "ETH_PAUSE", value: 2002)
!20 = !DIEnumerator(name: "ETHCTRL_DATA", value: 2003)
!21 = !DIEnumerator(name: "ETHCTRL_REGISTER_DSAP", value: 2004)
!22 = !DIEnumerator(name: "ETHCTRL_DEREGISTER_DSAP", value: 2005)
!23 = !DIEnumerator(name: "ETHCTRL_SENDPAUSE", value: 2006)
!24 = !{!25, !82, !86, !87, !94, !101, !116, !121, !125, !129, !268, !317, !393, !3, !544, !619, !620, !976, !1011, !1015, !1025, !1080, !1083, !1088, !1093, !1097, !1140, !1144, !1146, !1156, !1161, !1162, !1165, !1168, !1181, !1192, !1199, !1203, !1207, !1244, !1247, !1249, !1250, !1251, !1252, !1254, !1265, !1294, !1315, !1332, !1438, !9, !1439, !1458, !1496, !1598, !1635, !1807, !1986, !2030, !2074, !2079, !2083, !2086, !2092, !2177, !2210, !2244, !2418, !2643, !2656, !2660, !2667, !2670, !2673, !2685, !2688, !2766, !2807, !2847, !2850, !2863, !2880, !2884, !2922, !2932, !2935, !2941, !2944, !3076, !3149, !3183, !3189, !3220, !3221, !3301, !3306, !3467, !3522, !3550, !3554, !3561, !3599, !3622, !3817, !3826, !3855, !3890, !3903, !3939, !3942, !3944, !3991, !3993, !4003, !4007, !4008, !4009, !4011, !4066, !4076, !4096, !4106, !4107, !4112, !4115, !4151, !4154, !4209, !4245, !4248, !4251, !4254, !4301, !4304, !4306, !4308, !4318, !4322, !4323, !4324, !4326, !4327, !4328, !4329, !4330, !4331, !4332, !4333, !4334, !4335, !4338, !4384, !4387, !4389, !4399, !4403, !4404, !4405, !4407, !4408, !4409, !4410, !4411, !4412, !4446, !14, !1494, !1994, !1483, !4502, !3625, !4505, !4516, !4520, !4511, !4521, !4538, !3865, !40, !4541, !32, !4629, !4737}
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !26, line: 122, size: 1216, align: 64, elements: !27, identifier: "_ZTS7__sFILE")
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !{!28, !31, !33, !34, !36, !37, !38, !39, !41, !45, !51, !61, !67, !68, !70, !71, !75, !79, !80, !81}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !26, line: 123, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !26, line: 124, baseType: !32, size: 32, align: 32, offset: 64)
!32 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !26, line: 125, baseType: !32, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !26, line: 126, baseType: !35, size: 16, align: 16, offset: 128)
!35 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !26, line: 127, baseType: !35, size: 16, align: 16, offset: 144)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !26, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !26, line: 129, baseType: !32, size: 32, align: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !26, line: 132, baseType: !40, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !26, line: 133, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!32, !40}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !26, line: 134, baseType: !46, size: 64, align: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!32, !40, !49, !32}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !26, line: 135, baseType: !52, size: 64, align: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !40, !55, !32}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !26, line: 77, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !57, line: 71, baseType: !58)
!57 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !59, line: 46, baseType: !60)
!59 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !26, line: 136, baseType: !62, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!32, !40, !65, !32}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !26, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !26, line: 140, baseType: !69, size: 64, align: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !26, line: 141, baseType: !32, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !26, line: 144, baseType: !72, size: 24, align: 8, offset: 928)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !26, line: 145, baseType: !76, size: 8, align: 8, offset: 952)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !26, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !26, line: 151, baseType: !32, size: 32, align: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !26, line: 152, baseType: !55, size: 64, align: 64, offset: 1152)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !26, line: 88, size: 128, align: 64, elements: !83, identifier: "_ZTS6__sbuf")
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !26, line: 89, baseType: !29, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !26, line: 90, baseType: !32, size: 32, align: 32, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !26, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !88, identifier: "_ZTS13__va_list_tag")
!88 = !{!89, !91, !92, !93}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !90, size: 32, align: 32)
!90 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !90, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !40, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !40, size: 64, align: 64, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_union_type, file: !59, line: 76, size: 1024, align: 64, elements: !95, identifier: "_ZTS11__mbstate_t")
!95 = !{!96, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !"_ZTS11__mbstate_t", file: !59, line: 77, baseType: !97, size: 1024, align: 8)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1024, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !"_ZTS11__mbstate_t", file: !59, line: 78, baseType: !60, size: 64, align: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !102, line: 73, size: 448, align: 64, elements: !103, identifier: "_ZTS2tm")
!102 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !115}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !"_ZTS2tm", file: !102, line: 74, baseType: !32, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !"_ZTS2tm", file: !102, line: 75, baseType: !32, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !"_ZTS2tm", file: !102, line: 76, baseType: !32, size: 32, align: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !"_ZTS2tm", file: !102, line: 77, baseType: !32, size: 32, align: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !"_ZTS2tm", file: !102, line: 78, baseType: !32, size: 32, align: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !"_ZTS2tm", file: !102, line: 79, baseType: !32, size: 32, align: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !"_ZTS2tm", file: !102, line: 80, baseType: !32, size: 32, align: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !"_ZTS2tm", file: !102, line: 81, baseType: !32, size: 32, align: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !"_ZTS2tm", file: !102, line: 82, baseType: !32, size: 32, align: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !"_ZTS2tm", file: !102, line: 83, baseType: !114, size: 64, align: 64, offset: 320)
!114 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !"_ZTS2tm", file: !102, line: 84, baseType: !49, size: 64, align: 64, offset: 384)
!116 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 82, size: 64, align: 32, elements: !118, identifier: "_ZTS5div_t")
!117 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !117, line: 83, baseType: !32, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !117, line: 84, baseType: !32, size: 32, align: 32, offset: 32)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 87, size: 128, align: 64, elements: !122, identifier: "_ZTS6ldiv_t")
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !117, line: 88, baseType: !114, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !117, line: 89, baseType: !114, size: 64, align: 64, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 93, size: 128, align: 64, elements: !126, identifier: "_ZTS7lldiv_t")
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !117, line: 94, baseType: !60, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !117, line: 95, baseType: !60, size: 64, align: 64, offset: 64)
!129 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ostream<char, std::__1::char_traits<char> >", scope: !131, file: !130, line: 1108, size: 1280, align: 64, elements: !134, vtableHolder: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", templateParams: !265, identifier: "_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!130 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/ostream", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !DINamespace(name: "__1", scope: !133, file: !132, line: 369)
!132 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!133 = !DINamespace(name: "std", scope: null, file: !132, line: 368)
!134 = !{!135, !136, !141, !146, !149, !153, !158, !161, !167, !174, !181, !185, !188, !192, !195, !198, !201, !205, !208, !212, !216, !220, !224, !229, !232, !236, !244, !247, !255, !258, !264}
!135 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", offset: 24, flags: DIFlagPublic | DIFlagVirtual)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$basic_ostream", scope: !130, file: !130, baseType: !137, size: 64, flags: DIFlagArtificial)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!32}
!141 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 163, type: !142, isLocal: false, isDefinition: false, scopeLine: 163, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !145}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__115basic_streambufIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!146 = !DISubprogram(name: "~basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 164, type: !147, isLocal: false, isDefinition: false, scopeLine: 164, containingType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !144}
!149 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 176, type: !150, isLocal: false, isDefinition: false, scopeLine: 176, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !144, !152}
!152 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!153 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 182, type: !154, isLocal: false, isDefinition: false, scopeLine: 182, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !144, !156}
!156 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE")
!158 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEEaSERKS3_", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 183, type: !159, isLocal: false, isDefinition: false, scopeLine: 183, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{!152, !144, !156}
!161 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRS3_S4_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 191, type: !162, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!162 = !DISubroutineType(types: !163)
!163 = !{!152, !144, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!152, !152}
!167 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_9basic_iosIcS2_EES6_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 192, type: !168, isLocal: false, isDefinition: false, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!168 = !DISubroutineType(types: !169)
!169 = !{!152, !144, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !173}
!173 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!174 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPFRNS_8ios_baseES5_E", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 194, type: !175, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubroutineType(types: !176)
!176 = !{!152, !144, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !180}
!180 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__18ios_baseE")
!181 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEb", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 195, type: !182, isLocal: false, isDefinition: false, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{!152, !144, !184}
!184 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!185 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEs", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 196, type: !186, isLocal: false, isDefinition: false, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!152, !144, !35}
!188 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEt", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 197, type: !189, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!152, !144, !191}
!191 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!192 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEi", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 198, type: !193, isLocal: false, isDefinition: false, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!193 = !DISubroutineType(types: !194)
!194 = !{!152, !144, !32}
!195 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEj", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 199, type: !196, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!196 = !DISubroutineType(types: !197)
!197 = !{!152, !144, !90}
!198 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 200, type: !199, isLocal: false, isDefinition: false, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{!152, !144, !114}
!201 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEm", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 201, type: !202, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{!152, !144, !204}
!204 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!205 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEx", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 202, type: !206, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubroutineType(types: !207)
!207 = !{!152, !144, !60}
!208 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEy", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 203, type: !209, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubroutineType(types: !210)
!210 = !{!152, !144, !211}
!211 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!212 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEf", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 204, type: !213, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubroutineType(types: !214)
!214 = !{!152, !144, !215}
!215 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!216 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEd", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 205, type: !217, isLocal: false, isDefinition: false, scopeLine: 205, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubroutineType(types: !218)
!218 = !{!152, !144, !219}
!219 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!220 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEe", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 206, type: !221, isLocal: false, isDefinition: false, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!152, !144, !223}
!223 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!224 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPKv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 207, type: !225, isLocal: false, isDefinition: false, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!225 = !DISubroutineType(types: !226)
!226 = !{!152, !144, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!229 = !DISubprogram(name: "operator<<", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEElsEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 208, type: !230, isLocal: false, isDefinition: false, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!152, !144, !145}
!232 = !DISubprogram(name: "put", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE3putEc", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 211, type: !233, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!152, !144, !235}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 156, baseType: !50)
!236 = !DISubprogram(name: "write", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5writeEPKcl", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 212, type: !237, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!152, !144, !239, !241}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !131, file: !4, line: 229, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !243, line: 51, baseType: !114)
!243 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stddef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!244 = !DISubprogram(name: "flush", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5flushEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 213, type: !245, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!152, !144}
!247 = !DISubprogram(name: "tellp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5tellpEv", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 216, type: !248, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !144}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 159, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "pos_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 628, baseType: !253)
!252 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/string", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "streampos", scope: !131, file: !254, line: 176, baseType: !"_ZTSNSt3__14fposI11__mbstate_tEE")
!254 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/iosfwd", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!255 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpENS_4fposI11__mbstate_tEE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 217, type: !256, isLocal: false, isDefinition: false, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubroutineType(types: !257)
!257 = !{!152, !144, !250}
!258 = !DISubprogram(name: "seekp", linkageName: "_ZNSt3__113basic_ostreamIcNS_11char_traitsIcEEE5seekpExNS_8ios_base7seekdirE", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 218, type: !259, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{!152, !144, !261, !"_ZTSNSt3__18ios_base7seekdirE"}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 160, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 627, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamoff", scope: !131, file: !254, line: 187, baseType: !60)
!264 = !DISubprogram(name: "basic_ostream", scope: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", file: !130, line: 222, type: !147, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!265 = !{!266, !267}
!266 = !DITemplateTypeParameter(name: "_CharT", type: !50)
!267 = !DITemplateTypeParameter(name: "_Traits", type: !"_ZTSNSt3__111char_traitsIcEE")
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !131, file: !252, line: 623, size: 8, align: 8, elements: !269, templateParams: !316, identifier: "_ZTSNSt3__111char_traitsIcEE")
!269 = !{!270, !277, !280, !281, !286, !289, !292, !296, !297, !300, !304, !307, !310, !313}
!270 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignERcRKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 631, type: !271, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !273, !275}
!273 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 625, baseType: !50)
!275 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!277 = !DISubprogram(name: "eq", linkageName: "_ZNSt3__111char_traitsIcE2eqEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 633, type: !278, isLocal: false, isDefinition: false, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!184, !274, !274}
!280 = !DISubprogram(name: "lt", linkageName: "_ZNSt3__111char_traitsIcE2ltEcc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 635, type: !278, isLocal: false, isDefinition: false, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true)
!281 = !DISubprogram(name: "compare", linkageName: "_ZNSt3__111char_traitsIcE7compareEPKcS3_m", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 638, type: !282, isLocal: false, isDefinition: false, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true)
!282 = !DISubroutineType(types: !283)
!283 = !{!32, !284, !284, !285}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 62, baseType: !204)
!286 = !DISubprogram(name: "length", linkageName: "_ZNSt3__111char_traitsIcE6lengthEPKc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 640, type: !287, isLocal: false, isDefinition: false, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!285, !284}
!289 = !DISubprogram(name: "find", linkageName: "_ZNSt3__111char_traitsIcE4findEPKcmRS2_", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 641, type: !290, isLocal: false, isDefinition: false, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{!284, !284, !285, !275}
!292 = !DISubprogram(name: "move", linkageName: "_ZNSt3__111char_traitsIcE4moveEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 643, type: !293, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true)
!293 = !DISubroutineType(types: !294)
!294 = !{!295, !295, !284, !285}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!296 = !DISubprogram(name: "copy", linkageName: "_ZNSt3__111char_traitsIcE4copyEPcPKcm", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 645, type: !293, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: true)
!297 = !DISubprogram(name: "assign", linkageName: "_ZNSt3__111char_traitsIcE6assignEPcmc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 650, type: !298, isLocal: false, isDefinition: false, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{!295, !295, !285, !274}
!300 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt3__111char_traitsIcE7not_eofEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 653, type: !301, isLocal: false, isDefinition: false, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !303}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 626, baseType: !32)
!304 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt3__111char_traitsIcE12to_char_typeEi", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 655, type: !305, isLocal: false, isDefinition: false, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true)
!305 = !DISubroutineType(types: !306)
!306 = !{!274, !303}
!307 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt3__111char_traitsIcE11to_int_typeEc", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 657, type: !308, isLocal: false, isDefinition: false, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true)
!308 = !DISubroutineType(types: !309)
!309 = !{!303, !274}
!310 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt3__111char_traitsIcE11eq_int_typeEii", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 659, type: !311, isLocal: false, isDefinition: false, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{!184, !303, !303}
!313 = !DISubprogram(name: "eof", linkageName: "_ZNSt3__111char_traitsIcE3eofEv", scope: !"_ZTSNSt3__111char_traitsIcEE", file: !252, line: 661, type: !314, isLocal: false, isDefinition: false, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{!303}
!316 = !{!266}
!317 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_ios<char, std::__1::char_traits<char> >", scope: !131, file: !318, line: 570, size: 1216, align: 64, elements: !319, vtableHolder: !"_ZTSNSt3__18ios_baseE", templateParams: !265, identifier: "_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!318 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/streambuf", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!319 = !{!320, !321, !323, !325, !330, !331, !335, !339, !340, !341, !342, !343, !344, !345, !346, !349, !352, !355, !358, !361, !364, !368, !372, !375, !380, !383, !386, !387, !388, !391, !392}
!320 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", baseType: !"_ZTSNSt3__18ios_baseE", flags: DIFlagPublic)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__tie_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 647, baseType: !322, size: 64, align: 64, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE", size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__fill_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 648, baseType: !324, size: 32, align: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 579, baseType: !303)
!325 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEcvbEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 585, type: !326, isLocal: false, isDefinition: false, scopeLine: 585, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{!184, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE")
!330 = !DISubprogram(name: "operator!", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEEntEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 586, type: !326, isLocal: false, isDefinition: false, scopeLine: 586, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE7rdstateEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 587, type: !332, isLocal: false, isDefinition: false, scopeLine: 587, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !328}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "iostate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 256, baseType: !90)
!335 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5clearEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 588, type: !336, isLocal: false, isDefinition: false, scopeLine: 588, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338, !334}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!339 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE8setstateEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 589, type: !336, isLocal: false, isDefinition: false, scopeLine: 589, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4goodEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 590, type: !326, isLocal: false, isDefinition: false, scopeLine: 590, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3eofEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 591, type: !326, isLocal: false, isDefinition: false, scopeLine: 591, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4failEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 592, type: !326, isLocal: false, isDefinition: false, scopeLine: 592, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3badEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 593, type: !326, isLocal: false, isDefinition: false, scopeLine: 593, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 595, type: !332, isLocal: false, isDefinition: false, scopeLine: 595, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE10exceptionsEj", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 596, type: !336, isLocal: false, isDefinition: false, scopeLine: 596, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 600, type: !347, isLocal: false, isDefinition: false, scopeLine: 600, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !338, !145}
!349 = !DISubprogram(name: "~basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 601, type: !350, isLocal: false, isDefinition: false, scopeLine: 601, containingType: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !338}
!352 = !DISubprogram(name: "tie", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 605, type: !353, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!322, !328}
!355 = !DISubprogram(name: "tie", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE3tieEPNS_13basic_ostreamIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 607, type: !356, isLocal: false, isDefinition: false, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!322, !338, !322}
!358 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 610, type: !359, isLocal: false, isDefinition: false, scopeLine: 610, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!145, !328}
!361 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 612, type: !362, isLocal: false, isDefinition: false, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DISubroutineType(types: !363)
!363 = !{!145, !338, !145}
!364 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE7copyfmtERKS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 614, type: !365, isLocal: false, isDefinition: false, scopeLine: 614, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{!173, !338, !367}
!367 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !329)
!368 = !DISubprogram(name: "fill", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEv", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 617, type: !369, isLocal: false, isDefinition: false, scopeLine: 617, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!371, !328}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 576, baseType: !50)
!372 = !DISubprogram(name: "fill", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4fillEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 619, type: !373, isLocal: false, isDefinition: false, scopeLine: 619, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!371, !338, !371}
!375 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE5imbueERKNS_6localeE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 622, type: !376, isLocal: false, isDefinition: false, scopeLine: 622, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!"_ZTSNSt3__16localeE", !338, !378}
!378 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16localeE")
!380 = !DISubprogram(name: "narrow", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE6narrowEcc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 625, type: !381, isLocal: false, isDefinition: false, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!50, !328, !371, !50}
!383 = !DISubprogram(name: "widen", linkageName: "_ZNKSt3__19basic_iosIcNS_11char_traitsIcEEE5widenEc", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 627, type: !384, isLocal: false, isDefinition: false, scopeLine: 627, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{!371, !328, !50}
!386 = !DISubprogram(name: "basic_ios", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 631, type: !350, isLocal: false, isDefinition: false, scopeLine: 631, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!387 = !DISubprogram(name: "init", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4initEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 634, type: !347, isLocal: false, isDefinition: false, scopeLine: 634, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!388 = !DISubprogram(name: "move", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4moveERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 637, type: !389, isLocal: false, isDefinition: false, scopeLine: 637, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !338, !173}
!391 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE4swapERS3_", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 643, type: !389, isLocal: false, isDefinition: false, scopeLine: 643, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!392 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__19basic_iosIcNS_11char_traitsIcEEE9set_rdbufEPNS_15basic_streambufIcS2_EE", scope: !"_ZTSNSt3__19basic_iosIcNS_11char_traitsIcEEEE", file: !4, line: 645, type: !347, isLocal: false, isDefinition: false, scopeLine: 645, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!393 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !131, file: !4, line: 231, size: 1088, align: 64, elements: !394, vtableHolder: !"_ZTSNSt3__18ios_baseE", identifier: "_ZTSNSt3__18ios_baseE")
!394 = !{!395, !396, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !418, !419, !420, !421, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !442, !444, !445, !446, !447, !449, !450, !451, !453, !454, !455, !460, !464, !465, !468, !471, !474, !477, !478, !479, !482, !485, !486, !490, !494, !497, !500, !504, !507, !510, !513, !516, !517, !520, !521, !522, !523, !524, !525, !526, !527, !528, !531, !534, !535, !538, !539, !542, !543}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ios_base", scope: !4, file: !4, baseType: !137, size: 64, flags: DIFlagArtificial)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "boolalpha", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 237, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmtflags", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 236, baseType: !90)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 238, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 239, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 240, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 241, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 242, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "oct", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 243, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 244, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "scientific", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 245, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "showbase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 246, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "showpoint", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 247, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "showpos", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 248, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "skipws", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 249, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4096)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "unitbuf", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 250, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "uppercase", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 251, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "adjustfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 252, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 176)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "basefield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 253, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 74)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "floatfield", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 254, baseType: !397, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 260)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "badbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 258, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "eofbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 259, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "failbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 260, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "goodbit", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 261, baseType: !417, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 265, baseType: !422, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "openmode", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 263, baseType: !90)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ate", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 266, baseType: !422, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "binary", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 267, baseType: !422, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 268, baseType: !422, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 269, baseType: !422, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "trunc", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 270, baseType: !422, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__fmtflags_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 359, baseType: !398, size: 32, align: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__precision_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 360, baseType: !241, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__width_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 361, baseType: !241, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__rdstate_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 362, baseType: !334, size: 32, align: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__exceptions_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 363, baseType: !334, size: 32, align: 32, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__rdbuf_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 364, baseType: !40, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__loc_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 365, baseType: !40, size: 64, align: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__fn_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 366, baseType: !437, size: 64, align: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 306, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !"_ZTSNSt3__18ios_base5eventE", !180, !32}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__index_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 367, baseType: !443, size: 64, align: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__event_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 368, baseType: !285, size: 64, align: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__event_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 369, baseType: !285, size: 64, align: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__xindex_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 373, baseType: !32, flags: DIFlagStaticMember)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 375, baseType: !448, size: 64, align: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 376, baseType: !285, size: 64, align: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__iarray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 377, baseType: !285, size: 64, align: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 378, baseType: !452, size: 64, align: 64, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_size_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 379, baseType: !285, size: 64, align: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__parray_cap_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 380, baseType: !285, size: 64, align: 64, offset: 1024)
!455 = !DISubprogram(name: "flags", linkageName: "_ZNKSt3__18ios_base5flagsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 281, type: !456, isLocal: false, isDefinition: false, scopeLine: 281, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!398, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__18ios_baseE")
!460 = !DISubprogram(name: "flags", linkageName: "_ZNSt3__18ios_base5flagsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 282, type: !461, isLocal: false, isDefinition: false, scopeLine: 282, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!398, !463, !398}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__18ios_baseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!464 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 283, type: !461, isLocal: false, isDefinition: false, scopeLine: 283, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubprogram(name: "setf", linkageName: "_ZNSt3__18ios_base4setfEjj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 284, type: !466, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubroutineType(types: !467)
!467 = !{!398, !463, !398, !398}
!468 = !DISubprogram(name: "unsetf", linkageName: "_ZNSt3__18ios_base6unsetfEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 285, type: !469, isLocal: false, isDefinition: false, scopeLine: 285, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !463, !398}
!471 = !DISubprogram(name: "precision", linkageName: "_ZNKSt3__18ios_base9precisionEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 287, type: !472, isLocal: false, isDefinition: false, scopeLine: 287, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!241, !458}
!474 = !DISubprogram(name: "precision", linkageName: "_ZNSt3__18ios_base9precisionEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 288, type: !475, isLocal: false, isDefinition: false, scopeLine: 288, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!241, !463, !241}
!477 = !DISubprogram(name: "width", linkageName: "_ZNKSt3__18ios_base5widthEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 289, type: !472, isLocal: false, isDefinition: false, scopeLine: 289, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubprogram(name: "width", linkageName: "_ZNSt3__18ios_base5widthEl", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 290, type: !475, isLocal: false, isDefinition: false, scopeLine: 290, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubprogram(name: "imbue", linkageName: "_ZNSt3__18ios_base5imbueERKNS_6localeE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 293, type: !480, isLocal: false, isDefinition: false, scopeLine: 293, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubroutineType(types: !481)
!481 = !{!"_ZTSNSt3__16localeE", !463, !378}
!482 = !DISubprogram(name: "getloc", linkageName: "_ZNKSt3__18ios_base6getlocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 294, type: !483, isLocal: false, isDefinition: false, scopeLine: 294, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!483 = !DISubroutineType(types: !484)
!484 = !{!"_ZTSNSt3__16localeE", !458}
!485 = !DISubprogram(name: "xalloc", linkageName: "_ZNSt3__18ios_base6xallocEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 297, type: !139, isLocal: false, isDefinition: false, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubprogram(name: "iword", linkageName: "_ZNSt3__18ios_base5iwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 298, type: !487, isLocal: false, isDefinition: false, scopeLine: 298, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !463, !32}
!489 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !114)
!490 = !DISubprogram(name: "pword", linkageName: "_ZNSt3__18ios_base5pwordEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 299, type: !491, isLocal: false, isDefinition: false, scopeLine: 299, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !463, !32}
!493 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !40)
!494 = !DISubprogram(name: "~ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 302, type: !495, isLocal: false, isDefinition: false, scopeLine: 302, containingType: !"_ZTSNSt3__18ios_baseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !463}
!497 = !DISubprogram(name: "register_callback", linkageName: "_ZNSt3__18ios_base17register_callbackEPFvNS0_5eventERS0_iEi", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 307, type: !498, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !463, !438, !32}
!500 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 310, type: !501, isLocal: false, isDefinition: false, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !463, !503}
!503 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !459)
!504 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__18ios_baseaSERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 311, type: !505, isLocal: false, isDefinition: false, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{!180, !463, !503}
!507 = !DISubprogram(name: "sync_with_stdio", linkageName: "_ZNSt3__18ios_base15sync_with_stdioEb", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 314, type: !508, isLocal: false, isDefinition: false, scopeLine: 314, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{!184, !184}
!510 = !DISubprogram(name: "rdstate", linkageName: "_ZNKSt3__18ios_base7rdstateEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 316, type: !511, isLocal: false, isDefinition: false, scopeLine: 316, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubroutineType(types: !512)
!512 = !{!334, !458}
!513 = !DISubprogram(name: "clear", linkageName: "_ZNSt3__18ios_base5clearEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 317, type: !514, isLocal: false, isDefinition: false, scopeLine: 317, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !463, !334}
!516 = !DISubprogram(name: "setstate", linkageName: "_ZNSt3__18ios_base8setstateEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 318, type: !514, isLocal: false, isDefinition: false, scopeLine: 318, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubprogram(name: "good", linkageName: "_ZNKSt3__18ios_base4goodEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 320, type: !518, isLocal: false, isDefinition: false, scopeLine: 320, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{!184, !458}
!520 = !DISubprogram(name: "eof", linkageName: "_ZNKSt3__18ios_base3eofEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 321, type: !518, isLocal: false, isDefinition: false, scopeLine: 321, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubprogram(name: "fail", linkageName: "_ZNKSt3__18ios_base4failEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 322, type: !518, isLocal: false, isDefinition: false, scopeLine: 322, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubprogram(name: "bad", linkageName: "_ZNKSt3__18ios_base3badEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 323, type: !518, isLocal: false, isDefinition: false, scopeLine: 323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!523 = !DISubprogram(name: "exceptions", linkageName: "_ZNKSt3__18ios_base10exceptionsEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 325, type: !511, isLocal: false, isDefinition: false, scopeLine: 325, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!524 = !DISubprogram(name: "exceptions", linkageName: "_ZNSt3__18ios_base10exceptionsEj", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 326, type: !514, isLocal: false, isDefinition: false, scopeLine: 326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubprogram(name: "__set_badbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base33__set_badbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 328, type: !495, isLocal: false, isDefinition: false, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubprogram(name: "__set_failbit_and_consider_rethrow", linkageName: "_ZNSt3__18ios_base34__set_failbit_and_consider_rethrowEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 329, type: !495, isLocal: false, isDefinition: false, scopeLine: 329, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubprogram(name: "ios_base", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 333, type: !495, isLocal: false, isDefinition: false, scopeLine: 333, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!528 = !DISubprogram(name: "init", linkageName: "_ZNSt3__18ios_base4initEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 336, type: !529, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !463, !40}
!531 = !DISubprogram(name: "rdbuf", linkageName: "_ZNKSt3__18ios_base5rdbufEv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 337, type: !532, isLocal: false, isDefinition: false, scopeLine: 337, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!532 = !DISubroutineType(types: !533)
!533 = !{!40, !458}
!534 = !DISubprogram(name: "rdbuf", linkageName: "_ZNSt3__18ios_base5rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 340, type: !529, isLocal: false, isDefinition: false, scopeLine: 340, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "__call_callbacks", linkageName: "_ZNSt3__18ios_base16__call_callbacksENS0_5eventE", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 346, type: !536, isLocal: false, isDefinition: false, scopeLine: 346, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !463, !"_ZTSNSt3__18ios_base5eventE"}
!538 = !DISubprogram(name: "copyfmt", linkageName: "_ZNSt3__18ios_base7copyfmtERKS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 347, type: !501, isLocal: false, isDefinition: false, scopeLine: 347, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!539 = !DISubprogram(name: "move", linkageName: "_ZNSt3__18ios_base4moveERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 348, type: !540, isLocal: false, isDefinition: false, scopeLine: 348, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !463, !180}
!542 = !DISubprogram(name: "swap", linkageName: "_ZNSt3__18ios_base4swapERS0_", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 349, type: !540, isLocal: false, isDefinition: false, scopeLine: 349, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!543 = !DISubprogram(name: "set_rdbuf", linkageName: "_ZNSt3__18ios_base9set_rdbufEPv", scope: !"_ZTSNSt3__18ios_baseE", file: !4, line: 352, type: !529, isLocal: false, isDefinition: false, scopeLine: 352, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!544 = !DICompositeType(tag: DW_TAG_class_type, name: "locale", scope: !131, file: !545, line: 60, size: 64, align: 64, elements: !546, identifier: "_ZTSNSt3__16localeE")
!545 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__locale", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!546 = !{!547, !550, !551, !552, !553, !554, !555, !556, !557, !559, !563, !566, !569, !575, !578, !581, !584, !585, !588, !592, !595, !596, !599, !602, !606, !610, !614}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "none", scope: !"_ZTSNSt3__16localeE", file: !545, line: 69, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 0)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "category", scope: !"_ZTSNSt3__16localeE", file: !545, line: 67, baseType: !32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !"_ZTSNSt3__16localeE", file: !545, line: 70, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 1)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !"_ZTSNSt3__16localeE", file: !545, line: 71, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 2)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "monetary", scope: !"_ZTSNSt3__16localeE", file: !545, line: 72, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 8)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !"_ZTSNSt3__16localeE", file: !545, line: 73, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 16)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !"_ZTSNSt3__16localeE", file: !545, line: 74, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "messages", scope: !"_ZTSNSt3__16localeE", file: !545, line: 75, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 4)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !"_ZTSNSt3__16localeE", file: !545, line: 76, baseType: !548, flags: DIFlagPublic | DIFlagStaticMember, extraData: i32 63)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__locale_", scope: !"_ZTSNSt3__16localeE", file: !545, line: 109, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5__impE", size: 64, align: 64)
!559 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 79, type: !560, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16localeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!563 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 80, type: !564, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !562, !378}
!566 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 81, type: !567, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !562, !65}
!569 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 82, type: !570, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !562, !572}
!572 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !131, file: !254, line: 194, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!575 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 83, type: !576, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !562, !378, !65, !549}
!578 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 84, type: !579, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !562, !378, !572, !549}
!581 = !DISubprogram(name: "locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 87, type: !582, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !562, !378, !378, !549}
!584 = !DISubprogram(name: "~locale", scope: !"_ZTSNSt3__16localeE", file: !545, line: 89, type: !560, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!585 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__16localeaSERKS0_", scope: !"_ZTSNSt3__16localeE", file: !545, line: 91, type: !586, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{!378, !562, !378}
!588 = !DISubprogram(name: "name", linkageName: "_ZNKSt3__16locale4nameEv", scope: !"_ZTSNSt3__16localeE", file: !545, line: 96, type: !589, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!574, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!592 = !DISubprogram(name: "operator==", linkageName: "_ZNKSt3__16localeeqERKS0_", scope: !"_ZTSNSt3__16localeE", file: !545, line: 97, type: !593, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{!184, !591, !378}
!595 = !DISubprogram(name: "operator!=", linkageName: "_ZNKSt3__16localeneERKS0_", scope: !"_ZTSNSt3__16localeE", file: !545, line: 98, type: !593, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "global", linkageName: "_ZNSt3__16locale6globalERKS0_", scope: !"_ZTSNSt3__16localeE", file: !545, line: 104, type: !597, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{!"_ZTSNSt3__16localeE", !378}
!599 = !DISubprogram(name: "classic", linkageName: "_ZNSt3__16locale7classicEv", scope: !"_ZTSNSt3__16localeE", file: !545, line: 105, type: !600, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubroutineType(types: !601)
!601 = !{!378}
!602 = !DISubprogram(name: "__install_ctor", linkageName: "_ZNSt3__16locale14__install_ctorERKS0_PNS0_5facetEl", scope: !"_ZTSNSt3__16localeE", file: !545, line: 111, type: !603, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !562, !378, !605, !114}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__16locale5facetE", size: 64, align: 64)
!606 = !DISubprogram(name: "__global", linkageName: "_ZNSt3__16locale8__globalEv", scope: !"_ZTSNSt3__16localeE", file: !545, line: 112, type: !607, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true)
!607 = !DISubroutineType(types: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16localeE")
!610 = !DISubprogram(name: "has_facet", linkageName: "_ZNKSt3__16locale9has_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !545, line: 113, type: !611, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{!184, !591, !613}
!613 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__16locale2idE")
!614 = !DISubprogram(name: "use_facet", linkageName: "_ZNKSt3__16locale9use_facetERNS0_2idE", scope: !"_ZTSNSt3__16localeE", file: !545, line: 114, type: !615, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !591, !613}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16locale5facetE")
!619 = !DICompositeType(tag: DW_TAG_class_type, name: "__imp", scope: !"_ZTSNSt3__16localeE", file: !545, line: 108, flags: DIFlagFwdDecl, identifier: "_ZTSNSt3__16locale5__impE")
!620 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >", scope: !131, file: !252, line: 4243, size: 192, align: 64, elements: !621, templateParams: !974, identifier: "_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!621 = !{!622, !623, !624, !631, !635, !641, !646, !649, !655, !658, !661, !664, !667, !670, !673, !674, !678, !681, !684, !688, !693, !694, !695, !699, !703, !704, !705, !706, !707, !708, !709, !712, !713, !714, !715, !716, !719, !720, !721, !722, !725, !730, !735, !736, !737, !738, !739, !740, !741, !744, !747, !748, !751, !754, !755, !758, !761, !762, !763, !764, !765, !766, !767, !768, !771, !774, !777, !780, !783, !786, !789, !792, !795, !798, !801, !804, !807, !810, !813, !816, !819, !822, !825, !829, !832, !835, !838, !839, !842, !845, !848, !851, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !877, !880, !883, !886, !889, !892, !893, !894, !898, !901, !902, !903, !904, !905, !906, !907, !908, !916, !919, !926, !927, !928, !929, !930, !931, !934, !937, !938, !939, !942, !945, !946, !947, !952, !956, !957, !960, !963, !966, !969, !972, !973}
!622 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", baseType: !"_ZTSNSt3__121__basic_string_commonILb1EEE")
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__r_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1318, baseType: !"_ZTSNSt3__117__compressed_pairINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repES5_EE", size: 192, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "npos", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1321, baseType: !625, flags: DIFlagPublic | DIFlagStaticMember, extraData: i64 -1)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1213, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__116allocator_traitsINS_9allocatorIcEEEE", file: !628, line: 1417, baseType: !629)
!628 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/memory", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !"_ZTSNSt3__111__size_typeINS_9allocatorIcEElLb1EEE", file: !628, line: 1074, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !"_ZTSNSt3__19allocatorIcEE", file: !628, line: 1643, baseType: !285)
!631 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1323, type: !632, isLocal: false, isDefinition: false, scopeLine: 1323, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!635 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1325, type: !636, isLocal: false, isDefinition: false, scopeLine: 1325, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, isOptimized: true)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !634, !638}
!638 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1211, baseType: !"_ZTSNSt3__19allocatorIcEE")
!641 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1326, type: !642, isLocal: false, isDefinition: false, scopeLine: 1326, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !634, !644}
!644 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!646 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1327, type: !647, isLocal: false, isDefinition: false, scopeLine: 1327, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !634, !644, !638}
!649 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1335, type: !650, isLocal: false, isDefinition: false, scopeLine: 1335, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !634, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1210, baseType: !274)
!655 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1337, type: !656, isLocal: false, isDefinition: false, scopeLine: 1337, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !634, !652, !638}
!658 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1339, type: !659, isLocal: false, isDefinition: false, scopeLine: 1339, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !634, !652, !626}
!661 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1341, type: !662, isLocal: false, isDefinition: false, scopeLine: 1341, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !634, !652, !626, !638}
!664 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1343, type: !665, isLocal: false, isDefinition: false, scopeLine: 1343, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !634, !626, !654}
!667 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1345, type: !668, isLocal: false, isDefinition: false, scopeLine: 1345, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !634, !626, !654, !638}
!670 = !DISubprogram(name: "basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1346, type: !671, isLocal: false, isDefinition: false, scopeLine: 1346, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !634, !644, !626, !626, !638}
!673 = !DISubprogram(name: "~basic_string", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1361, type: !632, isLocal: false, isDefinition: false, scopeLine: 1361, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSERKS5_", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1363, type: !675, isLocal: false, isDefinition: false, scopeLine: 1363, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !634, !644}
!677 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE")
!678 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEPKc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1370, type: !679, isLocal: false, isDefinition: false, scopeLine: 1370, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!677, !634, !652}
!681 = !DISubprogram(name: "operator=", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEaSEc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1371, type: !682, isLocal: false, isDefinition: false, scopeLine: 1371, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!677, !634, !654}
!684 = !DISubprogram(name: "begin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1392, type: !685, isLocal: false, isDefinition: false, scopeLine: 1392, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{!687, !634}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1229, baseType: !"_ZTSNSt3__111__wrap_iterIPcEE")
!688 = !DISubprogram(name: "begin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5beginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1395, type: !689, isLocal: false, isDefinition: false, scopeLine: 1395, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1230, baseType: !"_ZTSNSt3__111__wrap_iterIPKcEE")
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!693 = !DISubprogram(name: "end", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1398, type: !685, isLocal: false, isDefinition: false, scopeLine: 1398, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubprogram(name: "end", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE3endEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1401, type: !689, isLocal: false, isDefinition: false, scopeLine: 1401, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1405, type: !696, isLocal: false, isDefinition: false, scopeLine: 1405, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubroutineType(types: !697)
!697 = !{!698, !634}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1232, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPcEEEE")
!699 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6rbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1408, type: !700, isLocal: false, isDefinition: false, scopeLine: 1408, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !692}
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1233, baseType: !"_ZTSNSt3__116reverse_iteratorINS_11__wrap_iterIPKcEEEE")
!703 = !DISubprogram(name: "rend", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1411, type: !696, isLocal: false, isDefinition: false, scopeLine: 1411, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubprogram(name: "rend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4rendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1414, type: !700, isLocal: false, isDefinition: false, scopeLine: 1414, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubprogram(name: "cbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6cbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1418, type: !689, isLocal: false, isDefinition: false, scopeLine: 1418, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!706 = !DISubprogram(name: "cend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4cendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1421, type: !689, isLocal: false, isDefinition: false, scopeLine: 1421, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!707 = !DISubprogram(name: "crbegin", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE7crbeginEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1424, type: !700, isLocal: false, isDefinition: false, scopeLine: 1424, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubprogram(name: "crend", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5crendEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1427, type: !700, isLocal: false, isDefinition: false, scopeLine: 1427, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubprogram(name: "size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE4sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1430, type: !710, isLocal: false, isDefinition: false, scopeLine: 1430, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubroutineType(types: !711)
!711 = !{!626, !692}
!712 = !DISubprogram(name: "length", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6lengthEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1432, type: !710, isLocal: false, isDefinition: false, scopeLine: 1432, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!713 = !DISubprogram(name: "max_size", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE8max_sizeEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1433, type: !710, isLocal: false, isDefinition: false, scopeLine: 1433, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!714 = !DISubprogram(name: "capacity", linkageName: "_ZNKSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE8capacityEv", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1434, type: !710, isLocal: false, isDefinition: false, scopeLine: 1434, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubprogram(name: "resize", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEmc", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1437, type: !665, isLocal: false, isDefinition: false, scopeLine: 1437, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!716 = !DISubprogram(name: "resize", linkageName: "_ZNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE6resizeEm", scope: !"_ZTSNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE", file: !252, line: 1438, type: !717, isLocal: false, isDefinition: false, scopeLine: 1438, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !634, !626}
