; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/libs/sim/task.cc'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._Task = type { i64, [37 x i32], [37 x i32], i32, i32, %struct._Task*, void (i8*)*, i8*, i32, %struct._Task*, i64 }

@main_task = global %struct._Task zeroinitializer, align 8
@current_task = global %struct._Task* null, align 8
@tmp_jmpb = global [37 x i32] zeroinitializer, align 16

; Function Attrs: nounwind optsize readnone ssp uwtable
define i32 @_Z4distP5_TaskS0_(%struct._Task* %from, %struct._Task* %to) #0 {
  tail call void @llvm.dbg.value(metadata %struct._Task* %from, i64 0, metadata !39, metadata !99), !dbg !100
  tail call void @llvm.dbg.value(metadata %struct._Task* %to, i64 0, metadata !40, metadata !99), !dbg !101
  %1 = icmp ugt %struct._Task* %from, %to, !dbg !102
  br i1 %1, label %2, label %6, !dbg !103

; <label>:2                                       ; preds = %0
  %3 = ptrtoint %struct._Task* %from to i64, !dbg !104
  %4 = ptrtoint %struct._Task* %to to i64, !dbg !104
  %5 = sub i64 %3, %4, !dbg !104
  br label %10, !dbg !103

; <label>:6                                       ; preds = %0
  %7 = ptrtoint %struct._Task* %to to i64, !dbg !105
  %8 = ptrtoint %struct._Task* %from to i64, !dbg !105
  %9 = sub i64 %7, %8, !dbg !105
  br label %10, !dbg !103

; <label>:10                                      ; preds = %6, %2

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !34, globals: !91, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/libs/sim/task.cc", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !32, !19}
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Task", file: !5, line: 41, size: 2880, align: 64, elements: !6, identifier: "_ZTS5_Task")
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/471.omnetpp/src/libs/sim/task.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !9, !16, !17, !18, !20, !22, !28, !29, !30, !31}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "guardbeef1", scope: !"_ZTS5_Task", file: !5, line: 43, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "jmpb", scope: !"_ZTS5_Task", file: !5, line: 44, baseType: !10, size: 1184, align: 32, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !11, line: 36, baseType: !12)
!11 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1184, align: 32, elements: !14)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !{!15}
!15 = !DISubrange(count: 37)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "rst_jmpb", scope: !"_ZTS5_Task", file: !5, line: 45, baseType: !10, size: 1184, align: 32, offset: 1248)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !"_ZTS5_Task", file: !5, line: 46, baseType: !13, size: 32, align: 32, offset: 2432)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS5_Task", file: !5, line: 47, baseType: !19, size: 32, align: 32, offset: 2464)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS5_Task", file: !5, line: 48, baseType: !21, size: 64, align: 64, offset: 2496)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS5_Task", size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "fnp", scope: !"_ZTS5_Task", file: !5, line: 50, baseType: !23, size: 64, align: 64, offset: 2560)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Task_fn", file: !5, line: 39, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !"_ZTS5_Task", file: !5, line: 51, baseType: !27, size: 64, align: 64, offset: 2624)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !"_ZTS5_Task", file: !5, line: 52, baseType: !19, size: 32, align: 32, offset: 2688)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prevbeef", scope: !"_ZTS5_Task", file: !5, line: 54, baseType: !21, size: 64, align: 64, offset: 2752)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "guardbeef2", scope: !"_ZTS5_Task", file: !5, line: 55, baseType: !8, size: 64, align: 64, offset: 2816)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !{!35, !43, !52, !59, !67, !72, !76, !79, !85}
!35 = !DISubprogram(name: "dist", linkageName: "_Z4distP5_TaskS0_", scope: !1, file: !1, line: 26, type: !36, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Task*, %struct._Task*)* @_Z4distP5_TaskS0_, variables: !38)
!36 = !DISubroutineType(types: !37)
!37 = !{!19, !21, !21}
!38 = !{!39, !40, !41, !42}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from", arg: 1, scope: !35, file: !1, line: 26, type: !21)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "to", arg: 2, scope: !35, file: !1, line: 26, type: !21)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !35, file: !1, line: 28, type: !32)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !35, file: !1, line: 29, type: !32)
!43 = !DISubprogram(name: "eat", linkageName: "_Z3eatP5_TaskjS0_", scope: !1, file: !1, line: 34, type: !44, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Task*, i32, %struct._Task*)* @_Z3eatP5_TaskjS0_, variables: !46)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !21, !19, !21}
!46 = !{!47, !48, !49, !50, !51}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !43, file: !1, line: 34, type: !21)
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !43, file: !1, line: 34, type: !19)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prevbeef", arg: 3, scope: !43, file: !1, line: 34, type: !21)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !43, file: !1, line: 36, type: !19)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !43, file: !1, line: 37, type: !"_ZTS5_Task")
!52 = !DISubprogram(name: "task_init", linkageName: "_Z9task_initjj", scope: !1, file: !1, line: 103, type: !53, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @_Z9task_initjj, variables: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !19, !19}
!55 = !{!56, !57, !58}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_stack", arg: 1, scope: !52, file: !1, line: 103, type: !19)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "main_stack", arg: 2, scope: !52, file: !1, line: 103, type: !19)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !52, file: !1, line: 105, type: !"_ZTS5_Task")
!59 = !DISubprogram(name: "task_create", linkageName: "_Z11task_createPFvPvES_j", scope: !1, file: !1, line: 119, type: !60, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Task* (void (i8*)*, i8*, i32)* @_Z11task_createPFvPvES_j, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{!21, !23, !27, !19}
!62 = !{!63, !64, !65, !66}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnp", arg: 1, scope: !59, file: !1, line: 119, type: !23)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !59, file: !1, line: 119, type: !27)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack_size", arg: 3, scope: !59, file: !1, line: 119, type: !19)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !59, file: !1, line: 121, type: !21)
!67 = !DISubprogram(name: "task_switchto", linkageName: "_Z13task_switchtoP5_Task", scope: !1, file: !1, line: 141, type: !68, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._Task*)* @_Z13task_switchtoP5_Task, variables: !70)
