; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/epd.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.move_s = type { i32, i32, i32, i32, i32, i32 }

@setup_epd_line.rankoffsets = internal unnamed_addr constant [8 x i32] [i32 110, i32 98, i32 86, i32 74, i32 62, i32 50, i32 38, i32 26], align 16
@board = external global [144 x i32]
@white_castled = external global i32
@black_castled = external global i32
@book_ply = external global i32
@bking_loc = external global i32
@wking_loc = external global i32
@white_to_move = external global i32
@moved = external global [144 x i32]
@ep_square = external global i32
@.str = private unnamed_addr constant [3 x i8] c"bm\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !12, globals: !170, imports: !175)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/epd.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10, !11}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !{!13, !32, !51, !130, !144, !150, !158, !161, !167}
!13 = !DISubprogram(name: "setup_epd_line", scope: !1, file: !1, line: 14, type: !14, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @setup_epd_line, variables: !18)
!14 = !DISubroutineType(types: !15)
!15 = !{null, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!19 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuff", arg: 1, scope: !13, file: !1, line: 14, type: !16)
!20 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !13, file: !1, line: 16, type: !9)
!21 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rankp", scope: !13, file: !1, line: 17, type: !9)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rankoffset", scope: !13, file: !1, line: 18, type: !9)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileoffset", scope: !13, file: !1, line: 19, type: !9)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !13, file: !1, line: 20, type: !9)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stage", scope: !13, file: !1, line: 29, type: !9)
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converterf", scope: !13, file: !1, line: 34, type: !9)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converterr", scope: !13, file: !1, line: 35, type: !9)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep_file", scope: !13, file: !1, line: 36, type: !9)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep_rank", scope: !13, file: !1, line: 36, type: !9)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norm_file", scope: !13, file: !1, line: 36, type: !9)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norm_rank", scope: !13, file: !1, line: 36, type: !9)
!32 = !DISubprogram(name: "check_solution", scope: !1, file: !1, line: 177, type: !33, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.move_s*)* @check_solution, variables: !44)
!33 = !DISubroutineType(types: !34)
!34 = !{!9, !16, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !4, line: 102, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 95, size: 192, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !36, file: !4, line: 96, baseType: !9, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !36, file: !4, line: 97, baseType: !9, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "captured", scope: !36, file: !4, line: 98, baseType: !9, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "promoted", scope: !36, file: !4, line: 99, baseType: !9, size: 32, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "castled", scope: !36, file: !4, line: 100, baseType: !9, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !36, file: !4, line: 101, baseType: !9, size: 32, align: 32, offset: 160)
!44 = !{!45, !46, !47}
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuff", arg: 1, scope: !32, file: !1, line: 177, type: !16)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cmove", arg: 2, scope: !32, file: !1, line: 177, type: !35)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "san", scope: !32, file: !1, line: 179, type: !48)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, align: 8, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 256)
!51 = !DISubprogram(name: "run_epd_testsuite", scope: !1, file: !1, line: 206, type: !52, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @run_epd_testsuite, variables: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{null}
!54 = !{!55, !116, !120, !124, !125, !126, !127, !128, !129}
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "testsuite", scope: !51, file: !1, line: 208, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 153, baseType: !59)
!58 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !58, line: 122, size: 1216, align: 64, elements: !60)
!60 = !{!61, !64, !65, !66, !68, !69, !74, !75, !76, !80, !84, !94, !100, !101, !104, !105, !109, !113, !114, !115}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !59, file: !58, line: 123, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !59, file: !58, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !59, file: !58, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !58, line: 126, baseType: !67, size: 16, align: 16, offset: 128)
!67 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !59, file: !58, line: 127, baseType: !67, size: 16, align: 16, offset: 144)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !59, file: !58, line: 128, baseType: !70, size: 128, align: 64, offset: 192)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !58, line: 88, size: 128, align: 64, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !70, file: !58, line: 89, baseType: !62, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !70, file: !58, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !59, file: !58, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !59, file: !58, line: 132, baseType: !10, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !59, file: !58, line: 133, baseType: !77, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!9, !10}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !59, file: !58, line: 134, baseType: !81, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!9, !10, !16, !9}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !59, file: !58, line: 135, baseType: !85, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !10, !88, !9}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !58, line: 77, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !90, line: 71, baseType: !91)
!90 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !92, line: 46, baseType: !93)
!92 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !59, file: !58, line: 136, baseType: !95, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!9, !10, !98, !9}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !59, file: !58, line: 139, baseType: !70, size: 128, align: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !59, file: !58, line: 140, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !58, line: 94, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !59, file: !58, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !59, file: !58, line: 144, baseType: !106, size: 24, align: 8, offset: 928)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 24, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !59, file: !58, line: 145, baseType: !110, size: 8, align: 8, offset: 952)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !59, file: !58, line: 148, baseType: !70, size: 128, align: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !59, file: !58, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !58, line: 152, baseType: !88, size: 64, align: 64, offset: 1152)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readbuff", scope: !51, file: !1, line: 209, type: !117)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 16000, align: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 2000)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "testname", scope: !51, file: !1, line: 210, type: !121)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8192, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 1024)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tempbuff", scope: !51, file: !1, line: 211, type: !117)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nps", scope: !51, file: !1, line: 212, type: !9)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thinktime", scope: !51, file: !1, line: 213, type: !9)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comp_move", scope: !51, file: !1, line: 214, type: !35)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tested", scope: !51, file: !1, line: 215, type: !9)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !51, file: !1, line: 215, type: !9)
!130 = !DISubprogram(name: "run_autotest", scope: !1, file: !1, line: 298, type: !14, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @run_autotest, variables: !131)
!131 = !{!132, !133, !134, !135, !136, !142, !143}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "testset", arg: 1, scope: !130, file: !1, line: 298, type: !16)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "testsuite", scope: !130, file: !1, line: 300, type: !56)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readbuff", scope: !130, file: !1, line: 301, type: !48)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "searchdepth", scope: !130, file: !1, line: 302, type: !9)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !130, file: !1, line: 303, type: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtime_t", file: !4, line: 161, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !139, line: 30, baseType: !140)
!139 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !92, line: 120, baseType: !141)
!141 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !130, file: !1, line: 303, type: !137)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comp_move", scope: !130, file: !1, line: 305, type: !35)
!144 = !DISubprogram(name: "isdigit", scope: !145, file: !145, line: 237, type: !146, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !148)
!145 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DISubroutineType(types: !147)
!147 = !{!9, !9}
!148 = !{!149}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !144, file: !145, line: 237, type: !9)
!150 = !DISubprogram(name: "__isctype", scope: !145, file: !145, line: 164, type: !151, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !155)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !153, !154}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !92, line: 70, baseType: !9)
!154 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!155 = !{!156, !157}
