; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/proof.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.move_s = type { i32, i32, i32, i32, i32, i32 }
%struct.node = type { i8, i8, i8, i8, i32, i32, %struct.node**, %struct.node*, %struct.move_s }

@bufftop = global i32 0, align 4
@membuff = common global i8* null, align 8
@Variant = external global i32
@white_to_move = external global i32
@wking_loc = external global i32
@bking_loc = external global i32
@numb_moves = external global i32
@root_to_move = external global i32
@piece_count = external global i32
@pieces = external global [62 x i32]
@board = external global [144 x i32]
@captures = external global i32
@hash = external global i32
@move_number = external global i32
@ply = external global i32
@hash_history = external global [600 x i32]
@maxply = common global i32 0, align 4
@forwards = common global i32 0, align 4
@phase = external global i32
@nodecount = common global i32 0, align 4
@frees = common global i32 0, align 4
@nodecount2 = common global i32 0, align 4
@pn2 = common global i32 0, align 4
@PBSize = external global i32
@alllosers = common global i32 0, align 4
@rootlosers = common global [300 x i32] zeroinitializer, align 16
@pn_move = common global %struct.move_s zeroinitializer, align 4
@dummy = external global %struct.move_s
@iters = common global i32 0, align 4
@pn_time = common global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !39, globals: !186, imports: !50)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/proof.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10, !36, !37, !38}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !1, line: 57, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !1, line: 45, size: 448, align: 64, elements: !13)
!13 = !{!14, !16, !17, !18, !19, !21, !22, !25, !26}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !12, file: !1, line: 47, baseType: !15, size: 8, align: 8)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "num_children", scope: !12, file: !1, line: 48, baseType: !15, size: 8, align: 8, offset: 8)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "expanded", scope: !12, file: !1, line: 49, baseType: !15, size: 8, align: 8, offset: 16)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "evaluated", scope: !12, file: !1, line: 50, baseType: !15, size: 8, align: 8, offset: 24)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "proof", scope: !12, file: !1, line: 51, baseType: !20, size: 32, align: 32, offset: 32)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "disproof", scope: !12, file: !1, line: 52, baseType: !20, size: 32, align: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !12, file: !1, line: 53, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !12, file: !1, line: 54, baseType: !24, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !12, file: !1, line: 55, baseType: !27, size: 192, align: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !4, line: 102, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 95, size: 192, align: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !28, file: !4, line: 96, baseType: !20, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !28, file: !4, line: 97, baseType: !20, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "captured", scope: !28, file: !4, line: 98, baseType: !20, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "promoted", scope: !28, file: !4, line: 99, baseType: !20, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "castled", scope: !28, file: !4, line: 100, baseType: !20, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !28, file: !4, line: 101, baseType: !20, size: 32, align: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!39 = !{!40, !47, !51, !57, !60, !70, !78, !89, !96, !106, !116, !121, !127, !162, !176}
!40 = !DISubprogram(name: "Xmalloc", scope: !1, file: !1, line: 67, type: !41, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @Xmalloc, variables: !44)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !20}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!44 = !{!45, !46}
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !40, file: !1, line: 67, type: !20)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtop", scope: !40, file: !1, line: 69, type: !20)
!47 = !DISubprogram(name: "Xfree", scope: !1, file: !1, line: 76, type: !48, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @Xfree, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !{}
!51 = !DISubprogram(name: "freenodes", scope: !1, file: !1, line: 81, type: !52, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.node*)* @freenodes, variables: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !10}
!54 = !{!55, !56}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !51, file: !1, line: 81, type: !10)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !51, file: !1, line: 83, type: !20)
!57 = !DISubprogram(name: "pn_eval", scope: !1, file: !1, line: 106, type: !52, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.node*)* @pn_eval, variables: !58)
!58 = !{!59}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !57, file: !1, line: 106, type: !10)
!60 = !DISubprogram(name: "std_pn_eval", scope: !1, file: !1, line: 122, type: !52, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.node*)* @std_pn_eval, variables: !61)
!61 = !{!62, !63, !64, !68, !69}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !60, file: !1, line: 122, type: !10)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !60, file: !1, line: 124, type: !20)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !60, file: !1, line: 125, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 98304, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 512)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mate", scope: !60, file: !1, line: 126, type: !20)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !60, file: !1, line: 127, type: !20)
!70 = !DISubprogram(name: "suicide_pn_eval", scope: !1, file: !1, line: 185, type: !52, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.node*)* @suicide_pn_eval, variables: !71)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !70, file: !1, line: 185, type: !10)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !70, file: !1, line: 187, type: !20)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !70, file: !1, line: 187, type: !20)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !70, file: !1, line: 187, type: !20)
