; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/search.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.move_s = type { i32, i32, i32, i32, i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@searching_pv = external global i32
@material = external global [14 x i32]
@board = external global [144 x i32]
@white_to_move = external global i32
@ply = external global i32
@pv = external global [300 x [300 x %struct.move_s]]
@i_depth = external global i32
@history_h = external global [144 x [144 x i32]]
@killer1 = external global [300 x %struct.move_s]
@killer2 = external global [300 x %struct.move_s]
@killer3 = external global [300 x %struct.move_s]
@nodes = external global i32
@rootnodecount = common global [512 x i32] zeroinitializer, align 16
@raw_nodes = external global i32
@numb_moves = external global i32
@pv_length = external global [300 x i32]
@time_exit = external global i32
@start_time = external global i64
@time_for_move = external global i32
@failed = common global i32 0, align 4
@extendedtime = common global i32 0, align 4
@fixed_time = external global i32
@go_fast = external global i32
@Variant = external global i32

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !13, globals: !251, imports: !291)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/search.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10, !11, !12}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !{!14, !39, !51, !78, !87, !124, !149, !177}
!14 = !DISubprogram(name: "order_moves", scope: !1, file: !1, line: 55, type: !15, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.move_s*, i32*, i32*, i32, i32)* @order_moves, variables: !27)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17, !11, !11, !9, !9}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !4, line: 102, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 95, size: 192, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !19, file: !4, line: 96, baseType: !9, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !19, file: !4, line: 97, baseType: !9, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "captured", scope: !19, file: !4, line: 98, baseType: !9, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "promoted", scope: !19, file: !4, line: 99, baseType: !9, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "castled", scope: !19, file: !4, line: 100, baseType: !9, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !19, file: !4, line: 101, baseType: !9, size: 32, align: 32, offset: 160)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "moves", arg: 1, scope: !14, file: !1, line: 55, type: !17)
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "move_ordering", arg: 2, scope: !14, file: !1, line: 55, type: !11)
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "see_values", arg: 3, scope: !14, file: !1, line: 55, type: !11)
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_moves", arg: 4, scope: !14, file: !1, line: 55, type: !9)
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "best", arg: 5, scope: !14, file: !1, line: 55, type: !9)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "promoted", scope: !14, file: !1, line: 57, type: !9)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "captured", scope: !14, file: !1, line: 57, type: !9)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !14, file: !1, line: 58, type: !9)
!36 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "from", scope: !14, file: !1, line: 58, type: !9)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !14, file: !1, line: 58, type: !9)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seev", scope: !14, file: !1, line: 58, type: !9)
!39 = !DISubprogram(name: "perft", scope: !1, file: !1, line: 294, type: !40, isLocal: false, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @perft, variables: !42)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !9}
!42 = !{!43, !44, !48, !49, !50}
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 1, scope: !39, file: !1, line: 294, type: !9)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !39, file: !1, line: 296, type: !45)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 98304, align: 32, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 512)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !39, file: !1, line: 297, type: !9)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !39, file: !1, line: 297, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !39, file: !1, line: 298, type: !9)
!51 = !DISubprogram(name: "qsearch", scope: !1, file: !1, line: 333, type: !52, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @qsearch, variables: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{!9, !9, !9, !9}
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !66, !67, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 1, scope: !51, file: !1, line: 333, type: !9)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "beta", arg: 2, scope: !51, file: !1, line: 333, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 3, scope: !51, file: !1, line: 333, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !51, file: !1, line: 338, type: !45)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !51, file: !1, line: 339, type: !9)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !51, file: !1, line: 339, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !51, file: !1, line: 339, type: !9)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !51, file: !1, line: 340, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "standpat", scope: !51, file: !1, line: 340, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "move_ordering", scope: !51, file: !1, line: 341, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 16384, align: 32, elements: !46)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "see_values", scope: !51, file: !1, line: 342, type: !65)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "legal_move", scope: !51, file: !1, line: 343, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbool", file: !4, line: 14, baseType: !3)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_moves", scope: !51, file: !1, line: 343, type: !68)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sbest", scope: !51, file: !1, line: 344, type: !9)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_score", scope: !51, file: !1, line: 344, type: !9)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best", scope: !51, file: !1, line: 344, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !51, file: !1, line: 344, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bound", scope: !51, file: !1, line: 344, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "originalalpha", scope: !51, file: !1, line: 345, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtime", scope: !51, file: !1, line: 346, type: !9)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seev", scope: !51, file: !1, line: 347, type: !9)
!78 = !DISubprogram(name: "remove_one", scope: !1, file: !1, line: 504, type: !79, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i32)* @remove_one, variables: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{!68, !11, !11, !9}
!81 = !{!82, !83, !84, !85, !86}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "marker", arg: 1, scope: !78, file: !1, line: 504, type: !11)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "move_ordering", arg: 2, scope: !78, file: !1, line: 504, type: !11)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_moves", arg: 3, scope: !78, file: !1, line: 504, type: !9)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !78, file: !1, line: 510, type: !9)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best", scope: !78, file: !1, line: 510, type: !9)
!87 = !DISubprogram(name: "search", scope: !1, file: !1, line: 531, type: !88, isLocal: false, isDefinition: true, scopeLine: 531, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32)* @search, variables: !90)
!88 = !DISubroutineType(types: !89)
!89 = !{!9, !9, !9, !9, !9}
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 1, scope: !87, file: !1, line: 531, type: !9)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "beta", arg: 2, scope: !87, file: !1, line: 531, type: !9)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 3, scope: !87, file: !1, line: 531, type: !9)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_null", arg: 4, scope: !87, file: !1, line: 531, type: !9)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !87, file: !1, line: 535, type: !45)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !87, file: !1, line: 536, type: !9)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !87, file: !1, line: 536, type: !9)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !87, file: !1, line: 536, type: !9)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "score", scope: !87, file: !1, line: 537, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "move_ordering", scope: !87, file: !1, line: 537, type: !65)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "see_values", scope: !87, file: !1, line: 537, type: !65)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_moves", scope: !87, file: !1, line: 538, type: !68)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "legal_move", scope: !87, file: !1, line: 538, type: !68)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bound", scope: !87, file: !1, line: 539, type: !9)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threat", scope: !87, file: !1, line: 539, type: !9)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "donull", scope: !87, file: !1, line: 539, type: !9)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best", scope: !87, file: !1, line: 539, type: !9)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sbest", scope: !87, file: !1, line: 539, type: !9)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_score", scope: !87, file: !1, line: 539, type: !9)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_ep", scope: !87, file: !1, line: 539, type: !9)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incheck", scope: !87, file: !1, line: 540, type: !68)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !87, file: !1, line: 540, type: !68)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extend", scope: !87, file: !1, line: 541, type: !9)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fscore", scope: !87, file: !1, line: 541, type: !9)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmax", scope: !87, file: !1, line: 541, type: !9)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "selective", scope: !87, file: !1, line: 541, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kswap", scope: !87, file: !1, line: 542, type: !18)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ksswap", scope: !87, file: !1, line: 543, type: !9)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "originalalpha", scope: !87, file: !1, line: 544, type: !9)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "afterincheck", scope: !87, file: !1, line: 545, type: !9)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "legalmoves", scope: !87, file: !1, line: 546, type: !9)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dropcut", scope: !87, file: !1, line: 547, type: !9)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtime", scope: !87, file: !1, line: 548, type: !9)
!124 = !DISubprogram(name: "search_root", scope: !1, file: !1, line: 1099, type: !125, isLocal: false, isDefinition: true, scopeLine: 1099, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.move_s*, i32, i32, i32)* @search_root, variables: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!18, !9, !9, !9}
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "originalalpha", arg: 1, scope: !124, file: !1, line: 1099, type: !9)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "originalbeta", arg: 2, scope: !124, file: !1, line: 1099, type: !9)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 3, scope: !124, file: !1, line: 1099, type: !9)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !124, file: !1, line: 1103, type: !45)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_move", scope: !124, file: !1, line: 1103, type: !18)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !124, file: !1, line: 1104, type: !9)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !124, file: !1, line: 1104, type: !9)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !124, file: !1, line: 1104, type: !9)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "root_score", scope: !124, file: !1, line: 1105, type: !9)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "move_ordering", scope: !124, file: !1, line: 1105, type: !65)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "see_values", scope: !124, file: !1, line: 1105, type: !65)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_moves", scope: !124, file: !1, line: 1106, type: !68)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "legal_move", scope: !124, file: !1, line: 1106, type: !68)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !124, file: !1, line: 1106, type: !68)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alpha", scope: !124, file: !1, line: 1107, type: !9)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beta", scope: !124, file: !1, line: 1107, type: !9)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kswap", scope: !124, file: !1, line: 1108, type: !18)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ksswap", scope: !124, file: !1, line: 1109, type: !9)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incheck", scope: !124, file: !1, line: 1110, type: !9)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mc", scope: !124, file: !1, line: 1111, type: !9)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldnodecount", scope: !124, file: !1, line: 1112, type: !9)
!149 = !DISubprogram(name: "think", scope: !1, file: !1, line: 1444, type: !150, isLocal: false, isDefinition: true, scopeLine: 1444, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.move_s*)* @think, variables: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!18}
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comp_move", scope: !149, file: !1, line: 1448, type: !18)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp_move", scope: !149, file: !1, line: 1448, type: !18)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_move", scope: !149, file: !1, line: 1448, type: !18)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !149, file: !1, line: 1449, type: !9)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !149, file: !1, line: 1449, type: !9)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !149, file: !1, line: 1449, type: !9)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elapsed", scope: !149, file: !1, line: 1450, type: !9)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp_score", scope: !149, file: !1, line: 1450, type: !9)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "true_score", scope: !149, file: !1, line: 1450, type: !9)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alpha", scope: !149, file: !1, line: 1451, type: !9)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beta", scope: !149, file: !1, line: 1451, type: !9)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmptmp", scope: !149, file: !1, line: 1452, type: !9)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rs", scope: !149, file: !1, line: 1453, type: !9)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !149, file: !1, line: 1454, type: !45)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !149, file: !1, line: 1455, type: !9)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastlegal", scope: !149, file: !1, line: 1455, type: !9)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !149, file: !1, line: 1455, type: !9)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pn_restart", scope: !149, file: !1, line: 1456, type: !9)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !149, file: !1, line: 1457, type: !9)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !149, file: !1, line: 1458, type: !173)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, align: 8, elements: !175)
!174 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!175 = !{!176}
!176 = !DISubrange(count: 8)
!177 = !DISubprogram(name: "tree", scope: !1, file: !1, line: 1910, type: !178, isLocal: false, isDefinition: true, scopeLine: 1910, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.__sFILE*, i8*)* @tree, variables: !241)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !9, !9, !180, !208}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !182, line: 153, baseType: !183)
!182 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !182, line: 122, size: 1216, align: 64, elements: !184)
!184 = !{!185, !188, !189, !190, !192, !193, !198, !199, !200, !204, !209, !219, !225, !226, !229, !230, !234, !238, !239, !240}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !183, file: !182, line: 123, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !183, file: !182, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !183, file: !182, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !183, file: !182, line: 126, baseType: !191, size: 16, align: 16, offset: 128)
!191 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !183, file: !182, line: 127, baseType: !191, size: 16, align: 16, offset: 144)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !183, file: !182, line: 128, baseType: !194, size: 128, align: 64, offset: 192)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !182, line: 88, size: 128, align: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !194, file: !182, line: 89, baseType: !186, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !194, file: !182, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !183, file: !182, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !183, file: !182, line: 132, baseType: !12, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !183, file: !182, line: 133, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!9, !12}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !183, file: !182, line: 134, baseType: !205, size: 64, align: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!9, !12, !208, !9}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !183, file: !182, line: 135, baseType: !210, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !12, !213, !9}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !182, line: 77, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !215, line: 71, baseType: !216)
!215 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !217, line: 46, baseType: !218)
!217 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!218 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !183, file: !182, line: 136, baseType: !220, size: 64, align: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!9, !12, !223, !9}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !183, file: !182, line: 139, baseType: !194, size: 128, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !183, file: !182, line: 140, baseType: !227, size: 64, align: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !182, line: 94, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !183, file: !182, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !183, file: !182, line: 144, baseType: !231, size: 24, align: 8, offset: 928)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 24, align: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !183, file: !182, line: 145, baseType: !235, size: 8, align: 8, offset: 952)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8, align: 8, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 1)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !183, file: !182, line: 148, baseType: !194, size: 128, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !183, file: !182, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !183, file: !182, line: 152, baseType: !213, size: 64, align: 64, offset: 1152)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 1, scope: !177, file: !1, line: 1910, type: !9)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indent", arg: 2, scope: !177, file: !1, line: 1910, type: !9)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 3, scope: !177, file: !1, line: 1910, type: !180)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "disp_b", arg: 4, scope: !177, file: !1, line: 1910, type: !208)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !177, file: !1, line: 1912, type: !45)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !177, file: !1, line: 1913, type: !9)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !177, file: !1, line: 1913, type: !9)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !177, file: !1, line: 1913, type: !9)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !177, file: !1, line: 1914, type: !9)
!251 = !{!252, !257, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !272, !276, !277, !278, !279, !280, !281, !282, !283, !285, !289, !290}
!252 = !DIGlobalVariable(name: "rc_index", scope: !87, file: !1, line: 549, type: !253, isLocal: true, isDefinition: true, variable: [14 x i32]* @search.rc_index)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 448, align: 32, elements: !255)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!255 = !{!256}
!256 = !DISubrange(count: 14)
!257 = !DIGlobalVariable(name: "FH", scope: !0, file: !1, line: 15, type: !258, isLocal: false, isDefinition: true, variable: i32* @FH)
!258 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!259 = !DIGlobalVariable(name: "FHF", scope: !0, file: !1, line: 15, type: !258, isLocal: false, isDefinition: true, variable: i32* @FHF)
!260 = !DIGlobalVariable(name: "razor_drop", scope: !0, file: !1, line: 16, type: !258, isLocal: false, isDefinition: true, variable: i32* @razor_drop)
!261 = !DIGlobalVariable(name: "razor_material", scope: !0, file: !1, line: 16, type: !258, isLocal: false, isDefinition: true, variable: i32* @razor_material)
!262 = !DIGlobalVariable(name: "drop_cuts", scope: !0, file: !1, line: 16, type: !258, isLocal: false, isDefinition: true, variable: i32* @drop_cuts)
!263 = !DIGlobalVariable(name: "ext_recap", scope: !0, file: !1, line: 16, type: !258, isLocal: false, isDefinition: true, variable: i32* @ext_recap)
!264 = !DIGlobalVariable(name: "ext_onerep", scope: !0, file: !1, line: 16, type: !258, isLocal: false, isDefinition: true, variable: i32* @ext_onerep)
!265 = !DIGlobalVariable(name: "true_i_depth", scope: !0, file: !1, line: 18, type: !174, isLocal: false, isDefinition: true, variable: i8* @true_i_depth)
!266 = !DIGlobalVariable(name: "bestmovenum", scope: !0, file: !1, line: 20, type: !9, isLocal: false, isDefinition: true, variable: i32* @bestmovenum)
!267 = !DIGlobalVariable(name: "ugly_ep_hack", scope: !0, file: !1, line: 22, type: !9, isLocal: false, isDefinition: true, variable: i32* @ugly_ep_hack)
!268 = !DIGlobalVariable(name: "postpv", scope: !0, file: !1, line: 24, type: !269, isLocal: false, isDefinition: true, variable: [256 x i8]* @postpv)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 2048, align: 8, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 256)
!272 = !DIGlobalVariable(name: "searching_move", scope: !0, file: !1, line: 26, type: !273, isLocal: false, isDefinition: true, variable: [20 x i8]* @searching_move)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 160, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 20)
