; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.move_s = type { i32, i32, i32, i32, i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.move_x = type { i32, i32, i32, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }

@divider = global [50 x i8] c"-------------------------------------------------\00", align 16
@dummy = global %struct.move_s zeroinitializer, align 4
@Variant = common global i32 0, align 4
@material = external global [14 x i32]
@std_material = external global [14 x i32]
@ECacheProbes = external global i32
@ECacheHits = external global i32
@TTProbes = external global i32
@TTStores = external global i32
@TTHits = external global i32
@bookidx = common global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !14, globals: !100, imports: !203)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !{!15, !71, !77, !80, !88, !91, !94}
!15 = !DISubprogram(name: "main", scope: !1, file: !1, line: 75, type: !16, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !21)
!16 = !DISubroutineType(types: !17)
!17 = !{!13, !13, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !{!22, !23, !24, !28, !29, !30, !31, !41, !42, !43, !45, !46, !50, !59, !60, !61, !62, !63, !64}
!22 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !15, file: !1, line: 75, type: !13)
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !15, file: !1, line: 75, type: !18)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !15, file: !1, line: 77, type: !25)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, align: 8, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 256)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !15, file: !1, line: 77, type: !19)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !15, file: !1, line: 77, type: !25)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readbuff", scope: !15, file: !1, line: 78, type: !25)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "move", scope: !15, file: !1, line: 79, type: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !4, line: 102, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 95, size: 192, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !33, file: !4, line: 96, baseType: !13, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !33, file: !4, line: 97, baseType: !13, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "captured", scope: !33, file: !4, line: 98, baseType: !13, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "promoted", scope: !33, file: !4, line: 99, baseType: !13, size: 32, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "castled", scope: !33, file: !4, line: 100, baseType: !13, size: 32, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !33, file: !4, line: 101, baseType: !13, size: 32, align: 32, offset: 160)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comp_move", scope: !15, file: !1, line: 79, type: !32)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !15, file: !1, line: 80, type: !13)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "force_mode", scope: !15, file: !1, line: 81, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbool", file: !4, line: 14, baseType: !3)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "show_board", scope: !15, file: !1, line: 81, type: !44)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "game_history", scope: !15, file: !1, line: 82, type: !47)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 115200, align: 32, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 600)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "game_history_x", scope: !15, file: !1, line: 83, type: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 76800, align: 32, elements: !48)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_x", file: !4, line: 109, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 104, size: 128, align: 32, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cap_num", scope: !53, file: !4, line: 105, baseType: !13, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "was_promoted", scope: !53, file: !4, line: 106, baseType: !13, size: 32, align: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !53, file: !4, line: 107, baseType: !13, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !53, file: !4, line: 108, baseType: !13, size: 32, align: 32, offset: 96)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_edit_mode", scope: !15, file: !1, line: 84, type: !13)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edit_color", scope: !15, file: !1, line: 84, type: !13)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pingnum", scope: !15, file: !1, line: 85, type: !13)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "braindeadinterface", scope: !15, file: !1, line: 86, type: !13)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "automode", scope: !15, file: !1, line: 87, type: !13)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xstart_time", scope: !15, file: !1, line: 88, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtime_t", file: !4, line: 161, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !67, line: 30, baseType: !68)
!67 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !69, line: 120, baseType: !70)
!69 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!70 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!71 = !DISubprogram(name: "tolower", scope: !72, file: !72, line: 292, type: !73, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, variables: !75)
!72 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!73 = !DISubroutineType(types: !74)
!74 = !{!13, !13}
!75 = !{!76}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !71, file: !72, line: 292, type: !13)
!77 = !DISubprogram(name: "isalpha", scope: !72, file: !72, line: 218, type: !73, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, variables: !78)
!78 = !{!79}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !77, file: !72, line: 218, type: !13)
!80 = !DISubprogram(name: "__istype", scope: !72, file: !72, line: 153, type: !81, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !85)
!81 = !DISubroutineType(types: !82)
!82 = !{!13, !83, !84}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !69, line: 70, baseType: !13)
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !{!86, !87}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !80, file: !72, line: 153, type: !83)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !80, file: !72, line: 153, type: !84)
!88 = !DISubprogram(name: "isascii", scope: !72, file: !72, line: 135, type: !73, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, variables: !89)
!89 = !{!90}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !88, file: !72, line: 135, type: !13)
!91 = !DISubprogram(name: "isdigit", scope: !72, file: !72, line: 237, type: !73, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !92)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !91, file: !72, line: 237, type: !13)
!94 = !DISubprogram(name: "__isctype", scope: !72, file: !72, line: 164, type: !95, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!83, !83, !84}
!97 = !{!98, !99}
