; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/ttable.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.TType = type { i8, i8, i8, i8, i16, i32, i32, i32 }
%struct.QTType = type { i8, i8, i16, i32, i32, i32 }

@DP_TTable = common global %struct.TType* null, align 8
@TTSize = external global i32
@AS_TTable = common global %struct.TType* null, align 8
@QS_TTable = common global %struct.QTType* null, align 8
@zobrist = common global [14 x [144 x i32]] zeroinitializer, align 16
@hash = common global i32 0, align 4
@hold_hash = external global i32
@board = external global [144 x i32]
@TTStores = common global i32 0, align 4
@white_to_move = external global i32
@is_pondering = external global i32
@ply = external global i32
@Variant = external global i32
@TTProbes = common global i32 0, align 4
@TTHits = common global i32 0, align 4
@str = private unnamed_addr constant [37 x i8] c"Out of memory allocating hashtables.\00"

; Function Attrs: nounwind optsize ssp uwtable
define void @clear_tt() #0 {
  %1 = load i8** bitcast (%struct.TType** @DP_TTable to i8**), align 8, !dbg !118, !tbaa !119
  %2 = load i32* @TTSize, align 4, !dbg !118, !tbaa !123
  %3 = sext i32 %2 to i64, !dbg !118
  %4 = mul nsw i64 %3, 20, !dbg !118
  %5 = tail call i64 @llvm.objectsize.i64.p0i8(i8* %1, i1 false), !dbg !118
  %6 = tail call i8* @__memset_chk(i8* %1, i32 0, i64 %4, i64 %5) #6, !dbg !118

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !36, globals: !101, imports: !40)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/ttable.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10, !11, !25, !35}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "TType", file: !1, line: 34, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 23, size: 160, align: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !21, !23, !24}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !13, file: !1, line: 25, baseType: !10, size: 8, align: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "OnMove", scope: !13, file: !1, line: 26, baseType: !10, size: 8, align: 8, offset: 8)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "Threat", scope: !13, file: !1, line: 27, baseType: !10, size: 8, align: 8, offset: 16)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !13, file: !1, line: 28, baseType: !10, size: 8, align: 8, offset: 24)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Bestmove", scope: !13, file: !1, line: 29, baseType: !20, size: 16, align: 16, offset: 32)
!20 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "HashKey", scope: !13, file: !1, line: 30, baseType: !22, size: 32, align: 32, offset: 64)
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Hold_hash", scope: !13, file: !1, line: 31, baseType: !22, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !13, file: !1, line: 32, baseType: !9, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "QTType", file: !1, line: 45, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 36, size: 128, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "OnMove", scope: !27, file: !1, line: 38, baseType: !10, size: 8, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !27, file: !1, line: 39, baseType: !10, size: 8, align: 8, offset: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bestmove", scope: !27, file: !1, line: 40, baseType: !20, size: 16, align: 16, offset: 16)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "HashKey", scope: !27, file: !1, line: 41, baseType: !22, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Hold_hash", scope: !27, file: !1, line: 42, baseType: !22, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !27, file: !1, line: 43, baseType: !9, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !{!37, !41, !42, !46, !49, !58, !69, !80, !92, !99, !100}
!37 = !DISubprogram(name: "clear_tt", scope: !1, file: !1, line: 51, type: !38, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @clear_tt, variables: !40)
!38 = !DISubroutineType(types: !39)
!39 = !{null}
!40 = !{}
!41 = !DISubprogram(name: "clear_dp_tt", scope: !1, file: !1, line: 58, type: !38, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @clear_dp_tt, variables: !40)
!42 = !DISubprogram(name: "initialize_zobrist", scope: !1, file: !1, line: 63, type: !38, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @initialize_zobrist, variables: !43)
!43 = !{!44, !45}
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !42, file: !1, line: 65, type: !9)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !42, file: !1, line: 65, type: !9)
!46 = !DISubprogram(name: "initialize_hash", scope: !1, file: !1, line: 82, type: !38, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @initialize_hash, variables: !47)
!47 = !{!48}
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !46, file: !1, line: 84, type: !9)
!49 = !DISubprogram(name: "QStoreTT", scope: !1, file: !1, line: 99, type: !50, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32)* @QStoreTT, variables: !52)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !9, !9, !9, !9}
!52 = !{!53, !54, !55, !56, !57}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "score", arg: 1, scope: !49, file: !1, line: 99, type: !9)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 2, scope: !49, file: !1, line: 99, type: !9)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "beta", arg: 3, scope: !49, file: !1, line: 99, type: !9)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "best", arg: 4, scope: !49, file: !1, line: 99, type: !9)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ttindex", scope: !49, file: !1, line: 101, type: !22)
!58 = !DISubprogram(name: "StoreTT", scope: !1, file: !1, line: 123, type: !59, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32)* @StoreTT, variables: !61)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !9, !9, !9, !9, !9, !9}
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "score", arg: 1, scope: !58, file: !1, line: 123, type: !9)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alpha", arg: 2, scope: !58, file: !1, line: 123, type: !9)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "beta", arg: 3, scope: !58, file: !1, line: 123, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "best", arg: 4, scope: !58, file: !1, line: 123, type: !9)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "threat", arg: 5, scope: !58, file: !1, line: 123, type: !9)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 6, scope: !58, file: !1, line: 123, type: !9)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ttindex", scope: !58, file: !1, line: 125, type: !22)
!69 = !DISubprogram(name: "LearnStoreTT", scope: !1, file: !1, line: 205, type: !70, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32)* @LearnStoreTT, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !9, !22, !22, !9, !9, !9}
