; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/utils.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.move_s = type { i32, i32, i32, i32, i32, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }

@left = global i32 -1, align 4
@moves_to_tc = external global i32
@min_per_game = external global i32
@inc = external global i32
@time_left = external global i32
@sec_per_game = external global i32
@opp_time = external global i32
@xb_mode = external global i32
@Variant = external global i32
@time_cushion = external global i32
@comp_to_san.type_to_char = internal unnamed_addr constant [14 x i32] [i32 70, i32 80, i32 80, i32 78, i32 78, i32 75, i32 75, i32 82, i32 82, i32 81, i32 81, i32 66, i32 66, i32 69], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !14, globals: !373, imports: !275)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/utils.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/458.sjeng/src/sjeng.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!14 = !{!15, !21, !54, !66, !140, !148, !154, !163, !174, !181, !195, !208, !218, !228, !231, !239, !250, !256, !259, !263, !272, !276, !277, !283, !288, !303, !304, !317, !321, !331, !341, !344, !350, !358, !361, !364, !370}
!15 = !DISubprogram(name: "allocate_time", scope: !1, file: !1, line: 30, type: !16, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @allocate_time, variables: !18)
!16 = !DISubroutineType(types: !17)
!17 = !{!10}
!18 = !{!19, !20}
!19 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allocated_time", scope: !15, file: !1, line: 36, type: !11)
!20 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "move_speed", scope: !15, file: !1, line: 36, type: !11)
!21 = !DISubprogram(name: "comp_to_san", scope: !1, file: !1, line: 116, type: !22, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.move_s*, i8*)* @comp_to_san, variables: !35)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24, !33}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !4, line: 102, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 95, size: 192, align: 32, elements: !26)
!26 = !{!27, !28, !29, !30, !31, !32}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !25, file: !4, line: 96, baseType: !10, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !25, file: !4, line: 97, baseType: !10, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "captured", scope: !25, file: !4, line: 98, baseType: !10, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "promoted", scope: !25, file: !4, line: 99, baseType: !10, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "castled", scope: !25, file: !4, line: 100, baseType: !10, size: 32, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !25, file: !4, line: 101, baseType: !10, size: 32, align: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !{!36, !37, !38, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "move", arg: 1, scope: !21, file: !1, line: 116, type: !24)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 2, scope: !21, file: !1, line: 116, type: !33)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !21, file: !1, line: 118, type: !39)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 98304, align: 32, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 512)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evade_moves", scope: !21, file: !1, line: 119, type: !39)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !21, file: !1, line: 121, type: !10)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_moves", scope: !21, file: !1, line: 121, type: !10)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evasions", scope: !21, file: !1, line: 121, type: !10)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ambig", scope: !21, file: !1, line: 121, type: !10)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mate", scope: !21, file: !1, line: 121, type: !10)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f_rank", scope: !21, file: !1, line: 122, type: !10)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t_rank", scope: !21, file: !1, line: 122, type: !10)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converter", scope: !21, file: !1, line: 122, type: !10)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f_file", scope: !21, file: !1, line: 123, type: !34)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t_file", scope: !21, file: !1, line: 123, type: !34)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !21, file: !1, line: 124, type: !10)
!54 = !DISubprogram(name: "comp_to_coord", scope: !1, file: !1, line: 276, type: !22, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.move_s*, i8*)* @comp_to_coord, variables: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "move", arg: 1, scope: !54, file: !1, line: 276, type: !24)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 2, scope: !54, file: !1, line: 276, type: !33)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prom", scope: !54, file: !1, line: 280, type: !10)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "from", scope: !54, file: !1, line: 280, type: !10)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !54, file: !1, line: 280, type: !10)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f_rank", scope: !54, file: !1, line: 280, type: !10)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t_rank", scope: !54, file: !1, line: 280, type: !10)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converter", scope: !54, file: !1, line: 280, type: !10)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f_file", scope: !54, file: !1, line: 281, type: !34)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t_file", scope: !54, file: !1, line: 281, type: !34)
!66 = !DISubprogram(name: "display_board", scope: !1, file: !1, line: 331, type: !67, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32)* @display_board, variables: !129)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !10}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 153, baseType: !72)
!71 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !71, line: 122, size: 1216, align: 64, elements: !73)
!73 = !{!74, !77, !78, !79, !81, !82, !87, !88, !89, !93, !97, !107, !113, !114, !117, !118, !122, !126, !127, !128}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !72, file: !71, line: 123, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !72, file: !71, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !72, file: !71, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !71, line: 126, baseType: !80, size: 16, align: 16, offset: 128)
!80 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !72, file: !71, line: 127, baseType: !80, size: 16, align: 16, offset: 144)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !72, file: !71, line: 128, baseType: !83, size: 128, align: 64, offset: 192)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !71, line: 88, size: 128, align: 64, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !83, file: !71, line: 89, baseType: !75, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !83, file: !71, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !72, file: !71, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !72, file: !71, line: 132, baseType: !13, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !72, file: !71, line: 133, baseType: !90, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!10, !13}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !72, file: !71, line: 134, baseType: !94, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!10, !13, !33, !10}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !72, file: !71, line: 135, baseType: !98, size: 64, align: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !13, !101, !10}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !71, line: 77, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !103, line: 71, baseType: !104)
!103 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !72, file: !71, line: 136, baseType: !108, size: 64, align: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!10, !13, !111, !10}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !72, file: !71, line: 139, baseType: !83, size: 128, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !72, file: !71, line: 140, baseType: !115, size: 64, align: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !71, line: 94, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !72, file: !71, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !72, file: !71, line: 144, baseType: !119, size: 24, align: 8, offset: 928)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !72, file: !71, line: 145, baseType: !123, size: 8, align: 8, offset: 952)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 1)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !72, file: !71, line: 148, baseType: !83, size: 128, align: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !72, file: !71, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !71, line: 152, baseType: !101, size: 64, align: 64, offset: 1152)
!129 = !{!130, !131, !132, !133, !137, !138, !139}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 1, scope: !66, file: !1, line: 331, type: !69)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "color", arg: 2, scope: !66, file: !1, line: 331, type: !10)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_sep", scope: !66, file: !1, line: 335, type: !111)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "piece_rep", scope: !66, file: !1, line: 336, type: !134)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 896, align: 64, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 14)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !66, file: !1, line: 338, type: !10)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !66, file: !1, line: 338, type: !10)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !66, file: !1, line: 338, type: !10)
!140 = !DISubprogram(name: "init_game", scope: !1, file: !1, line: 370, type: !141, isLocal: false, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @init_game, variables: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{null}
!143 = !{!144}
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "init_board", scope: !140, file: !1, line: 374, type: !145)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4608, align: 32, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 144)
!148 = !DISubprogram(name: "is_move", scope: !1, file: !1, line: 423, type: !149, isLocal: false, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @is_move, variables: !152)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !33}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "xbool", file: !4, line: 14, baseType: !3)
!152 = !{!153}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !148, file: !1, line: 423, type: !33)
!154 = !DISubprogram(name: "perft_debug", scope: !1, file: !1, line: 443, type: !141, isLocal: false, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @perft_debug, variables: !155)
!155 = !{!156, !160, !161, !162}
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !154, file: !1, line: 448, type: !157)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, align: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 256)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !154, file: !1, line: 448, type: !33)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "move", scope: !154, file: !1, line: 449, type: !24)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !154, file: !1, line: 450, type: !10)
!163 = !DISubprogram(name: "hash_extract_pv", scope: !1, file: !1, line: 497, type: !164, isLocal: false, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @hash_extract_pv, variables: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !10, !33}
!166 = !{!167, !168, !169, !170, !171, !172, !173}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 1, scope: !163, file: !1, line: 497, type: !10)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 2, scope: !163, file: !1, line: 497, type: !33)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdummy", scope: !163, file: !1, line: 499, type: !10)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bm", scope: !163, file: !1, line: 499, type: !10)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moves", scope: !163, file: !1, line: 500, type: !39)
