; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/bcyl.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::BCyl_Struct" = type { i32, i16, i16, double*, double*, %"struct.pov::BCyl_Intersection_Struct"*, %"struct.pov::BCyl_Intersection_Struct"*, %"struct.pov::BCyl_Intersection_Struct"*, %"struct.pov::BCyl_Entry_Struct"* }
%"struct.pov::BCyl_Intersection_Struct" = type { i32, [2 x double], [2 x double] }
%"struct.pov::BCyl_Entry_Struct" = type { i16, i16, i16, i16 }

@.str = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/bcyl.cpp\00", align 1
@.str1 = private unnamed_addr constant [18 x i8] c"bounding cylinder\00", align 1
@.str2 = private unnamed_addr constant [23 x i8] c"bounding cylinder data\00", align 1
@.str3 = private unnamed_addr constant [24 x i8] c"lathe intersection list\00", align 1
@.str4 = private unnamed_addr constant [16 x i8] c"temp lathe data\00", align 1

; Function Attrs: optsize ssp uwtable
define i32 @_ZN3pov14Intersect_BCylEPNS_11BCyl_StructEPdS2_(%"struct.pov::BCyl_Struct"* nocapture readonly %BCyl, double* nocapture readonly %P, double* nocapture readonly %D) #0 {
  %cnt = alloca i32, align 4
  %dist = alloca [8 x double], align 16
  %Inter = alloca %"struct.pov::BCyl_Intersection_Struct", align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !12, subprograms: !66, globals: !150, imports: !151)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/bcyl.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 692, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "X", value: 0)
!9 = !DIEnumerator(name: "Y", value: 1)
!10 = !DIEnumerator(name: "Z", value: 2)
!11 = !DIEnumerator(name: "T", value: 3)
!12 = !{!13, !19, !24, !29, !48, !56, !62, !46, !41, !64, !37, !65}
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 82, size: 64, align: 32, elements: !15, identifier: "_ZTS5div_t")
!14 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !14, line: 83, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !14, line: 84, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 87, size: 128, align: 64, elements: !20, identifier: "_ZTS6ldiv_t")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !14, line: 88, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !14, line: 89, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 93, size: 128, align: 64, elements: !25, identifier: "_ZTS7lldiv_t")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !14, line: 94, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !14, line: 95, baseType: !27, size: 64, align: 64, offset: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Struct", scope: !5, file: !30, line: 67, size: 448, align: 64, elements: !31, identifier: "_ZTSN3pov11BCyl_StructE")
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/bcyl.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !{!32, !33, !35, !36, !39, !40, !43, !44, !45}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 69, baseType: !17, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nradius", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 70, baseType: !34, size: 16, align: 16, offset: 32)
!34 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nheight", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 71, baseType: !34, size: 16, align: 16, offset: 48)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 72, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 73, baseType: !37, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rint", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 74, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL_INT", scope: !5, file: !30, line: 52, baseType: !"_ZTSN3pov24BCyl_Intersection_StructE")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 75, baseType: !41, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "intervals", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 76, baseType: !41, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !"_ZTSN3pov11BCyl_StructE", file: !30, line: 77, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL_ENTRY", scope: !5, file: !30, line: 51, baseType: !"_ZTSN3pov17BCyl_Entry_StructE")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Intersection_Struct", scope: !5, file: !30, line: 54, size: 320, align: 64, elements: !49, identifier: "_ZTSN3pov24BCyl_Intersection_StructE")
!49 = !{!50, !51, !55}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !"_ZTSN3pov24BCyl_Intersection_StructE", file: !30, line: 56, baseType: !17, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !"_ZTSN3pov24BCyl_Intersection_StructE", file: !30, line: 57, baseType: !52, size: 128, align: 64, offset: 64)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, align: 64, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !"_ZTSN3pov24BCyl_Intersection_StructE", file: !30, line: 58, baseType: !52, size: 128, align: 64, offset: 192)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Entry_Struct", scope: !5, file: !30, line: 61, size: 64, align: 16, elements: !57, identifier: "_ZTSN3pov17BCyl_Entry_StructE")
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !"_ZTSN3pov17BCyl_Entry_StructE", file: !30, line: 63, baseType: !34, size: 16, align: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !"_ZTSN3pov17BCyl_Entry_StructE", file: !30, line: 63, baseType: !34, size: 16, align: 16, offset: 16)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !"_ZTSN3pov17BCyl_Entry_StructE", file: !30, line: 64, baseType: !34, size: 16, align: 16, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !"_ZTSN3pov17BCyl_Entry_StructE", file: !30, line: 64, baseType: !34, size: 16, align: 16, offset: 48)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL", scope: !5, file: !30, line: 50, baseType: !"_ZTSN3pov11BCyl_StructE")
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !{!67, !83, !103, !108, !123, !136, !144}
!67 = !DISubprogram(name: "Intersect_BCyl", linkageName: "_ZN3pov14Intersect_BCylEPNS_11BCyl_StructEPdS2_", scope: !5, file: !1, line: 389, type: !68, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%"struct.pov::BCyl_Struct"*, double*, double*)* @_ZN3pov14Intersect_BCylEPNS_11BCyl_StructEPdS2_, variables: !70)
!68 = !DISubroutineType(types: !69)
!69 = !{!17, !62, !37, !37}
!70 = !{!71, !72, !73, !74, !75, !76, !80, !81, !82}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "BCyl", arg: 1, scope: !67, file: !1, line: 389, type: !62)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "P", arg: 2, scope: !67, file: !1, line: 389, type: !37)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "D", arg: 3, scope: !67, file: !1, line: 389, type: !37)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !67, file: !1, line: 391, type: !17)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnt", scope: !67, file: !1, line: 391, type: !17)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dist", scope: !67, file: !1, line: 392, type: !77)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, align: 64, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 8)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Inter", scope: !67, file: !1, line: 393, type: !42)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intervals", scope: !67, file: !1, line: 394, type: !41)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Entry", scope: !67, file: !1, line: 395, type: !46)
!83 = !DISubprogram(name: "Create_BCyl", linkageName: "_ZN3pov11Create_BCylEiPdS0_S0_S0_", scope: !5, file: !1, line: 538, type: !84, isLocal: false, isDefinition: true, scopeLine: 539, flags: DIFlagPrototyped, isOptimized: true, function: %"struct.pov::BCyl_Struct"* (i32, double*, double*, double*, double*)* @_ZN3pov11Create_BCylEiPdS0_S0_S0_, variables: !86)
!84 = !DISubroutineType(types: !85)
!85 = !{!62, !17, !37, !37, !37, !37}
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 1, scope: !83, file: !1, line: 538, type: !17)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_r1", arg: 2, scope: !83, file: !1, line: 538, type: !37)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_r2", arg: 3, scope: !83, file: !1, line: 538, type: !37)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_h1", arg: 4, scope: !83, file: !1, line: 538, type: !37)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_h2", arg: 5, scope: !83, file: !1, line: 538, type: !37)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !83, file: !1, line: 540, type: !17)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !83, file: !1, line: 540, type: !17)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !83, file: !1, line: 540, type: !17)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nh", scope: !83, file: !1, line: 540, type: !17)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_r1_index", scope: !83, file: !1, line: 541, type: !64)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_r2_index", scope: !83, file: !1, line: 542, type: !64)
