; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/colutils.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"struct.pov::Frame_Struct" = type { %"struct.pov::Camera_Struct"*, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Object_Struct"*, double, double, double, [5 x float], [5 x float], [5 x float], %"struct.pov::Media_Struct"*, %"struct.pov::Fog_Struct"*, %"struct.pov::Rainbow_Struct"*, %"struct.pov::Skysphere_Struct"*, %"struct.pov::light_group_light_struct"* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !13, subprograms: !97, globals: !156, imports: !157)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/colutils.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 701, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "pRED", value: 0)
!9 = !DIEnumerator(name: "pGREEN", value: 1)
!10 = !DIEnumerator(name: "pBLUE", value: 2)
!11 = !DIEnumerator(name: "pFILTER", value: 3)
!12 = !DIEnumerator(name: "pTRANSM", value: 4)
!13 = !{!14, !20, !25, !30, !85, !89, !90, !35, !18}
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 82, size: 64, align: 32, elements: !16, identifier: "_ZTS5div_t")
!15 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !15, line: 83, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !15, line: 84, baseType: !18, size: 32, align: 32, offset: 32)
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 87, size: 128, align: 64, elements: !21, identifier: "_ZTS6ldiv_t")
!21 = !{!22, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !15, line: 88, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !15, line: 89, baseType: !23, size: 64, align: 64, offset: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 93, size: 128, align: 64, elements: !26, identifier: "_ZTS7lldiv_t")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !15, line: 94, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !15, line: 95, baseType: !28, size: 64, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !31, line: 122, size: 1216, align: 64, elements: !32, identifier: "_ZTS7__sFILE")
!31 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!32 = !{!33, !36, !37, !38, !40, !41, !42, !43, !45, !49, !55, !64, !70, !71, !73, !74, !78, !82, !83, !84}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !31, line: 123, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !31, line: 124, baseType: !18, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !31, line: 125, baseType: !18, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !31, line: 126, baseType: !39, size: 16, align: 16, offset: 128)
!39 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !31, line: 127, baseType: !39, size: 16, align: 16, offset: 144)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !31, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !31, line: 129, baseType: !18, size: 32, align: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !31, line: 132, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !31, line: 133, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!18, !44}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !31, line: 134, baseType: !50, size: 64, align: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!18, !44, !53, !18}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !31, line: 135, baseType: !56, size: 64, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !44, !59, !18}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !31, line: 77, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !61, line: 71, baseType: !62)
!61 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !63, line: 46, baseType: !28)
!63 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !31, line: 136, baseType: !65, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!18, !44, !68, !18}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !31, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !31, line: 140, baseType: !72, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !31, line: 141, baseType: !18, size: 32, align: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !31, line: 144, baseType: !75, size: 24, align: 8, offset: 928)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 24, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !31, line: 145, baseType: !79, size: 8, align: 8, offset: 952)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !31, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !31, line: 151, baseType: !18, size: 32, align: 32, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !31, line: 152, baseType: !59, size: 64, align: 64, offset: 1152)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !31, line: 88, size: 128, align: 64, elements: !86, identifier: "_ZTS6__sbuf")
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !31, line: 89, baseType: !34, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !31, line: 90, baseType: !18, size: 32, align: 32, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !31, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !91, identifier: "_ZTS13__va_list_tag")
!91 = !{!92, !94, !95, !96}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !93, size: 32, align: 32)
!93 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !93, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !44, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !44, size: 64, align: 64, offset: 128)
!97 = !{!98, !105, !122, !134, !142, !149}
!98 = !DISubprogram(name: "gamma_correct", linkageName: "_ZN3pov13gamma_correctEPf", scope: !5, file: !1, line: 115, type: !99, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: void (float*)* @_ZN3pov13gamma_correctEPf, variables: !103)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!103 = !{!104}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Colour", arg: 1, scope: !98, file: !1, line: 115, type: !101)
!105 = !DISubprogram(name: "extract_colors", linkageName: "_ZN3pov14extract_colorsEPfPhS1_S1_S1_Pd", scope: !5, file: !1, line: 158, type: !106, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, i8*, i8*, i8*, i8*, double*)* @_ZN3pov14extract_colorsEPfPhS1_S1_S1_Pd, variables: !110)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !101, !34, !34, !34, !34, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!110 = !{!111, !112, !113, !114, !115, !116, !117}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Colour", arg: 1, scope: !105, file: !1, line: 158, type: !101)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Red", arg: 2, scope: !105, file: !1, line: 158, type: !34)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Green", arg: 3, scope: !105, file: !1, line: 158, type: !34)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Blue", arg: 4, scope: !105, file: !1, line: 158, type: !34)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Alpha", arg: 5, scope: !105, file: !1, line: 158, type: !34)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grey", arg: 6, scope: !105, file: !1, line: 158, type: !108)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ColourG", scope: !105, file: !1, line: 160, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 160, align: 32, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 5)
!122 = !DISubprogram(name: "extract_colors_nocorrect", linkageName: "_ZN3pov24extract_colors_nocorrectEPfPhS1_S1_S1_Pd", scope: !5, file: !1, line: 211, type: !106, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: void (float*, i8*, i8*, i8*, i8*, double*)* @_ZN3pov24extract_colors_nocorrectEPfPhS1_S1_S1_Pd, variables: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Colour", arg: 1, scope: !122, file: !1, line: 211, type: !101)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Red", arg: 2, scope: !122, file: !1, line: 211, type: !34)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Green", arg: 3, scope: !122, file: !1, line: 211, type: !34)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Blue", arg: 4, scope: !122, file: !1, line: 211, type: !34)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Alpha", arg: 5, scope: !122, file: !1, line: 211, type: !34)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grey", arg: 6, scope: !122, file: !1, line: 211, type: !108)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RedU", scope: !122, file: !1, line: 213, type: !18)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GreenU", scope: !122, file: !1, line: 213, type: !18)
