; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/defaultrenderfrontend.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov_frontend::DefaultRenderFrontend" = type { %"class.pov_frontend::RenderFrontend.base", [4 x i8] }
%"class.pov_frontend::RenderFrontend.base" = type <{ %"class.pov_frontend::MessageOutput", i8*, i8*, i32 }>
%"class.pov_frontend::MessageOutput" = type { %class.POVMS_MessageReceiver, [8 x %"class.pov_base::TextStreamBuffer"*], [8 x i8*], [8 x i8], i32, i8*, [80 x i8] }
%class.POVMS_MessageReceiver = type { i32 (...)**, i8*, %"struct.POVMS_MessageReceiver::HandlerNode"* }
%"struct.POVMS_MessageReceiver::HandlerNode" = type { %"struct.POVMS_MessageReceiver::HandlerNode"*, %"struct.POVMS_MessageReceiver::HandlerNode"*, i32, i32, %"class.POVMS_MessageReceiver::HandlerOO"*, %"class.POVMS_MessageReceiver::Handler"* }
%"class.POVMS_MessageReceiver::HandlerOO" = type { i32 (...)** }
%"class.POVMS_MessageReceiver::Handler" = type { i32 (...)** }
%"class.pov_base::TextStreamBuffer" = type { i32 (...)**, i8*, i32, i32, i32, i32 }
%"class.pov_frontend::RenderFrontend" = type <{ %"class.pov_frontend::MessageOutput", i8*, i8*, i32, [4 x i8] }>
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%"class.pov_base::OStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !50, subprograms: !797, globals: !929, imports: !930)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/defaultrenderfrontend.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11, !23}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EngineState", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 44, size: 32, align: 32, elements: !5, identifier: "_ZTSN12pov_frontend14RenderFrontend11EngineStateE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/renderfrontend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "kUnknown", value: 0)
!7 = !DIEnumerator(name: "kReady", value: 1)
!8 = !DIEnumerator(name: "kStartRequested", value: 2)
!9 = !DIEnumerator(name: "kRendering", value: 3)
!10 = !DIEnumerator(name: "kStopRequested", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 51, size: 32, align: 32, elements: !13, identifier: "_ZTSN12pov_frontend13MessageOutputUt_E")
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/messageoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22}
!14 = !DIEnumerator(name: "BANNER_STREAM", value: 0)
!15 = !DIEnumerator(name: "STATUS_STREAM", value: 1)
!16 = !DIEnumerator(name: "DEBUG_STREAM", value: 2)
!17 = !DIEnumerator(name: "FATAL_STREAM", value: 3)
!18 = !DIEnumerator(name: "RENDER_STREAM", value: 4)
!19 = !DIEnumerator(name: "STATISTIC_STREAM", value: 5)
!20 = !DIEnumerator(name: "WARNING_STREAM", value: 6)
!21 = !DIEnumerator(name: "ALL_STREAM", value: 7)
!22 = !DIEnumerator(name: "MAX_STREAMS", value: 8)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !25, file: !24, line: 51, size: 32, align: 32, elements: !27)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DINamespace(name: "pov_base", scope: null, file: !26, line: 41)
!26 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_err.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!28 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!29 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!30 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!31 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!32 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!33 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!34 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!35 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!36 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!37 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!38 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!39 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!40 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!41 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!42 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!43 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!44 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!45 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!46 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!47 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!48 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!49 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!50 = !{!51, !57, !62, !67, !75, !129, !133, !134, !161, !223, !231, !238, !274, !293, !298, !304, !310, !408, !452, !494, !501, !516, !531, !555, !615, !3, !11, !660, !712, !764, !73, !782}
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 82, size: 64, align: 32, elements: !53, identifier: "_ZTS5div_t")
!52 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !52, line: 83, baseType: !55, size: 32, align: 32)
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !52, line: 84, baseType: !55, size: 32, align: 32, offset: 32)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 87, size: 128, align: 64, elements: !58, identifier: "_ZTS6ldiv_t")
!58 = !{!59, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !52, line: 88, baseType: !60, size: 64, align: 64)
!60 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !52, line: 89, baseType: !60, size: 64, align: 64, offset: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 93, size: 128, align: 64, elements: !63, identifier: "_ZTS7lldiv_t")
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !52, line: 94, baseType: !65, size: 64, align: 64)
!65 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !52, line: 95, baseType: !65, size: 64, align: 64, offset: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !68, identifier: "_ZTS13__va_list_tag")
!68 = !{!69, !71, !72, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !70, size: 32, align: 32)
!70 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !70, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !73, size: 64, align: 64, offset: 128)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !76, line: 122, size: 1216, align: 64, elements: !77, identifier: "_ZTS7__sFILE")
!76 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !81, !82, !83, !85, !86, !87, !88, !89, !93, !99, !108, !114, !115, !117, !118, !122, !126, !127, !128}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !76, line: 123, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !76, line: 124, baseType: !55, size: 32, align: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !76, line: 125, baseType: !55, size: 32, align: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !76, line: 126, baseType: !84, size: 16, align: 16, offset: 128)
!84 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !76, line: 127, baseType: !84, size: 16, align: 16, offset: 144)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !76, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !76, line: 129, baseType: !55, size: 32, align: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !76, line: 132, baseType: !73, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !76, line: 133, baseType: !90, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!55, !73}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !76, line: 134, baseType: !94, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!55, !73, !97, !55}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !76, line: 135, baseType: !100, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !73, !103, !55}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !76, line: 77, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 46, baseType: !65)
!107 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !76, line: 136, baseType: !109, size: 64, align: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!55, !73, !112, !55}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !76, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !76, line: 140, baseType: !116, size: 64, align: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !76, line: 141, baseType: !55, size: 32, align: 32, offset: 896)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !76, line: 144, baseType: !119, size: 24, align: 8, offset: 928)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 24, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !76, line: 145, baseType: !123, size: 8, align: 8, offset: 952)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 8, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 1)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !76, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !76, line: 151, baseType: !55, size: 32, align: 32, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !76, line: 152, baseType: !103, size: 64, align: 64, offset: 1152)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !76, line: 88, size: 128, align: 64, elements: !130, identifier: "_ZTS6__sbuf")
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !76, line: 89, baseType: !79, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !76, line: 90, baseType: !55, size: 32, align: 32, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !76, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "DefaultRenderFrontend", scope: !136, file: !135, line: 46, size: 2240, align: 64, elements: !137, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend21DefaultRenderFrontendE")
!135 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/defaultrenderfrontend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!136 = !DINamespace(name: "pov_frontend", scope: null, file: !12, line: 41)
!137 = !{!138, !139, !145, !148, !151, !152, !153, !156, !160}
!138 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", baseType: !"_ZTSN12pov_frontend14RenderFrontendE", flags: DIFlagPublic)
!139 = !DISubprogram(name: "DefaultRenderFrontend", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 49, type: !140, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !143, !73}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSContext", file: !144, line: 171, baseType: !73)
!144 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DISubprogram(name: "~DefaultRenderFrontend", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 50, type: !146, isLocal: false, isDefinition: false, scopeLine: 50, containingType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !142}
!148 = !DISubprogram(name: "BannerPrintf", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend12BannerPrintfEPKcz", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 52, type: !149, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !142, !112, null}
!151 = !DISubprogram(name: "BannerFlush", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend11BannerFlushEv", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 53, type: !146, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!152 = !DISubprogram(name: "PrintHelpScreens", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend16PrintHelpScreensEv", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 55, type: !146, isLocal: false, isDefinition: false, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubprogram(name: "PrintUsage", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend10PrintUsageEi", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 56, type: !154, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !142, !55}
!156 = !DISubprogram(name: "OpenStreams", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend11OpenStreamsEb", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 72, type: !157, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !142, !159}
!159 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!160 = !DISubprogram(name: "CloseStreams", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend12CloseStreamsEv", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !135, line: 73, type: !146, isLocal: false, isDefinition: false, scopeLine: 73, containingType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_MessageReceiver", file: !162, line: 226, size: 192, align: 64, elements: !163, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTS21POVMS_MessageReceiver")
!162 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmscpp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!163 = !{!164, !169, !170, !172, !176, !179, !187, !196, !197, !198, !201, !202, !207, !211, !214, !219, !220}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_MessageReceiver", scope: !162, file: !162, baseType: !165, size: 64, flags: DIFlagArtificial)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!55}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 415, baseType: !143, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "receivers", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 416, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", size: 64, align: 64)
!172 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 360, type: !173, isLocal: false, isDefinition: false, scopeLine: 360, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175, !143}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS21POVMS_MessageReceiver", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!176 = !DISubprogram(name: "~POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 361, type: !177, isLocal: false, isDefinition: false, scopeLine: 361, containingType: !"_ZTS21POVMS_MessageReceiver", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !175}
!179 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 373, type: !180, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !175, !70, !70, !182, !73}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !162, line: 305, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !186, !186, !55, !73}
!186 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS13POVMS_Message")
!187 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 378, type: !188, isLocal: false, isDefinition: false, scopeLine: 378, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !175, !70, !70, !190, !73}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !162, line: 334, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !194, !55, !73}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !144, line: 173, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!196 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 393, type: !180, isLocal: false, isDefinition: false, scopeLine: 393, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!197 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 398, type: !188, isLocal: false, isDefinition: false, scopeLine: 398, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!198 = !DISubprogram(name: "Remove", linkageName: "_ZN21POVMS_MessageReceiver6RemoveEjj", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 403, type: !199, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !175, !70, !70}
!201 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 418, type: !177, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: true)
!202 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 419, type: !203, isLocal: false, isDefinition: false, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !175, !205}
!205 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!207 = !DISubprogram(name: "operator=", linkageName: "_ZN21POVMS_MessageReceiveraSERKS_", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 420, type: !208, isLocal: false, isDefinition: false, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !175, !205}
!210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!211 = !DISubprogram(name: "ReceiveHandler", linkageName: "_ZN21POVMS_MessageReceiver14ReceiveHandlerEP9POVMSDataS1_iPv", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 422, type: !212, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!55, !194, !194, !55, !73}
!214 = !DISubprogram(name: "AddNodeFront", linkageName: "_ZN21POVMS_MessageReceiver12AddNodeFrontEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 424, type: !215, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !175, !70, !70, !217, !218}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64)
!219 = !DISubprogram(name: "AddNodeBack", linkageName: "_ZN21POVMS_MessageReceiver11AddNodeBackEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 425, type: !215, isLocal: false, isDefinition: false, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true)
!220 = !DISubprogram(name: "RemoveNode", linkageName: "_ZN21POVMS_MessageReceiver10RemoveNodeEPNS_11HandlerNodeE", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 426, type: !221, isLocal: false, isDefinition: false, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !175, !171}
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandlerNode", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 405, size: 320, align: 64, elements: !224, identifier: "_ZTSN21POVMS_MessageReceiver11HandlerNodeE")
!224 = !{!225, !226, !227, !228, !229, !230}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !162, line: 407, baseType: !171, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !162, line: 408, baseType: !171, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "hclass", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !162, line: 409, baseType: !70, size: 32, align: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !162, line: 410, baseType: !70, size: 32, align: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "handleroo", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !162, line: 411, baseType: !217, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !162, line: 412, baseType: !218, size: 64, align: 64, offset: 256)
!231 = !DICompositeType(tag: DW_TAG_class_type, name: "HandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 233, size: 64, align: 64, elements: !232, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver9HandlerOOE")
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$HandlerOO", scope: !162, file: !162, baseType: !165, size: 64, flags: DIFlagArtificial)
!234 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver9HandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", file: !162, line: 236, type: !235, isLocal: false, isDefinition: false, scopeLine: 236, containingType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !186, !186, !55}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!238 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Message", file: !162, line: 207, size: 192, align: 64, elements: !239, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS13POVMS_Message")
!239 = !{!240, !241, !245, !250, !253, !257, !260, !263, !266, !267, !270, !271}
!240 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS13POVMS_Message", baseType: !"_ZTS12POVMS_Object", flags: DIFlagPublic)
!241 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !162, line: 210, type: !242, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244, !70, !70, !70}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS13POVMS_Message", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!245 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !162, line: 211, type: !246, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !244, !248}
!248 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObject", file: !144, line: 173, baseType: !"_ZTS9POVMSData")
!250 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !162, line: 212, type: !251, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !244, !194}
!253 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !162, line: 213, type: !254, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !244, !256}
!256 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS12POVMS_Object")
!257 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !162, line: 214, type: !258, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !244, !186}
!260 = !DISubprogram(name: "operator=", linkageName: "_ZN13POVMS_MessageaSERS_", scope: !"_ZTS13POVMS_Message", file: !162, line: 216, type: !261, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{!186, !244, !186}
!263 = !DISubprogram(name: "GetClass", linkageName: "_ZN13POVMS_Message8GetClassEv", scope: !"_ZTS13POVMS_Message", file: !162, line: 218, type: !264, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{!70, !244}
!266 = !DISubprogram(name: "GetIdentifier", linkageName: "_ZN13POVMS_Message13GetIdentifierEv", scope: !"_ZTS13POVMS_Message", file: !162, line: 219, type: !264, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubprogram(name: "GetSourceAddress", linkageName: "_ZN13POVMS_Message16GetSourceAddressEv", scope: !"_ZTS13POVMS_Message", file: !162, line: 221, type: !268, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{!73, !244}
!270 = !DISubprogram(name: "GetDestinationAddress", linkageName: "_ZN13POVMS_Message21GetDestinationAddressEv", scope: !"_ZTS13POVMS_Message", file: !162, line: 222, type: !268, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubprogram(name: "SetDestinationAddress", linkageName: "_ZN13POVMS_Message21SetDestinationAddressEPv", scope: !"_ZTS13POVMS_Message", file: !162, line: 223, type: !272, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !244, !73}
!274 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Container", file: !162, line: 50, size: 192, align: 64, elements: !275, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Container")
!275 = !{!276, !277, !278, !282, !283, !286, !289, !292}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_Container", scope: !162, file: !162, baseType: !165, size: 64, flags: DIFlagArtificial)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS15POVMS_Container", file: !162, line: 64, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 64, flags: DIFlagProtected)
!278 = !DISubprogram(name: "POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !162, line: 57, type: !279, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Container", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!282 = !DISubprogram(name: "~POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !162, line: 58, type: !279, isLocal: false, isDefinition: false, scopeLine: 58, containingType: !"_ZTS15POVMS_Container", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!283 = !DISubprogram(name: "Type", linkageName: "_ZN15POVMS_Container4TypeEv", scope: !"_ZTS15POVMS_Container", file: !162, line: 60, type: !284, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!70, !281}
!286 = !DISubprogram(name: "Size", linkageName: "_ZN15POVMS_Container4SizeEv", scope: !"_ZTS15POVMS_Container", file: !162, line: 61, type: !287, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!60, !281}
!289 = !DISubprogram(name: "IsNull", linkageName: "_ZN15POVMS_Container6IsNullEv", scope: !"_ZTS15POVMS_Container", file: !162, line: 62, type: !290, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{!159, !281}
!292 = !DISubprogram(name: "DetachData", linkageName: "_ZN15POVMS_Container10DetachDataEv", scope: !"_ZTS15POVMS_Container", file: !162, line: 66, type: !279, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !144, line: 178, size: 128, align: 64, elements: !294, identifier: "_ZTS9POVMSData")
!294 = !{!295, !296, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !144, line: 180, baseType: !70, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !144, line: 181, baseType: !55, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !144, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !144, line: 182, size: 64, align: 64, elements: !299, identifier: "_ZTSN9POVMSDataUt_E")
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !144, line: 184, baseType: !73, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !144, line: 185, baseType: !195, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !144, line: 186, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !144, line: 190, size: 320, align: 64, elements: !305, identifier: "_ZTS9POVMSNode")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !144, line: 192, baseType: !303, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !144, line: 193, baseType: !303, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !144, line: 194, baseType: !70, size: 32, align: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !144, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!310 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Object", file: !162, line: 112, size: 192, align: 64, elements: !311, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS12POVMS_Object")
!311 = !{!312, !313, !317, !320, !323, !326, !329, !332, !336, !340, !343, !344, !345, !346, !347, !350, !351, !358, !362, !365, !368, !371, !374, !378, !379, !382, !385, !388, !389, !392, !395, !396, !399, !403, !406, !407}
!312 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS12POVMS_Object", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!313 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !162, line: 117, type: !314, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316, !70}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS12POVMS_Object", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!317 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !162, line: 118, type: !318, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !316, !248}
!320 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !162, line: 119, type: !321, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !316, !194}
!323 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !162, line: 120, type: !324, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !316, !256}
!326 = !DISubprogram(name: "~POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !162, line: 121, type: !327, isLocal: false, isDefinition: false, scopeLine: 121, containingType: !"_ZTS12POVMS_Object", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !316}
!329 = !DISubprogram(name: "operator=", linkageName: "_ZN12POVMS_ObjectaSERS_", scope: !"_ZTS12POVMS_Object", file: !162, line: 123, type: !330, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubroutineType(types: !331)
!331 = !{!256, !316, !256}
!332 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !162, line: 125, type: !333, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !316, !70, !335}
!335 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS15POVMS_Attribute")
!336 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !162, line: 126, type: !337, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !316, !70, !339}
!339 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS10POVMS_List")
!340 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjRS_", scope: !"_ZTS12POVMS_Object", file: !162, line: 127, type: !341, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !316, !70, !256}
!343 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !162, line: 128, type: !333, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !162, line: 129, type: !337, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!345 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjRS_", scope: !"_ZTS12POVMS_Object", file: !162, line: 130, type: !341, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubprogram(name: "Remove", linkageName: "_ZN12POVMS_Object6RemoveEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 131, type: !314, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubprogram(name: "Exist", linkageName: "_ZN12POVMS_Object5ExistEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 132, type: !348, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!159, !316, !70}
!350 = !DISubprogram(name: "Merge", linkageName: "_ZN12POVMS_Object5MergeERS_", scope: !"_ZTS12POVMS_Object", file: !162, line: 133, type: !324, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubprogram(name: "operator*", linkageName: "_ZNK12POVMS_ObjectdeEv", scope: !"_ZTS12POVMS_Object", file: !162, line: 135, type: !352, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !356}
!354 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS12POVMS_Object")
!358 = !DISubprogram(name: "operator->", linkageName: "_ZNK12POVMS_ObjectptEv", scope: !"_ZTS12POVMS_Object", file: !162, line: 136, type: !359, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !356}
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!362 = !DISubprogram(name: "operator()", linkageName: "_ZN12POVMS_ObjectclEv", scope: !"_ZTS12POVMS_Object", file: !162, line: 137, type: !363, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{!249, !316}
!365 = !DISubprogram(name: "SetString", linkageName: "_ZN12POVMS_Object9SetStringEjPKc", scope: !"_ZTS12POVMS_Object", file: !162, line: 139, type: !366, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !316, !70, !112}
!368 = !DISubprogram(name: "SetInt", linkageName: "_ZN12POVMS_Object6SetIntEji", scope: !"_ZTS12POVMS_Object", file: !162, line: 140, type: !369, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !316, !70, !55}
!371 = !DISubprogram(name: "SetLong", linkageName: "_ZN12POVMS_Object7SetLongEjx", scope: !"_ZTS12POVMS_Object", file: !162, line: 141, type: !372, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !316, !70, !65}
!374 = !DISubprogram(name: "SetFloat", linkageName: "_ZN12POVMS_Object8SetFloatEjf", scope: !"_ZTS12POVMS_Object", file: !162, line: 142, type: !375, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !316, !70, !377}
!377 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!378 = !DISubprogram(name: "SetBool", linkageName: "_ZN12POVMS_Object7SetBoolEji", scope: !"_ZTS12POVMS_Object", file: !162, line: 143, type: !369, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubprogram(name: "SetType", linkageName: "_ZN12POVMS_Object7SetTypeEjj", scope: !"_ZTS12POVMS_Object", file: !162, line: 144, type: !380, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !316, !70, !70}
!382 = !DISubprogram(name: "GetStringLength", linkageName: "_ZN12POVMS_Object15GetStringLengthEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 145, type: !383, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!383 = !DISubroutineType(types: !384)
!384 = !{!55, !316, !70}
!385 = !DISubprogram(name: "GetString", linkageName: "_ZN12POVMS_Object9GetStringEjPci", scope: !"_ZTS12POVMS_Object", file: !162, line: 146, type: !386, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{!55, !316, !70, !97, !55}
!388 = !DISubprogram(name: "GetInt", linkageName: "_ZN12POVMS_Object6GetIntEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 147, type: !383, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!389 = !DISubprogram(name: "GetLong", linkageName: "_ZN12POVMS_Object7GetLongEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 148, type: !390, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{!65, !316, !70}
!392 = !DISubprogram(name: "GetFloat", linkageName: "_ZN12POVMS_Object8GetFloatEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 149, type: !393, isLocal: false, isDefinition: false, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{!377, !316, !70}
!395 = !DISubprogram(name: "GetBool", linkageName: "_ZN12POVMS_Object7GetBoolEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 150, type: !383, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!396 = !DISubprogram(name: "GetType", linkageName: "_ZN12POVMS_Object7GetTypeEj", scope: !"_ZTS12POVMS_Object", file: !162, line: 151, type: !397, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubroutineType(types: !398)
!398 = !{!70, !316, !70}
!399 = !DISubprogram(name: "ReadHeader", linkageName: "_ZN12POVMS_Object10ReadHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !162, line: 201, type: !400, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true)
!400 = !DISubroutineType(types: !401)
!401 = !{!159, !316, !79, !402}
!402 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !55)
!403 = !DISubprogram(name: "ReadObject", linkageName: "_ZN12POVMS_Object10ReadObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !162, line: 202, type: !404, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{!159, !316, !79, !55}
!406 = !DISubprogram(name: "WriteHeader", linkageName: "_ZN12POVMS_Object11WriteHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !162, line: 203, type: !400, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true)
!407 = !DISubprogram(name: "WriteObject", linkageName: "_ZN12POVMS_Object11WriteObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !162, line: 204, type: !404, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true)
!408 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Attribute", file: !162, line: 69, size: 192, align: 64, elements: !409, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Attribute")
!409 = !{!410, !411, !415, !418, !421, !424, !427, !430, !433, !438, !441, !442, !445, !449}
!410 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS15POVMS_Attribute", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!411 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 72, type: !412, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Attribute", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!415 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 73, type: !416, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !414, !112}
!418 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 74, type: !419, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !414, !55}
!421 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 75, type: !422, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !414, !65}
!424 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 76, type: !425, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !414, !377}
!427 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 77, type: !428, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !414, !159}
!430 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 78, type: !431, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !414, !70}
!433 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 79, type: !434, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !414, !436}
!436 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttribute", file: !144, line: 174, baseType: !"_ZTS9POVMSData")
!438 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 80, type: !439, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !414, !335}
!441 = !DISubprogram(name: "~POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 81, type: !412, isLocal: false, isDefinition: false, scopeLine: 81, containingType: !"_ZTS15POVMS_Attribute", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!442 = !DISubprogram(name: "operator=", linkageName: "_ZN15POVMS_AttributeaSERS_", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 83, type: !443, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!335, !414, !335}
!445 = !DISubprogram(name: "Get", linkageName: "_ZN15POVMS_Attribute3GetEjPvPi", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 85, type: !446, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !414, !70, !73, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!449 = !DISubprogram(name: "Set", linkageName: "_ZN15POVMS_Attribute3SetEjPvi", scope: !"_ZTS15POVMS_Attribute", file: !162, line: 86, type: !450, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !414, !70, !73, !55}
!452 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_List", file: !162, line: 89, size: 192, align: 64, elements: !453, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS10POVMS_List")
!453 = !{!454, !455, !459, !464, !467, !468, !471, !474, !475, !478, !481, !484, !487, !488, !489, !490, !493}
!454 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS10POVMS_List", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!455 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !162, line: 92, type: !456, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS10POVMS_List", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!459 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !162, line: 93, type: !460, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !458, !462}
!462 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttributeList", file: !144, line: 175, baseType: !"_ZTS9POVMSData")
!464 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !162, line: 94, type: !465, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !458, !339}
!467 = !DISubprogram(name: "~POVMS_List", scope: !"_ZTS10POVMS_List", file: !162, line: 95, type: !456, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTS10POVMS_List", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!468 = !DISubprogram(name: "operator=", linkageName: "_ZN10POVMS_ListaSERS_", scope: !"_ZTS10POVMS_List", file: !162, line: 97, type: !469, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{!339, !458, !339}
!471 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !162, line: 99, type: !472, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !458, !335}
!474 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendERS_", scope: !"_ZTS10POVMS_List", file: !162, line: 100, type: !465, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !162, line: 101, type: !476, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !458, !256}
!478 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !162, line: 102, type: !479, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !458, !55, !335}
!481 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !162, line: 103, type: !482, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !458, !55, !339}
!484 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !162, line: 104, type: !485, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !458, !55, !256}
!487 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !162, line: 105, type: !479, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !162, line: 106, type: !482, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!489 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !162, line: 107, type: !485, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!490 = !DISubprogram(name: "RemoveNth", linkageName: "_ZN10POVMS_List9RemoveNthEi", scope: !"_ZTS10POVMS_List", file: !162, line: 108, type: !491, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !458, !55}
!493 = !DISubprogram(name: "Clear", linkageName: "_ZN10POVMS_List5ClearEv", scope: !"_ZTS10POVMS_List", file: !162, line: 109, type: !456, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DICompositeType(tag: DW_TAG_class_type, name: "Handler", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 238, size: 64, align: 64, elements: !495, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver7HandlerE")
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Handler", scope: !162, file: !162, baseType: !165, size: 64, flags: DIFlagArtificial)
!497 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver7Handler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver7HandlerE", file: !162, line: 241, type: !498, isLocal: false, isDefinition: false, scopeLine: 241, containingType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !500, !194, !194, !55}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!501 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 302, size: 192, align: 64, elements: !502, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE")
!502 = !{!503, !504, !505, !506, !510, !513}
!503 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", flags: DIFlagPublic)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !162, line: 327, baseType: !182, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !162, line: 328, baseType: !73, size: 64, align: 64, offset: 128)
!506 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !162, line: 307, type: !507, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!510 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !162, line: 313, type: !511, isLocal: false, isDefinition: false, scopeLine: 313, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !509, !182, !73}
!513 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver17FunctionHandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !162, line: 319, type: !514, isLocal: false, isDefinition: false, scopeLine: 319, containingType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !509, !186, !186, !55}
!516 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandler", scope: !"_ZTS21POVMS_MessageReceiver", file: !162, line: 331, size: 192, align: 64, elements: !517, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver15FunctionHandlerE")
!517 = !{!518, !519, !520, !521, !525, !528}
!518 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", flags: DIFlagPublic)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !162, line: 356, baseType: !190, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !162, line: 357, baseType: !73, size: 64, align: 64, offset: 128)
!521 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !162, line: 336, type: !522, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!525 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !162, line: 342, type: !526, isLocal: false, isDefinition: false, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !524, !190, !73}
!528 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver15FunctionHandler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !162, line: 348, type: !529, isLocal: false, isDefinition: false, scopeLine: 348, containingType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !524, !194, !194, !55}
!531 = !DICompositeType(tag: DW_TAG_class_type, name: "RenderFrontend", scope: !136, file: !4, line: 41, size: 2240, align: 64, elements: !532, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend14RenderFrontendE")
!532 = !{!533, !534, !535, !536, !537, !541, !544, !547, !548, !551, !554}
!533 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend14RenderFrontendE", baseType: !"_ZTSN12pov_frontend13MessageOutputE", flags: DIFlagPublic)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "backendaddress", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 64, baseType: !73, size: 64, align: 64, offset: 2048)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 65, baseType: !143, size: 64, align: 64, offset: 2112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 66, baseType: !"_ZTSN12pov_frontend14RenderFrontend11EngineStateE", size: 32, align: 32, offset: 2176)
!537 = !DISubprogram(name: "RenderFrontend", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 53, type: !538, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !540, !143, !73}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend14RenderFrontendE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!541 = !DISubprogram(name: "~RenderFrontend", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 54, type: !542, isLocal: false, isDefinition: false, scopeLine: 54, containingType: !"_ZTSN12pov_frontend14RenderFrontendE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !540}
!544 = !DISubprogram(name: "StartRender", linkageName: "_ZN12pov_frontend14RenderFrontend11StartRenderER12POVMS_Object", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 56, type: !545, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !540, !256}
!547 = !DISubprogram(name: "StopRender", linkageName: "_ZN12pov_frontend14RenderFrontend10StopRenderEv", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 57, type: !542, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubprogram(name: "GetState", linkageName: "_ZN12pov_frontend14RenderFrontend8GetStateEv", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 59, type: !549, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{!"_ZTSN12pov_frontend14RenderFrontend11EngineStateE", !540}
!551 = !DISubprogram(name: "RenderStarted", linkageName: "_ZN12pov_frontend14RenderFrontend13RenderStartedER13POVMS_MessageS2_i", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 61, type: !552, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !540, !186, !186, !55}
!554 = !DISubprogram(name: "RenderDone", linkageName: "_ZN12pov_frontend14RenderFrontend10RenderDoneER13POVMS_MessageS2_i", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 62, type: !552, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!555 = !DICompositeType(tag: DW_TAG_class_type, name: "MessageOutput", scope: !136, file: !12, line: 45, size: 2048, align: 64, elements: !556, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend13MessageOutputE")
!556 = !{!557, !558, !563, !565, !567, !569, !570, !574, !578, !581, !584, !585, !589, !592, !595, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612}
!557 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend13MessageOutputE", baseType: !"_ZTS21POVMS_MessageReceiver", flags: DIFlagPublic)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 64, baseType: !559, size: 512, align: 64, offset: 192, flags: DIFlagProtected)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 512, align: 64, elements: !561)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64)
!561 = !{!562}
!562 = !DISubrange(count: 8)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "streamnames", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 65, baseType: !564, size: 512, align: 64, offset: 704, flags: DIFlagProtected)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 512, align: 64, elements: !561)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "consoleoutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 66, baseType: !566, size: 64, align: 8, offset: 1216, flags: DIFlagProtected)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 64, align: 8, elements: !561)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "output_string_buffer_size", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 92, baseType: !568, size: 32, align: 32, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "output_string_buffer", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 93, baseType: !97, size: 64, align: 64, offset: 1344)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "status_string_buffer", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 94, baseType: !571, size: 640, align: 8, offset: 1408)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 640, align: 8, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 80)
!574 = !DISubprogram(name: "MessageOutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 48, type: !575, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !577, !143}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend13MessageOutputE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!578 = !DISubprogram(name: "~MessageOutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 49, type: !579, isLocal: false, isDefinition: false, scopeLine: 49, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !577}
!581 = !DISubprogram(name: "OpenStreams", linkageName: "_ZN12pov_frontend13MessageOutput11OpenStreamsEb", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 68, type: !582, isLocal: false, isDefinition: false, scopeLine: 68, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !577, !159}
!584 = !DISubprogram(name: "CloseStreams", linkageName: "_ZN12pov_frontend13MessageOutput12CloseStreamsEv", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 69, type: !579, isLocal: false, isDefinition: false, scopeLine: 69, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!585 = !DISubprogram(name: "Printfile", linkageName: "_ZN12pov_frontend13MessageOutput9PrintfileEiPKcmi", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 71, type: !586, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !577, !55, !112, !588, !55}
!588 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!589 = !DISubprogram(name: "Printf", linkageName: "_ZN12pov_frontend13MessageOutput6PrintfEiPKcz", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 72, type: !590, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !577, !55, !112, null}
!592 = !DISubprogram(name: "Flush", linkageName: "_ZN12pov_frontend13MessageOutput5FlushEi", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 73, type: !593, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !577, !55}
!595 = !DISubprogram(name: "InitInfo", linkageName: "_ZN12pov_frontend13MessageOutput8InitInfoEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 75, type: !596, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !577, !194, !194, !55}
!598 = !DISubprogram(name: "RenderOptions", linkageName: "_ZN12pov_frontend13MessageOutput13RenderOptionsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 76, type: !596, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "RenderStarted", linkageName: "_ZN12pov_frontend13MessageOutput13RenderStartedEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 77, type: !596, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!600 = !DISubprogram(name: "FrameStatistics", linkageName: "_ZN12pov_frontend13MessageOutput15FrameStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 78, type: !596, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "ParseStatistics", linkageName: "_ZN12pov_frontend13MessageOutput15ParseStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 79, type: !596, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!602 = !DISubprogram(name: "RenderStatistics", linkageName: "_ZN12pov_frontend13MessageOutput16RenderStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 80, type: !596, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "RenderDone", linkageName: "_ZN12pov_frontend13MessageOutput10RenderDoneEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 81, type: !596, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "Progress", linkageName: "_ZN12pov_frontend13MessageOutput8ProgressEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 82, type: !596, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "Warning", linkageName: "_ZN12pov_frontend13MessageOutput7WarningEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 83, type: !596, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!606 = !DISubprogram(name: "Error", linkageName: "_ZN12pov_frontend13MessageOutput5ErrorEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 84, type: !596, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!607 = !DISubprogram(name: "FatalError", linkageName: "_ZN12pov_frontend13MessageOutput10FatalErrorEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 85, type: !596, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!608 = !DISubprogram(name: "DebugInfo", linkageName: "_ZN12pov_frontend13MessageOutput9DebugInfoEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 86, type: !596, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!609 = !DISubprogram(name: "FileMessage", linkageName: "_ZN12pov_frontend13MessageOutput11FileMessageEiP9POVMSData", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 88, type: !610, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !577, !55, !194}
!612 = !DISubprogram(name: "GetOptionSwitchString", linkageName: "_ZN12pov_frontend13MessageOutput21GetOptionSwitchStringEP9POVMSDatajb", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !12, line: 90, type: !613, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!613 = !DISubroutineType(types: !614)
!614 = !{!112, !577, !194, !70, !159}
!615 = !DICompositeType(tag: DW_TAG_class_type, name: "TextStreamBuffer", scope: !25, file: !616, line: 51, size: 256, align: 64, elements: !617, vtableHolder: !"_ZTSN8pov_base16TextStreamBufferE", identifier: "_ZTSN8pov_base16TextStreamBufferE")
!616 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!617 = !{!618, !619, !620, !621, !622, !623, !624, !631, !634, !637, !640, !641, !644, !647, !652, !653, !656, !657, !658, !659}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$TextStreamBuffer", scope: !616, file: !616, baseType: !165, size: 64, flags: DIFlagArtificial)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 69, baseType: !97, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "boffset", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 70, baseType: !70, size: 32, align: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 71, baseType: !70, size: 32, align: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 72, baseType: !70, size: 32, align: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "curline", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 73, baseType: !70, size: 32, align: 32, offset: 224)
!624 = !DISubprogram(name: "TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 54, type: !625, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !627, !628, !70}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !629, line: 30, baseType: !630)
!629 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !107, line: 92, baseType: !588)
!631 = !DISubprogram(name: "~TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 55, type: !632, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !627}
!634 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base16TextStreamBuffer6printfEPKcz", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 57, type: !635, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !627, !112, null}
!637 = !DISubprogram(name: "print", linkageName: "_ZN8pov_base16TextStreamBuffer5printEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 58, type: !638, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !627, !112}
!640 = !DISubprogram(name: "puts", linkageName: "_ZN8pov_base16TextStreamBuffer4putsEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 59, type: !638, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!641 = !DISubprogram(name: "putc", linkageName: "_ZN8pov_base16TextStreamBuffer4putcEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 60, type: !642, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !627, !55}
!644 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEPKcmi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 61, type: !645, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !627, !112, !588, !55}
!647 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEP7__sFILEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 62, type: !648, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !627, !650, !55}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 153, baseType: !"_ZTS7__sFILE")
!652 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base16TextStreamBuffer5flushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 63, type: !632, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!653 = !DISubprogram(name: "lineoutput", linkageName: "_ZN8pov_base16TextStreamBuffer10lineoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 65, type: !654, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !627, !112, !70}
!656 = !DISubprogram(name: "directoutput", linkageName: "_ZN8pov_base16TextStreamBuffer12directoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 66, type: !654, isLocal: false, isDefinition: false, scopeLine: 66, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!657 = !DISubprogram(name: "rawoutput", linkageName: "_ZN8pov_base16TextStreamBuffer9rawoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 67, type: !654, isLocal: false, isDefinition: false, scopeLine: 67, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!658 = !DISubprogram(name: "lineflush", linkageName: "_ZN8pov_base16TextStreamBuffer9lineflushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 75, type: !632, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true)
!659 = !DISubprogram(name: "directflush", linkageName: "_ZN8pov_base16TextStreamBuffer11directflushEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !616, line: 76, type: !654, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true)
!660 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !25, file: !24, line: 150, size: 320, align: 64, elements: !661, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!661 = !{!662, !663, !667, !670, !673, !677, !681, !684, !687, !690, !693, !696, !699, !700, !703, !704, !707, !708, !711}
!662 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!663 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 153, type: !664, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !666, !568}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!667 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 154, type: !668, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !666}
!670 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 156, type: !671, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !666, !112, null}
!673 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 158, type: !674, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{!676, !666, !80}
!676 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!677 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 159, type: !678, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubroutineType(types: !679)
!679 = !{!676, !666, !680}
!680 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!681 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 160, type: !682, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!676, !666, !70}
!684 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 161, type: !685, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{!676, !666, !588}
!687 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 162, type: !688, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubroutineType(types: !689)
!689 = !{!676, !666}
!690 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 164, type: !691, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!691 = !DISubroutineType(types: !692)
!692 = !{!676, !666, !112}
!693 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 165, type: !694, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!694 = !DISubroutineType(types: !695)
!695 = !{!676, !666, !79}
!696 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 166, type: !697, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubroutineType(types: !698)
!698 = !{!676, !666, !98}
!699 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 167, type: !674, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 168, type: !701, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!701 = !DISubroutineType(types: !702)
!702 = !{!676, !666, !84}
!703 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 169, type: !678, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 170, type: !705, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubroutineType(types: !706)
!706 = !{!676, !666, !55}
!707 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 171, type: !682, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 172, type: !709, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!676, !666, !60}
!711 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !24, line: 173, type: !685, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !25, file: !24, line: 84, size: 320, align: 64, elements: !713, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!713 = !{!714, !715, !716, !717, !718, !719, !720, !724, !727, !730, !733, !737, !738, !741, !744, !745, !746, !749, !752, !755, !760, !763}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !24, file: !24, baseType: !165, size: 64, flags: DIFlagArtificial)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 110, baseType: !159, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 111, baseType: !650, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 113, baseType: !70, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 114, baseType: !70, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 115, baseType: !97, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!720 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 87, type: !721, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !723, !70, !70}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!724 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 88, type: !725, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !723}
!727 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 94, type: !728, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!728 = !DISubroutineType(types: !729)
!729 = !{!159, !723, !112, !70}
!730 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 95, type: !731, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!731 = !DISubroutineType(types: !732)
!732 = !{!159, !723}
!733 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 96, type: !734, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{!736, !723, !73, !588}
!736 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!737 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 97, type: !734, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!738 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 98, type: !739, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!739 = !DISubroutineType(types: !740)
!740 = !{!736, !723, !588, !70}
!741 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 100, type: !742, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!742 = !DISubroutineType(types: !743)
!743 = !{!70, !723}
!744 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 101, type: !742, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!745 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 102, type: !731, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!746 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 103, type: !747, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!747 = !DISubroutineType(types: !748)
!748 = !{!588, !723}
!749 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 104, type: !750, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!750 = !DISubroutineType(types: !751)
!751 = !{!736, !723}
!752 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 105, type: !753, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!753 = !DISubroutineType(types: !754)
!754 = !{!112, !723}
!755 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 107, type: !756, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!756 = !DISubroutineType(types: !757)
!757 = !{!73, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!760 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !24, line: 108, type: !761, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!761 = !DISubroutineType(types: !762)
