; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/discs.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!63 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!64 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!65 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!66 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!67 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!68 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!69 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!70 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!71 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!72 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!73 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!74 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!75 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!76 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!77 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!78 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!79 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!80 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!81 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!82 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!83 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!84 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!85 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!86 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!87 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!88 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!89 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!90 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!91 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!92 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!93 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!94 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!95 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!96 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!97 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!98 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!99 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!100 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!101 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!102 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!103 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!104 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!105 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!106 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!107 = !DIEnumerator(name: "Media_Samples", value: 99)
!108 = !DIEnumerator(name: "Media_Intervals", value: 100)
!109 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!110 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!111 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!112 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!113 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!114 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!115 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!116 = !DIEnumerator(name: "nChecked", value: 108)
!117 = !DIEnumerator(name: "nEnqueued", value: 109)
!118 = !DIEnumerator(name: "totalQueues", value: 110)
!119 = !DIEnumerator(name: "totalQueueResets", value: 111)
!120 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!121 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!122 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!123 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!124 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!125 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 692, size: 32, align: 32, elements: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !{!138, !139, !140, !141}
!138 = !DIEnumerator(name: "X", value: 0)
!139 = !DIEnumerator(name: "Y", value: 1)
!140 = !DIEnumerator(name: "Z", value: 2)
!141 = !DIEnumerator(name: "T", value: 3)
!142 = !{!143, !149, !154, !159, !201, !254, !270, !302, !307, !320, !331, !337, !352, !366, !388, !394, !404, !412, !435, !442, !454, !460, !466, !470, !474, !479, !490, !500, !509, !513, !528, !546, !550, !554, !559, !569, !579, !588, !592, !610, !614, !618, !623, !633, !643, !652, !656, !674, !678, !682, !687, !697, !707, !716, !720, !747, !762, !790, !845, !852, !860, !871, !878, !884, !894, !902, !923, !3, !232, !850}
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 82, size: 64, align: 32, elements: !145, identifier: "_ZTS5div_t")
!144 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !144, line: 83, baseType: !147, size: 32, align: 32)
!147 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !144, line: 84, baseType: !147, size: 32, align: 32, offset: 32)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 87, size: 128, align: 64, elements: !150, identifier: "_ZTS6ldiv_t")
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !144, line: 88, baseType: !152, size: 64, align: 64)
!152 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !144, line: 89, baseType: !152, size: 64, align: 64, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 93, size: 128, align: 64, elements: !155, identifier: "_ZTS7lldiv_t")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !144, line: 94, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !144, line: 95, baseType: !157, size: 64, align: 64, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Disc_Struct", scope: !5, file: !160, line: 52, size: 1536, align: 64, elements: !161, identifier: "_ZTSN3pov11Disc_StructE")
!160 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/discs.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !{!162, !165, !166, !169, !172, !173, !176, !177, !178, !181, !183, !186, !187, !189, !191, !197, !198, !199, !200}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !136, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !147, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !136, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !136, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !170, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !136, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !167, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !167, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !179, size: 64, align: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !136, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !182, size: 192, align: 32, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !136, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !184, size: 64, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !136, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !184, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !188, size: 32, align: 32, offset: 896)
!188 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 54, baseType: !190, size: 32, align: 32, offset: 928)
!190 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 55, baseType: !192, size: 192, align: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !136, line: 677, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 192, align: 64, elements: !195)
!194 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!195 = !{!196}
!196 = !DISubrange(count: 3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 56, baseType: !192, size: 192, align: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 57, baseType: !194, size: 64, align: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "iradius2", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 58, baseType: !194, size: 64, align: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "oradius2", scope: !"_ZTSN3pov11Disc_StructE", file: !160, line: 59, baseType: !194, size: 64, align: 64, offset: 1472)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !136, line: 1503, size: 704, align: 64, elements: !202, identifier: "_ZTSN3pov13Method_StructE")
!202 = !{!203, !212, !218, !225, !227, !233, !238, !240, !242, !247, !252}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1505, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !136, line: 1420, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!147, !167, !208, !210}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !136, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !136, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1506, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !136, line: 1421, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!147, !217, !167}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1507, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !136, line: 1422, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !217, !167, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !136, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1508, baseType: !226, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !136, line: 1423, baseType: !220)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1509, baseType: !228, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !136, line: 1424, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !167}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1510, baseType: !234, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !136, line: 1425, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !167, !217, !184}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1511, baseType: !239, size: 64, align: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !136, line: 1426, baseType: !235)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1512, baseType: !241, size: 64, align: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !136, line: 1427, baseType: !235)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1513, baseType: !243, size: 64, align: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !136, line: 1428, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !167, !184}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1514, baseType: !248, size: 64, align: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !136, line: 1429, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !167}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1515, baseType: !253, size: 64, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !136, line: 1430, baseType: !249)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !136, line: 1521, size: 960, align: 64, elements: !255, identifier: "_ZTSN3pov13Object_StructE")
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !163, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !147, size: 32, align: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !167, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !170, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !170, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !174, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !167, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !167, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !179, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !182, size: 192, align: 32, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !184, size: 64, align: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !184, size: 64, align: 64, offset: 832)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !188, size: 32, align: 32, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !190, size: 32, align: 32, offset: 928)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !136, line: 1345, size: 1664, align: 64, elements: !271, identifier: "_ZTSN3pov14Texture_StructE")
!271 = !{!272, !274, !275, !276, !277, !278, !279, !280, !283, !286, !289, !290, !291, !294, !297, !300, !301}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !273, size: 16, align: 16)
!273 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !273, size: 16, align: 16, offset: 16)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !273, size: 16, align: 16, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !147, size: 32, align: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !281, size: 64, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !136, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !284, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !136, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !287, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !136, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !170, size: 64, align: 64, offset: 1280)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1348, baseType: !292, size: 64, align: 64, offset: 1344)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !136, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1349, baseType: !295, size: 64, align: 64, offset: 1408)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !136, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1350, baseType: !298, size: 64, align: 64, offset: 1472)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !136, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1351, baseType: !170, size: 64, align: 64, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1352, baseType: !147, size: 32, align: 32, offset: 1600)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !136, line: 1373, size: 192, align: 64, elements: !303, identifier: "_ZTSN3pov12Warps_StructE")
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !273, size: 16, align: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !281, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !281, size: 64, align: 64, offset: 128)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !136, line: 1323, size: 1280, align: 64, elements: !308, identifier: "_ZTSN3pov14Pattern_StructE")
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !273, size: 16, align: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !273, size: 16, align: 16, offset: 16)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !273, size: 16, align: 16, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !147, size: 32, align: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !281, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !284, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !287, size: 64, align: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !136, line: 1045, size: 128, align: 64, elements: !321, identifier: "_ZTSN3pov16Blend_Map_StructE")
!321 = !{!322, !323, !325, !327, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1047, baseType: !147, size: 32, align: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1048, baseType: !324, size: 16, align: 16, offset: 32)
!324 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !326, size: 8, align: 8, offset: 48)
!326 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !326, size: 8, align: 8, offset: 56)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1050, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !136, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !136, line: 1031, size: 256, align: 64, elements: !332, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!332 = !{!333, !334, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1033, baseType: !188, size: 32, align: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1034, baseType: !335, size: 8, align: 8, offset: 32)
!335 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!337 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1035, size: 192, align: 64, elements: !338, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!338 = !{!339, !344, !345, !346, !347}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1037, baseType: !340, size: 160, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !136, line: 681, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 160, align: 32, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 5)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1038, baseType: !292, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1039, baseType: !295, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1040, baseType: !170, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1041, baseType: !348, size: 128, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !136, line: 676, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 128, align: 64, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 2)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !136, line: 1328, size: 1472, align: 64, elements: !353, identifier: "_ZTSN3pov14Pigment_StructE")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !273, size: 16, align: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !273, size: 16, align: 16, offset: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !273, size: 16, align: 16, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !147, size: 32, align: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !281, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !284, size: 64, align: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !287, size: 64, align: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1331, baseType: !340, size: 160, align: 32, offset: 1280)
!366 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, size: 896, align: 64, elements: !367, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!367 = !{!368, !371, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !136, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !136, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !292, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !167, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !136, line: 1269, size: 128, align: 64, elements: !389, identifier: "_ZTSN3pov19Density_file_StructE")
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1271, baseType: !147, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1272, baseType: !392, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !136, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !136, line: 1275, size: 320, align: 64, elements: !395, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!395 = !{!396, !397, !399, !400, !401, !402, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1277, baseType: !147, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1278, baseType: !398, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !147, size: 32, align: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !147, size: 32, align: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !147, size: 32, align: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1280, baseType: !147, size: 32, align: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!404 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, size: 64, align: 64, elements: !405, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!405 = !{!406, !408, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1283, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1284, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1285, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !136, line: 1220, size: 960, align: 64, elements: !413, identifier: "_ZTSN3pov12Image_StructE")
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !433, !434}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1222, baseType: !147, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1223, baseType: !147, size: 32, align: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1224, baseType: !147, size: 32, align: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1225, baseType: !147, size: 32, align: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1226, baseType: !147, size: 32, align: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !147, size: 32, align: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !147, size: 32, align: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1228, baseType: !324, size: 16, align: 16, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1229, baseType: !326, size: 8, align: 8, offset: 240)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1230, baseType: !326, size: 8, align: 8, offset: 248)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1231, baseType: !192, size: 192, align: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !188, size: 32, align: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !188, size: 32, align: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1233, baseType: !348, size: 128, align: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !194, size: 64, align: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !194, size: 64, align: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1235, baseType: !431, size: 64, align: 64, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !136, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1236, baseType: !232, size: 64, align: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !136, line: 1161, size: 80, align: 16, elements: !436, identifier: "_ZTSN3pov19Image_Colour_StructE")
!436 = !{!437, !438, !439, !440, !441}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !273, size: 16, align: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !273, size: 16, align: 16, offset: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !273, size: 16, align: 16, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !273, size: 16, align: 16, offset: 48)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !273, size: 16, align: 16, offset: 64)
!442 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1237, size: 64, align: 64, elements: !443, identifier: "_ZTSN3pov12Image_StructUt_E")
!443 = !{!444, !447, !450, !452}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1239, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !136, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1240, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !136, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1241, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1242, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !136, line: 1166, size: 256, align: 64, elements: !455, identifier: "_ZTSN3pov18Image8_Line_StructE")
!455 = !{!456, !457, !458, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !407, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !407, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !407, size: 64, align: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !407, size: 64, align: 64, offset: 192)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !136, line: 1171, size: 256, align: 64, elements: !461, identifier: "_ZTSN3pov19Image16_Line_StructE")
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !409, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !409, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !409, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !409, size: 64, align: 64, offset: 192)
!466 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 256, align: 64, elements: !467, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 64, align: 32, elements: !471, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 320, align: 64, elements: !475, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 128)
!479 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 896, align: 64, elements: !480, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!480 = !{!481, !482, !483, !484, !485, !486, !488, !489}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !487, size: 64, align: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !147, size: 32, align: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 704)
!490 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 832, align: 64, elements: !491, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16, offset: 400)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !348, size: 128, align: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !348, size: 128, align: 64, offset: 704)
!500 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 384, align: 64, elements: !501, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!501 = !{!502, !503, !504, !505, !506, !507, !508}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !348, size: 128, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16, offset: 144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !324, size: 16, align: 16, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !147, size: 32, align: 32, offset: 320)
!509 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 128, align: 64, elements: !510, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !136, line: 1330, baseType: !232, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !136, line: 1330, baseType: !232, size: 64, align: 64, offset: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !136, line: 1334, size: 1344, align: 64, elements: !514, identifier: "_ZTSN3pov14Tnormal_StructE")
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !273, size: 16, align: 16)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !273, size: 16, align: 16, offset: 16)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !273, size: 16, align: 16, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !147, size: 32, align: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !281, size: 64, align: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !284, size: 64, align: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !287, size: 64, align: 64, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1337, baseType: !188, size: 32, align: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1338, baseType: !188, size: 32, align: 32, offset: 1312)
!528 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, size: 896, align: 64, elements: !529, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !369, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !372, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !292, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !167, size: 64, align: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 256, align: 64, elements: !547, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 64, align: 32, elements: !551, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 32)
!554 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 320, align: 64, elements: !555, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 128)
!559 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 896, align: 64, elements: !560, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !487, size: 64, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !147, size: 32, align: 32, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 704)
!569 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 832, align: 64, elements: !570, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16, offset: 400)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !348, size: 128, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !348, size: 128, align: 64, offset: 704)
!579 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 384, align: 64, elements: !580, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!580 = !{!581, !582, !583, !584, !585, !586, !587}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !348, size: 128, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16, offset: 144)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !324, size: 16, align: 16, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !147, size: 32, align: 32, offset: 320)
!588 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 128, align: 64, elements: !589, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !232, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !232, size: 64, align: 64, offset: 64)
!592 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, size: 896, align: 64, elements: !593, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !369, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !372, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !292, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !167, size: 64, align: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 256, align: 64, elements: !611, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 64, align: 32, elements: !615, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 32)
!618 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 320, align: 64, elements: !619, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!619 = !{!620, !621, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 128)
!623 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 896, align: 64, elements: !624, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !487, size: 64, align: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !147, size: 32, align: 32, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 704)
!633 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 832, align: 64, elements: !634, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16, offset: 400)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !348, size: 128, align: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !348, size: 128, align: 64, offset: 704)
!643 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 384, align: 64, elements: !644, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!644 = !{!645, !646, !647, !648, !649, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !348, size: 128, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16, offset: 144)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !324, size: 16, align: 16, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !147, size: 32, align: 32, offset: 320)
!652 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 128, align: 64, elements: !653, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !136, line: 1325, baseType: !232, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !136, line: 1325, baseType: !232, size: 64, align: 64, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, size: 896, align: 64, elements: !657, identifier: "_ZTSN3pov14Texture_StructUt_E")
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !369, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !372, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !292, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !167, size: 64, align: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 256, align: 64, elements: !675, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 64, align: 32, elements: !679, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 32)
!682 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 320, align: 64, elements: !683, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 128)
!687 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 896, align: 64, elements: !688, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !487, size: 64, align: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !147, size: 32, align: 32, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 704)
!697 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 832, align: 64, elements: !698, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16, offset: 400)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !348, size: 128, align: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !348, size: 128, align: 64, offset: 704)
!707 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 384, align: 64, elements: !708, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!708 = !{!709, !710, !711, !712, !713, !714, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !348, size: 128, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16, offset: 144)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !324, size: 16, align: 16, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !147, size: 32, align: 32, offset: 320)
!716 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 128, align: 64, elements: !717, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !232, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !232, size: 64, align: 64, offset: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !136, line: 1356, size: 928, align: 32, elements: !721, identifier: "_ZTSN3pov13Finish_StructE")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !741, !742, !743, !744, !745, !746}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !188, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !188, size: 32, align: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !188, size: 32, align: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !188, size: 32, align: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !188, size: 32, align: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !188, size: 32, align: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !188, size: 32, align: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !188, size: 32, align: 32, offset: 224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !188, size: 32, align: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !188, size: 32, align: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !188, size: 32, align: 32, offset: 480)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !739, size: 96, align: 32, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !136, line: 682, baseType: !740)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, align: 32, elements: !195)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !739, size: 96, align: 32, offset: 608)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !739, size: 96, align: 32, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1365, baseType: !188, size: 32, align: 32, offset: 800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1366, baseType: !147, size: 32, align: 32, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1367, baseType: !188, size: 32, align: 32, offset: 864)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1368, baseType: !147, size: 32, align: 32, offset: 896)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !136, line: 1112, size: 512, align: 64, elements: !748, identifier: "_ZTSN3pov15Interior_StructE")
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1114, baseType: !147, size: 32, align: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !147, size: 32, align: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !147, size: 32, align: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !188, size: 32, align: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !188, size: 32, align: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !188, size: 32, align: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !188, size: 32, align: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !188, size: 32, align: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !188, size: 32, align: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1119, baseType: !340, size: 160, align: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1120, baseType: !760, size: 64, align: 64, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !136, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !136, line: 1069, size: 1728, align: 64, elements: !763, identifier: "_ZTSN3pov12Media_StructE")
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1071, baseType: !147, size: 32, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1072, baseType: !147, size: 32, align: 32, offset: 32)
