; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/express.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!517 = !DIEnumerator(name: "COORDS_TOKEN", value: 509)
!518 = !DIEnumerator(name: "SIZE_TOKEN", value: 510)
!519 = !DIEnumerator(name: "METRIC_TOKEN", value: 511)
!520 = !DIEnumerator(name: "FORM_TOKEN", value: 512)
!521 = !DIEnumerator(name: "ORIENTATION_TOKEN", value: 513)
!522 = !DIEnumerator(name: "TOROIDAL_TOKEN", value: 514)
!523 = !DIEnumerator(name: "DIST_EXP_TOKEN", value: 515)
!524 = !DIEnumerator(name: "MAJOR_RADIUS_TOKEN", value: 516)
!525 = !DIEnumerator(name: "JPEG_TOKEN", value: 517)
!526 = !DIEnumerator(name: "AA_THRESHOLD_TOKEN", value: 518)
!527 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519)
!528 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520)
!529 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521)
!530 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522)
!531 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523)
!532 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524)
!533 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525)
!534 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526)
!535 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527)
!536 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528)
!537 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529)
!538 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530)
!539 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531)
!540 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532)
!541 = !DIEnumerator(name: "JULIA_TOKEN", value: 533)
!542 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534)
!543 = !DIEnumerator(name: "LAST_TOKEN", value: 535)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !545, line: 692, size: 32, align: 32, elements: !546)
!545 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!546 = !{!547, !548, !549, !550}
!547 = !DIEnumerator(name: "X", value: 0)
!548 = !DIEnumerator(name: "Y", value: 1)
!549 = !DIEnumerator(name: "Z", value: 2)
!550 = !DIEnumerator(name: "T", value: 3)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !545, line: 701, size: 32, align: 32, elements: !552)
!552 = !{!553, !554, !555, !556, !557}
!553 = !DIEnumerator(name: "pRED", value: 0)
!554 = !DIEnumerator(name: "pGREEN", value: 1)
!555 = !DIEnumerator(name: "pBLUE", value: 2)
!556 = !DIEnumerator(name: "pFILTER", value: 3)
!557 = !DIEnumerator(name: "pTRANSM", value: 4)
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !545, line: 1799, size: 32, align: 32, elements: !559, identifier: "_ZTSN3pov9FRAMETYPEE")
!559 = !{!560, !561}
!560 = !DIEnumerator(name: "FT_SINGLE_FRAME", value: 0)
!561 = !DIEnumerator(name: "FT_MULTIPLE_FRAME", value: 1)
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !564, file: !563, line: 51, size: 32, align: 32, elements: !565)
!563 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!564 = !DINamespace(name: "pov_base", scope: null, file: !563, line: 37)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!566 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!567 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!568 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!569 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!570 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!571 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!572 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!573 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!574 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!575 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!576 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!577 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!578 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!579 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!580 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!581 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!582 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!583 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!584 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!585 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!586 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!587 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !545, line: 686, size: 32, align: 32, elements: !589)
!589 = !{!590, !591}
!590 = !DIEnumerator(name: "U", value: 0)
!591 = !DIEnumerator(name: "V", value: 1)
!592 = !{!593, !599, !604, !609, !664, !668, !669, !3, !676, !677, !686, !691, !713, !734, !739, !752, !778, !784, !793, !800, !823, !830, !842, !848, !854, !858, !862, !867, !878, !888, !897, !901, !926, !978, !988, !1003, !1031, !1039, !1060, !1068, !1089, !1107, !1111, !1115, !1120, !1130, !1140, !1149, !1153, !1168, !1186, !1190, !1194, !1199, !1209, !1219, !1228, !1232, !1259, !1314, !1321, !1332, !1339, !1345, !1363, !1367, !1371, !1376, !1386, !1396, !1405, !730, !684, !623, !1409, !1425, !1430, !597, !1432, !710, !1433, !1442, !1512, !1570, !558, !942, !1581, !776, !1583, !1584, !799, !672, !1601, !1605, !1637, !1684, !1688}
!593 = !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 82, size: 64, align: 32, elements: !595, identifier: "_ZTS5div_t")
!594 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!595 = !{!596, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !594, line: 83, baseType: !597, size: 32, align: 32)
!597 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !594, line: 84, baseType: !597, size: 32, align: 32, offset: 32)
!599 = !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 87, size: 128, align: 64, elements: !600, identifier: "_ZTS6ldiv_t")
!600 = !{!601, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !594, line: 88, baseType: !602, size: 64, align: 64)
!602 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !594, line: 89, baseType: !602, size: 64, align: 64, offset: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, file: !594, line: 93, size: 128, align: 64, elements: !605, identifier: "_ZTS7lldiv_t")
!605 = !{!606, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !594, line: 94, baseType: !607, size: 64, align: 64)
!607 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !594, line: 95, baseType: !607, size: 64, align: 64, offset: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !610, line: 122, size: 1216, align: 64, elements: !611, identifier: "_ZTS7__sFILE")
!610 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!611 = !{!612, !615, !616, !617, !619, !620, !621, !622, !624, !628, !634, !643, !649, !650, !652, !653, !657, !661, !662, !663}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !610, line: 123, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !610, line: 124, baseType: !597, size: 32, align: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !610, line: 125, baseType: !597, size: 32, align: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !610, line: 126, baseType: !618, size: 16, align: 16, offset: 128)
!618 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !610, line: 127, baseType: !618, size: 16, align: 16, offset: 144)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !610, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !610, line: 129, baseType: !597, size: 32, align: 32, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !610, line: 132, baseType: !623, size: 64, align: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !610, line: 133, baseType: !625, size: 64, align: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!597, !623}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !610, line: 134, baseType: !629, size: 64, align: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!597, !623, !632, !597}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !610, line: 135, baseType: !635, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!638, !623, !638, !597}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !610, line: 77, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !640, line: 71, baseType: !641)
!640 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !642, line: 46, baseType: !607)
!642 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !610, line: 136, baseType: !644, size: 64, align: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!597, !623, !647, !597}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !610, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !610, line: 140, baseType: !651, size: 64, align: 64, offset: 832)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !610, line: 141, baseType: !597, size: 32, align: 32, offset: 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !610, line: 144, baseType: !654, size: 24, align: 8, offset: 928)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 24, align: 8, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 3)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !610, line: 145, baseType: !658, size: 8, align: 8, offset: 952)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 8, align: 8, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 1)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !610, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !610, line: 151, baseType: !597, size: 32, align: 32, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !610, line: 152, baseType: !638, size: 64, align: 64, offset: 1152)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !610, line: 88, size: 128, align: 64, elements: !665, identifier: "_ZTS6__sbuf")
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !610, line: 89, baseType: !613, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !610, line: 90, baseType: !597, size: 32, align: 32, offset: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !610, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !670, identifier: "_ZTS13__va_list_tag")
!670 = !{!671, !673, !674, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !672, size: 32, align: 32)
!672 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !672, size: 32, align: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !623, size: 64, align: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !623, size: 64, align: 64, offset: 128)
!676 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !545, line: 1045, size: 128, align: 64, elements: !678, identifier: "_ZTSN3pov16Blend_Map_StructE")
!678 = !{!679, !680, !681, !682, !683}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !545, line: 1047, baseType: !597, size: 32, align: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !545, line: 1048, baseType: !618, size: 16, align: 16, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !545, line: 1049, baseType: !633, size: 8, align: 8, offset: 48)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !545, line: 1049, baseType: !633, size: 8, align: 8, offset: 56)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !545, line: 1050, baseType: !684, size: 64, align: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !545, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !545, line: 1031, size: 256, align: 64, elements: !687, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !545, line: 1033, baseType: !676, size: 32, align: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !545, line: 1034, baseType: !614, size: 8, align: 8, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !545, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!691 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !545, line: 1035, size: 192, align: 64, elements: !692, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!692 = !{!693, !698, !701, !704, !707}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !545, line: 1037, baseType: !694, size: 160, align: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !545, line: 681, baseType: !695)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 160, align: 32, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 5)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !545, line: 1038, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !545, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !545, line: 1039, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !545, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !545, line: 1040, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !545, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !545, line: 1041, baseType: !708, size: 128, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !545, line: 676, baseType: !709)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 128, align: 64, elements: !711)
!710 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!711 = !{!712}
!712 = !DISubrange(count: 2)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !545, line: 1328, size: 1472, align: 64, elements: !714, identifier: "_ZTSN3pov14Pigment_StructE")
!714 = !{!715, !717, !718, !719, !720, !721, !722, !723, !726, !729, !732, !733}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !716, size: 16, align: 16)
!716 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !716, size: 16, align: 16, offset: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !716, size: 16, align: 16, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !597, size: 32, align: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !676, size: 32, align: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !676, size: 32, align: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !676, size: 32, align: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !724, size: 64, align: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !545, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !727, size: 64, align: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !545, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !730, size: 64, align: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !545, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !545, line: 1331, baseType: !694, size: 160, align: 32, offset: 1280)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !545, line: 1373, size: 192, align: 64, elements: !735, identifier: "_ZTSN3pov12Warps_StructE")
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !545, line: 1375, baseType: !716, size: 16, align: 16)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !545, line: 1375, baseType: !724, size: 64, align: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !545, line: 1375, baseType: !724, size: 64, align: 64, offset: 128)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !545, line: 1323, size: 1280, align: 64, elements: !740, identifier: "_ZTSN3pov14Pattern_StructE")
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !716, size: 16, align: 16)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !716, size: 16, align: 16, offset: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !716, size: 16, align: 16, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !597, size: 32, align: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !676, size: 32, align: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !676, size: 32, align: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !676, size: 32, align: 32, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !724, size: 64, align: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !727, size: 64, align: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !730, size: 64, align: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!752 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !545, line: 1325, size: 896, align: 64, elements: !753, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!753 = !{!754, !757, !760, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !545, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !545, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !545, line: 677, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 192, align: 64, elements: !655)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !676, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !699, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !545, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !545, line: 1269, size: 128, align: 64, elements: !779, identifier: "_ZTSN3pov19Density_file_StructE")
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !545, line: 1271, baseType: !597, size: 32, align: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !545, line: 1272, baseType: !782, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !545, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !545, line: 1275, size: 320, align: 64, elements: !785, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!785 = !{!786, !787, !788, !789, !790, !791, !792}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1277, baseType: !597, size: 32, align: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1278, baseType: !632, size: 64, align: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1279, baseType: !597, size: 32, align: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1279, baseType: !597, size: 32, align: 32, offset: 160)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1279, baseType: !597, size: 32, align: 32, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1280, baseType: !597, size: 32, align: 32, offset: 224)
!792 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!793 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !545, line: 1281, size: 64, align: 64, elements: !794, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!794 = !{!795, !796, !798}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !545, line: 1283, baseType: !613, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !545, line: 1284, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !545, line: 1285, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !545, line: 1220, size: 960, align: 64, elements: !801, identifier: "_ZTSN3pov12Image_StructE")
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !821, !822}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1222, baseType: !597, size: 32, align: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1223, baseType: !597, size: 32, align: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1224, baseType: !597, size: 32, align: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1225, baseType: !597, size: 32, align: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1226, baseType: !597, size: 32, align: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1227, baseType: !597, size: 32, align: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1227, baseType: !597, size: 32, align: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1228, baseType: !618, size: 16, align: 16, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1229, baseType: !633, size: 8, align: 8, offset: 240)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1230, baseType: !633, size: 8, align: 8, offset: 248)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1231, baseType: !761, size: 192, align: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1232, baseType: !676, size: 32, align: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1232, baseType: !676, size: 32, align: 32, offset: 480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1233, baseType: !708, size: 128, align: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1234, baseType: !710, size: 64, align: 64, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1234, baseType: !710, size: 64, align: 64, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1235, baseType: !819, size: 64, align: 64, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !545, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1236, baseType: !623, size: 64, align: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !545, line: 1161, size: 80, align: 16, elements: !824, identifier: "_ZTSN3pov19Image_Colour_StructE")
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !545, line: 1163, baseType: !716, size: 16, align: 16)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !545, line: 1163, baseType: !716, size: 16, align: 16, offset: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !545, line: 1163, baseType: !716, size: 16, align: 16, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !545, line: 1163, baseType: !716, size: 16, align: 16, offset: 48)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !545, line: 1163, baseType: !716, size: 16, align: 16, offset: 64)
!830 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !545, line: 1237, size: 64, align: 64, elements: !831, identifier: "_ZTSN3pov12Image_StructUt_E")
!831 = !{!832, !835, !838, !840}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !545, line: 1239, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !545, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !545, line: 1240, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !545, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !545, line: 1241, baseType: !839, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !545, line: 1242, baseType: !841, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !545, line: 1166, size: 256, align: 64, elements: !843, identifier: "_ZTSN3pov18Image8_Line_StructE")
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !545, line: 1168, baseType: !613, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !545, line: 1168, baseType: !613, size: 64, align: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !545, line: 1168, baseType: !613, size: 64, align: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !545, line: 1168, baseType: !613, size: 64, align: 64, offset: 192)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !545, line: 1171, size: 256, align: 64, elements: !849, identifier: "_ZTSN3pov19Image16_Line_StructE")
!849 = !{!850, !851, !852, !853}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !545, line: 1173, baseType: !797, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !545, line: 1173, baseType: !797, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !545, line: 1173, baseType: !797, size: 64, align: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !545, line: 1173, baseType: !797, size: 64, align: 64, offset: 192)
!854 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 256, align: 64, elements: !855, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !545, line: 1325, baseType: !676, size: 32, align: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64, offset: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 64, align: 32, elements: !859, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !545, line: 1325, baseType: !676, size: 32, align: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !545, line: 1325, baseType: !676, size: 32, align: 32, offset: 32)
!862 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 320, align: 64, elements: !863, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64, offset: 128)
!867 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 896, align: 64, elements: !868, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!868 = !{!869, !870, !871, !872, !873, !874, !876, !877}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !875, size: 64, align: 64, offset: 576)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !597, size: 32, align: 32, offset: 640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64, offset: 704)
!878 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 832, align: 64, elements: !879, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!879 = !{!880, !881, !882, !883, !884, !885, !886, !887}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !761, size: 192, align: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16, offset: 400)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !708, size: 128, align: 64, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !545, line: 1325, baseType: !708, size: 128, align: 64, offset: 704)
!888 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 384, align: 64, elements: !889, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !708, size: 128, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16, offset: 144)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !618, size: 16, align: 16, offset: 160)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !710, size: 64, align: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !545, line: 1325, baseType: !597, size: 32, align: 32, offset: 320)
!897 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !545, line: 1325, size: 128, align: 64, elements: !898, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !545, line: 1325, baseType: !623, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !545, line: 1325, baseType: !623, size: 64, align: 64, offset: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !545, line: 1521, size: 960, align: 64, elements: !902, identifier: "_ZTSN3pov13Object_StructE")
!902 = !{!903, !906, !907, !908, !909, !910, !913, !914, !915, !918, !920, !923, !924, !925}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !545, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !597, size: 32, align: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !776, size: 64, align: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !705, size: 64, align: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !705, size: 64, align: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !911, size: 64, align: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !545, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !776, size: 64, align: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !776, size: 64, align: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !916, size: 64, align: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !545, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!918 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !919, size: 192, align: 32, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !545, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !921, size: 64, align: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !545, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!923 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !921, size: 64, align: 64, offset: 832)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !676, size: 32, align: 32, offset: 896)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !545, line: 1523, baseType: !672, size: 32, align: 32, offset: 928)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !545, line: 1503, size: 704, align: 64, elements: !927, identifier: "_ZTSN3pov13Method_StructE")
!927 = !{!928, !937, !943, !950, !952, !957, !962, !964, !966, !971, !976}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1505, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !545, line: 1420, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!597, !776, !933, !935}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !545, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !545, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1506, baseType: !938, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !545, line: 1421, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!597, !942, !776}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1507, baseType: !944, size: 64, align: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !545, line: 1422, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !942, !776, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !545, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!950 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1508, baseType: !951, size: 64, align: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !545, line: 1423, baseType: !945)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1509, baseType: !953, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !545, line: 1424, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!623, !776}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1510, baseType: !958, size: 64, align: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !545, line: 1425, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !776, !942, !921}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1511, baseType: !963, size: 64, align: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !545, line: 1426, baseType: !959)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1512, baseType: !965, size: 64, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !545, line: 1427, baseType: !959)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1513, baseType: !967, size: 64, align: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !545, line: 1428, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !776, !921}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1514, baseType: !972, size: 64, align: 64, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !545, line: 1429, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !776}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !545, line: 1515, baseType: !977, size: 64, align: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !545, line: 1430, baseType: !973)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !545, line: 1783, size: 6848, align: 64, elements: !979, identifier: "_ZTSN3pov10Ray_StructE")
!979 = !{!980, !981, !982, !983, !984}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !545, line: 1785, baseType: !761, size: 192, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !545, line: 1786, baseType: !761, size: 192, align: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !545, line: 1787, baseType: !597, size: 32, align: 32, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !545, line: 1788, baseType: !672, size: 32, align: 32, offset: 416)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !545, line: 1789, baseType: !985, size: 6400, align: 64, offset: 448)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 6400, align: 64, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 100)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !545, line: 1112, size: 512, align: 64, elements: !989, identifier: "_ZTSN3pov15Interior_StructE")
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1114, baseType: !597, size: 32, align: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1115, baseType: !597, size: 32, align: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1115, baseType: !597, size: 32, align: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1116, baseType: !676, size: 32, align: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1116, baseType: !676, size: 32, align: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1117, baseType: !676, size: 32, align: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1117, baseType: !676, size: 32, align: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1118, baseType: !676, size: 32, align: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1118, baseType: !676, size: 32, align: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1119, baseType: !694, size: 160, align: 32, offset: 288)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !545, line: 1120, baseType: !1001, size: 64, align: 64, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !545, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !545, line: 1069, size: 1728, align: 64, elements: !1004, identifier: "_ZTSN3pov12Media_StructE")
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1071, baseType: !597, size: 32, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1072, baseType: !597, size: 32, align: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1073, baseType: !597, size: 32, align: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1074, baseType: !597, size: 32, align: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1075, baseType: !597, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1076, baseType: !710, size: 64, align: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1077, baseType: !597, size: 32, align: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1078, baseType: !710, size: 64, align: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1078, baseType: !710, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1079, baseType: !597, size: 32, align: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1080, baseType: !597, size: 32, align: 32, offset: 480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1081, baseType: !597, size: 32, align: 32, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1082, baseType: !597, size: 32, align: 32, offset: 544)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1083, baseType: !694, size: 160, align: 32, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1084, baseType: !694, size: 160, align: 32, offset: 736)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1085, baseType: !694, size: 160, align: 32, offset: 896)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1086, baseType: !694, size: 160, align: 32, offset: 1056)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1088, baseType: !710, size: 64, align: 64, offset: 1216)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1089, baseType: !710, size: 64, align: 64, offset: 1280)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1090, baseType: !710, size: 64, align: 64, offset: 1344)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1091, baseType: !942, size: 64, align: 64, offset: 1408)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1093, baseType: !710, size: 64, align: 64, offset: 1472)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1094, baseType: !597, size: 32, align: 32, offset: 1536)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1095, baseType: !597, size: 32, align: 32, offset: 1568)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1097, baseType: !699, size: 64, align: 64, offset: 1600)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !545, line: 1099, baseType: !1001, size: 64, align: 64, offset: 1664)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !545, line: 1621, size: 192, align: 64, elements: !1032, identifier: "_ZTSN3pov13istack_structE")
!1032 = !{!1033, !1035, !1037, !1038}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !545, line: 1623, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !545, line: 1624, baseType: !1036, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !545, line: 1625, baseType: !672, size: 32, align: 32, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !545, line: 1626, baseType: !672, size: 32, align: 32, offset: 160)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !545, line: 1596, size: 1600, align: 64, elements: !1040, identifier: "_ZTSN3pov10istk_entryE")
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1598, baseType: !710, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1599, baseType: !761, size: 192, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1600, baseType: !761, size: 192, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1601, baseType: !761, size: 192, align: 64, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1602, baseType: !708, size: 128, align: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1603, baseType: !776, size: 64, align: 64, offset: 768)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1610, baseType: !597, size: 32, align: 32, offset: 832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1610, baseType: !597, size: 32, align: 32, offset: 864)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1611, baseType: !710, size: 64, align: 64, offset: 896)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1611, baseType: !710, size: 64, align: 64, offset: 960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1612, baseType: !710, size: 64, align: 64, offset: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1612, baseType: !710, size: 64, align: 64, offset: 1088)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1613, baseType: !710, size: 64, align: 64, offset: 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1613, baseType: !710, size: 64, align: 64, offset: 1216)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1614, baseType: !710, size: 64, align: 64, offset: 1280)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1614, baseType: !710, size: 64, align: 64, offset: 1344)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1614, baseType: !710, size: 64, align: 64, offset: 1408)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1616, baseType: !623, size: 64, align: 64, offset: 1472)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !545, line: 1618, baseType: !623, size: 64, align: 64, offset: 1536)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !545, line: 1002, size: 2048, align: 64, elements: !1061, identifier: "_ZTSN3pov16Transform_StructE")
!1061 = !{!1062, !1067}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !545, line: 1004, baseType: !1063, size: 1024, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !545, line: 679, baseType: !1064)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 1024, align: 64, elements: !1065)
!1065 = !{!1066, !1066}
!1066 = !DISubrange(count: 4)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !545, line: 1005, baseType: !1063, size: 1024, align: 64, offset: 1024)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !545, line: 1345, size: 1664, align: 64, elements: !1069, identifier: "_ZTSN3pov14Texture_StructE")
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1087, !1088}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !716, size: 16, align: 16)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !716, size: 16, align: 16, offset: 16)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !716, size: 16, align: 16, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !597, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !676, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !676, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !676, size: 32, align: 32, offset: 160)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !724, size: 64, align: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !727, size: 64, align: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !730, size: 64, align: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, baseType: !705, size: 64, align: 64, offset: 1280)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1348, baseType: !699, size: 64, align: 64, offset: 1344)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1349, baseType: !702, size: 64, align: 64, offset: 1408)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1350, baseType: !1085, size: 64, align: 64, offset: 1472)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !545, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1351, baseType: !705, size: 64, align: 64, offset: 1536)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1352, baseType: !597, size: 32, align: 32, offset: 1600)
!1089 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !545, line: 1347, size: 896, align: 64, elements: !1090, identifier: "_ZTSN3pov14Texture_StructUt_E")
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !755, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !758, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !676, size: 32, align: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !699, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, baseType: !776, size: 64, align: 64)
!1107 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 256, align: 64, elements: !1108, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !545, line: 1347, baseType: !676, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64, offset: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 64, align: 32, elements: !1112, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !545, line: 1347, baseType: !676, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !545, line: 1347, baseType: !676, size: 32, align: 32, offset: 32)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 320, align: 64, elements: !1116, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64, offset: 128)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 896, align: 64, elements: !1121, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !875, size: 64, align: 64, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !597, size: 32, align: 32, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64, offset: 704)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 832, align: 64, elements: !1131, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !761, size: 192, align: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16, offset: 400)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !708, size: 128, align: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !545, line: 1347, baseType: !708, size: 128, align: 64, offset: 704)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 384, align: 64, elements: !1141, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !708, size: 128, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16, offset: 144)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !618, size: 16, align: 16, offset: 160)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !710, size: 64, align: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !545, line: 1347, baseType: !597, size: 32, align: 32, offset: 320)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !545, line: 1347, size: 128, align: 64, elements: !1150, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !545, line: 1347, baseType: !623, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !545, line: 1347, baseType: !623, size: 64, align: 64, offset: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !545, line: 1334, size: 1344, align: 64, elements: !1154, identifier: "_ZTSN3pov14Tnormal_StructE")
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !716, size: 16, align: 16)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !716, size: 16, align: 16, offset: 16)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !716, size: 16, align: 16, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !597, size: 32, align: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !676, size: 32, align: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !676, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !676, size: 32, align: 32, offset: 160)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !724, size: 64, align: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !727, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !730, size: 64, align: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1337, baseType: !676, size: 32, align: 32, offset: 1280)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1338, baseType: !676, size: 32, align: 32, offset: 1312)
!1168 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !545, line: 1336, size: 896, align: 64, elements: !1169, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !755, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !758, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !676, size: 32, align: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !699, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, baseType: !776, size: 64, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 256, align: 64, elements: !1187, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !545, line: 1336, baseType: !676, size: 32, align: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64, offset: 64)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 64, align: 32, elements: !1191, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !545, line: 1336, baseType: !676, size: 32, align: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !545, line: 1336, baseType: !676, size: 32, align: 32, offset: 32)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 320, align: 64, elements: !1195, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64, offset: 128)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 896, align: 64, elements: !1200, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 448)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16, offset: 512)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !875, size: 64, align: 64, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !597, size: 32, align: 32, offset: 640)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64, offset: 704)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 832, align: 64, elements: !1210, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !761, size: 192, align: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16, offset: 384)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16, offset: 400)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 512)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !708, size: 128, align: 64, offset: 576)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !545, line: 1336, baseType: !708, size: 128, align: 64, offset: 704)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 384, align: 64, elements: !1220, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1226, !1227}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !708, size: 128, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16, offset: 144)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !618, size: 16, align: 16, offset: 160)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !710, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !545, line: 1336, baseType: !597, size: 32, align: 32, offset: 320)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !545, line: 1336, size: 128, align: 64, elements: !1229, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !545, line: 1336, baseType: !623, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !545, line: 1336, baseType: !623, size: 64, align: 64, offset: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !545, line: 1356, size: 928, align: 32, elements: !1233, identifier: "_ZTSN3pov13Finish_StructE")
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1253, !1254, !1255, !1256, !1257, !1258}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !545, line: 1358, baseType: !676, size: 32, align: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !545, line: 1358, baseType: !676, size: 32, align: 32, offset: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !545, line: 1359, baseType: !676, size: 32, align: 32, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !545, line: 1359, baseType: !676, size: 32, align: 32, offset: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !545, line: 1360, baseType: !676, size: 32, align: 32, offset: 128)
