; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov_base::POV_File_Extensions" = type { [4 x i8*] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"class.pov_base::PlatformBase" = type { i32 (...)** }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::OStream" = type { %"class.pov_base::IOBase" }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%"class.pov_base::Pointer" = type { %"class.pov_base::IStream"* }
%"class.pov_base::Pointer.0" = type { %"class.pov_base::OStream"* }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str1 = private unnamed_addr constant [5 x i8] c".tga\00", align 1
@.str2 = private unnamed_addr constant [5 x i8] c".TGA\00", align 1
@.str3 = private unnamed_addr constant [5 x i8] c".png\00", align 1
@.str4 = private unnamed_addr constant [5 x i8] c".PNG\00", align 1
@.str5 = private unnamed_addr constant [5 x i8] c".ppm\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !386, globals: !621, imports: !627)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 90, size: 32, align: 32, elements: !5, identifier: "_ZTSN8pov_base6IOBaseUt_E")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "none", value: 0)
!7 = !DIEnumerator(name: "append", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 91, size: 32, align: 32, elements: !9, identifier: "_ZTSN8pov_base6IOBaseUt0_E")
!9 = !{!10, !11, !12}
!10 = !DIEnumerator(name: "input", value: 0)
!11 = !DIEnumerator(name: "output", value: 1)
!12 = !DIEnumerator(name: "io", value: 2)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 92, size: 32, align: 32, elements: !14, identifier: "_ZTSN8pov_base6IOBaseUt1_E")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "seek_set", value: 0)
!16 = !DIEnumerator(name: "seek_cur", value: 1)
!17 = !DIEnumerator(name: "seek_end", value: 2)
!18 = !{!19, !25, !30, !35, !43, !52, !115, !164, !168, !3, !8, !13, !169, !48, !239, !290, !328, !41, !365}
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 82, size: 64, align: 32, elements: !21, identifier: "_ZTS5div_t")
!20 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !20, line: 83, baseType: !23, size: 32, align: 32)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !20, line: 84, baseType: !23, size: 32, align: 32, offset: 32)
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 87, size: 128, align: 64, elements: !26, identifier: "_ZTS6ldiv_t")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !20, line: 88, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !20, line: 89, baseType: !28, size: 64, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 93, size: 128, align: 64, elements: !31, identifier: "_ZTS7lldiv_t")
!31 = !{!32, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !20, line: 94, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !20, line: 95, baseType: !33, size: 64, align: 64, offset: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !36, identifier: "_ZTS13__va_list_tag")
!36 = !{!37, !39, !40, !42}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !38, size: 32, align: 32)
!38 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !38, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !41, size: 64, align: 64, offset: 128)
!43 = !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !4, line: 77, size: 256, align: 64, elements: !45, identifier: "_ZTSN8pov_base19POV_File_ExtensionsE")
!44 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !"_ZTSN8pov_base19POV_File_ExtensionsE", file: !4, line: 79, baseType: !47, size: 256, align: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, align: 64, elements: !50)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !{!51}
!51 = !DISubrange(count: 4)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !44, file: !4, line: 84, size: 320, align: 64, elements: !53, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!53 = !{!54, !59, !61, !65, !66, !67, !68, !72, !75, !80, !83, !88, !89, !92, !95, !96, !97, !100, !103, !106, !111, !114}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !55, size: 64, flags: DIFlagArtificial)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!23}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !60, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!60 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !62, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 153, baseType: !"_ZTS7__sFILE")
!64 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !38, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !38, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !48, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!68 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !69, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !38, !38}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!72 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !73, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !71}
!75 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !76, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!76 = !DISubroutineType(types: !77)
!77 = !{!60, !71, !78, !38}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!80 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !81, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!81 = !DISubroutineType(types: !82)
!82 = !{!60, !71}
!83 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !84, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!84 = !DISubroutineType(types: !85)
!85 = !{!86, !71, !41, !87}
!86 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!87 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!88 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !84, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!89 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !90, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubroutineType(types: !91)
!91 = !{!86, !71, !87, !38}
!92 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !93, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!93 = !DISubroutineType(types: !94)
!94 = !{!38, !71}
!95 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !93, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!96 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !81, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!97 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !98, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!98 = !DISubroutineType(types: !99)
!99 = !{!87, !71}
!100 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !101, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!101 = !DISubroutineType(types: !102)
!102 = !{!86, !71}
!103 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !104, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!104 = !DISubroutineType(types: !105)
!105 = !{!78, !71}
!106 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !107, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!107 = !DISubroutineType(types: !108)
!108 = !{!41, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!111 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !112, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!112 = !DISubroutineType(types: !113)
!113 = !{!60, !109}
!114 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !101, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !64, line: 122, size: 1216, align: 64, elements: !116, identifier: "_ZTS7__sFILE")
!116 = !{!117, !120, !121, !122, !124, !125, !126, !127, !128, !132, !136, !145, !149, !150, !152, !153, !157, !161, !162, !163}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !64, line: 123, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !64, line: 124, baseType: !23, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !64, line: 125, baseType: !23, size: 32, align: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !64, line: 126, baseType: !123, size: 16, align: 16, offset: 128)
!123 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !64, line: 127, baseType: !123, size: 16, align: 16, offset: 144)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !64, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !64, line: 129, baseType: !23, size: 32, align: 32, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !64, line: 132, baseType: !41, size: 64, align: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !64, line: 133, baseType: !129, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!23, !41}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !64, line: 134, baseType: !133, size: 64, align: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!23, !41, !48, !23}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !64, line: 135, baseType: !137, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !41, !140, !23}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !64, line: 77, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !142, line: 71, baseType: !143)
!142 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !144, line: 46, baseType: !33)
!144 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !64, line: 136, baseType: !146, size: 64, align: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!23, !41, !78, !23}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !64, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !64, line: 140, baseType: !151, size: 64, align: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !64, line: 141, baseType: !23, size: 32, align: 32, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !64, line: 144, baseType: !154, size: 24, align: 8, offset: 928)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 24, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 3)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !64, line: 145, baseType: !158, size: 8, align: 8, offset: 952)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, align: 8, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 1)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !64, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !64, line: 151, baseType: !23, size: 32, align: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !64, line: 152, baseType: !140, size: 64, align: 64, offset: 1152)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !64, line: 88, size: 128, align: 64, elements: !165, identifier: "_ZTS6__sbuf")
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !64, line: 89, baseType: !118, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !64, line: 90, baseType: !23, size: 32, align: 32, offset: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !64, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!169 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !44, file: !4, line: 118, size: 320, align: 64, elements: !170, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!170 = !{!171, !172, !177, !180, !183, !184, !185, !188, !193, !197, !201, !206, !210, !214, !218, !222, !223, !224, !225, !226, !227, !228, !229, !230, !233, !236}
!171 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!172 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 121, type: !173, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175, !176}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!177 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 122, type: !178, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !175}
!180 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 124, type: !181, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!23, !175}
!183 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 125, type: !181, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!184 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 126, type: !181, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!185 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 127, type: !186, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!28, !175}
!188 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 128, type: !189, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !175, !192}
!191 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!192 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !49)
!193 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 129, type: !194, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{!191, !175, !196}
!196 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !119)
!197 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 130, type: !198, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
