; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fncode.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"struct.pov::TrapS" = type { void (double*, i32, i32)*, i32 }
%"struct.pov::Trap" = type { double (double*, i32)*, i32 }
%"class.pov::FNCode" = type <{ %"struct.pov::FunctionCode"*, i32, i32, i32, i32, i32, [4 x i8] }>
%"struct.pov::FunctionCode" = type { i32*, i32, i8, i8, i8, [56 x i32], [56 x i8*], [56 x i8*], i8*, i8*, %"struct.pov_base::ITextStream::FilePos", i32, i8* (i8*)*, void (i8*)*, i8* }

!513 = !DIEnumerator(name: "PATTERN_TOKEN", value: 505)
!514 = !DIEnumerator(name: "FACETS_TOKEN", value: 506)
!515 = !DIEnumerator(name: "SLOPE_TOKEN", value: 507)
!516 = !DIEnumerator(name: "SOLID_TOKEN", value: 508)
!517 = !DIEnumerator(name: "COORDS_TOKEN", value: 509)
!518 = !DIEnumerator(name: "SIZE_TOKEN", value: 510)
!519 = !DIEnumerator(name: "METRIC_TOKEN", value: 511)
!520 = !DIEnumerator(name: "FORM_TOKEN", value: 512)
!521 = !DIEnumerator(name: "ORIENTATION_TOKEN", value: 513)
!522 = !DIEnumerator(name: "TOROIDAL_TOKEN", value: 514)
!523 = !DIEnumerator(name: "DIST_EXP_TOKEN", value: 515)
!524 = !DIEnumerator(name: "MAJOR_RADIUS_TOKEN", value: 516)
!525 = !DIEnumerator(name: "JPEG_TOKEN", value: 517)
!526 = !DIEnumerator(name: "AA_THRESHOLD_TOKEN", value: 518)
!527 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519)
!528 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520)
!529 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521)
!530 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522)
!531 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523)
!532 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524)
!533 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525)
!534 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526)
!535 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527)
!536 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528)
!537 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529)
!538 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530)
!539 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531)
!540 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532)
!541 = !DIEnumerator(name: "JULIA_TOKEN", value: 533)
!542 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534)
!543 = !DIEnumerator(name: "LAST_TOKEN", value: 535)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !545, line: 41, size: 32, align: 32, elements: !546)
!545 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fnsyntax.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!547 = !DIEnumerator(name: "OP_NONE", value: 0)
!548 = !DIEnumerator(name: "OP_CMP_EQ", value: 1)
!549 = !DIEnumerator(name: "OP_CMP_NE", value: 2)
!550 = !DIEnumerator(name: "OP_CMP_LT", value: 3)
!551 = !DIEnumerator(name: "OP_CMP_LE", value: 4)
!552 = !DIEnumerator(name: "OP_CMP_GT", value: 5)
!553 = !DIEnumerator(name: "OP_CMP_GE", value: 6)
!554 = !DIEnumerator(name: "OP_ADD", value: 7)
!555 = !DIEnumerator(name: "OP_SUB", value: 8)
!556 = !DIEnumerator(name: "OP_OR", value: 9)
!557 = !DIEnumerator(name: "OP_MUL", value: 10)
!558 = !DIEnumerator(name: "OP_DIV", value: 11)
!559 = !DIEnumerator(name: "OP_AND", value: 12)
!560 = !DIEnumerator(name: "OP_POW", value: 13)
!561 = !DIEnumerator(name: "OP_NEG", value: 14)
!562 = !DIEnumerator(name: "OP_NOT", value: 15)
!563 = !DIEnumerator(name: "OP_LEFTMOST", value: 16)
!564 = !DIEnumerator(name: "OP_FIRST", value: 17)
!565 = !DIEnumerator(name: "OP_CONSTANT", value: 18)
!566 = !DIEnumerator(name: "OP_VARIABLE", value: 19)
!567 = !DIEnumerator(name: "OP_DOT", value: 20)
!568 = !DIEnumerator(name: "OP_MEMBER", value: 21)
!569 = !DIEnumerator(name: "OP_CALL", value: 22)
!570 = !DIEnumerator(name: "OP_TRAP", value: 23)
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !572, line: 83, size: 32, align: 32, elements: !573)
!572 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fnpovfpu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!573 = !{!574, !575, !576, !577}
!574 = !DIEnumerator(name: "TRAP_SYS2_POW", value: 0)
!575 = !DIEnumerator(name: "TRAP_SYS2_ATAN2", value: 1)
!576 = !DIEnumerator(name: "TRAP_SYS2_MOD", value: 2)
!577 = !DIEnumerator(name: "TRAP_SYS2_DIV", value: 3)
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !572, line: 60, size: 32, align: 32, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!580 = !DIEnumerator(name: "TRAP_SYS1_SIN", value: 0)
!581 = !DIEnumerator(name: "TRAP_SYS1_COS", value: 1)
!582 = !DIEnumerator(name: "TRAP_SYS1_TAN", value: 2)
!583 = !DIEnumerator(name: "TRAP_SYS1_ASIN", value: 3)
!584 = !DIEnumerator(name: "TRAP_SYS1_ACOS", value: 4)
!585 = !DIEnumerator(name: "TRAP_SYS1_ATAN", value: 5)
!586 = !DIEnumerator(name: "TRAP_SYS1_SINH", value: 6)
!587 = !DIEnumerator(name: "TRAP_SYS1_COSH", value: 7)
!588 = !DIEnumerator(name: "TRAP_SYS1_TANH", value: 8)
!589 = !DIEnumerator(name: "TRAP_SYS1_ASINH", value: 9)
!590 = !DIEnumerator(name: "TRAP_SYS1_ACOSH", value: 10)
!591 = !DIEnumerator(name: "TRAP_SYS1_ATANH", value: 11)
!592 = !DIEnumerator(name: "TRAP_SYS1_FLOOR", value: 12)
!593 = !DIEnumerator(name: "TRAP_SYS1_CEIL", value: 13)
!594 = !DIEnumerator(name: "TRAP_SYS1_SQRT", value: 14)
!595 = !DIEnumerator(name: "TRAP_SYS1_EXP", value: 15)
!596 = !DIEnumerator(name: "TRAP_SYS1_LN", value: 16)
!597 = !DIEnumerator(name: "TRAP_SYS1_LOG", value: 17)
!598 = !DIEnumerator(name: "TRAP_SYS1_INT", value: 18)
!599 = !{!600, !606, !611, !616, !671, !675, !676, !683, !750, !781, !835, !905, !959, !963, !973, !979, !3, !753, !604, !639, !630, !728, !679, !986, !1002}
!600 = !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 82, size: 64, align: 32, elements: !602, identifier: "_ZTS5div_t")
!601 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!602 = !{!603, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !601, line: 83, baseType: !604, size: 32, align: 32)
!604 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !601, line: 84, baseType: !604, size: 32, align: 32, offset: 32)
!606 = !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 87, size: 128, align: 64, elements: !607, identifier: "_ZTS6ldiv_t")
!607 = !{!608, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !601, line: 88, baseType: !609, size: 64, align: 64)
!609 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !601, line: 89, baseType: !609, size: 64, align: 64, offset: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 93, size: 128, align: 64, elements: !612, identifier: "_ZTS7lldiv_t")
!612 = !{!613, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !601, line: 94, baseType: !614, size: 64, align: 64)
!614 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !601, line: 95, baseType: !614, size: 64, align: 64, offset: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !617, line: 122, size: 1216, align: 64, elements: !618, identifier: "_ZTS7__sFILE")
!617 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!618 = !{!619, !622, !623, !624, !626, !627, !628, !629, !631, !635, !641, !650, !656, !657, !659, !660, !664, !668, !669, !670}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !617, line: 123, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !617, line: 124, baseType: !604, size: 32, align: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !617, line: 125, baseType: !604, size: 32, align: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !617, line: 126, baseType: !625, size: 16, align: 16, offset: 128)
!625 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !617, line: 127, baseType: !625, size: 16, align: 16, offset: 144)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !617, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !617, line: 129, baseType: !604, size: 32, align: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !617, line: 132, baseType: !630, size: 64, align: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !617, line: 133, baseType: !632, size: 64, align: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!604, !630}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !617, line: 134, baseType: !636, size: 64, align: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!604, !630, !639, !604}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !617, line: 135, baseType: !642, size: 64, align: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!645, !630, !645, !604}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !617, line: 77, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !647, line: 71, baseType: !648)
!647 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !649, line: 46, baseType: !614)
!649 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !617, line: 136, baseType: !651, size: 64, align: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!604, !630, !654, !604}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !617, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !617, line: 140, baseType: !658, size: 64, align: 64, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !617, line: 141, baseType: !604, size: 32, align: 32, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !617, line: 144, baseType: !661, size: 24, align: 8, offset: 928)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 24, align: 8, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 3)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !617, line: 145, baseType: !665, size: 8, align: 8, offset: 952)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 8, align: 8, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 1)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !617, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !617, line: 151, baseType: !604, size: 32, align: 32, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !617, line: 152, baseType: !645, size: 64, align: 64, offset: 1152)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !617, line: 88, size: 128, align: 64, elements: !672, identifier: "_ZTS6__sbuf")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !617, line: 89, baseType: !620, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !617, line: 90, baseType: !604, size: 32, align: 32, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !617, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !677, identifier: "_ZTS13__va_list_tag")
!677 = !{!678, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !679, size: 32, align: 32)
!679 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !679, size: 32, align: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !630, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !630, size: 64, align: 64, offset: 128)
!683 = !DICompositeType(tag: DW_TAG_class_type, name: "FNCode", scope: !5, file: !684, line: 91, size: 256, align: 64, elements: !685, identifier: "_ZTSN3pov6FNCodeE")
!684 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fncode.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!685 = !{!686, !689, !690, !691, !692, !693, !694, !699, !702, !707, !710, !711, !715, !716, !719, !724, !725, !729, !732, !733, !736, !737, !738, !741, !744, !747}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 100, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionCode", scope: !5, file: !684, line: 86, baseType: !"_ZTSN3pov12FunctionCodeE")
!689 = !DIDerivedType(tag: DW_TAG_member, name: "max_program_size", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 102, baseType: !679, size: 32, align: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max_stack_size", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 103, baseType: !679, size: 32, align: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 104, baseType: !679, size: 32, align: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_stack_pointer", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 105, baseType: !679, size: 32, align: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 106, baseType: !604, size: 32, align: 32, offset: 192)
!694 = !DISubprogram(name: "FNCode", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 94, type: !695, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !697, !687, !698, !639}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov6FNCodeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!698 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!699 = !DISubprogram(name: "Parameter", linkageName: "_ZN3pov6FNCode9ParameterEv", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 96, type: !700, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !697}
!702 = !DISubprogram(name: "Compile", linkageName: "_ZN3pov6FNCode7CompileEPNS_14ExprNodeStructE", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 97, type: !703, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !697, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExprNode", scope: !5, file: !545, line: 92, baseType: !"_ZTSN3pov14ExprNodeStructE")
!707 = !DISubprogram(name: "SetFlag", linkageName: "_ZN3pov6FNCode7SetFlagEjPc", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 98, type: !708, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !697, !679, !639}
!710 = !DISubprogram(name: "FNCode", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 116, type: !700, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true)
!711 = !DISubprogram(name: "FNCode", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 117, type: !712, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !697, !714}
!714 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN3pov6FNCodeE")
!715 = !DISubprogram(name: "compile_recursive", linkageName: "_ZN3pov6FNCode17compile_recursiveEPNS_14ExprNodeStructE", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 119, type: !703, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true)
!716 = !DISubprogram(name: "compile_member", linkageName: "_ZN3pov6FNCode14compile_memberEPc", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 120, type: !717, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !697, !639}
!719 = !DISubprogram(name: "compile_call", linkageName: "_ZN3pov6FNCode12compile_callEPNS_14ExprNodeStructEjiPc", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 121, type: !720, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !697, !705, !722, !604, !639}
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !5, file: !723, line: 40, baseType: !679)
!723 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/function.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!724 = !DISubprogram(name: "compile_select", linkageName: "_ZN3pov6FNCode14compile_selectEPNS_14ExprNodeStructE", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 122, type: !703, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true)
!725 = !DISubprogram(name: "compile_seq_op", linkageName: "_ZN3pov6FNCode14compile_seq_opEPNS_14ExprNodeStructEjd", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 123, type: !726, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !697, !705, !679, !728}
!728 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!729 = !DISubprogram(name: "compile_float_function_call", linkageName: "_ZN3pov6FNCode27compile_float_function_callEPNS_14ExprNodeStructEjPc", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 124, type: !730, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !697, !705, !722, !639}
!732 = !DISubprogram(name: "compile_vector_function_call", linkageName: "_ZN3pov6FNCode28compile_vector_function_callEPNS_14ExprNodeStructEjPc", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 125, type: !730, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true)
!733 = !DISubprogram(name: "compile_inline", linkageName: "_ZN3pov6FNCode14compile_inlineEPNS_12FunctionCodeE", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 126, type: !734, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !697, !687}
!736 = !DISubprogram(name: "compile_variable", linkageName: "_ZN3pov6FNCode16compile_variableEPc", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 127, type: !717, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true)
!737 = !DISubprogram(name: "compile_parameters", linkageName: "_ZN3pov6FNCode18compile_parametersEv", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 128, type: !700, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true)
!738 = !DISubprogram(name: "compile_push_result", linkageName: "_ZN3pov6FNCode19compile_push_resultEv", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 129, type: !739, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true)
!739 = !DISubroutineType(types: !740)
!740 = !{!679, !697}
!741 = !DISubprogram(name: "compile_pop_result", linkageName: "_ZN3pov6FNCode18compile_pop_resultEj", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 130, type: !742, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !697, !679}
!744 = !DISubprogram(name: "compile_instruction", linkageName: "_ZN3pov6FNCode19compile_instructionEjjjj", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 131, type: !745, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true)
!745 = !DISubroutineType(types: !746)
!746 = !{!679, !697, !679, !679, !679, !679}
!747 = !DISubprogram(name: "compile_instruction", linkageName: "_ZN3pov6FNCode19compile_instructionEjjjjj", scope: !"_ZTSN3pov6FNCodeE", file: !684, line: 132, type: !748, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true)
!748 = !DISubroutineType(types: !749)
!749 = !{!679, !697, !679, !679, !679, !679, !679}
!750 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !684, line: 69, size: 9600, align: 64, elements: !751, identifier: "_ZTSN3pov12FunctionCodeE")
!751 = !{!752, !755, !756, !757, !758, !759, !763, !765, !766, !767, !768, !769, !770, !775, !780}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 71, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", scope: !5, file: !684, line: 67, baseType: !679)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "program_size", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 72, baseType: !679, size: 32, align: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "return_size", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 73, baseType: !621, size: 8, align: 8, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_cnt", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 74, baseType: !621, size: 8, align: 8, offset: 104)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_cnt", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 75, baseType: !621, size: 8, align: 8, offset: 112)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_pos", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 76, baseType: !760, size: 1792, align: 32, offset: 128)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 1792, align: 32, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 56)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "localvar", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 77, baseType: !764, size: 3584, align: 64, offset: 1920)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 3584, align: 64, elements: !761)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 78, baseType: !764, size: 3584, align: 64, offset: 5504)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 79, baseType: !639, size: 64, align: 64, offset: 9088)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 80, baseType: !639, size: 64, align: 64, offset: 9152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "filepos", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 81, baseType: !"_ZTSN8pov_base11ITextStream7FilePosE", size: 128, align: 64, offset: 9216)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 82, baseType: !679, size: 32, align: 32, offset: 9344)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "private_copy_method", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 83, baseType: !771, size: 64, align: 64, offset: 9408)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_COPY_METHOD", scope: !5, file: !684, line: 64, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!630, !630}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "private_destroy_method", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 84, baseType: !776, size: 64, align: 64, offset: 9472)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_DESTROY_METHOD", scope: !5, file: !684, line: 65, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !630}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !"_ZTSN3pov12FunctionCodeE", file: !684, line: 85, baseType: !630, size: 64, align: 64, offset: 9536)
!781 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !783, file: !782, line: 54, size: 4608, align: 64, elements: !785, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!782 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!783 = !DINamespace(name: "pov_base", scope: null, file: !784, line: 37)
!784 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!785 = !{!786, !791, !793, !797, !799, !800, !801, !802, !803, !804, !805, !809, !812, !815, !818, !821, !824, !827, !830, !831, !834}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !782, file: !782, baseType: !787, size: 64, flags: DIFlagArtificial)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!604}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 78, baseType: !792, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 79, baseType: !794, size: 4096, align: 8, offset: 128)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 4096, align: 8, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 80, baseType: !798, size: 64, align: 64, offset: 4224)
!798 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 81, baseType: !798, size: 64, align: 64, offset: 4288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 82, baseType: !798, size: 64, align: 64, offset: 4352)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 83, baseType: !798, size: 64, align: 64, offset: 4416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 84, baseType: !639, size: 64, align: 64, offset: 4480)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 85, baseType: !604, size: 32, align: 32, offset: 4544)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 86, baseType: !604, size: 32, align: 32, offset: 4576)
!805 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 63, type: !806, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !808, !654, !679}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!809 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 64, type: !810, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !808, !654, !792}
!812 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 65, type: !813, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !808}
!815 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 67, type: !816, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!816 = !DISubroutineType(types: !817)
!817 = !{!604, !808}
!818 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 68, type: !819, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !808, !604}
!821 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 70, type: !822, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!822 = !DISubroutineType(types: !823)
!823 = !{!698, !808}
!824 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 71, type: !825, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!825 = !DISubroutineType(types: !826)
!826 = !{!698, !808, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!827 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 72, type: !828, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!828 = !DISubroutineType(types: !829)
!829 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !808}
!830 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 74, type: !816, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!831 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 76, type: !832, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!832 = !DISubroutineType(types: !833)
!833 = !{!654, !808}
!834 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 88, type: !813, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!835 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !783, file: !784, line: 118, size: 320, align: 64, elements: !836, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!836 = !{!837, !838, !843, !846, !849, !850, !851, !854, !859, !863, !867, !872, !876, !880, !884, !888, !889, !890, !891, !892, !893, !894, !895, !896, !899, !902}
!837 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!838 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 121, type: !839, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !841, !842}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!843 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 122, type: !844, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !841}
!846 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 124, type: !847, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!847 = !DISubroutineType(types: !848)
!848 = !{!604, !841}
!849 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 125, type: !847, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!850 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 126, type: !847, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!851 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 127, type: !852, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!852 = !DISubroutineType(types: !853)
!853 = !{!609, !841}
!854 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 128, type: !855, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!855 = !DISubroutineType(types: !856)
!856 = !{!857, !841, !858}
!857 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!858 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !640)
!859 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 129, type: !860, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!860 = !DISubroutineType(types: !861)
!861 = !{!857, !841, !862}
!862 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !621)
!863 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 130, type: !864, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!864 = !DISubroutineType(types: !865)
!865 = !{!857, !841, !866}
!866 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !625)
!867 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 131, type: !868, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!868 = !DISubroutineType(types: !869)
!869 = !{!857, !841, !870}
!870 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !871)
!871 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!872 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 132, type: !873, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!873 = !DISubroutineType(types: !874)
!874 = !{!857, !841, !875}
!875 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !604)
!876 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 133, type: !877, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!877 = !DISubroutineType(types: !878)
!878 = !{!857, !841, !879}
!879 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !679)
!880 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 134, type: !881, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!881 = !DISubroutineType(types: !882)
!882 = !{!857, !841, !883}
!883 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !609)
!884 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 135, type: !885, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!885 = !DISubroutineType(types: !886)
!886 = !{!857, !841, !887}
!887 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !798)
!888 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 137, type: !881, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!889 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 138, type: !873, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!890 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 139, type: !864, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!891 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 140, type: !855, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!892 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 141, type: !885, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!893 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 142, type: !877, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!894 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 143, type: !868, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!895 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 144, type: !860, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!896 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 145, type: !897, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!897 = !DISubroutineType(types: !898)
!898 = !{!857, !841, !604}
!899 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 146, type: !900, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!900 = !DISubroutineType(types: !901)
!901 = !{!857, !841, !639, !798}
!902 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !784, line: 147, type: !903, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!903 = !DISubroutineType(types: !904)
!904 = !{!857, !841, !798}
!905 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !783, file: !784, line: 84, size: 320, align: 64, elements: !906, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!906 = !{!907, !908, !909, !912, !913, !914, !915, !919, !922, !925, !928, !932, !933, !936, !939, !940, !941, !944, !947, !950, !955, !958}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !784, file: !784, baseType: !787, size: 64, flags: DIFlagArtificial)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 110, baseType: !698, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 111, baseType: !910, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !617, line: 153, baseType: !"_ZTS7__sFILE")
!912 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 113, baseType: !679, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 114, baseType: !679, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 115, baseType: !639, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!915 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 87, type: !916, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !918, !679, !679}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!919 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 88, type: !920, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !918}
!922 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 94, type: !923, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!923 = !DISubroutineType(types: !924)
!924 = !{!698, !918, !654, !679}
!925 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 95, type: !926, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!926 = !DISubroutineType(types: !927)
!927 = !{!698, !918}
!928 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 96, type: !929, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !918, !630, !798}
!931 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!932 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 97, type: !929, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!933 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 98, type: !934, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!934 = !DISubroutineType(types: !935)
!935 = !{!931, !918, !798, !679}
!936 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 100, type: !937, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!937 = !DISubroutineType(types: !938)
!938 = !{!679, !918}
!939 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 101, type: !937, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!940 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 102, type: !926, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!941 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 103, type: !942, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!942 = !DISubroutineType(types: !943)
!943 = !{!798, !918}
!944 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 104, type: !945, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!945 = !DISubroutineType(types: !946)
!946 = !{!931, !918}
!947 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 105, type: !948, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!948 = !DISubroutineType(types: !949)
!949 = !{!654, !918}
!950 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 107, type: !951, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!951 = !DISubroutineType(types: !952)
!952 = !{!630, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!955 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 108, type: !956, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!956 = !DISubroutineType(types: !957)
!957 = !{!698, !953}
!958 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !784, line: 112, type: !945, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !782, line: 57, size: 128, align: 64, elements: !960, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !782, line: 59, baseType: !798, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !782, line: 60, baseType: !604, size: 32, align: 32, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExprNodeStruct", scope: !5, file: !545, line: 72, size: 448, align: 64, elements: !964, identifier: "_ZTSN3pov14ExprNodeStructE")
!964 = !{!965, !967, !968, !969, !970, !971, !972}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 74, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov14ExprNodeStructE", size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 75, baseType: !966, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 76, baseType: !966, size: 64, align: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 77, baseType: !966, size: 64, align: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 78, baseType: !604, size: 32, align: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 79, baseType: !604, size: 32, align: 32, offset: 288)
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 80, baseType: !"_ZTSN3pov14ExprNodeStructUt_E", size: 128, align: 64, offset: 320)
!973 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14ExprNodeStructE", file: !545, line: 80, size: 128, align: 64, elements: !974, identifier: "_ZTSN3pov14ExprNodeStructUt_E")
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "variable", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !545, line: 82, baseType: !639, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !545, line: 88, baseType: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", size: 128, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "trap", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !545, line: 89, baseType: !679, size: 32, align: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !545, line: 90, baseType: !728, size: 64, align: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !545, line: 83, size: 128, align: 64, elements: !980, identifier: "_ZTSN3pov14ExprNodeStructUt_Ut_E")
!980 = !{!981, !982, !985}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !545, line: 85, baseType: !639, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !545, line: 86, baseType: !983, size: 32, align: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "TOKEN", scope: !5, file: !984, line: 1841, baseType: !604)
!984 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !545, line: 87, baseType: !722, size: 32, align: 32, offset: 96)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "__less<int, int>", scope: !988, file: !987, line: 699, size: 8, align: 8, elements: !991, templateParams: !999, identifier: "_ZTSNSt3__16__lessIiiEE")
!987 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/algorithm", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!988 = !DINamespace(name: "__1", scope: !990, file: !989, line: 369)
!989 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!990 = !DINamespace(name: "std", scope: null, file: !989, line: 368)
!991 = !{!992}
!992 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt3__16__lessIiiEclERKiS3_", scope: !"_ZTSNSt3__16__lessIiiEE", file: !987, line: 702, type: !993, isLocal: false, isDefinition: false, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true)
!993 = !DISubroutineType(types: !994)
!994 = !{!698, !995, !997, !997}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16__lessIiiEE")
!997 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!999 = !{!1000, !1001}
!1000 = !DITemplateTypeParameter(name: "_T1", type: !604)
!1001 = !DITemplateTypeParameter(name: "_T2", type: !604)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "__less<unsigned int, unsigned int>", scope: !988, file: !987, line: 699, size: 8, align: 8, elements: !1003, templateParams: !1010, identifier: "_ZTSNSt3__16__lessIjjEE")
!1003 = !{!1004}
!1004 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt3__16__lessIjjEclERKjS3_", scope: !"_ZTSNSt3__16__lessIjjEE", file: !987, line: 702, type: !1005, isLocal: false, isDefinition: false, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!698, !1007, !1009, !1009}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16__lessIjjEE")
!1009 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !842)
!1010 = !{!1011, !1012}
!1011 = !DITemplateTypeParameter(name: "_T1", type: !679)
!1012 = !DITemplateTypeParameter(name: "_T2", type: !679)
!1013 = !{!1014, !1023, !1029, !1032, !1037, !1044, !1050, !1055, !1062, !1067, !1079, !1089, !1104, !1120, !1136, !1144, !1150, !1157, !1160, !1164, !1171, !1179, !1183, !1191, !1200, !1206, !1210, !1215, !1223, !1232}
!1014 = !DISubprogram(name: "FNCode", linkageName: "_ZN3pov6FNCodeC2EPNS_12FunctionCodeEbPc", scope: !"_ZTSN3pov6FNCodeE", file: !1, line: 105, type: !695, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::FNCode"*, %"struct.pov::FunctionCode"*, i1, i8*)* @_ZN3pov6FNCodeC2EPNS_12FunctionCodeEbPc, declaration: !694, variables: !1015)
!1015 = !{!1016, !1018, !1019, !1020, !1021}
!1016 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !1014, type: !1017, flags: DIFlagArtificial | DIFlagObjectPointer)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov6FNCodeE", size: 64, align: 64)
!1018 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !1014, file: !1, line: 105, type: !687)
!1019 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_local", arg: 3, scope: !1014, file: !1, line: 105, type: !698)
