; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fnpovfpu.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Opcode" = type { i8*, i32, i32 }
%"struct.pov::FunctionEntry_Struct" = type { %"struct.pov::FunctionCode", i32 }
%"struct.pov::FunctionCode" = type { i32*, i32, i8, i8, i8, [56 x i32], [56 x i8*], [56 x i8*], i8*, i8*, %"struct.pov_base::ITextStream::FilePos", i32, i8* (i8*)*, void (i8*)*, i8* }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"struct.pov::FPUContext_Struct" = type { %"struct.pov::FPUContext_Struct"*, %"struct.pov::StackFrame_Struct"*, double*, i32 }
%"struct.pov::StackFrame_Struct" = type { i32, i32 }
%"struct.pov::Trap" = type { double (double*, i32)*, i32 }
%"struct.pov::TrapS" = type { void (double*, i32, i32)*, i32 }

@.str = private unnamed_addr constant [4 x i8] c"add\00", align 1
@.str1 = private unnamed_addr constant [4 x i8] c"sub\00", align 1
@.str2 = private unnamed_addr constant [4 x i8] c"mul\00", align 1
@.str3 = private unnamed_addr constant [4 x i8] c"div\00", align 1
@.str4 = private unnamed_addr constant [4 x i8] c"mod\00", align 1
@.str5 = private unnamed_addr constant [5 x i8] c"move\00", align 1
@.str6 = private unnamed_addr constant [4 x i8] c"cmp\00", align 1
@.str7 = private unnamed_addr constant [4 x i8] c"neg\00", align 1
@.str8 = private unnamed_addr constant [4 x i8] c"abs\00", align 1

!51 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43)
!52 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44)
!53 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45)
!54 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46)
!55 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47)
!56 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48)
!57 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49)
!58 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50)
!59 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51)
!60 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52)
!61 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53)
!62 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54)
!63 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!64 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!65 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!66 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!67 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!68 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!69 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!70 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!71 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!72 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!73 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!74 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!75 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!76 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!77 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!78 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!79 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!80 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!81 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!82 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!83 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!84 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!85 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!86 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!87 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!88 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!89 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!90 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!91 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!92 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!93 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!94 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!95 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!96 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!97 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!98 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!99 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!100 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!101 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!102 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!103 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!104 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!105 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!106 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!107 = !DIEnumerator(name: "Media_Samples", value: 99)
!108 = !DIEnumerator(name: "Media_Intervals", value: 100)
!109 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!110 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!111 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!112 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!113 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!114 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!115 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!116 = !DIEnumerator(name: "nChecked", value: 108)
!117 = !DIEnumerator(name: "nEnqueued", value: 109)
!118 = !DIEnumerator(name: "totalQueues", value: 110)
!119 = !DIEnumerator(name: "totalQueueResets", value: 111)
!120 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!121 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!122 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!123 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!124 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!125 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !{!136, !142, !147, !152, !207, !211, !212, !219, !225, !231, !262, !317, !387, !441, !445, !456, !454, !140, !166, !453, !215, !462, !464, !450, !3, !466}
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 82, size: 64, align: 32, elements: !138, identifier: "_ZTS5div_t")
!137 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !137, line: 83, baseType: !140, size: 32, align: 32)
!140 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !137, line: 84, baseType: !140, size: 32, align: 32, offset: 32)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 87, size: 128, align: 64, elements: !143, identifier: "_ZTS6ldiv_t")
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !137, line: 88, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !137, line: 89, baseType: !145, size: 64, align: 64, offset: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 93, size: 128, align: 64, elements: !148, identifier: "_ZTS7lldiv_t")
!148 = !{!149, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !137, line: 94, baseType: !150, size: 64, align: 64)
!150 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !137, line: 95, baseType: !150, size: 64, align: 64, offset: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !153, line: 122, size: 1216, align: 64, elements: !154, identifier: "_ZTS7__sFILE")
!153 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !{!155, !158, !159, !160, !162, !163, !164, !165, !167, !171, !177, !186, !192, !193, !195, !196, !200, !204, !205, !206}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !153, line: 123, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !153, line: 124, baseType: !140, size: 32, align: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !153, line: 125, baseType: !140, size: 32, align: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !153, line: 126, baseType: !161, size: 16, align: 16, offset: 128)
!161 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !153, line: 127, baseType: !161, size: 16, align: 16, offset: 144)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !153, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !153, line: 129, baseType: !140, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !153, line: 132, baseType: !166, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !153, line: 133, baseType: !168, size: 64, align: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!140, !166}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !153, line: 134, baseType: !172, size: 64, align: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!140, !166, !175, !140}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !153, line: 135, baseType: !178, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !166, !181, !140}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !153, line: 77, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !183, line: 71, baseType: !184)
!183 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !185, line: 46, baseType: !150)
!185 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !153, line: 136, baseType: !187, size: 64, align: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!140, !166, !190, !140}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !153, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !153, line: 140, baseType: !194, size: 64, align: 64, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !153, line: 141, baseType: !140, size: 32, align: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !153, line: 144, baseType: !197, size: 24, align: 8, offset: 928)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 24, align: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 3)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !153, line: 145, baseType: !201, size: 8, align: 8, offset: 952)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 8, align: 8, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 1)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !153, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !153, line: 151, baseType: !140, size: 32, align: 32, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !153, line: 152, baseType: !181, size: 64, align: 64, offset: 1152)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !153, line: 88, size: 128, align: 64, elements: !208, identifier: "_ZTS6__sbuf")
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !153, line: 89, baseType: !156, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !153, line: 90, baseType: !140, size: 32, align: 32, offset: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !153, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !213, identifier: "_ZTS13__va_list_tag")
!213 = !{!214, !216, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !215, size: 32, align: 32)
!215 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !215, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !166, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !166, size: 64, align: 64, offset: 128)
!219 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !220, line: 53, size: 128, align: 64, elements: !221, identifier: "_ZTSN3pov6OpcodeE")
!220 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fnpovfpu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov6OpcodeE", file: !220, line: 55, baseType: !175, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !"_ZTSN3pov6OpcodeE", file: !220, line: 56, baseType: !215, size: 32, align: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTSN3pov6OpcodeE", file: !220, line: 57, baseType: !140, size: 32, align: 32, offset: 96)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionEntry_Struct", scope: !5, file: !220, line: 96, size: 9664, align: 64, elements: !226, identifier: "_ZTSN3pov20FunctionEntry_StructE")
!226 = !{!227, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !"_ZTSN3pov20FunctionEntry_StructE", file: !220, line: 98, baseType: !228, size: 9600, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionCode", scope: !5, file: !229, line: 86, baseType: !"_ZTSN3pov12FunctionCodeE")
!229 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fncode.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !"_ZTSN3pov20FunctionEntry_StructE", file: !220, line: 99, baseType: !215, size: 32, align: 32, offset: 9600)
!231 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !229, line: 69, size: 9600, align: 64, elements: !232, identifier: "_ZTSN3pov12FunctionCodeE")
!232 = !{!233, !236, !237, !238, !239, !240, !244, !246, !247, !248, !249, !250, !251, !256, !261}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 71, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", scope: !5, file: !229, line: 67, baseType: !215)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "program_size", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 72, baseType: !215, size: 32, align: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "return_size", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 73, baseType: !157, size: 8, align: 8, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_cnt", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 74, baseType: !157, size: 8, align: 8, offset: 104)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_cnt", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 75, baseType: !157, size: 8, align: 8, offset: 112)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_pos", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 76, baseType: !241, size: 1792, align: 32, offset: 128)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 1792, align: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 56)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "localvar", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 77, baseType: !245, size: 3584, align: 64, offset: 1920)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 3584, align: 64, elements: !242)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 78, baseType: !245, size: 3584, align: 64, offset: 5504)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 79, baseType: !175, size: 64, align: 64, offset: 9088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 80, baseType: !175, size: 64, align: 64, offset: 9152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "filepos", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 81, baseType: !"_ZTSN8pov_base11ITextStream7FilePosE", size: 128, align: 64, offset: 9216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 82, baseType: !215, size: 32, align: 32, offset: 9344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "private_copy_method", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 83, baseType: !252, size: 64, align: 64, offset: 9408)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_COPY_METHOD", scope: !5, file: !229, line: 64, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!166, !166}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "private_destroy_method", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 84, baseType: !257, size: 64, align: 64, offset: 9472)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_DESTROY_METHOD", scope: !5, file: !229, line: 65, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !166}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !"_ZTSN3pov12FunctionCodeE", file: !229, line: 85, baseType: !166, size: 64, align: 64, offset: 9536)
!262 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !264, file: !263, line: 54, size: 4608, align: 64, elements: !266, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!263 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!264 = !DINamespace(name: "pov_base", scope: null, file: !265, line: 37)
!265 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!266 = !{!267, !272, !274, !278, !280, !281, !282, !283, !284, !285, !286, !290, !293, !296, !299, !302, !306, !309, !312, !313, !316}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !263, file: !263, baseType: !268, size: 64, flags: DIFlagArtificial)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!140}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 78, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 79, baseType: !275, size: 4096, align: 8, offset: 128)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 4096, align: 8, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 80, baseType: !279, size: 64, align: 64, offset: 4224)
!279 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 81, baseType: !279, size: 64, align: 64, offset: 4288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 82, baseType: !279, size: 64, align: 64, offset: 4352)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 83, baseType: !279, size: 64, align: 64, offset: 4416)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 84, baseType: !175, size: 64, align: 64, offset: 4480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 85, baseType: !140, size: 32, align: 32, offset: 4544)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 86, baseType: !140, size: 32, align: 32, offset: 4576)
!286 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 63, type: !287, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289, !190, !215}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!290 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 64, type: !291, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !289, !190, !273}
!293 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 65, type: !294, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !289}
!296 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 67, type: !297, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{!140, !289}
!299 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 68, type: !300, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !289, !140}
!302 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 70, type: !303, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !289}
!305 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!306 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 71, type: !307, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{!305, !289, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!309 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 72, type: !310, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!310 = !DISubroutineType(types: !311)
!311 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !289}
!312 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 74, type: !297, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!313 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 76, type: !314, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{!190, !289}
!316 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 88, type: !294, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!317 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !264, file: !265, line: 118, size: 320, align: 64, elements: !318, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!318 = !{!319, !320, !325, !328, !331, !332, !333, !336, !341, !345, !349, !354, !358, !362, !366, !370, !371, !372, !373, !374, !375, !376, !377, !378, !381, !384}
!319 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!320 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 121, type: !321, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !323, !324}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!325 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 122, type: !326, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !323}
!328 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 124, type: !329, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!140, !323}
!331 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 125, type: !329, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!332 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 126, type: !329, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 127, type: !334, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{!145, !323}
!336 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 128, type: !337, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !323, !340}
!339 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!340 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !176)
!341 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 129, type: !342, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{!339, !323, !344}
!344 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !157)
!345 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 130, type: !346, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!339, !323, !348}
!348 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !161)
!349 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 131, type: !350, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{!339, !323, !352}
!352 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !353)
!353 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!354 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 132, type: !355, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!339, !323, !357}
!357 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !140)
!358 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 133, type: !359, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!339, !323, !361}
!361 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !215)
!362 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 134, type: !363, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{!339, !323, !365}
!365 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !145)
!366 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 135, type: !367, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!367 = !DISubroutineType(types: !368)
!368 = !{!339, !323, !369}
!369 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !279)
!370 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 137, type: !363, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!371 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 138, type: !355, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 139, type: !346, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 140, type: !337, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!374 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 141, type: !367, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!375 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 142, type: !359, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 143, type: !350, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!377 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 144, type: !342, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!378 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 145, type: !379, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!339, !323, !140}
!381 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 146, type: !382, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!339, !323, !175, !279}
!384 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !265, line: 147, type: !385, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!339, !323, !279}
!387 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !264, file: !265, line: 84, size: 320, align: 64, elements: !388, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!388 = !{!389, !390, !391, !394, !395, !396, !397, !401, !404, !407, !410, !414, !415, !418, !421, !422, !423, !426, !429, !432, !437, !440}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !265, file: !265, baseType: !268, size: 64, flags: DIFlagArtificial)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 110, baseType: !305, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 111, baseType: !392, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !153, line: 153, baseType: !"_ZTS7__sFILE")
!394 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 113, baseType: !215, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 114, baseType: !215, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 115, baseType: !175, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!397 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 87, type: !398, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400, !215, !215}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!401 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 88, type: !402, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !400}
!404 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 94, type: !405, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{!305, !400, !190, !215}
!407 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 95, type: !408, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{!305, !400}
!410 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 96, type: !411, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{!413, !400, !166, !279}
!413 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!414 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 97, type: !411, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!415 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 98, type: !416, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{!413, !400, !279, !215}
!418 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 100, type: !419, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{!215, !400}
!421 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 101, type: !419, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!422 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 102, type: !408, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 103, type: !424, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{!279, !400}
!426 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 104, type: !427, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!427 = !DISubroutineType(types: !428)
!428 = !{!413, !400}
!429 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 105, type: !430, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{!190, !400}
!432 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 107, type: !433, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{!166, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!437 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 108, type: !438, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{!305, !435}
!440 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !265, line: 112, type: !427, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !263, line: 57, size: 128, align: 64, elements: !442, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !263, line: 59, baseType: !279, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !263, line: 60, baseType: !140, size: 32, align: 32, offset: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "FPUContext_Struct", scope: !5, file: !220, line: 113, size: 256, align: 64, elements: !446, identifier: "_ZTSN3pov17FPUContext_StructE")
!446 = !{!447, !449, !452, !455}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov17FPUContext_StructE", file: !220, line: 115, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov17FPUContext_StructE", size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pstackbase", scope: !"_ZTSN3pov17FPUContext_StructE", file: !220, line: 116, baseType: !450, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackFrame", scope: !5, file: !220, line: 109, baseType: !"_ZTSN3pov17StackFrame_StructE")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dblstackbase", scope: !"_ZTSN3pov17FPUContext_StructE", file: !220, line: 117, baseType: !453, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "maxdblstacksize", scope: !"_ZTSN3pov17FPUContext_StructE", file: !220, line: 118, baseType: !215, size: 32, align: 32, offset: 192)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "StackFrame_Struct", scope: !5, file: !220, line: 105, size: 64, align: 32, elements: !457, identifier: "_ZTSN3pov17StackFrame_StructE")
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !"_ZTSN3pov17StackFrame_StructE", file: !220, line: 107, baseType: !215, size: 32, align: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !"_ZTSN3pov17StackFrame_StructE", file: !220, line: 108, baseType: !460, size: 32, align: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !5, file: !461, line: 40, baseType: !215)
!461 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/function.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionEntry", scope: !5, file: !220, line: 101, baseType: !"_ZTSN3pov20FunctionEntry_StructE")
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPUContext", scope: !5, file: !220, line: 122, baseType: !"_ZTSN3pov17FPUContext_StructE")
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "__less<unsigned int, unsigned int>", scope: !468, file: !467, line: 699, size: 8, align: 8, elements: !471, templateParams: !478, identifier: "_ZTSNSt3__16__lessIjjEE")
!467 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/algorithm", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!468 = !DINamespace(name: "__1", scope: !470, file: !469, line: 369)
!469 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!470 = !DINamespace(name: "std", scope: null, file: !469, line: 368)
!471 = !{!472}
!472 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt3__16__lessIjjEclERKjS3_", scope: !"_ZTSNSt3__16__lessIjjEE", file: !467, line: 702, type: !473, isLocal: false, isDefinition: false, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true)
!473 = !DISubroutineType(types: !474)
!474 = !{!305, !475, !477, !477}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16__lessIjjEE")
!477 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !324)
!478 = !{!479, !480}
!479 = !DITemplateTypeParameter(name: "_T1", type: !215)
!480 = !DITemplateTypeParameter(name: "_T2", type: !215)
!481 = !{!482, !487, !493, !497, !498, !504, !510, !515, !519, !522, !528, !531, !537, !543, !554, !560, !565, !571, !593, !601, !609, !618}
!482 = !DISubprogram(name: "math_int", linkageName: "_ZN3pov8math_intEd", scope: !5, file: !1, line: 534, type: !483, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @_ZN3pov8math_intEd, variables: !485)
!483 = !DISubroutineType(types: !484)
!484 = !{!454, !454}
!485 = !{!486}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 1, scope: !482, file: !1, line: 534, type: !454)
!487 = !DISubprogram(name: "math_div", linkageName: "_ZN3pov8math_divEdd", scope: !5, file: !1, line: 566, type: !488, isLocal: false, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: double (double, double)* @_ZN3pov8math_divEdd, variables: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{!454, !454, !454}
!490 = !{!491, !492}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i1", arg: 1, scope: !487, file: !1, line: 566, type: !454)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i2", arg: 2, scope: !487, file: !1, line: 566, type: !454)
!493 = !DISubprogram(name: "POVFPU_Init", linkageName: "_ZN3pov11POVFPU_InitEv", scope: !5, file: !1, line: 598, type: !494, isLocal: false, isDefinition: true, scopeLine: 599, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov11POVFPU_InitEv, variables: !496)
