; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fnsyntax.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::ExprParserTableEntry" = type { i32, i32, i1 (%"struct.pov::ExprNodeStruct"**, i32, i32)*, i32, i32 }
%"struct.pov::ExprNodeStruct" = type { %"struct.pov::ExprNodeStruct"*, %"struct.pov::ExprNodeStruct"*, %"struct.pov::ExprNodeStruct"*, %"struct.pov::ExprNodeStruct"*, i32, i32, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i8*, i32, i32 }
%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!480 = !DIEnumerator(name: "DENSITY_MAP_TOKEN", value: 445)
!481 = !DIEnumerator(name: "DENSITY_MAP_ID_TOKEN", value: 446)
!482 = !DIEnumerator(name: "REFLECTION_EXPONENT_TOKEN", value: 447)
!483 = !DIEnumerator(name: "DF3_TOKEN", value: 448)
!484 = !DIEnumerator(name: "EXTINCTION_TOKEN", value: 449)
!485 = !DIEnumerator(name: "MATERIAL_TOKEN", value: 450)
!486 = !DIEnumerator(name: "MATERIAL_ID_TOKEN", value: 451)
!487 = !DIEnumerator(name: "UV_ID_TOKEN", value: 452)
!488 = !DIEnumerator(name: "VECTOR_4D_ID_TOKEN", value: 453)
!489 = !DIEnumerator(name: "UV_MAPPING_TOKEN", value: 454)
!490 = !DIEnumerator(name: "UV_VECTORS_TOKEN", value: 455)
!491 = !DIEnumerator(name: "MESH2_TOKEN", value: 456)
!492 = !DIEnumerator(name: "VERTEX_VECTORS_TOKEN", value: 457)
!493 = !DIEnumerator(name: "NORMAL_VECTORS_TOKEN", value: 458)
!494 = !DIEnumerator(name: "FACE_INDICES_TOKEN", value: 459)
!495 = !DIEnumerator(name: "NORMAL_INDICES_TOKEN", value: 460)
!496 = !DIEnumerator(name: "UV_INDICES_TOKEN", value: 461)
!497 = !DIEnumerator(name: "TEXTURE_LIST_TOKEN", value: 462)
!498 = !DIEnumerator(name: "IMAGE_PATTERN_TOKEN", value: 463)
!499 = !DIEnumerator(name: "USE_ALPHA_TOKEN", value: 464)
!500 = !DIEnumerator(name: "DOUBLE_ILLUMINATE_TOKEN", value: 465)
!501 = !DIEnumerator(name: "INSIDE_VECTOR_TOKEN", value: 466)
!502 = !DIEnumerator(name: "PHOTONS_TOKEN", value: 467)
!503 = !DIEnumerator(name: "STEPS_TOKEN", value: 468)
!504 = !DIEnumerator(name: "PASS_THROUGH_TOKEN", value: 469)
!505 = !DIEnumerator(name: "COLLECT_TOKEN", value: 470)
!506 = !DIEnumerator(name: "AUTOSTOP_TOKEN", value: 471)
!507 = !DIEnumerator(name: "GATHER_TOKEN", value: 472)
!508 = !DIEnumerator(name: "SPLIT_UNION_TOKEN", value: 473)
!509 = !DIEnumerator(name: "EXPAND_THRESHOLDS_TOKEN", value: 474)
!510 = !DIEnumerator(name: "SPACING_TOKEN", value: 475)
!511 = !DIEnumerator(name: "TARGET_TOKEN", value: 476)
!512 = !DIEnumerator(name: "PARAMETRIC_TOKEN", value: 477)
!513 = !DIEnumerator(name: "PRECOMPUTE_TOKEN", value: 478)
!514 = !DIEnumerator(name: "CONTAINED_BY_TOKEN", value: 479)
!515 = !DIEnumerator(name: "ISOSURFACE_TOKEN", value: 480)
!516 = !DIEnumerator(name: "METHOD_TOKEN", value: 481)
!517 = !DIEnumerator(name: "ACCURACY_TOKEN", value: 482)
!518 = !DIEnumerator(name: "MAX_GRADIENT_TOKEN", value: 483)
!519 = !DIEnumerator(name: "MAX_TRACE_TOKEN", value: 484)
!520 = !DIEnumerator(name: "FUNCTION_TOKEN", value: 485)
!521 = !DIEnumerator(name: "EVALUATE_TOKEN", value: 486)
!522 = !DIEnumerator(name: "FUNCT_ID_TOKEN", value: 487)
!523 = !DIEnumerator(name: "VECTFUNCT_ID_TOKEN", value: 488)
!524 = !DIEnumerator(name: "ALL_INTERSECTIONS_TOKEN", value: 489)
!525 = !DIEnumerator(name: "DISPERSION_TOKEN", value: 490)
!526 = !DIEnumerator(name: "DISPERSION_SAMPLES_TOKEN", value: 491)
!527 = !DIEnumerator(name: "ORIENT_TOKEN", value: 492)
!528 = !DIEnumerator(name: "CIRCULAR_TOKEN", value: 493)
!529 = !DIEnumerator(name: "NO_IMAGE_TOKEN", value: 494)
!530 = !DIEnumerator(name: "NO_REFLECTION_TOKEN", value: 495)
!531 = !DIEnumerator(name: "LIGHT_GROUP_TOKEN", value: 496)
!532 = !DIEnumerator(name: "NATURAL_SPLINE_TOKEN", value: 497)
!533 = !DIEnumerator(name: "B_SPLINE_TOKEN", value: 498)
!534 = !DIEnumerator(name: "TOLERANCE_TOKEN", value: 499)
!535 = !DIEnumerator(name: "PROJECTED_THROUGH_TOKEN", value: 500)
!536 = !DIEnumerator(name: "PARALLEL_TOKEN", value: 501)
!537 = !DIEnumerator(name: "SPHERE_SWEEP_TOKEN", value: 502)
!538 = !DIEnumerator(name: "SPLINE_TOKEN", value: 503)
!539 = !DIEnumerator(name: "SPLINE_ID_TOKEN", value: 504)
!540 = !DIEnumerator(name: "PATTERN_TOKEN", value: 505)
!541 = !DIEnumerator(name: "FACETS_TOKEN", value: 506)
!542 = !DIEnumerator(name: "SLOPE_TOKEN", value: 507)
!543 = !DIEnumerator(name: "SOLID_TOKEN", value: 508)
!544 = !DIEnumerator(name: "COORDS_TOKEN", value: 509)
!545 = !DIEnumerator(name: "SIZE_TOKEN", value: 510)
!546 = !DIEnumerator(name: "METRIC_TOKEN", value: 511)
!547 = !DIEnumerator(name: "FORM_TOKEN", value: 512)
!548 = !DIEnumerator(name: "ORIENTATION_TOKEN", value: 513)
!549 = !DIEnumerator(name: "TOROIDAL_TOKEN", value: 514)
!550 = !DIEnumerator(name: "DIST_EXP_TOKEN", value: 515)
!551 = !DIEnumerator(name: "MAJOR_RADIUS_TOKEN", value: 516)
!552 = !DIEnumerator(name: "JPEG_TOKEN", value: 517)
!553 = !DIEnumerator(name: "AA_THRESHOLD_TOKEN", value: 518)
!554 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519)
!555 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520)
!556 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521)
!557 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522)
!558 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523)
!559 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524)
!560 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525)
!561 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526)
!562 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527)
!563 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528)
!564 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529)
!565 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530)
!566 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531)
!567 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532)
!568 = !DIEnumerator(name: "JULIA_TOKEN", value: 533)
!569 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534)
!570 = !DIEnumerator(name: "LAST_TOKEN", value: 535)
!571 = !{!572, !578, !583, !588, !643, !647, !648, !655, !665, !672, !602, !32, !681, !682, !684, !671, !576, !686, !687, !699}
!572 = !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 82, size: 64, align: 32, elements: !574, identifier: "_ZTS5div_t")
!573 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!574 = !{!575, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !573, line: 83, baseType: !576, size: 32, align: 32)
!576 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !573, line: 84, baseType: !576, size: 32, align: 32, offset: 32)
!578 = !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 87, size: 128, align: 64, elements: !579, identifier: "_ZTS6ldiv_t")
!579 = !{!580, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !573, line: 88, baseType: !581, size: 64, align: 64)
!581 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !573, line: 89, baseType: !581, size: 64, align: 64, offset: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 93, size: 128, align: 64, elements: !584, identifier: "_ZTS7lldiv_t")
!584 = !{!585, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !573, line: 94, baseType: !586, size: 64, align: 64)
!586 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !573, line: 95, baseType: !586, size: 64, align: 64, offset: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !589, line: 122, size: 1216, align: 64, elements: !590, identifier: "_ZTS7__sFILE")
!589 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!590 = !{!591, !594, !595, !596, !598, !599, !600, !601, !603, !607, !613, !622, !628, !629, !631, !632, !636, !640, !641, !642}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !589, line: 123, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !589, line: 124, baseType: !576, size: 32, align: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !589, line: 125, baseType: !576, size: 32, align: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !589, line: 126, baseType: !597, size: 16, align: 16, offset: 128)
!597 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !589, line: 127, baseType: !597, size: 16, align: 16, offset: 144)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !589, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !589, line: 129, baseType: !576, size: 32, align: 32, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !589, line: 132, baseType: !602, size: 64, align: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !589, line: 133, baseType: !604, size: 64, align: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!576, !602}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !589, line: 134, baseType: !608, size: 64, align: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!576, !602, !611, !576}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !589, line: 135, baseType: !614, size: 64, align: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !602, !617, !576}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !589, line: 77, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !619, line: 71, baseType: !620)
!619 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !621, line: 46, baseType: !586)
!621 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !589, line: 136, baseType: !623, size: 64, align: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!576, !602, !626, !576}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !589, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !589, line: 140, baseType: !630, size: 64, align: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !589, line: 141, baseType: !576, size: 32, align: 32, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !589, line: 144, baseType: !633, size: 24, align: 8, offset: 928)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 24, align: 8, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 3)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !589, line: 145, baseType: !637, size: 8, align: 8, offset: 952)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 8, align: 8, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 1)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !589, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !589, line: 151, baseType: !576, size: 32, align: 32, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !589, line: 152, baseType: !617, size: 64, align: 64, offset: 1152)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !589, line: 88, size: 128, align: 64, elements: !644, identifier: "_ZTS6__sbuf")
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !589, line: 89, baseType: !592, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !589, line: 90, baseType: !576, size: 32, align: 32, offset: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !589, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !649, identifier: "_ZTS13__va_list_tag")
!649 = !{!650, !652, !653, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !651, size: 32, align: 32)
!651 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !651, size: 32, align: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !602, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !602, size: 64, align: 64, offset: 128)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExprNodeStruct", scope: !5, file: !4, line: 72, size: 448, align: 64, elements: !656, identifier: "_ZTSN3pov14ExprNodeStructE")
!656 = !{!657, !659, !660, !661, !662, !663, !664}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 74, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov14ExprNodeStructE", size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 75, baseType: !658, size: 64, align: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 76, baseType: !658, size: 64, align: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 77, baseType: !658, size: 64, align: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 78, baseType: !576, size: 32, align: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 79, baseType: !576, size: 32, align: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 80, baseType: !"_ZTSN3pov14ExprNodeStructUt_E", size: 128, align: 64, offset: 320)
!665 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14ExprNodeStructE", file: !4, line: 80, size: 128, align: 64, elements: !666, identifier: "_ZTSN3pov14ExprNodeStructUt_E")
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "variable", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !4, line: 82, baseType: !611, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !4, line: 88, baseType: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", size: 128, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "trap", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !4, line: 89, baseType: !651, size: 32, align: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !4, line: 90, baseType: !671, size: 64, align: 64)
!671 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!672 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !4, line: 83, size: 128, align: 64, elements: !673, identifier: "_ZTSN3pov14ExprNodeStructUt_Ut_E")
!673 = !{!674, !675, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !4, line: 85, baseType: !611, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !4, line: 86, baseType: !676, size: 32, align: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "TOKEN", scope: !5, file: !677, line: 1841, baseType: !576)
!677 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !4, line: 87, baseType: !679, size: 32, align: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !5, file: !680, line: 40, baseType: !651)
!680 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/function.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExprNode", scope: !5, file: !4, line: 92, baseType: !"_ZTSN3pov14ExprNodeStructE")
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION_PTR", scope: !5, file: !680, line: 41, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!686 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!687 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !1, line: 75, size: 192, align: 64, elements: !688, identifier: "_ZTSN3pov20ExprParserTableEntryE")
!688 = !{!689, !690, !691, !697, !698}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !"_ZTSN3pov20ExprParserTableEntryE", file: !1, line: 77, baseType: !576, size: 32, align: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !"_ZTSN3pov20ExprParserTableEntryE", file: !1, line: 78, baseType: !676, size: 32, align: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "operation", scope: !"_ZTSN3pov20ExprParserTableEntryE", file: !1, line: 79, baseType: !692, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !696, !576, !576}
!695 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!696 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !682)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov20ExprParserTableEntryE", file: !1, line: 80, baseType: !576, size: 32, align: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !"_ZTSN3pov20ExprParserTableEntryE", file: !1, line: 81, baseType: !576, size: 32, align: 32, offset: 160)
!699 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !1, line: 84, size: 128, align: 64, elements: !700, identifier: "_ZTSN3pov20ExprParserErrorEntryE")
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !"_ZTSN3pov20ExprParserErrorEntryE", file: !1, line: 86, baseType: !576, size: 32, align: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !"_ZTSN3pov20ExprParserErrorEntryE", file: !1, line: 87, baseType: !611, size: 64, align: 64, offset: 64)
!703 = !{!704, !709, !715, !723, !730, !734, !741, !746, !756, !762, !768, !774, !779, !785, !796, !801, !808, !813}
!704 = !DISubprogram(name: "FNSyntax_ParseExpression", linkageName: "_ZN3pov24FNSyntax_ParseExpressionEv", scope: !5, file: !1, line: 191, type: !705, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: %"struct.pov::ExprNodeStruct"* ()* @_ZN3pov24FNSyntax_ParseExpressionEv, variables: !707)
!705 = !DISubroutineType(types: !706)
!706 = !{!682}
!707 = !{!708}
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "expression", scope: !704, file: !1, line: 193, type: !682)
!709 = !DISubprogram(name: "FNSyntax_GetTrapExpression", linkageName: "_ZN3pov26FNSyntax_GetTrapExpressionEj", scope: !5, file: !1, line: 232, type: !710, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: %"struct.pov::ExprNodeStruct"* (i32)* @_ZN3pov26FNSyntax_GetTrapExpressionEj, variables: !712)
!710 = !DISubroutineType(types: !711)
!711 = !{!682, !651}
!712 = !{!713, !714}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trap", arg: 1, scope: !709, file: !1, line: 232, type: !651)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "expression", scope: !709, file: !1, line: 234, type: !682)
!715 = !DISubprogram(name: "FNSyntax_DeleteExpression", linkageName: "_ZN3pov25FNSyntax_DeleteExpressionEPNS_14ExprNodeStructE", scope: !5, file: !1, line: 271, type: !716, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, function: void (%"struct.pov::ExprNodeStruct"*)* @_ZN3pov25FNSyntax_DeleteExpressionEPNS_14ExprNodeStructE, variables: !718)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !682}
!718 = !{!719, !720, !721}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !715, file: !1, line: 271, type: !682)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !715, file: !1, line: 273, type: !682)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !722, file: !1, line: 275, type: !682)
!722 = distinct !DILexicalBlock(scope: !715, file: !1, line: 275, column: 2)
!723 = !DISubprogram(name: "parse_expr", linkageName: "_ZN3pov10parse_exprEv", scope: !5, file: !1, line: 333, type: !705, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, function: %"struct.pov::ExprNodeStruct"* ()* @_ZN3pov10parse_exprEv, variables: !724)
!724 = !{!725, !726, !727, !728, !729}
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !723, file: !1, line: 335, type: !682)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !723, file: !1, line: 336, type: !682)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "token", scope: !723, file: !1, line: 337, type: !676)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_index", scope: !723, file: !1, line: 338, type: !576)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !723, file: !1, line: 339, type: !576)
!730 = !DISubprogram(name: "expr_get_token", linkageName: "_ZN3pov14expr_get_tokenEv", scope: !5, file: !1, line: 406, type: !731, isLocal: false, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_ZN3pov14expr_get_tokenEv, variables: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!676}
!733 = !{}
!734 = !DISubprogram(name: "new_expr_node", linkageName: "_ZN3pov13new_expr_nodeEii", scope: !5, file: !1, line: 495, type: !735, isLocal: false, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, function: %"struct.pov::ExprNodeStruct"* (i32, i32)* @_ZN3pov13new_expr_nodeEii, variables: !737)
!735 = !DISubroutineType(types: !736)
