; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/function.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"struct.pov::FunctionCode" = type { i32*, i32, i8, i8, i8, [56 x i32], [56 x i8*], [56 x i8*], i8*, i8*, %"struct.pov_base::ITextStream::FilePos", i32, i8* (i8*)*, void (i8*)*, i8* }
%"class.pov::FNCode" = type <{ %"struct.pov::FunctionCode"*, i32, i32, i32, i32, i32, [4 x i8] }>
%"struct.pov::ExprNodeStruct" = type { %"struct.pov::ExprNodeStruct"*, %"struct.pov::ExprNodeStruct"*, %"struct.pov::ExprNodeStruct"*, %"struct.pov::ExprNodeStruct"*, i32, i32, %union.anon }

!461 = !DIEnumerator(name: "VECTOR_4D_ID_TOKEN", value: 453)
!462 = !DIEnumerator(name: "UV_MAPPING_TOKEN", value: 454)
!463 = !DIEnumerator(name: "UV_VECTORS_TOKEN", value: 455)
!464 = !DIEnumerator(name: "MESH2_TOKEN", value: 456)
!465 = !DIEnumerator(name: "VERTEX_VECTORS_TOKEN", value: 457)
!466 = !DIEnumerator(name: "NORMAL_VECTORS_TOKEN", value: 458)
!467 = !DIEnumerator(name: "FACE_INDICES_TOKEN", value: 459)
!468 = !DIEnumerator(name: "NORMAL_INDICES_TOKEN", value: 460)
!469 = !DIEnumerator(name: "UV_INDICES_TOKEN", value: 461)
!470 = !DIEnumerator(name: "TEXTURE_LIST_TOKEN", value: 462)
!471 = !DIEnumerator(name: "IMAGE_PATTERN_TOKEN", value: 463)
!472 = !DIEnumerator(name: "USE_ALPHA_TOKEN", value: 464)
!473 = !DIEnumerator(name: "DOUBLE_ILLUMINATE_TOKEN", value: 465)
!474 = !DIEnumerator(name: "INSIDE_VECTOR_TOKEN", value: 466)
!475 = !DIEnumerator(name: "PHOTONS_TOKEN", value: 467)
!476 = !DIEnumerator(name: "STEPS_TOKEN", value: 468)
!477 = !DIEnumerator(name: "PASS_THROUGH_TOKEN", value: 469)
!478 = !DIEnumerator(name: "COLLECT_TOKEN", value: 470)
!479 = !DIEnumerator(name: "AUTOSTOP_TOKEN", value: 471)
!480 = !DIEnumerator(name: "GATHER_TOKEN", value: 472)
!481 = !DIEnumerator(name: "SPLIT_UNION_TOKEN", value: 473)
!482 = !DIEnumerator(name: "EXPAND_THRESHOLDS_TOKEN", value: 474)
!483 = !DIEnumerator(name: "SPACING_TOKEN", value: 475)
!484 = !DIEnumerator(name: "TARGET_TOKEN", value: 476)
!485 = !DIEnumerator(name: "PARAMETRIC_TOKEN", value: 477)
!486 = !DIEnumerator(name: "PRECOMPUTE_TOKEN", value: 478)
!487 = !DIEnumerator(name: "CONTAINED_BY_TOKEN", value: 479)
!488 = !DIEnumerator(name: "ISOSURFACE_TOKEN", value: 480)
!489 = !DIEnumerator(name: "METHOD_TOKEN", value: 481)
!490 = !DIEnumerator(name: "ACCURACY_TOKEN", value: 482)
!491 = !DIEnumerator(name: "MAX_GRADIENT_TOKEN", value: 483)
!492 = !DIEnumerator(name: "MAX_TRACE_TOKEN", value: 484)
!493 = !DIEnumerator(name: "FUNCTION_TOKEN", value: 485)
!494 = !DIEnumerator(name: "EVALUATE_TOKEN", value: 486)
!495 = !DIEnumerator(name: "FUNCT_ID_TOKEN", value: 487)
!496 = !DIEnumerator(name: "VECTFUNCT_ID_TOKEN", value: 488)
!497 = !DIEnumerator(name: "ALL_INTERSECTIONS_TOKEN", value: 489)
!498 = !DIEnumerator(name: "DISPERSION_TOKEN", value: 490)
!499 = !DIEnumerator(name: "DISPERSION_SAMPLES_TOKEN", value: 491)
!500 = !DIEnumerator(name: "ORIENT_TOKEN", value: 492)
!501 = !DIEnumerator(name: "CIRCULAR_TOKEN", value: 493)
!502 = !DIEnumerator(name: "NO_IMAGE_TOKEN", value: 494)
!503 = !DIEnumerator(name: "NO_REFLECTION_TOKEN", value: 495)
!504 = !DIEnumerator(name: "LIGHT_GROUP_TOKEN", value: 496)
!505 = !DIEnumerator(name: "NATURAL_SPLINE_TOKEN", value: 497)
!506 = !DIEnumerator(name: "B_SPLINE_TOKEN", value: 498)
!507 = !DIEnumerator(name: "TOLERANCE_TOKEN", value: 499)
!508 = !DIEnumerator(name: "PROJECTED_THROUGH_TOKEN", value: 500)
!509 = !DIEnumerator(name: "PARALLEL_TOKEN", value: 501)
!510 = !DIEnumerator(name: "SPHERE_SWEEP_TOKEN", value: 502)
!511 = !DIEnumerator(name: "SPLINE_TOKEN", value: 503)
!512 = !DIEnumerator(name: "SPLINE_ID_TOKEN", value: 504)
!513 = !DIEnumerator(name: "PATTERN_TOKEN", value: 505)
!514 = !DIEnumerator(name: "FACETS_TOKEN", value: 506)
!515 = !DIEnumerator(name: "SLOPE_TOKEN", value: 507)
!516 = !DIEnumerator(name: "SOLID_TOKEN", value: 508)
!517 = !DIEnumerator(name: "COORDS_TOKEN", value: 509)
!518 = !DIEnumerator(name: "SIZE_TOKEN", value: 510)
!519 = !DIEnumerator(name: "METRIC_TOKEN", value: 511)
!520 = !DIEnumerator(name: "FORM_TOKEN", value: 512)
!521 = !DIEnumerator(name: "ORIENTATION_TOKEN", value: 513)
!522 = !DIEnumerator(name: "TOROIDAL_TOKEN", value: 514)
!523 = !DIEnumerator(name: "DIST_EXP_TOKEN", value: 515)
!524 = !DIEnumerator(name: "MAJOR_RADIUS_TOKEN", value: 516)
!525 = !DIEnumerator(name: "JPEG_TOKEN", value: 517)
!526 = !DIEnumerator(name: "AA_THRESHOLD_TOKEN", value: 518)
!527 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519)
!528 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520)
!529 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521)
!530 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522)
!531 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523)
!532 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524)
!533 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525)
!534 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526)
!535 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527)
!536 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528)
!537 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529)
!538 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530)
!539 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531)
!540 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532)
!541 = !DIEnumerator(name: "JULIA_TOKEN", value: 533)
!542 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534)
!543 = !DIEnumerator(name: "LAST_TOKEN", value: 535)
!544 = !{!545, !551, !556, !561, !616, !620, !621, !575, !628, !632, !643, !650, !657, !689, !744, !814, !868, !872, !3, !624, !679, !684, !934, !952, !957, !959, !982, !987, !1000, !1009, !1014, !1031, !1046, !1072, !1078, !1087, !1094, !1117, !1124, !1136, !1142, !1148, !1152, !1156, !1161, !1172, !1182, !1191, !1195, !1220, !1272, !1282, !1297, !1325, !1333, !1354, !1362, !1383, !1401, !1405, !1409, !1414, !1424, !1434, !1443, !1447, !1474, !1528, !1535, !1546, !1553, !1559, !1577, !1581, !1585, !1590, !1600, !1610, !1619, !1623, !1641, !1645, !1649, !1654, !1664, !1674, !1683, !1687, !1018, !973}
!545 = !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 82, size: 64, align: 32, elements: !547, identifier: "_ZTS5div_t")
!546 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!547 = !{!548, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !546, line: 83, baseType: !549, size: 32, align: 32)
!549 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !546, line: 84, baseType: !549, size: 32, align: 32, offset: 32)
!551 = !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 87, size: 128, align: 64, elements: !552, identifier: "_ZTS6ldiv_t")
!552 = !{!553, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !546, line: 88, baseType: !554, size: 64, align: 64)
!554 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !546, line: 89, baseType: !554, size: 64, align: 64, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 93, size: 128, align: 64, elements: !557, identifier: "_ZTS7lldiv_t")
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !546, line: 94, baseType: !559, size: 64, align: 64)
!559 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !546, line: 95, baseType: !559, size: 64, align: 64, offset: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !562, line: 122, size: 1216, align: 64, elements: !563, identifier: "_ZTS7__sFILE")
!562 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!563 = !{!564, !567, !568, !569, !571, !572, !573, !574, !576, !580, !586, !595, !601, !602, !604, !605, !609, !613, !614, !615}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !562, line: 123, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !562, line: 124, baseType: !549, size: 32, align: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !562, line: 125, baseType: !549, size: 32, align: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !562, line: 126, baseType: !570, size: 16, align: 16, offset: 128)
!570 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !562, line: 127, baseType: !570, size: 16, align: 16, offset: 144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !562, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !562, line: 129, baseType: !549, size: 32, align: 32, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !562, line: 132, baseType: !575, size: 64, align: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !562, line: 133, baseType: !577, size: 64, align: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!549, !575}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !562, line: 134, baseType: !581, size: 64, align: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!549, !575, !584, !549}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !562, line: 135, baseType: !587, size: 64, align: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !575, !590, !549}
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !562, line: 77, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !592, line: 71, baseType: !593)
!592 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !594, line: 46, baseType: !559)
!594 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !562, line: 136, baseType: !596, size: 64, align: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!549, !575, !599, !549}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !562, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !562, line: 140, baseType: !603, size: 64, align: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !562, line: 141, baseType: !549, size: 32, align: 32, offset: 896)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !562, line: 144, baseType: !606, size: 24, align: 8, offset: 928)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 24, align: 8, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 3)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !562, line: 145, baseType: !610, size: 8, align: 8, offset: 952)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 8, align: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 1)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !562, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !562, line: 151, baseType: !549, size: 32, align: 32, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !562, line: 152, baseType: !590, size: 64, align: 64, offset: 1152)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !562, line: 88, size: 128, align: 64, elements: !617, identifier: "_ZTS6__sbuf")
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !562, line: 89, baseType: !565, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !562, line: 90, baseType: !549, size: 32, align: 32, offset: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !562, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !622, identifier: "_ZTS13__va_list_tag")
!622 = !{!623, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !624, size: 32, align: 32)
!624 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !624, size: 32, align: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !575, size: 64, align: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !575, size: 64, align: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION_PTR", scope: !5, file: !629, line: 41, baseType: !630)
!629 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/function.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !5, file: !629, line: 40, baseType: !624)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExprNodeStruct", scope: !5, file: !633, line: 72, size: 448, align: 64, elements: !634, identifier: "_ZTSN3pov14ExprNodeStructE")
!633 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fnsyntax.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!634 = !{!635, !637, !638, !639, !640, !641, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 74, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov14ExprNodeStructE", size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 75, baseType: !636, size: 64, align: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 76, baseType: !636, size: 64, align: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 77, baseType: !636, size: 64, align: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 78, baseType: !549, size: 32, align: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 79, baseType: !549, size: 32, align: 32, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 80, baseType: !"_ZTSN3pov14ExprNodeStructUt_E", size: 128, align: 64, offset: 320)
!643 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14ExprNodeStructE", file: !633, line: 80, size: 128, align: 64, elements: !644, identifier: "_ZTSN3pov14ExprNodeStructUt_E")
!644 = !{!645, !646, !647, !648}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "variable", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !633, line: 82, baseType: !584, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !633, line: 88, baseType: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", size: 128, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "trap", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !633, line: 89, baseType: !624, size: 32, align: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !633, line: 90, baseType: !649, size: 64, align: 64)
!649 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!650 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14ExprNodeStructUt_E", file: !633, line: 83, size: 128, align: 64, elements: !651, identifier: "_ZTSN3pov14ExprNodeStructUt_Ut_E")
!651 = !{!652, !653, !656}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !633, line: 85, baseType: !584, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !633, line: 86, baseType: !654, size: 32, align: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "TOKEN", scope: !5, file: !655, line: 1841, baseType: !549)
!655 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !"_ZTSN3pov14ExprNodeStructUt_Ut_E", file: !633, line: 87, baseType: !631, size: 32, align: 32, offset: 96)
!657 = !DICompositeType(tag: DW_TAG_structure_type, scope: !5, file: !658, line: 69, size: 9600, align: 64, elements: !659, identifier: "_ZTSN3pov12FunctionCodeE")
!658 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fncode.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!659 = !{!660, !663, !664, !665, !666, !667, !671, !673, !674, !675, !676, !677, !678, !683, !688}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 71, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", scope: !5, file: !658, line: 67, baseType: !624)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "program_size", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 72, baseType: !624, size: 32, align: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "return_size", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 73, baseType: !566, size: 8, align: 8, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_cnt", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 74, baseType: !566, size: 8, align: 8, offset: 104)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_cnt", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 75, baseType: !566, size: 8, align: 8, offset: 112)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_pos", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 76, baseType: !668, size: 1792, align: 32, offset: 128)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 1792, align: 32, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 56)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "localvar", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 77, baseType: !672, size: 3584, align: 64, offset: 1920)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 3584, align: 64, elements: !669)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 78, baseType: !672, size: 3584, align: 64, offset: 5504)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 79, baseType: !584, size: 64, align: 64, offset: 9088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 80, baseType: !584, size: 64, align: 64, offset: 9152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "filepos", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 81, baseType: !"_ZTSN8pov_base11ITextStream7FilePosE", size: 128, align: 64, offset: 9216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 82, baseType: !624, size: 32, align: 32, offset: 9344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "private_copy_method", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 83, baseType: !679, size: 64, align: 64, offset: 9408)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_COPY_METHOD", scope: !5, file: !658, line: 64, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!575, !575}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "private_destroy_method", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 84, baseType: !684, size: 64, align: 64, offset: 9472)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_DESTROY_METHOD", scope: !5, file: !658, line: 65, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !575}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !"_ZTSN3pov12FunctionCodeE", file: !658, line: 85, baseType: !575, size: 64, align: 64, offset: 9536)
!689 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !691, file: !690, line: 54, size: 4608, align: 64, elements: !693, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!690 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!691 = !DINamespace(name: "pov_base", scope: null, file: !692, line: 37)
!692 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!693 = !{!694, !699, !701, !705, !707, !708, !709, !710, !711, !712, !713, !717, !720, !723, !726, !729, !733, !736, !739, !740, !743}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !690, file: !690, baseType: !695, size: 64, flags: DIFlagArtificial)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!549}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 78, baseType: !700, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 79, baseType: !702, size: 4096, align: 8, offset: 128)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 4096, align: 8, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 80, baseType: !706, size: 64, align: 64, offset: 4224)
!706 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 81, baseType: !706, size: 64, align: 64, offset: 4288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 82, baseType: !706, size: 64, align: 64, offset: 4352)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 83, baseType: !706, size: 64, align: 64, offset: 4416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 84, baseType: !584, size: 64, align: 64, offset: 4480)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 85, baseType: !549, size: 32, align: 32, offset: 4544)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 86, baseType: !549, size: 32, align: 32, offset: 4576)
!713 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 63, type: !714, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !716, !599, !624}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!717 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 64, type: !718, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !716, !599, !700}
!720 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 65, type: !721, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !716}
!723 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 67, type: !724, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!724 = !DISubroutineType(types: !725)
!725 = !{!549, !716}
!726 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 68, type: !727, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !716, !549}
!729 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 70, type: !730, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !716}
!732 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!733 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 71, type: !734, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{!732, !716, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!736 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 72, type: !737, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !716}
!739 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 74, type: !724, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!740 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 76, type: !741, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!741 = !DISubroutineType(types: !742)
!742 = !{!599, !716}
!743 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 88, type: !721, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!744 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !691, file: !692, line: 118, size: 320, align: 64, elements: !745, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!745 = !{!746, !747, !752, !755, !758, !759, !760, !763, !768, !772, !776, !781, !785, !789, !793, !797, !798, !799, !800, !801, !802, !803, !804, !805, !808, !811}
!746 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!747 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 121, type: !748, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !750, !751}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!752 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 122, type: !753, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !750}
!755 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 124, type: !756, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!756 = !DISubroutineType(types: !757)
!757 = !{!549, !750}
!758 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 125, type: !756, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!759 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 126, type: !756, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!760 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 127, type: !761, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!761 = !DISubroutineType(types: !762)
!762 = !{!554, !750}
!763 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 128, type: !764, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !750, !767}
!766 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!767 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !585)
!768 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 129, type: !769, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!769 = !DISubroutineType(types: !770)
!770 = !{!766, !750, !771}
!771 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !566)
!772 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 130, type: !773, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!773 = !DISubroutineType(types: !774)
!774 = !{!766, !750, !775}
!775 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !570)
!776 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 131, type: !777, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!777 = !DISubroutineType(types: !778)
!778 = !{!766, !750, !779}
!779 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !780)
!780 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!781 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 132, type: !782, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!782 = !DISubroutineType(types: !783)
!783 = !{!766, !750, !784}
!784 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !549)
!785 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 133, type: !786, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!786 = !DISubroutineType(types: !787)
!787 = !{!766, !750, !788}
!788 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !624)
!789 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 134, type: !790, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!790 = !DISubroutineType(types: !791)
!791 = !{!766, !750, !792}
!792 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !554)
!793 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 135, type: !794, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!794 = !DISubroutineType(types: !795)
!795 = !{!766, !750, !796}
!796 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !706)
!797 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 137, type: !790, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!798 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 138, type: !782, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!799 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 139, type: !773, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!800 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 140, type: !764, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!801 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 141, type: !794, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!802 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 142, type: !786, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!803 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 143, type: !777, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!804 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 144, type: !769, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!805 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 145, type: !806, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!806 = !DISubroutineType(types: !807)
!807 = !{!766, !750, !549}
!808 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 146, type: !809, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!809 = !DISubroutineType(types: !810)
!810 = !{!766, !750, !584, !706}
!811 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !692, line: 147, type: !812, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!812 = !DISubroutineType(types: !813)
!813 = !{!766, !750, !706}
!814 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !691, file: !692, line: 84, size: 320, align: 64, elements: !815, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!815 = !{!816, !817, !818, !821, !822, !823, !824, !828, !831, !834, !837, !841, !842, !845, !848, !849, !850, !853, !856, !859, !864, !867}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !692, file: !692, baseType: !695, size: 64, flags: DIFlagArtificial)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 110, baseType: !732, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 111, baseType: !819, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !562, line: 153, baseType: !"_ZTS7__sFILE")
!821 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 113, baseType: !624, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 114, baseType: !624, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 115, baseType: !584, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!824 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 87, type: !825, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !827, !624, !624}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!828 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 88, type: !829, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !827}
!831 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 94, type: !832, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!832 = !DISubroutineType(types: !833)
!833 = !{!732, !827, !599, !624}
!834 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 95, type: !835, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!835 = !DISubroutineType(types: !836)
!836 = !{!732, !827}
!837 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 96, type: !838, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!838 = !DISubroutineType(types: !839)
!839 = !{!840, !827, !575, !706}
!840 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!841 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 97, type: !838, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!842 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 98, type: !843, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!843 = !DISubroutineType(types: !844)
!844 = !{!840, !827, !706, !624}
!845 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 100, type: !846, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!846 = !DISubroutineType(types: !847)
!847 = !{!624, !827}
!848 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 101, type: !846, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!849 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 102, type: !835, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!850 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 103, type: !851, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!851 = !DISubroutineType(types: !852)
!852 = !{!706, !827}
!853 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 104, type: !854, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!854 = !DISubroutineType(types: !855)
!855 = !{!840, !827}
!856 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 105, type: !857, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!857 = !DISubroutineType(types: !858)
!858 = !{!599, !827}
!859 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 107, type: !860, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!860 = !DISubroutineType(types: !861)
!861 = !{!575, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!864 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 108, type: !865, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!865 = !DISubroutineType(types: !866)
!866 = !{!732, !862}
!867 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !692, line: 112, type: !854, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !690, line: 57, size: 128, align: 64, elements: !869, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !690, line: 59, baseType: !706, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !690, line: 60, baseType: !549, size: 32, align: 32, offset: 64)
!872 = !DICompositeType(tag: DW_TAG_class_type, name: "FNCode", scope: !5, file: !658, line: 91, size: 256, align: 64, elements: !873, identifier: "_ZTSN3pov6FNCodeE")
!873 = !{!874, !877, !878, !879, !880, !881, !882, !886, !889, !894, !897, !898, !902, !903, !906, !909, !910, !913, !916, !917, !920, !921, !922, !925, !928, !931}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 100, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionCode", scope: !5, file: !658, line: 86, baseType: !"_ZTSN3pov12FunctionCodeE")
!877 = !DIDerivedType(tag: DW_TAG_member, name: "max_program_size", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 102, baseType: !624, size: 32, align: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "max_stack_size", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 103, baseType: !624, size: 32, align: 32, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "stack_pointer", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 104, baseType: !624, size: 32, align: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_stack_pointer", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 105, baseType: !624, size: 32, align: 32, offset: 160)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 106, baseType: !549, size: 32, align: 32, offset: 192)
!882 = !DISubprogram(name: "FNCode", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 94, type: !883, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !885, !875, !732, !584}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov6FNCodeE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!886 = !DISubprogram(name: "Parameter", linkageName: "_ZN3pov6FNCode9ParameterEv", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 96, type: !887, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !885}
!889 = !DISubprogram(name: "Compile", linkageName: "_ZN3pov6FNCode7CompileEPNS_14ExprNodeStructE", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 97, type: !890, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !885, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExprNode", scope: !5, file: !633, line: 92, baseType: !"_ZTSN3pov14ExprNodeStructE")
!894 = !DISubprogram(name: "SetFlag", linkageName: "_ZN3pov6FNCode7SetFlagEjPc", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 98, type: !895, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !885, !624, !584}
!897 = !DISubprogram(name: "FNCode", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 116, type: !887, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true)
!898 = !DISubprogram(name: "FNCode", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 117, type: !899, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !885, !901}
!901 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN3pov6FNCodeE")
!902 = !DISubprogram(name: "compile_recursive", linkageName: "_ZN3pov6FNCode17compile_recursiveEPNS_14ExprNodeStructE", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 119, type: !890, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true)
!903 = !DISubprogram(name: "compile_member", linkageName: "_ZN3pov6FNCode14compile_memberEPc", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 120, type: !904, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !885, !584}
!906 = !DISubprogram(name: "compile_call", linkageName: "_ZN3pov6FNCode12compile_callEPNS_14ExprNodeStructEjiPc", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 121, type: !907, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !885, !892, !631, !549, !584}
!909 = !DISubprogram(name: "compile_select", linkageName: "_ZN3pov6FNCode14compile_selectEPNS_14ExprNodeStructE", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 122, type: !890, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true)
!910 = !DISubprogram(name: "compile_seq_op", linkageName: "_ZN3pov6FNCode14compile_seq_opEPNS_14ExprNodeStructEjd", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 123, type: !911, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !885, !892, !624, !649}
!913 = !DISubprogram(name: "compile_float_function_call", linkageName: "_ZN3pov6FNCode27compile_float_function_callEPNS_14ExprNodeStructEjPc", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 124, type: !914, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !885, !892, !631, !584}
!916 = !DISubprogram(name: "compile_vector_function_call", linkageName: "_ZN3pov6FNCode28compile_vector_function_callEPNS_14ExprNodeStructEjPc", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 125, type: !914, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true)
!917 = !DISubprogram(name: "compile_inline", linkageName: "_ZN3pov6FNCode14compile_inlineEPNS_12FunctionCodeE", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 126, type: !918, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !885, !875}
!920 = !DISubprogram(name: "compile_variable", linkageName: "_ZN3pov6FNCode16compile_variableEPc", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 127, type: !904, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true)
!921 = !DISubprogram(name: "compile_parameters", linkageName: "_ZN3pov6FNCode18compile_parametersEv", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 128, type: !887, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true)
!922 = !DISubprogram(name: "compile_push_result", linkageName: "_ZN3pov6FNCode19compile_push_resultEv", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 129, type: !923, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true)
!923 = !DISubroutineType(types: !924)
!924 = !{!624, !885}
!925 = !DISubprogram(name: "compile_pop_result", linkageName: "_ZN3pov6FNCode18compile_pop_resultEj", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 130, type: !926, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !885, !624}
!928 = !DISubprogram(name: "compile_instruction", linkageName: "_ZN3pov6FNCode19compile_instructionEjjjj", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 131, type: !929, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true)
!929 = !DISubroutineType(types: !930)
!930 = !{!624, !885, !624, !624, !624, !624}
!931 = !DISubprogram(name: "compile_instruction", linkageName: "_ZN3pov6FNCode19compile_instructionEjjjjj", scope: !"_ZTSN3pov6FNCodeE", file: !658, line: 132, type: !932, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true)
!932 = !DISubroutineType(types: !933)
!933 = !{!624, !885, !624, !624, !624, !624, !624}
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spline_Struct", scope: !5, file: !655, line: 1130, size: 704, align: 64, elements: !935, identifier: "_ZTSN3pov13Spline_StructE")
!935 = !{!936, !937, !938, !939, !942, !943, !944, !945, !946, !947}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1132, baseType: !549, size: 32, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1132, baseType: !549, size: 32, align: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Entries", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1133, baseType: !549, size: 32, align: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "SplineEntries", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1134, baseType: !940, size: 64, align: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE_ENTRY", scope: !5, file: !655, line: 1028, baseType: !"_ZTSN3pov12Spline_EntryE")
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Coeffs_Computed", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1135, baseType: !549, size: 32, align: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Terms", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1136, baseType: !549, size: 32, align: 32, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Valid", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1137, baseType: !732, size: 8, align: 8, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Type", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1138, baseType: !549, size: 32, align: 32, offset: 288)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Point", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1139, baseType: !649, size: 64, align: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Data", scope: !"_ZTSN3pov13Spline_StructE", file: !655, line: 1140, baseType: !948, size: 320, align: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXPRESS", scope: !5, file: !655, line: 680, baseType: !949)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 320, align: 64, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 5)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spline_Entry", scope: !5, file: !655, line: 1123, size: 704, align: 64, elements: !953, identifier: "_ZTSN3pov12Spline_EntryE")
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !"_ZTSN3pov12Spline_EntryE", file: !655, line: 1125, baseType: !649, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !"_ZTSN3pov12Spline_EntryE", file: !655, line: 1126, baseType: !949, size: 320, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !"_ZTSN3pov12Spline_EntryE", file: !655, line: 1127, baseType: !949, size: 320, align: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE", scope: !5, file: !655, line: 1029, baseType: !"_ZTSN3pov13Spline_StructE")
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !655, line: 1328, size: 1472, align: 64, elements: !960, identifier: "_ZTSN3pov14Pigment_StructE")
!960 = !{!961, !962, !963, !964, !965, !967, !968, !969, !972, !975, !978, !979}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !780, size: 16, align: 16)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !780, size: 16, align: 16, offset: 16)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !780, size: 16, align: 16, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !549, size: 32, align: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !966, size: 32, align: 32, offset: 96)
!966 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !966, size: 32, align: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !966, size: 32, align: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !970, size: 64, align: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !655, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !973, size: 64, align: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !655, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !976, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !655, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !655, line: 1331, baseType: !980, size: 160, align: 32, offset: 1280)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !655, line: 681, baseType: !981)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 160, align: 32, elements: !950)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !655, line: 1373, size: 192, align: 64, elements: !983, identifier: "_ZTSN3pov12Warps_StructE")
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !655, line: 1375, baseType: !780, size: 16, align: 16)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !655, line: 1375, baseType: !970, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !655, line: 1375, baseType: !970, size: 64, align: 64, offset: 128)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !655, line: 1323, size: 1280, align: 64, elements: !988, identifier: "_ZTSN3pov14Pattern_StructE")
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !780, size: 16, align: 16)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !780, size: 16, align: 16, offset: 16)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !780, size: 16, align: 16, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !549, size: 32, align: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !966, size: 32, align: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !966, size: 32, align: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !966, size: 32, align: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !970, size: 64, align: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !973, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !976, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !655, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !655, line: 1045, size: 128, align: 64, elements: !1001, identifier: "_ZTSN3pov16Blend_Map_StructE")
!1001 = !{!1002, !1003, !1004, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !655, line: 1047, baseType: !549, size: 32, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !655, line: 1048, baseType: !570, size: 16, align: 16, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !655, line: 1049, baseType: !585, size: 8, align: 8, offset: 48)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !655, line: 1049, baseType: !585, size: 8, align: 8, offset: 56)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !655, line: 1050, baseType: !1007, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !655, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !655, line: 1031, size: 256, align: 64, elements: !1010, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !655, line: 1033, baseType: !966, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !655, line: 1034, baseType: !566, size: 8, align: 8, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !655, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!1014 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !655, line: 1035, size: 192, align: 64, elements: !1015, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!1015 = !{!1016, !1017, !1020, !1023, !1026}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !655, line: 1037, baseType: !980, size: 160, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !655, line: 1038, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !655, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !655, line: 1039, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !655, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !655, line: 1040, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !655, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !655, line: 1041, baseType: !1027, size: 128, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !655, line: 676, baseType: !1028)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 128, align: 64, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 2)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !655, line: 1334, size: 1344, align: 64, elements: !1032, identifier: "_ZTSN3pov14Tnormal_StructE")
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !780, size: 16, align: 16)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !780, size: 16, align: 16, offset: 16)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !780, size: 16, align: 16, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !549, size: 32, align: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !966, size: 32, align: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !966, size: 32, align: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !966, size: 32, align: 32, offset: 160)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !970, size: 64, align: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !973, size: 64, align: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !976, size: 64, align: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1337, baseType: !966, size: 32, align: 32, offset: 1280)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1338, baseType: !966, size: 32, align: 32, offset: 1312)
!1046 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !655, line: 1336, size: 896, align: 64, elements: !1047, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!1047 = !{!1048, !1051, !1054, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !655, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !655, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !655, line: 677, baseType: !1056)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 192, align: 64, elements: !607)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !966, size: 32, align: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !1018, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !655, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !655, line: 1269, size: 128, align: 64, elements: !1073, identifier: "_ZTSN3pov19Density_file_StructE")
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !655, line: 1271, baseType: !549, size: 32, align: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !655, line: 1272, baseType: !1076, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !655, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !655, line: 1275, size: 320, align: 64, elements: !1079, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1277, baseType: !549, size: 32, align: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1278, baseType: !584, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1279, baseType: !549, size: 32, align: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1279, baseType: !549, size: 32, align: 32, offset: 160)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1279, baseType: !549, size: 32, align: 32, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1280, baseType: !549, size: 32, align: 32, offset: 224)
!1086 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!1087 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !655, line: 1281, size: 64, align: 64, elements: !1088, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!1088 = !{!1089, !1090, !1092}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !655, line: 1283, baseType: !565, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !655, line: 1284, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !655, line: 1285, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !655, line: 1220, size: 960, align: 64, elements: !1095, identifier: "_ZTSN3pov12Image_StructE")
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1115, !1116}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1222, baseType: !549, size: 32, align: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1223, baseType: !549, size: 32, align: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1224, baseType: !549, size: 32, align: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1225, baseType: !549, size: 32, align: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1226, baseType: !549, size: 32, align: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1227, baseType: !549, size: 32, align: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1227, baseType: !549, size: 32, align: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1228, baseType: !570, size: 16, align: 16, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1229, baseType: !585, size: 8, align: 8, offset: 240)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1230, baseType: !585, size: 8, align: 8, offset: 248)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1231, baseType: !1055, size: 192, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1232, baseType: !966, size: 32, align: 32, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1232, baseType: !966, size: 32, align: 32, offset: 480)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1233, baseType: !1027, size: 128, align: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1234, baseType: !649, size: 64, align: 64, offset: 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1234, baseType: !649, size: 64, align: 64, offset: 704)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1235, baseType: !1113, size: 64, align: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !655, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1236, baseType: !575, size: 64, align: 64, offset: 832)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !655, line: 1161, size: 80, align: 16, elements: !1118, identifier: "_ZTSN3pov19Image_Colour_StructE")
!1118 = !{!1119, !1120, !1121, !1122, !1123}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !655, line: 1163, baseType: !780, size: 16, align: 16)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !655, line: 1163, baseType: !780, size: 16, align: 16, offset: 16)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !655, line: 1163, baseType: !780, size: 16, align: 16, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !655, line: 1163, baseType: !780, size: 16, align: 16, offset: 48)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !655, line: 1163, baseType: !780, size: 16, align: 16, offset: 64)
!1124 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !655, line: 1237, size: 64, align: 64, elements: !1125, identifier: "_ZTSN3pov12Image_StructUt_E")
!1125 = !{!1126, !1129, !1132, !1134}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !655, line: 1239, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !655, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !655, line: 1240, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !655, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !655, line: 1241, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !655, line: 1242, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !655, line: 1166, size: 256, align: 64, elements: !1137, identifier: "_ZTSN3pov18Image8_Line_StructE")
!1137 = !{!1138, !1139, !1140, !1141}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !655, line: 1168, baseType: !565, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !655, line: 1168, baseType: !565, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !655, line: 1168, baseType: !565, size: 64, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !655, line: 1168, baseType: !565, size: 64, align: 64, offset: 192)
!1142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !655, line: 1171, size: 256, align: 64, elements: !1143, identifier: "_ZTSN3pov19Image16_Line_StructE")
!1143 = !{!1144, !1145, !1146, !1147}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !655, line: 1173, baseType: !1091, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !655, line: 1173, baseType: !1091, size: 64, align: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !655, line: 1173, baseType: !1091, size: 64, align: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !655, line: 1173, baseType: !1091, size: 64, align: 64, offset: 192)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 256, align: 64, elements: !1149, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !655, line: 1336, baseType: !966, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64, offset: 64)
!1152 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 64, align: 32, elements: !1153, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !655, line: 1336, baseType: !966, size: 32, align: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !655, line: 1336, baseType: !966, size: 32, align: 32, offset: 32)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 320, align: 64, elements: !1157, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64, offset: 128)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 896, align: 64, elements: !1162, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1170, !1171}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !1169, size: 64, align: 64, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !549, size: 32, align: 32, offset: 640)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64, offset: 704)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 832, align: 64, elements: !1173, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !1055, size: 192, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16, offset: 400)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !1027, size: 128, align: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !655, line: 1336, baseType: !1027, size: 128, align: 64, offset: 704)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 384, align: 64, elements: !1183, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !1027, size: 128, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16, offset: 144)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !570, size: 16, align: 16, offset: 160)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !649, size: 64, align: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !655, line: 1336, baseType: !549, size: 32, align: 32, offset: 320)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !655, line: 1336, size: 128, align: 64, elements: !1192, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!1192 = !{!1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !655, line: 1336, baseType: !575, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !655, line: 1336, baseType: !575, size: 64, align: 64, offset: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !655, line: 1521, size: 960, align: 64, elements: !1196, identifier: "_ZTSN3pov13Object_StructE")
!1196 = !{!1197, !1200, !1201, !1202, !1203, !1204, !1207, !1208, !1209, !1212, !1214, !1217, !1218, !1219}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !655, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !549, size: 32, align: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1070, size: 64, align: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1024, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1024, size: 64, align: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1205, size: 64, align: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !655, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1070, size: 64, align: 64, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1070, size: 64, align: 64, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1210, size: 64, align: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !655, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1213, size: 192, align: 32, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !655, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1215, size: 64, align: 64, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !655, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !1215, size: 64, align: 64, offset: 832)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !966, size: 32, align: 32, offset: 896)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !655, line: 1523, baseType: !624, size: 32, align: 32, offset: 928)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !655, line: 1503, size: 704, align: 64, elements: !1221, identifier: "_ZTSN3pov13Method_StructE")
!1221 = !{!1222, !1231, !1237, !1244, !1246, !1251, !1256, !1258, !1260, !1265, !1270}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !655, line: 1505, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !655, line: 1420, baseType: !1224)
