; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/hcmplx.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::cmplx" = type { double, double }
%"struct.pov::Fractal_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32, [3 x double], [4 x double], [4 x double], double, double, i32, double, i32, i32, i32, %"struct.pov::cmplx", void (double*, i32, %"struct.pov::Fractal_Struct"*)*, {}*, i32 (double*, %"struct.pov::Fractal_Struct"*, double*)*, i32 (%"struct.pov::Ray_Struct"*, %"struct.pov::Fractal_Struct"*, double*, double*)*, void (%"struct.pov::cmplx"*, %"struct.pov::cmplx"*)*, double }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !12, subprograms: !835, globals: !1237, imports: !1240)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/hcmplx.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 692, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "X", value: 0)
!9 = !DIEnumerator(name: "Y", value: 1)
!10 = !DIEnumerator(name: "Z", value: 2)
!11 = !DIEnumerator(name: "T", value: 3)
!12 = !{!13, !19, !24, !29, !113, !163, !179, !211, !216, !229, !240, !246, !261, !275, !297, !303, !313, !321, !344, !351, !363, !369, !375, !379, !383, !388, !399, !409, !418, !422, !437, !455, !459, !463, !468, !478, !488, !497, !501, !519, !523, !527, !532, !542, !552, !561, !565, !583, !587, !591, !596, !606, !616, !625, !629, !656, !671, !699, !754, !761, !768, !779, !786, !792, !802, !810, !831}
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 82, size: 64, align: 32, elements: !15, identifier: "_ZTS5div_t")
!14 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !14, line: 83, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !14, line: 84, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 87, size: 128, align: 64, elements: !20, identifier: "_ZTS6ldiv_t")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !14, line: 88, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !14, line: 89, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 93, size: 128, align: 64, elements: !25, identifier: "_ZTS7lldiv_t")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !14, line: 94, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !14, line: 95, baseType: !27, size: 64, align: 64, offset: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fractal_Struct", scope: !5, file: !30, line: 84, size: 2560, align: 64, elements: !31, identifier: "_ZTSN3pov14Fractal_StructE")
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fractal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !{!32, !35, !36, !39, !42, !43, !46, !47, !48, !51, !53, !56, !57, !59, !61, !67, !71, !72, !73, !74, !75, !76, !77, !78, !79, !81, !89, !94, !99, !106, !112}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !4, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !17, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !37, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !4, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !4, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !40, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !44, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !4, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !37, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !37, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !49, size: 64, align: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !4, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !52, size: 192, align: 32, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !54, size: 64, align: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !4, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !54, size: 64, align: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !58, size: 32, align: 32, offset: 896)
!58 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 86, baseType: !60, size: 32, align: 32, offset: 928)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 87, baseType: !62, size: 192, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, align: 64, elements: !65)
!64 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Julia_Parm", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 88, baseType: !68, size: 256, align: 64, offset: 1152)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, align: 64, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 4)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 89, baseType: !68, size: 256, align: 64, offset: 1408)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "SliceDist", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 90, baseType: !64, size: 64, align: 64, offset: 1664)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Exit_Value", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 91, baseType: !64, size: 64, align: 64, offset: 1728)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 92, baseType: !17, size: 32, align: 32, offset: 1792)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Precision", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 93, baseType: !64, size: 64, align: 64, offset: 1856)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Inverted", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 94, baseType: !17, size: 32, align: 32, offset: 1920)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Algebra", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 96, baseType: !17, size: 32, align: 32, offset: 1952)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Sub_Type", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 97, baseType: !17, size: 32, align: 32, offset: 1984)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 98, baseType: !80, size: 128, align: 64, offset: 2048)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMPLX", scope: !5, file: !30, line: 77, baseType: !"_ZTSN3pov5cmplxE")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Calc_Method", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 100, baseType: !82, size: 64, align: 64, offset: 2176)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_CALC_METHOD", scope: !5, file: !30, line: 78, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !17, !87}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRACTAL", scope: !5, file: !30, line: 76, baseType: !"_ZTSN3pov14Fractal_StructE")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Iteration_Method", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 101, baseType: !90, size: 64, align: 64, offset: 2240)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ITERATION_METHOD", scope: !5, file: !30, line: 79, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!17, !86, !87}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "D_Iteration_Method", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 102, baseType: !95, size: 64, align: 64, offset: 2304)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "D_ITERATION_METHOD", scope: !5, file: !30, line: 80, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!17, !86, !87, !86}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "F_Bound_Method", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 103, baseType: !100, size: 64, align: 64, offset: 2368)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "F_BOUND_METHOD", scope: !5, file: !30, line: 81, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!17, !104, !87, !86, !86}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !4, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Complex_Function_Method", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 104, baseType: !107, size: 64, align: 64, offset: 2432)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMPLEX_FUNCTION_METHOD", scope: !5, file: !30, line: 82, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Squared", scope: !"_ZTSN3pov14Fractal_StructE", file: !30, line: 106, baseType: !64, size: 64, align: 64, offset: 2496)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !4, line: 1503, size: 704, align: 64, elements: !114, identifier: "_ZTSN3pov13Method_StructE")
!114 = !{!115, !122, !127, !134, !136, !142, !147, !149, !151, !156, !161}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1505, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !4, line: 1420, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!17, !37, !104, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !4, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1506, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !4, line: 1421, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!17, !86, !37}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1507, baseType: !128, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !4, line: 1422, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !86, !37, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !4, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1508, baseType: !135, size: 64, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !4, line: 1423, baseType: !129)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1509, baseType: !137, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !4, line: 1424, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !37}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1510, baseType: !143, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !4, line: 1425, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !37, !86, !54}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1511, baseType: !148, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !4, line: 1426, baseType: !144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1512, baseType: !150, size: 64, align: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !4, line: 1427, baseType: !144)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1513, baseType: !152, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !4, line: 1428, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !37, !54}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1514, baseType: !157, size: 64, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !4, line: 1429, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !37}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1515, baseType: !162, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !4, line: 1430, baseType: !158)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !4, line: 1521, size: 960, align: 64, elements: !164, identifier: "_ZTSN3pov13Object_StructE")
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !33, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !17, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !37, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !40, size: 64, align: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !40, size: 64, align: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !44, size: 64, align: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !37, size: 64, align: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !37, size: 64, align: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !49, size: 64, align: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !52, size: 192, align: 32, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !54, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !54, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !58, size: 32, align: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !60, size: 32, align: 32, offset: 928)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !4, line: 1345, size: 1664, align: 64, elements: !180, identifier: "_ZTSN3pov14Texture_StructE")
!180 = !{!181, !183, !184, !185, !186, !187, !188, !189, !192, !195, !198, !199, !200, !203, !206, !209, !210}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !182, size: 16, align: 16)
!182 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !182, size: 16, align: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !182, size: 16, align: 16, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !17, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !58, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !58, size: 32, align: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !58, size: 32, align: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !190, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !4, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !193, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !4, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !4, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !40, size: 64, align: 64, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1348, baseType: !201, size: 64, align: 64, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !4, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1349, baseType: !204, size: 64, align: 64, offset: 1408)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !4, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1350, baseType: !207, size: 64, align: 64, offset: 1472)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !4, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1351, baseType: !40, size: 64, align: 64, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1352, baseType: !17, size: 32, align: 32, offset: 1600)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !4, line: 1373, size: 192, align: 64, elements: !212, identifier: "_ZTSN3pov12Warps_StructE")
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !182, size: 16, align: 16)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !190, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !190, size: 64, align: 64, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !4, line: 1323, size: 1280, align: 64, elements: !217, identifier: "_ZTSN3pov14Pattern_StructE")
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !182, size: 16, align: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !182, size: 16, align: 16, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !182, size: 16, align: 16, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !17, size: 32, align: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !58, size: 32, align: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !58, size: 32, align: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !58, size: 32, align: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !190, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !193, size: 64, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !196, size: 64, align: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !4, line: 1045, size: 128, align: 64, elements: !230, identifier: "_ZTSN3pov16Blend_Map_StructE")
!230 = !{!231, !232, !234, !236, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1047, baseType: !17, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1048, baseType: !233, size: 16, align: 16, offset: 32)
!233 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !235, size: 8, align: 8, offset: 48)
!235 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !235, size: 8, align: 8, offset: 56)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1050, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !4, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !4, line: 1031, size: 256, align: 64, elements: !241, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!241 = !{!242, !243, !245}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1033, baseType: !58, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1034, baseType: !244, size: 8, align: 8, offset: 32)
!244 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!246 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1035, size: 192, align: 64, elements: !247, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!247 = !{!248, !253, !254, !255, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1037, baseType: !249, size: 160, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, align: 32, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 5)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1038, baseType: !201, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1039, baseType: !204, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1040, baseType: !40, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1041, baseType: !257, size: 128, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !4, line: 676, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, align: 64, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !4, line: 1328, size: 1472, align: 64, elements: !262, identifier: "_ZTSN3pov14Pigment_StructE")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !182, size: 16, align: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !182, size: 16, align: 16, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !182, size: 16, align: 16, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !17, size: 32, align: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !58, size: 32, align: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !58, size: 32, align: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !58, size: 32, align: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !190, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !193, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !196, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1331, baseType: !249, size: 160, align: 32, offset: 1280)
!275 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, size: 896, align: 64, elements: !276, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!276 = !{!277, !280, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !4, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !4, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !58, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !37, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !4, line: 1269, size: 128, align: 64, elements: !298, identifier: "_ZTSN3pov19Density_file_StructE")
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1271, baseType: !17, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1272, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !4, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !4, line: 1275, size: 320, align: 64, elements: !304, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!304 = !{!305, !306, !308, !309, !310, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1277, baseType: !17, size: 32, align: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1278, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !17, size: 32, align: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !17, size: 32, align: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !17, size: 32, align: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1280, baseType: !17, size: 32, align: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!313 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, size: 64, align: 64, elements: !314, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!314 = !{!315, !317, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1283, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1284, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1285, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !4, line: 1220, size: 960, align: 64, elements: !322, identifier: "_ZTSN3pov12Image_StructE")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !343}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1222, baseType: !17, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1223, baseType: !17, size: 32, align: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1224, baseType: !17, size: 32, align: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1225, baseType: !17, size: 32, align: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1226, baseType: !17, size: 32, align: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !17, size: 32, align: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !17, size: 32, align: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1228, baseType: !233, size: 16, align: 16, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1229, baseType: !235, size: 8, align: 8, offset: 240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1230, baseType: !235, size: 8, align: 8, offset: 248)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1231, baseType: !62, size: 192, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !58, size: 32, align: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !58, size: 32, align: 32, offset: 480)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1233, baseType: !257, size: 128, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !64, size: 64, align: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !64, size: 64, align: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1235, baseType: !340, size: 64, align: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !4, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1236, baseType: !141, size: 64, align: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !4, line: 1161, size: 80, align: 16, elements: !345, identifier: "_ZTSN3pov19Image_Colour_StructE")
!345 = !{!346, !347, !348, !349, !350}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !182, size: 16, align: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !182, size: 16, align: 16, offset: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !182, size: 16, align: 16, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !182, size: 16, align: 16, offset: 48)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !182, size: 16, align: 16, offset: 64)
!351 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1237, size: 64, align: 64, elements: !352, identifier: "_ZTSN3pov12Image_StructUt_E")
!352 = !{!353, !356, !359, !361}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1239, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !4, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1240, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !4, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1241, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1242, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !4, line: 1166, size: 256, align: 64, elements: !364, identifier: "_ZTSN3pov18Image8_Line_StructE")
!364 = !{!365, !366, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !316, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !316, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !316, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !316, size: 64, align: 64, offset: 192)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !4, line: 1171, size: 256, align: 64, elements: !370, identifier: "_ZTSN3pov19Image16_Line_StructE")
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !318, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !318, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !318, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !318, size: 64, align: 64, offset: 192)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 256, align: 64, elements: !376, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !58, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64, offset: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 64, align: 32, elements: !380, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !58, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !58, size: 32, align: 32, offset: 32)
!383 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 320, align: 64, elements: !384, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64, offset: 128)
!388 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 896, align: 64, elements: !389, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!389 = !{!390, !391, !392, !393, !394, !395, !397, !398}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !396, size: 64, align: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !17, size: 32, align: 32, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64, offset: 704)
!399 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 832, align: 64, elements: !400, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !62, size: 192, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16, offset: 400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !257, size: 128, align: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !257, size: 128, align: 64, offset: 704)
!409 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 384, align: 64, elements: !410, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!410 = !{!411, !412, !413, !414, !415, !416, !417}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !257, size: 128, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16, offset: 144)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !233, size: 16, align: 16, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !64, size: 64, align: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !17, size: 32, align: 32, offset: 320)
!418 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 128, align: 64, elements: !419, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !141, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !141, size: 64, align: 64, offset: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !4, line: 1334, size: 1344, align: 64, elements: !423, identifier: "_ZTSN3pov14Tnormal_StructE")
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !182, size: 16, align: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !182, size: 16, align: 16, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !182, size: 16, align: 16, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !17, size: 32, align: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !58, size: 32, align: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !58, size: 32, align: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !58, size: 32, align: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !190, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !193, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !196, size: 64, align: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1337, baseType: !58, size: 32, align: 32, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1338, baseType: !58, size: 32, align: 32, offset: 1312)
!437 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, size: 896, align: 64, elements: !438, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !278, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !281, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !58, size: 32, align: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !37, size: 64, align: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 256, align: 64, elements: !456, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !58, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64, offset: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 64, align: 32, elements: !460, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !58, size: 32, align: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !58, size: 32, align: 32, offset: 32)
!463 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 320, align: 64, elements: !464, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64, offset: 128)
!468 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 896, align: 64, elements: !469, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !396, size: 64, align: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !17, size: 32, align: 32, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64, offset: 704)
!478 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 832, align: 64, elements: !479, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !62, size: 192, align: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16, offset: 400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !257, size: 128, align: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !257, size: 128, align: 64, offset: 704)
!488 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 384, align: 64, elements: !489, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!489 = !{!490, !491, !492, !493, !494, !495, !496}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !257, size: 128, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16, offset: 144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !233, size: 16, align: 16, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !64, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !17, size: 32, align: 32, offset: 320)
!497 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 128, align: 64, elements: !498, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !141, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !141, size: 64, align: 64, offset: 64)
!501 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, size: 896, align: 64, elements: !502, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !278, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !281, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !58, size: 32, align: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !37, size: 64, align: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 256, align: 64, elements: !520, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !58, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64, offset: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 64, align: 32, elements: !524, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !58, size: 32, align: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !58, size: 32, align: 32, offset: 32)
!527 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 320, align: 64, elements: !528, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!528 = !{!529, !530, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64, offset: 128)
!532 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 896, align: 64, elements: !533, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !396, size: 64, align: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !17, size: 32, align: 32, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64, offset: 704)
!542 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 832, align: 64, elements: !543, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !62, size: 192, align: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16, offset: 400)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !257, size: 128, align: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !257, size: 128, align: 64, offset: 704)
!552 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 384, align: 64, elements: !553, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!553 = !{!554, !555, !556, !557, !558, !559, !560}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !257, size: 128, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16, offset: 144)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !233, size: 16, align: 16, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !64, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !17, size: 32, align: 32, offset: 320)
!561 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 128, align: 64, elements: !562, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !4, line: 1325, baseType: !141, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !4, line: 1325, baseType: !141, size: 64, align: 64, offset: 64)
!565 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, size: 896, align: 64, elements: !566, identifier: "_ZTSN3pov14Texture_StructUt_E")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !278, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !281, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !58, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !37, size: 64, align: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 256, align: 64, elements: !584, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !58, size: 32, align: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64, offset: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 64, align: 32, elements: !588, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !58, size: 32, align: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !58, size: 32, align: 32, offset: 32)
!591 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 320, align: 64, elements: !592, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64, offset: 128)
!596 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 896, align: 64, elements: !597, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !396, size: 64, align: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !17, size: 32, align: 32, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64, offset: 704)
!606 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 832, align: 64, elements: !607, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !62, size: 192, align: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16, offset: 400)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !257, size: 128, align: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !257, size: 128, align: 64, offset: 704)
!616 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 384, align: 64, elements: !617, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!617 = !{!618, !619, !620, !621, !622, !623, !624}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !257, size: 128, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16, offset: 144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !233, size: 16, align: 16, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !64, size: 64, align: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !17, size: 32, align: 32, offset: 320)
!625 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 128, align: 64, elements: !626, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !141, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !141, size: 64, align: 64, offset: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !4, line: 1356, size: 928, align: 32, elements: !630, identifier: "_ZTSN3pov13Finish_StructE")
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !650, !651, !652, !653, !654, !655}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !58, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !58, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !58, size: 32, align: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !58, size: 32, align: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !58, size: 32, align: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !58, size: 32, align: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !58, size: 32, align: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !58, size: 32, align: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !58, size: 32, align: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !58, size: 32, align: 32, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !58, size: 32, align: 32, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !58, size: 32, align: 32, offset: 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !58, size: 32, align: 32, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !58, size: 32, align: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !58, size: 32, align: 32, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !58, size: 32, align: 32, offset: 480)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !648, size: 96, align: 32, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !4, line: 682, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 96, align: 32, elements: !65)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !648, size: 96, align: 32, offset: 608)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !648, size: 96, align: 32, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1365, baseType: !58, size: 32, align: 32, offset: 800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1366, baseType: !17, size: 32, align: 32, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1367, baseType: !58, size: 32, align: 32, offset: 864)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1368, baseType: !17, size: 32, align: 32, offset: 896)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !4, line: 1112, size: 512, align: 64, elements: !657, identifier: "_ZTSN3pov15Interior_StructE")
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1114, baseType: !17, size: 32, align: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !17, size: 32, align: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !17, size: 32, align: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !58, size: 32, align: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !58, size: 32, align: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !58, size: 32, align: 32, offset: 160)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !58, size: 32, align: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !58, size: 32, align: 32, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !58, size: 32, align: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1119, baseType: !249, size: 160, align: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1120, baseType: !669, size: 64, align: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !4, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !4, line: 1069, size: 1728, align: 64, elements: !672, identifier: "_ZTSN3pov12Media_StructE")
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1071, baseType: !17, size: 32, align: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1072, baseType: !17, size: 32, align: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1073, baseType: !17, size: 32, align: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1074, baseType: !17, size: 32, align: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1075, baseType: !17, size: 32, align: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1076, baseType: !64, size: 64, align: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1077, baseType: !17, size: 32, align: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1078, baseType: !64, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1078, baseType: !64, size: 64, align: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1079, baseType: !17, size: 32, align: 32, offset: 448)
