; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/iff.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Image_Colour_Struct" = type { i16, i16, i16, i16, i16 }
%"struct.pov::Chunk_Header_Struct" = type { i32, i32 }
%"struct.pov::Image_Struct" = type { i32, i32, i32, i32, i32, i32, i32, i16, i8, i8, [3 x double], float, float, [2 x double], double, double, %"struct.pov::Image_Colour_Struct"*, i8*, %union.anon }
%union.anon = type { %"struct.pov::Image8_Line_Struct"* }
%"struct.pov::Image8_Line_Struct" = type { i8*, i8*, i8*, i8* }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [23 x i8] c"Cannot open IFF image.\00", align 1
@_ZN3povL14iff_colour_mapE = internal unnamed_addr global %"struct.pov::Image_Colour_Struct"* null, align 8
@_ZN3povL12Chunk_HeaderE = internal global %"struct.pov::Chunk_Header_Struct" zeroinitializer, align 4
@_ZN3povL14colourmap_sizeE = internal unnamed_addr global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !29, subprograms: !307, globals: !367, imports: !371)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/iff.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 51, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!8 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!9 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!10 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!11 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!12 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!13 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!14 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!15 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!16 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!17 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!18 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!19 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!20 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!21 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!22 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!23 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!24 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!25 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!26 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!27 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!28 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!29 = !{!30, !36, !41, !46, !85, !93, !108, !114, !120, !192, !254, !298, !302, !34, !66, !80, !39, !105, !106, !96, !107, !173, !61, !83, !303}
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 82, size: 64, align: 32, elements: !32, identifier: "_ZTS5div_t")
!31 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !31, line: 83, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !31, line: 84, baseType: !34, size: 32, align: 32, offset: 32)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 87, size: 128, align: 64, elements: !37, identifier: "_ZTS6ldiv_t")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !31, line: 88, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !31, line: 89, baseType: !39, size: 64, align: 64, offset: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 93, size: 128, align: 64, elements: !42, identifier: "_ZTS7lldiv_t")
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !31, line: 94, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !31, line: 95, baseType: !44, size: 64, align: 64, offset: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !48, file: !47, line: 1220, size: 960, align: 64, elements: !50, identifier: "_ZTSN3pov12Image_StructE")
!47 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DINamespace(name: "pov", scope: null, file: !49, line: 36)
!49 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !60, !62, !63, !69, !71, !72, !77, !78, !79, !82, !84}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1222, baseType: !34, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1223, baseType: !34, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1224, baseType: !34, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1225, baseType: !34, size: 32, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1226, baseType: !34, size: 32, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1227, baseType: !34, size: 32, align: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1227, baseType: !34, size: 32, align: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1228, baseType: !59, size: 16, align: 16, offset: 224)
!59 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1229, baseType: !61, size: 8, align: 8, offset: 240)
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1230, baseType: !61, size: 8, align: 8, offset: 248)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1231, baseType: !64, size: 192, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !48, file: !47, line: 677, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 192, align: 64, elements: !67)
!66 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1232, baseType: !70, size: 32, align: 32, offset: 448)
!70 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1232, baseType: !70, size: 32, align: 32, offset: 480)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1233, baseType: !73, size: 128, align: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !48, file: !47, line: 676, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, align: 64, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 2)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1234, baseType: !66, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1234, baseType: !66, size: 64, align: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1235, baseType: !80, size: 64, align: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !48, file: !47, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1236, baseType: !83, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !48, file: !47, line: 1161, size: 80, align: 16, elements: !86, identifier: "_ZTSN3pov19Image_Colour_StructE")
!86 = !{!87, !89, !90, !91, !92}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !47, line: 1163, baseType: !88, size: 16, align: 16)
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !47, line: 1163, baseType: !88, size: 16, align: 16, offset: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !47, line: 1163, baseType: !88, size: 16, align: 16, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !47, line: 1163, baseType: !88, size: 16, align: 16, offset: 48)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !47, line: 1163, baseType: !88, size: 16, align: 16, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !47, line: 1237, size: 64, align: 64, elements: !94, identifier: "_ZTSN3pov12Image_StructUt_E")
!94 = !{!95, !98, !101, !104}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !47, line: 1239, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !48, file: !47, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !47, line: 1240, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !48, file: !47, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !47, line: 1241, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !47, line: 1242, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !48, file: !47, line: 1166, size: 256, align: 64, elements: !109, identifier: "_ZTSN3pov18Image8_Line_StructE")
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !47, line: 1168, baseType: !106, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !47, line: 1168, baseType: !106, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !47, line: 1168, baseType: !106, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !47, line: 1168, baseType: !106, size: 64, align: 64, offset: 192)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !48, file: !47, line: 1171, size: 256, align: 64, elements: !115, identifier: "_ZTSN3pov19Image16_Line_StructE")
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !47, line: 1173, baseType: !103, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !47, line: 1173, baseType: !103, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !47, line: 1173, baseType: !103, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !47, line: 1173, baseType: !103, size: 64, align: 64, offset: 192)
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !4, line: 118, size: 320, align: 64, elements: !121, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!121 = !{!122, !123, !129, !132, !135, !136, !137, !140, !145, !149, !153, !157, !161, !165, !169, !174, !175, !176, !177, !178, !179, !180, !181, !182, !185, !189}
!122 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!123 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 121, type: !124, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126, !127}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!129 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 122, type: !130, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !126}
!132 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 124, type: !133, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubroutineType(types: !134)
!134 = !{!34, !126}
!135 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 125, type: !133, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!136 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 126, type: !133, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!137 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 127, type: !138, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubroutineType(types: !139)
!139 = !{!39, !126}
!140 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 128, type: !141, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !126, !144}
!143 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!144 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !61)
!145 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 129, type: !146, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubroutineType(types: !147)
!147 = !{!143, !126, !148}
!148 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !107)
!149 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 130, type: !150, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!150 = !DISubroutineType(types: !151)
!151 = !{!143, !126, !152}
!152 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !59)
!153 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 131, type: !154, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{!143, !126, !156}
!156 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !88)
!157 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 132, type: !158, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubroutineType(types: !159)
!159 = !{!143, !126, !160}
!160 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!161 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 133, type: !162, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!162 = !DISubroutineType(types: !163)
!163 = !{!143, !126, !164}
!164 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !128)
!165 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 134, type: !166, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{!143, !126, !168}
!168 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39)
!169 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 135, type: !170, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubroutineType(types: !171)
!171 = !{!143, !126, !172}
!172 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !173)
!173 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!174 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 137, type: !166, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 138, type: !158, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 139, type: !150, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 140, type: !141, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 141, type: !170, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!179 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 142, type: !162, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 143, type: !154, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 144, type: !146, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 145, type: !183, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!143, !126, !34}
!185 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 146, type: !186, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!143, !126, !188, !173}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!189 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 147, type: !190, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{!143, !126, !173}
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !4, line: 84, size: 320, align: 64, elements: !193, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!193 = !{!194, !199, !201, !205, !206, !207, !208, !212, !215, !220, !223, !227, !228, !231, !234, !235, !236, !239, !242, !245, !250, !253}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !195, size: 64, flags: DIFlagArtificial)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!34}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !200, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!200 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !202, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !204, line: 153, baseType: !"_ZTS7__sFILE")
!204 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !128, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !128, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !188, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!208 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !209, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211, !128, !128}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!212 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !213, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !211}
!215 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !216, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!200, !211, !218, !128}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!220 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !221, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!200, !211}
!223 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !224, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !211, !83, !173}
!226 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!227 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !224, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!228 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !229, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubroutineType(types: !230)
!230 = !{!226, !211, !173, !128}
!231 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !232, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!232 = !DISubroutineType(types: !233)
!233 = !{!128, !211}
!234 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !232, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !221, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !237, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!173, !211}
!239 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !240, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!240 = !DISubroutineType(types: !241)
!241 = !{!226, !211}
!242 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !243, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{!218, !211}
!245 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !246, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!83, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!250 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !251, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!200, !248}
!253 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !240, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !204, line: 122, size: 1216, align: 64, elements: !255, identifier: "_ZTS7__sFILE")
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !268, !272, !281, !285, !286, !288, !289, !291, !295, !296, !297}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !204, line: 123, baseType: !106, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !204, line: 124, baseType: !34, size: 32, align: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !204, line: 125, baseType: !34, size: 32, align: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !204, line: 126, baseType: !59, size: 16, align: 16, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !204, line: 127, baseType: !59, size: 16, align: 16, offset: 144)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !204, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !204, line: 129, baseType: !34, size: 32, align: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !204, line: 132, baseType: !83, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !204, line: 133, baseType: !265, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!34, !83}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !204, line: 134, baseType: !269, size: 64, align: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!34, !83, !188, !34}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !204, line: 135, baseType: !273, size: 64, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !83, !276, !34}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !204, line: 77, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !278, line: 71, baseType: !279)
!278 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !280, line: 46, baseType: !44)
!280 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !204, line: 136, baseType: !282, size: 64, align: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!34, !83, !218, !34}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !204, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !204, line: 140, baseType: !287, size: 64, align: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !204, line: 141, baseType: !34, size: 32, align: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !204, line: 144, baseType: !290, size: 24, align: 8, offset: 928)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 24, align: 8, elements: !67)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !204, line: 145, baseType: !292, size: 8, align: 8, offset: 952)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8, align: 8, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 1)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !204, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !204, line: 151, baseType: !34, size: 32, align: 32, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !204, line: 152, baseType: !276, size: 64, align: 64, offset: 1152)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !204, line: 88, size: 128, align: 64, elements: !299, identifier: "_ZTS6__sbuf")
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !204, line: 89, baseType: !106, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !204, line: 90, baseType: !34, size: 32, align: 32, offset: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !204, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Chunk_Header_Struct", scope: !48, file: !47, line: 1859, size: 64, align: 32, elements: !304, identifier: "_ZTSN3pov19Chunk_Header_StructE")
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !"_ZTSN3pov19Chunk_Header_StructE", file: !47, line: 1861, baseType: !34, size: 32, align: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTSN3pov19Chunk_Header_StructE", file: !47, line: 1862, baseType: !34, size: 32, align: 32, offset: 32)
!307 = !{!308, !335, !343, !350, !354, !360, !364}
!308 = !DISubprogram(name: "Read_Iff_Image", linkageName: "_ZN3pov14Read_Iff_ImageEPNS_12Image_StructEPc", scope: !48, file: !1, line: 286, type: !309, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: void (%"struct.pov::Image_Struct"*, i8*)* @_ZN3pov14Read_Iff_ImageEPNS_12Image_StructEPc, variables: !313)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311, !188}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !48, file: !47, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !334}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Image", arg: 1, scope: !308, file: !1, line: 286, type: !311)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !308, file: !1, line: 286, type: !188)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row_bytes", scope: !308, file: !1, line: 288, type: !105)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !308, file: !1, line: 289, type: !34)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !308, file: !1, line: 289, type: !34)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !308, file: !1, line: 289, type: !34)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !308, file: !1, line: 289, type: !34)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nBytes", scope: !308, file: !1, line: 289, type: !34)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nPlanes", scope: !308, file: !1, line: 289, type: !34)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compression", scope: !308, file: !1, line: 289, type: !34)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !308, file: !1, line: 290, type: !34)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byte_index", scope: !308, file: !1, line: 290, type: !34)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !308, file: !1, line: 290, type: !34)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "viewmodes", scope: !308, file: !1, line: 290, type: !34)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Previous_Red", scope: !308, file: !1, line: 291, type: !34)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Previous_Green", scope: !308, file: !1, line: 291, type: !34)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Previous_Blue", scope: !308, file: !1, line: 291, type: !34)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "creg", scope: !308, file: !1, line: 292, type: !173)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !308, file: !1, line: 293, type: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !308, file: !1, line: 294, type: !96)
!335 = !DISubprogram(name: "Read_Chunk_Header", linkageName: "_ZN3povL17Read_Chunk_HeaderEPN8pov_base7IStreamEPNS_19Chunk_Header_StructE", scope: !48, file: !1, line: 254, type: !336, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, variables: !340)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !333, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHUNK_HEADER", scope: !48, file: !47, line: 1837, baseType: !"_ZTSN3pov19Chunk_Header_StructE")
!340 = !{!341, !342}
