; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/lathe.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!66 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51)
!67 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52)
!68 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53)
!69 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54)
!70 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!71 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!72 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!73 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!74 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!75 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!76 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!77 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!78 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!79 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!80 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!81 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!82 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!83 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!84 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!85 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!86 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!87 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!88 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!89 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!90 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!91 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!92 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!93 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!94 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!95 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!96 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!97 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!98 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!99 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!100 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!101 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!102 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!103 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!104 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!105 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!106 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!107 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!108 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!109 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!110 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!111 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!112 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!113 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!114 = !DIEnumerator(name: "Media_Samples", value: 99)
!115 = !DIEnumerator(name: "Media_Intervals", value: 100)
!116 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!117 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!118 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!119 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!120 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!121 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!122 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!123 = !DIEnumerator(name: "nChecked", value: 108)
!124 = !DIEnumerator(name: "nEnqueued", value: 109)
!125 = !DIEnumerator(name: "totalQueues", value: 110)
!126 = !DIEnumerator(name: "totalQueueResets", value: 111)
!127 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!128 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!129 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!130 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!131 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!132 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!133 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!134 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!135 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!136 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!137 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!138 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!139 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!140 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!141 = !DIEnumerator(name: "MaxStat", value: 126)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 686, size: 32, align: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIEnumerator(name: "U", value: 0)
!145 = !DIEnumerator(name: "V", value: 1)
!146 = !{!147, !153, !158, !163, !205, !258, !274, !306, !311, !324, !335, !341, !356, !370, !396, !402, !412, !420, !443, !450, !462, !468, !474, !478, !482, !487, !498, !508, !517, !521, !536, !554, !558, !562, !567, !577, !587, !596, !600, !618, !622, !626, !631, !641, !651, !660, !664, !682, !686, !690, !695, !705, !715, !724, !728, !755, !770, !798, !853, !860, !868, !879, !886, !892, !902, !910, !931, !941, !947, !962, !967, !973, !198, !935, !221, !236, !12, !171, !201, !858, !975}
!147 = !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 82, size: 64, align: 32, elements: !149, identifier: "_ZTS5div_t")
!148 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !148, line: 83, baseType: !151, size: 32, align: 32)
!151 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !148, line: 84, baseType: !151, size: 32, align: 32, offset: 32)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 87, size: 128, align: 64, elements: !154, identifier: "_ZTS6ldiv_t")
!154 = !{!155, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !148, line: 88, baseType: !156, size: 64, align: 64)
!156 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !148, line: 89, baseType: !156, size: 64, align: 64, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 93, size: 128, align: 64, elements: !159, identifier: "_ZTS7lldiv_t")
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !148, line: 94, baseType: !161, size: 64, align: 64)
!161 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !148, line: 95, baseType: !161, size: 64, align: 64, offset: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lathe_Struct", scope: !5, file: !164, line: 76, size: 1344, align: 64, elements: !165, identifier: "_ZTSN3pov12Lathe_StructE")
!164 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/lathe.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!165 = !{!166, !169, !170, !173, !176, !177, !180, !181, !182, !185, !187, !190, !191, !193, !195, !196, !197, !200, !202, !203, !204}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !4, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !151, size: 32, align: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !4, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !4, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !174, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !178, size: 64, align: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !4, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !171, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !171, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !183, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !4, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !186, size: 192, align: 32, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !188, size: 64, align: 64, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !4, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !188, size: 64, align: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !192, size: 32, align: 32, offset: 896)
!192 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 78, baseType: !194, size: 32, align: 32, offset: 928)
!194 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Spline_Type", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 79, baseType: !151, size: 32, align: 32, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Number", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 80, baseType: !151, size: 32, align: 32, offset: 992)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Spline", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 81, baseType: !198, size: 64, align: 64, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "LATHE_SPLINE", scope: !5, file: !164, line: 61, baseType: !"_ZTSN3pov19Lathe_Spline_StructE")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Height1", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 82, baseType: !201, size: 64, align: 64, offset: 1088)
!201 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Height2", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 82, baseType: !201, size: 64, align: 64, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Radius1", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 83, baseType: !201, size: 64, align: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Radius2", scope: !"_ZTSN3pov12Lathe_StructE", file: !164, line: 83, baseType: !201, size: 64, align: 64, offset: 1280)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !4, line: 1503, size: 704, align: 64, elements: !206, identifier: "_ZTSN3pov13Method_StructE")
!206 = !{!207, !216, !222, !229, !231, !237, !242, !244, !246, !251, !256}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1505, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !4, line: 1420, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!151, !171, !212, !214}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !4, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !4, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1506, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !4, line: 1421, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!151, !221, !171}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1507, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !4, line: 1422, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !221, !171, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !4, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1508, baseType: !230, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !4, line: 1423, baseType: !224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1509, baseType: !232, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !4, line: 1424, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !171}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1510, baseType: !238, size: 64, align: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !4, line: 1425, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !171, !221, !188}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1511, baseType: !243, size: 64, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !4, line: 1426, baseType: !239)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1512, baseType: !245, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !4, line: 1427, baseType: !239)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1513, baseType: !247, size: 64, align: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !4, line: 1428, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !171, !188}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1514, baseType: !252, size: 64, align: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !4, line: 1429, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !171}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1515, baseType: !257, size: 64, align: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !4, line: 1430, baseType: !253)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !4, line: 1521, size: 960, align: 64, elements: !259, identifier: "_ZTSN3pov13Object_StructE")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !167, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !151, size: 32, align: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !171, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !174, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !174, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !178, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !171, size: 64, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !171, size: 64, align: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !183, size: 64, align: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !186, size: 192, align: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !188, size: 64, align: 64, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !188, size: 64, align: 64, offset: 832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !192, size: 32, align: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !194, size: 32, align: 32, offset: 928)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !4, line: 1345, size: 1664, align: 64, elements: !275, identifier: "_ZTSN3pov14Texture_StructE")
!275 = !{!276, !278, !279, !280, !281, !282, !283, !284, !287, !290, !293, !294, !295, !298, !301, !304, !305}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !277, size: 16, align: 16)
!277 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !277, size: 16, align: 16, offset: 16)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !277, size: 16, align: 16, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !151, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !192, size: 32, align: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !192, size: 32, align: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !192, size: 32, align: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !285, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !4, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !288, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !4, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !291, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !4, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !174, size: 64, align: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1348, baseType: !296, size: 64, align: 64, offset: 1344)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !4, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1349, baseType: !299, size: 64, align: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !4, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1350, baseType: !302, size: 64, align: 64, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !4, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1351, baseType: !174, size: 64, align: 64, offset: 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1352, baseType: !151, size: 32, align: 32, offset: 1600)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !4, line: 1373, size: 192, align: 64, elements: !307, identifier: "_ZTSN3pov12Warps_StructE")
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !277, size: 16, align: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !285, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !285, size: 64, align: 64, offset: 128)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !4, line: 1323, size: 1280, align: 64, elements: !312, identifier: "_ZTSN3pov14Pattern_StructE")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !277, size: 16, align: 16)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !277, size: 16, align: 16, offset: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !277, size: 16, align: 16, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !151, size: 32, align: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !192, size: 32, align: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !192, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !192, size: 32, align: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !285, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !288, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !291, size: 64, align: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !4, line: 1045, size: 128, align: 64, elements: !325, identifier: "_ZTSN3pov16Blend_Map_StructE")
!325 = !{!326, !327, !329, !331, !332}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1047, baseType: !151, size: 32, align: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1048, baseType: !328, size: 16, align: 16, offset: 32)
!328 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !330, size: 8, align: 8, offset: 48)
!330 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !330, size: 8, align: 8, offset: 56)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1050, baseType: !333, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !4, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !4, line: 1031, size: 256, align: 64, elements: !336, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!336 = !{!337, !338, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1033, baseType: !192, size: 32, align: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1034, baseType: !339, size: 8, align: 8, offset: 32)
!339 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!341 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1035, size: 192, align: 64, elements: !342, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!342 = !{!343, !348, !349, !350, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1037, baseType: !344, size: 160, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 160, align: 32, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 5)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1038, baseType: !296, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1039, baseType: !299, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1040, baseType: !174, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1041, baseType: !352, size: 128, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !4, line: 676, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 128, align: 64, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 2)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !4, line: 1328, size: 1472, align: 64, elements: !357, identifier: "_ZTSN3pov14Pigment_StructE")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !277, size: 16, align: 16)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !277, size: 16, align: 16, offset: 16)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !277, size: 16, align: 16, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !151, size: 32, align: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !192, size: 32, align: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !192, size: 32, align: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !192, size: 32, align: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !285, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !288, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !291, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1331, baseType: !344, size: 160, align: 32, offset: 1280)
!370 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, size: 896, align: 64, elements: !371, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!371 = !{!372, !375, !378, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !4, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !4, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 192, align: 64, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 3)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !192, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !296, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !171, size: 64, align: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !4, line: 1269, size: 128, align: 64, elements: !397, identifier: "_ZTSN3pov19Density_file_StructE")
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1271, baseType: !151, size: 32, align: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1272, baseType: !400, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !4, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !4, line: 1275, size: 320, align: 64, elements: !403, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!403 = !{!404, !405, !407, !408, !409, !410, !411}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1277, baseType: !151, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1278, baseType: !406, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !151, size: 32, align: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !151, size: 32, align: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !151, size: 32, align: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1280, baseType: !151, size: 32, align: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!412 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, size: 64, align: 64, elements: !413, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!413 = !{!414, !416, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1283, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1284, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1285, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !4, line: 1220, size: 960, align: 64, elements: !421, identifier: "_ZTSN3pov12Image_StructE")
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !441, !442}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1222, baseType: !151, size: 32, align: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1223, baseType: !151, size: 32, align: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1224, baseType: !151, size: 32, align: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1225, baseType: !151, size: 32, align: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1226, baseType: !151, size: 32, align: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !151, size: 32, align: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !151, size: 32, align: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1228, baseType: !328, size: 16, align: 16, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1229, baseType: !330, size: 8, align: 8, offset: 240)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1230, baseType: !330, size: 8, align: 8, offset: 248)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1231, baseType: !379, size: 192, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !192, size: 32, align: 32, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !192, size: 32, align: 32, offset: 480)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1233, baseType: !352, size: 128, align: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !201, size: 64, align: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !201, size: 64, align: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1235, baseType: !439, size: 64, align: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !4, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1236, baseType: !236, size: 64, align: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !4, line: 1161, size: 80, align: 16, elements: !444, identifier: "_ZTSN3pov19Image_Colour_StructE")
!444 = !{!445, !446, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !277, size: 16, align: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !277, size: 16, align: 16, offset: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !277, size: 16, align: 16, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !277, size: 16, align: 16, offset: 48)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !277, size: 16, align: 16, offset: 64)
!450 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1237, size: 64, align: 64, elements: !451, identifier: "_ZTSN3pov12Image_StructUt_E")
!451 = !{!452, !455, !458, !460}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1239, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !4, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1240, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !4, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1241, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1242, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !4, line: 1166, size: 256, align: 64, elements: !463, identifier: "_ZTSN3pov18Image8_Line_StructE")
!463 = !{!464, !465, !466, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !415, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !415, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !415, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !415, size: 64, align: 64, offset: 192)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !4, line: 1171, size: 256, align: 64, elements: !469, identifier: "_ZTSN3pov19Image16_Line_StructE")
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !417, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !417, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !417, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !417, size: 64, align: 64, offset: 192)
!474 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 256, align: 64, elements: !475, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !192, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64, offset: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 64, align: 32, elements: !479, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !192, size: 32, align: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !192, size: 32, align: 32, offset: 32)
!482 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 320, align: 64, elements: !483, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64, offset: 128)
!487 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 896, align: 64, elements: !488, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!488 = !{!489, !490, !491, !492, !493, !494, !496, !497}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !495, size: 64, align: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !151, size: 32, align: 32, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64, offset: 704)
!498 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 832, align: 64, elements: !499, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !379, size: 192, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16, offset: 400)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !352, size: 128, align: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !352, size: 128, align: 64, offset: 704)
!508 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 384, align: 64, elements: !509, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!509 = !{!510, !511, !512, !513, !514, !515, !516}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !352, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16, offset: 144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !328, size: 16, align: 16, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !201, size: 64, align: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !151, size: 32, align: 32, offset: 320)
!517 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 128, align: 64, elements: !518, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !236, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !236, size: 64, align: 64, offset: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !4, line: 1334, size: 1344, align: 64, elements: !522, identifier: "_ZTSN3pov14Tnormal_StructE")
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !277, size: 16, align: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !277, size: 16, align: 16, offset: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !277, size: 16, align: 16, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !151, size: 32, align: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !192, size: 32, align: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !192, size: 32, align: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !192, size: 32, align: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !285, size: 64, align: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !288, size: 64, align: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !291, size: 64, align: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1337, baseType: !192, size: 32, align: 32, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1338, baseType: !192, size: 32, align: 32, offset: 1312)
!536 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, size: 896, align: 64, elements: !537, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !373, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !376, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !192, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !296, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !171, size: 64, align: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 256, align: 64, elements: !555, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !192, size: 32, align: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64, offset: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 64, align: 32, elements: !559, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !192, size: 32, align: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !192, size: 32, align: 32, offset: 32)
!562 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 320, align: 64, elements: !563, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64, offset: 128)
!567 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 896, align: 64, elements: !568, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !495, size: 64, align: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !151, size: 32, align: 32, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64, offset: 704)
!577 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 832, align: 64, elements: !578, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !379, size: 192, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16, offset: 400)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !352, size: 128, align: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !352, size: 128, align: 64, offset: 704)
!587 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 384, align: 64, elements: !588, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!588 = !{!589, !590, !591, !592, !593, !594, !595}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !352, size: 128, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16, offset: 144)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !328, size: 16, align: 16, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !201, size: 64, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !151, size: 32, align: 32, offset: 320)
!596 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 128, align: 64, elements: !597, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !236, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !236, size: 64, align: 64, offset: 64)
!600 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, size: 896, align: 64, elements: !601, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !373, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !376, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !192, size: 32, align: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !296, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !171, size: 64, align: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 256, align: 64, elements: !619, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !192, size: 32, align: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 64, align: 32, elements: !623, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !192, size: 32, align: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !192, size: 32, align: 32, offset: 32)
!626 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 320, align: 64, elements: !627, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!627 = !{!628, !629, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 896, align: 64, elements: !632, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !495, size: 64, align: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !151, size: 32, align: 32, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64, offset: 704)
!641 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 832, align: 64, elements: !642, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !379, size: 192, align: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16, offset: 400)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !352, size: 128, align: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !352, size: 128, align: 64, offset: 704)
!651 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 384, align: 64, elements: !652, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!652 = !{!653, !654, !655, !656, !657, !658, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !352, size: 128, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16, offset: 144)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !328, size: 16, align: 16, offset: 160)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !201, size: 64, align: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !151, size: 32, align: 32, offset: 320)
!660 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 128, align: 64, elements: !661, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !4, line: 1325, baseType: !236, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !4, line: 1325, baseType: !236, size: 64, align: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, size: 896, align: 64, elements: !665, identifier: "_ZTSN3pov14Texture_StructUt_E")
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !373, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !376, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !192, size: 32, align: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !296, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !171, size: 64, align: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 256, align: 64, elements: !683, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !192, size: 32, align: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 64, align: 32, elements: !687, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !192, size: 32, align: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !192, size: 32, align: 32, offset: 32)
!690 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 320, align: 64, elements: !691, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64, offset: 128)
!695 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 896, align: 64, elements: !696, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !495, size: 64, align: 64, offset: 576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !151, size: 32, align: 32, offset: 640)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64, offset: 704)
!705 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 832, align: 64, elements: !706, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !379, size: 192, align: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16, offset: 400)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !352, size: 128, align: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !352, size: 128, align: 64, offset: 704)
!715 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 384, align: 64, elements: !716, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!716 = !{!717, !718, !719, !720, !721, !722, !723}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !352, size: 128, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16, offset: 144)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !328, size: 16, align: 16, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !201, size: 64, align: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !151, size: 32, align: 32, offset: 320)
!724 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 128, align: 64, elements: !725, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !236, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !236, size: 64, align: 64, offset: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !4, line: 1356, size: 928, align: 32, elements: !729, identifier: "_ZTSN3pov13Finish_StructE")
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !749, !750, !751, !752, !753, !754}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !192, size: 32, align: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !192, size: 32, align: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !192, size: 32, align: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !192, size: 32, align: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !192, size: 32, align: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !192, size: 32, align: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !192, size: 32, align: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !192, size: 32, align: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !192, size: 32, align: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !192, size: 32, align: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !192, size: 32, align: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !192, size: 32, align: 32, offset: 352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !192, size: 32, align: 32, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !192, size: 32, align: 32, offset: 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !192, size: 32, align: 32, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !192, size: 32, align: 32, offset: 480)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !747, size: 96, align: 32, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !4, line: 682, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96, align: 32, elements: !381)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !747, size: 96, align: 32, offset: 608)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !747, size: 96, align: 32, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1365, baseType: !192, size: 32, align: 32, offset: 800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1366, baseType: !151, size: 32, align: 32, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1367, baseType: !192, size: 32, align: 32, offset: 864)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1368, baseType: !151, size: 32, align: 32, offset: 896)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !4, line: 1112, size: 512, align: 64, elements: !756, identifier: "_ZTSN3pov15Interior_StructE")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1114, baseType: !151, size: 32, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !151, size: 32, align: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !151, size: 32, align: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !192, size: 32, align: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !192, size: 32, align: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !192, size: 32, align: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !192, size: 32, align: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !192, size: 32, align: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !192, size: 32, align: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1119, baseType: !344, size: 160, align: 32, offset: 288)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1120, baseType: !768, size: 64, align: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !4, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !4, line: 1069, size: 1728, align: 64, elements: !771, identifier: "_ZTSN3pov12Media_StructE")
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1071, baseType: !151, size: 32, align: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1072, baseType: !151, size: 32, align: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1073, baseType: !151, size: 32, align: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1074, baseType: !151, size: 32, align: 32, offset: 96)
