; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/lbuffer.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon.33 }
%union.anon.33 = type { i8* }
%"struct.pov::Frame_Struct" = type { %"struct.pov::Camera_Struct"*, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Object_Struct"*, double, double, double, [5 x float], [5 x float], [5 x float], %"struct.pov::Media_Struct"*, %"struct.pov::Fog_Struct"*, %"struct.pov::Rainbow_Struct"*, %"struct.pov::Skysphere_Struct"*, %"struct.pov::light_group_light_struct"* }

!86 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!87 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!88 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!89 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!90 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!91 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!92 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!93 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!94 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!95 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!96 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!97 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!98 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!99 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!100 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!101 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!102 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!103 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!104 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!105 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!106 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!107 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!108 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!109 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!110 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!111 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!112 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!113 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!114 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!115 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!116 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!117 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!118 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!119 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!120 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!121 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!122 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!123 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!124 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!125 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!126 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!127 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!128 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!129 = !DIEnumerator(name: "Media_Samples", value: 99)
!130 = !DIEnumerator(name: "Media_Intervals", value: 100)
!131 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!132 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!133 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!134 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!135 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!136 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!137 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!138 = !DIEnumerator(name: "nChecked", value: 108)
!139 = !DIEnumerator(name: "nEnqueued", value: 109)
!140 = !DIEnumerator(name: "totalQueues", value: 110)
!141 = !DIEnumerator(name: "totalQueueResets", value: 111)
!142 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!143 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!144 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!145 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!146 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!147 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!148 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!149 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!150 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!151 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!152 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!153 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!154 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!155 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!156 = !DIEnumerator(name: "MaxStat", value: 126)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !158, line: 692, size: 32, align: 32, elements: !159)
!158 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !{!160, !161, !162, !163}
!160 = !DIEnumerator(name: "X", value: 0)
!161 = !DIEnumerator(name: "Y", value: 1)
!162 = !DIEnumerator(name: "Z", value: 2)
!163 = !DIEnumerator(name: "T", value: 3)
!164 = !{!165, !171, !176, !181, !187, !269, !322, !338, !368, !373, !386, !397, !402, !413, !427, !449, !455, !465, !473, !496, !503, !515, !521, !527, !531, !535, !540, !551, !561, !570, !574, !589, !607, !611, !615, !620, !630, !640, !649, !653, !671, !675, !679, !684, !694, !704, !713, !717, !735, !739, !743, !748, !758, !768, !777, !781, !808, !823, !851, !858, !866, !876, !884, !905, !916, !923, !27, !932, !938, !194, !940, !964, !966, !993, !169, !915, !265, !300, !995}
!165 = !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 82, size: 64, align: 32, elements: !167, identifier: "_ZTS5div_t")
!166 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!167 = !{!168, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !166, line: 83, baseType: !169, size: 32, align: 32)
!169 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !166, line: 84, baseType: !169, size: 32, align: 32, offset: 32)
!171 = !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 87, size: 128, align: 64, elements: !172, identifier: "_ZTS6ldiv_t")
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !166, line: 88, baseType: !174, size: 64, align: 64)
!174 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !166, line: 89, baseType: !174, size: 64, align: 64, offset: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 93, size: 128, align: 64, elements: !177, identifier: "_ZTS7lldiv_t")
!177 = !{!178, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !166, line: 94, baseType: !179, size: 64, align: 64)
!179 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !166, line: 95, baseType: !179, size: 64, align: 64, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !158, line: 1545, size: 128, align: 32, elements: !182, identifier: "_ZTSN3pov14Project_StructE")
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !169, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !169, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !169, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !169, size: 32, align: 32, offset: 96)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !158, line: 1566, size: 3456, align: 64, elements: !188, identifier: "_ZTSN3pov19Light_Source_StructE")
!188 = !{!189, !192, !193, !196, !199, !200, !203, !204, !205, !208, !210, !213, !214, !216, !218, !219, !224, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !242, !243, !244, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !258, !259, !260, !263}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !158, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !169, size: 32, align: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !158, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !197, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !158, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !197, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !201, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !158, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !194, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !194, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !206, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !158, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !209, size: 192, align: 32, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !158, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !211, size: 64, align: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !158, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !211, size: 64, align: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !215, size: 32, align: 32, offset: 896)
!215 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !217, size: 32, align: 32, offset: 928)
!217 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !194, size: 64, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1569, baseType: !220, size: 160, align: 32, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !158, line: 681, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 160, align: 32, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 5)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !225, size: 192, align: 64, offset: 1216)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !158, line: 677, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 192, align: 64, elements: !228)
!227 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!228 = !{!229}
!229 = !DISubrange(count: 3)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !225, size: 192, align: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !225, size: 192, align: 64, offset: 1600)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !225, size: 192, align: 64, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !225, size: 192, align: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1571, baseType: !227, size: 64, align: 64, offset: 2176)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1571, baseType: !227, size: 64, align: 64, offset: 2240)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1571, baseType: !227, size: 64, align: 64, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1572, baseType: !227, size: 64, align: 64, offset: 2368)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1572, baseType: !227, size: 64, align: 64, offset: 2432)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1573, baseType: !206, size: 64, align: 64, offset: 2496)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1574, baseType: !241, size: 8, align: 8, offset: 2560)
!241 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1574, baseType: !241, size: 8, align: 8, offset: 2568)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1574, baseType: !241, size: 8, align: 8, offset: 2576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1575, baseType: !245, size: 8, align: 8, offset: 2584)
!245 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1576, baseType: !245, size: 8, align: 8, offset: 2592)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1577, baseType: !241, size: 8, align: 8, offset: 2600)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1577, baseType: !241, size: 8, align: 8, offset: 2608)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1578, baseType: !241, size: 8, align: 8, offset: 2616)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1579, baseType: !169, size: 32, align: 32, offset: 2624)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1579, baseType: !169, size: 32, align: 32, offset: 2656)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1580, baseType: !169, size: 32, align: 32, offset: 2688)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1581, baseType: !169, size: 32, align: 32, offset: 2720)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1582, baseType: !169, size: 32, align: 32, offset: 2752)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1583, baseType: !256, size: 64, align: 64, offset: 2816)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1584, baseType: !194, size: 64, align: 64, offset: 2880)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1584, baseType: !194, size: 64, align: 64, offset: 2944)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1585, baseType: !261, size: 64, align: 64, offset: 3008)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !158, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1586, baseType: !264, size: 384, align: 64, offset: 3072)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 384, align: 64, elements: !267)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !158, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!267 = !{!268}
!268 = !DISubrange(count: 6)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !158, line: 1503, size: 704, align: 64, elements: !270, identifier: "_ZTSN3pov13Method_StructE")
!270 = !{!271, !280, !286, !293, !295, !301, !306, !308, !310, !315, !320}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1505, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !158, line: 1420, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!169, !194, !276, !278}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !158, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !158, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1506, baseType: !281, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !158, line: 1421, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!169, !285, !194}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1507, baseType: !287, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !158, line: 1422, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !285, !194, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !158, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1508, baseType: !294, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !158, line: 1423, baseType: !288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1509, baseType: !296, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !158, line: 1424, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !194}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1510, baseType: !302, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !158, line: 1425, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !194, !285, !211}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1511, baseType: !307, size: 64, align: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !158, line: 1426, baseType: !303)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1512, baseType: !309, size: 64, align: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !158, line: 1427, baseType: !303)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1513, baseType: !311, size: 64, align: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !158, line: 1428, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !194, !211}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1514, baseType: !316, size: 64, align: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !158, line: 1429, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !194}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1515, baseType: !321, size: 64, align: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !158, line: 1430, baseType: !317)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !158, line: 1521, size: 960, align: 64, elements: !323, identifier: "_ZTSN3pov13Object_StructE")
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !190, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !169, size: 32, align: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !194, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !197, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !197, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !201, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !194, size: 64, align: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !194, size: 64, align: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !206, size: 64, align: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !209, size: 192, align: 32, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !211, size: 64, align: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !211, size: 64, align: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !215, size: 32, align: 32, offset: 896)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !217, size: 32, align: 32, offset: 928)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !158, line: 1345, size: 1664, align: 64, elements: !339, identifier: "_ZTSN3pov14Texture_StructE")
!339 = !{!340, !342, !343, !344, !345, !346, !347, !348, !351, !354, !355, !356, !357, !360, !363, !366, !367}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !341, size: 16, align: 16)
!341 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !341, size: 16, align: 16, offset: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !341, size: 16, align: 16, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !169, size: 32, align: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !215, size: 32, align: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !215, size: 32, align: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !215, size: 32, align: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !158, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !352, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !158, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !261, size: 64, align: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !197, size: 64, align: 64, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1348, baseType: !358, size: 64, align: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !158, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1349, baseType: !361, size: 64, align: 64, offset: 1408)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !158, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1350, baseType: !364, size: 64, align: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !158, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1351, baseType: !197, size: 64, align: 64, offset: 1536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1352, baseType: !169, size: 32, align: 32, offset: 1600)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !158, line: 1373, size: 192, align: 64, elements: !369, identifier: "_ZTSN3pov12Warps_StructE")
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !341, size: 16, align: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !349, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !349, size: 64, align: 64, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !158, line: 1323, size: 1280, align: 64, elements: !374, identifier: "_ZTSN3pov14Pattern_StructE")
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !341, size: 16, align: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !341, size: 16, align: 16, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !341, size: 16, align: 16, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !169, size: 32, align: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !215, size: 32, align: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !215, size: 32, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !215, size: 32, align: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !349, size: 64, align: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !352, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !261, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !158, line: 1045, size: 128, align: 64, elements: !387, identifier: "_ZTSN3pov16Blend_Map_StructE")
!387 = !{!388, !389, !391, !393, !394}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1047, baseType: !169, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1048, baseType: !390, size: 16, align: 16, offset: 32)
!390 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1049, baseType: !392, size: 8, align: 8, offset: 48)
!392 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1049, baseType: !392, size: 8, align: 8, offset: 56)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1050, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !158, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !158, line: 1031, size: 256, align: 64, elements: !398, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1033, baseType: !215, size: 32, align: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1034, baseType: !241, size: 8, align: 8, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!402 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1035, size: 192, align: 64, elements: !403, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!403 = !{!404, !405, !406, !407, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1037, baseType: !220, size: 160, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1038, baseType: !358, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1039, baseType: !361, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1040, baseType: !197, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1041, baseType: !409, size: 128, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !158, line: 676, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 128, align: 64, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 2)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !158, line: 1328, size: 1472, align: 64, elements: !414, identifier: "_ZTSN3pov14Pigment_StructE")
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !341, size: 16, align: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !341, size: 16, align: 16, offset: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !341, size: 16, align: 16, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !169, size: 32, align: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !215, size: 32, align: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !215, size: 32, align: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !215, size: 32, align: 32, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !349, size: 64, align: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !352, size: 64, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !261, size: 64, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1331, baseType: !220, size: 160, align: 32, offset: 1280)
!427 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, size: 896, align: 64, elements: !428, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!428 = !{!429, !432, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !158, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !158, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !215, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !358, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, baseType: !194, size: 64, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !158, line: 1269, size: 128, align: 64, elements: !450, identifier: "_ZTSN3pov19Density_file_StructE")
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !158, line: 1271, baseType: !169, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !158, line: 1272, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !158, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !158, line: 1275, size: 320, align: 64, elements: !456, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!456 = !{!457, !458, !460, !461, !462, !463, !464}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1277, baseType: !169, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1278, baseType: !459, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !169, size: 32, align: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !169, size: 32, align: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !169, size: 32, align: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1280, baseType: !169, size: 32, align: 32, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!465 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1281, size: 64, align: 64, elements: !466, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!466 = !{!467, !469, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1283, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1284, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1285, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !158, line: 1220, size: 960, align: 64, elements: !474, identifier: "_ZTSN3pov12Image_StructE")
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !494, !495}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1222, baseType: !169, size: 32, align: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1223, baseType: !169, size: 32, align: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1224, baseType: !169, size: 32, align: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1225, baseType: !169, size: 32, align: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1226, baseType: !169, size: 32, align: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1227, baseType: !169, size: 32, align: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1227, baseType: !169, size: 32, align: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1228, baseType: !390, size: 16, align: 16, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1229, baseType: !392, size: 8, align: 8, offset: 240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1230, baseType: !392, size: 8, align: 8, offset: 248)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1231, baseType: !225, size: 192, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1232, baseType: !215, size: 32, align: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1232, baseType: !215, size: 32, align: 32, offset: 480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1233, baseType: !409, size: 128, align: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1234, baseType: !227, size: 64, align: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1234, baseType: !227, size: 64, align: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1235, baseType: !492, size: 64, align: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !158, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1236, baseType: !300, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !158, line: 1161, size: 80, align: 16, elements: !497, identifier: "_ZTSN3pov19Image_Colour_StructE")
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !341, size: 16, align: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !341, size: 16, align: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !341, size: 16, align: 16, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !341, size: 16, align: 16, offset: 48)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !341, size: 16, align: 16, offset: 64)
!503 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1237, size: 64, align: 64, elements: !504, identifier: "_ZTSN3pov12Image_StructUt_E")
!504 = !{!505, !508, !511, !513}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1239, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !158, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1240, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !158, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1241, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1242, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !158, line: 1166, size: 256, align: 64, elements: !516, identifier: "_ZTSN3pov18Image8_Line_StructE")
!516 = !{!517, !518, !519, !520}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !468, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !468, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !468, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !468, size: 64, align: 64, offset: 192)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !158, line: 1171, size: 256, align: 64, elements: !522, identifier: "_ZTSN3pov19Image16_Line_StructE")
!522 = !{!523, !524, !525, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !470, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !470, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !470, size: 64, align: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !470, size: 64, align: 64, offset: 192)
!527 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 256, align: 64, elements: !528, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !158, line: 1330, baseType: !215, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64, offset: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 64, align: 32, elements: !532, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !158, line: 1330, baseType: !215, size: 32, align: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !158, line: 1330, baseType: !215, size: 32, align: 32, offset: 32)
!535 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 320, align: 64, elements: !536, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64, offset: 128)
!540 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 896, align: 64, elements: !541, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!541 = !{!542, !543, !544, !545, !546, !547, !549, !550}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !548, size: 64, align: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !169, size: 32, align: 32, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64, offset: 704)
!551 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 832, align: 64, elements: !552, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !225, size: 192, align: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16, offset: 400)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !409, size: 128, align: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !158, line: 1330, baseType: !409, size: 128, align: 64, offset: 704)
!561 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 384, align: 64, elements: !562, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!562 = !{!563, !564, !565, !566, !567, !568, !569}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !409, size: 128, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16, offset: 144)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !390, size: 16, align: 16, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !227, size: 64, align: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !158, line: 1330, baseType: !169, size: 32, align: 32, offset: 320)
!570 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !158, line: 1330, size: 128, align: 64, elements: !571, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !158, line: 1330, baseType: !300, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !158, line: 1330, baseType: !300, size: 64, align: 64, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !158, line: 1334, size: 1344, align: 64, elements: !575, identifier: "_ZTSN3pov14Tnormal_StructE")
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !341, size: 16, align: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !341, size: 16, align: 16, offset: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !341, size: 16, align: 16, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !169, size: 32, align: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !215, size: 32, align: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !215, size: 32, align: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !215, size: 32, align: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !349, size: 64, align: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !352, size: 64, align: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !261, size: 64, align: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1337, baseType: !215, size: 32, align: 32, offset: 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1338, baseType: !215, size: 32, align: 32, offset: 1312)
!589 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, size: 896, align: 64, elements: !590, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !430, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !433, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !215, size: 32, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !358, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !194, size: 64, align: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 256, align: 64, elements: !608, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !158, line: 1336, baseType: !215, size: 32, align: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64, offset: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 64, align: 32, elements: !612, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !158, line: 1336, baseType: !215, size: 32, align: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !158, line: 1336, baseType: !215, size: 32, align: 32, offset: 32)
!615 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 320, align: 64, elements: !616, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64, offset: 128)
!620 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 896, align: 64, elements: !621, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !548, size: 64, align: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !169, size: 32, align: 32, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64, offset: 704)
!630 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 832, align: 64, elements: !631, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !225, size: 192, align: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16, offset: 400)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !409, size: 128, align: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !409, size: 128, align: 64, offset: 704)
!640 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 384, align: 64, elements: !641, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!641 = !{!642, !643, !644, !645, !646, !647, !648}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !409, size: 128, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16, offset: 144)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !390, size: 16, align: 16, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !227, size: 64, align: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !169, size: 32, align: 32, offset: 320)
!649 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 128, align: 64, elements: !650, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !158, line: 1336, baseType: !300, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !158, line: 1336, baseType: !300, size: 64, align: 64, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, size: 896, align: 64, elements: !654, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !430, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !433, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !215, size: 32, align: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !358, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !194, size: 64, align: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 256, align: 64, elements: !672, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !158, line: 1325, baseType: !215, size: 32, align: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 64, align: 32, elements: !676, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !158, line: 1325, baseType: !215, size: 32, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !158, line: 1325, baseType: !215, size: 32, align: 32, offset: 32)
!679 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 320, align: 64, elements: !680, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64, offset: 128)
!684 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 896, align: 64, elements: !685, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !548, size: 64, align: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !169, size: 32, align: 32, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64, offset: 704)
!694 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 832, align: 64, elements: !695, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !225, size: 192, align: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16, offset: 400)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !409, size: 128, align: 64, offset: 576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !409, size: 128, align: 64, offset: 704)
!704 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 384, align: 64, elements: !705, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!705 = !{!706, !707, !708, !709, !710, !711, !712}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !409, size: 128, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16, offset: 144)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !390, size: 16, align: 16, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !227, size: 64, align: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !158, line: 1325, baseType: !169, size: 32, align: 32, offset: 320)
!713 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 128, align: 64, elements: !714, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !158, line: 1325, baseType: !300, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !158, line: 1325, baseType: !300, size: 64, align: 64, offset: 64)
!717 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, size: 896, align: 64, elements: !718, identifier: "_ZTSN3pov14Texture_StructUt_E")
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !430, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !433, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !215, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !358, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !194, size: 64, align: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 256, align: 64, elements: !736, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !158, line: 1347, baseType: !215, size: 32, align: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64, offset: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 64, align: 32, elements: !740, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !158, line: 1347, baseType: !215, size: 32, align: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !158, line: 1347, baseType: !215, size: 32, align: 32, offset: 32)
!743 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 320, align: 64, elements: !744, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64, offset: 128)
!748 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 896, align: 64, elements: !749, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !548, size: 64, align: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !169, size: 32, align: 32, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64, offset: 704)
!758 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 832, align: 64, elements: !759, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !225, size: 192, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16, offset: 400)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !409, size: 128, align: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !409, size: 128, align: 64, offset: 704)
!768 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 384, align: 64, elements: !769, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!769 = !{!770, !771, !772, !773, !774, !775, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !409, size: 128, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16, offset: 144)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !390, size: 16, align: 16, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !227, size: 64, align: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !169, size: 32, align: 32, offset: 320)
!777 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 128, align: 64, elements: !778, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !158, line: 1347, baseType: !300, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !158, line: 1347, baseType: !300, size: 64, align: 64, offset: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !158, line: 1356, size: 928, align: 32, elements: !782, identifier: "_ZTSN3pov13Finish_StructE")
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !802, !803, !804, !805, !806, !807}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1358, baseType: !215, size: 32, align: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1358, baseType: !215, size: 32, align: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1359, baseType: !215, size: 32, align: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1359, baseType: !215, size: 32, align: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1360, baseType: !215, size: 32, align: 32, offset: 128)
