; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/lightgrp.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::photon_options_struct" = type { i32, double, double, double, i32, i32, double, double, double, i32, i32, i8*, i32, i32, %"struct.pov::photon_map_struct", i32, double, double, %"struct.pov::Object_Struct"*, double*, double*, %"struct.pov::photon_struct"**, double*, i32, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, i8, %"struct.pov::photon_map_struct", double, i32, i32, i32, i32 }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !803, globals: !2, imports: !844)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/lightgrp.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !15, !20, !57, !111, !127, !159, !164, !177, !188, !194, !209, !223, !249, !255, !265, !273, !296, !303, !315, !321, !327, !331, !335, !340, !351, !361, !370, !374, !389, !407, !411, !415, !420, !430, !440, !449, !453, !471, !475, !479, !484, !494, !504, !513, !517, !535, !539, !543, !548, !558, !568, !577, !581, !608, !623, !651, !706, !713, !721, !732, !739, !745, !755, !763, !43, !784, !801}
!4 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 82, size: 64, align: 32, elements: !6, identifier: "_ZTS5div_t")
!5 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !5, line: 83, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !5, line: 84, baseType: !8, size: 32, align: 32, offset: 32)
!10 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 87, size: 128, align: 64, elements: !11, identifier: "_ZTS6ldiv_t")
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !5, line: 88, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !5, line: 89, baseType: !13, size: 64, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 93, size: 128, align: 64, elements: !16, identifier: "_ZTS7lldiv_t")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !5, line: 94, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !5, line: 95, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "CSG_Struct", scope: !22, file: !21, line: 62, size: 1088, align: 64, elements: !24, identifier: "_ZTSN3pov10CSG_StructE")
!21 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/csg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DINamespace(name: "pov", scope: null, file: !23, line: 36)
!23 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !{!25, !29, !30, !33, !36, !37, !40, !41, !42, !45, !47, !50, !51, !53, !55, !56}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !22, file: !28, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !8, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !22, file: !28, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !22, file: !28, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !34, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !38, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !22, file: !28, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !31, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !31, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !43, size: 64, align: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !22, file: !28, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !46, size: 192, align: 32, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !22, file: !28, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !48, size: 64, align: 64, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !22, file: !28, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !48, size: 64, align: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !52, size: 32, align: 32, offset: 896)
!52 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !54, size: 32, align: 32, offset: 928)
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 64, baseType: !31, size: 64, align: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "do_split", scope: !"_ZTSN3pov10CSG_StructE", file: !21, line: 65, baseType: !8, size: 32, align: 32, offset: 1024)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !22, file: !28, line: 1503, size: 704, align: 64, elements: !58, identifier: "_ZTSN3pov13Method_StructE")
!58 = !{!59, !68, !75, !82, !84, !90, !95, !97, !99, !104, !109}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1505, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !22, file: !28, line: 1420, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!8, !31, !64, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !22, file: !28, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !22, file: !28, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1506, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !22, file: !28, line: 1421, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!8, !73, !31}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1507, baseType: !76, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !22, file: !28, line: 1422, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !73, !31, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !22, file: !28, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1508, baseType: !83, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !22, file: !28, line: 1423, baseType: !77)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1509, baseType: !85, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !22, file: !28, line: 1424, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !31}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1510, baseType: !91, size: 64, align: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !22, file: !28, line: 1425, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !31, !73, !48}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1511, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !22, file: !28, line: 1426, baseType: !92)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1512, baseType: !98, size: 64, align: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !22, file: !28, line: 1427, baseType: !92)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1513, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !22, file: !28, line: 1428, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !31, !48}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1514, baseType: !105, size: 64, align: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !22, file: !28, line: 1429, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !31}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !28, line: 1515, baseType: !110, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !22, file: !28, line: 1430, baseType: !106)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !22, file: !28, line: 1521, size: 960, align: 64, elements: !112, identifier: "_ZTSN3pov13Object_StructE")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !26, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !8, size: 32, align: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !31, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !34, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !34, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !38, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !31, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !31, size: 64, align: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !43, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !46, size: 192, align: 32, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !48, size: 64, align: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !48, size: 64, align: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !52, size: 32, align: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !28, line: 1523, baseType: !54, size: 32, align: 32, offset: 928)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !22, file: !28, line: 1345, size: 1664, align: 64, elements: !128, identifier: "_ZTSN3pov14Texture_StructE")
!128 = !{!129, !131, !132, !133, !134, !135, !136, !137, !140, !143, !146, !147, !148, !151, !154, !157, !158}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !130, size: 16, align: 16)
!130 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !130, size: 16, align: 16, offset: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !130, size: 16, align: 16, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !8, size: 32, align: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !52, size: 32, align: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !52, size: 32, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !52, size: 32, align: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !138, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !22, file: !28, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !141, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !22, file: !28, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !22, file: !28, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, baseType: !34, size: 64, align: 64, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1348, baseType: !149, size: 64, align: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !22, file: !28, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1349, baseType: !152, size: 64, align: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !22, file: !28, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1350, baseType: !155, size: 64, align: 64, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !22, file: !28, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1351, baseType: !34, size: 64, align: 64, offset: 1536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1352, baseType: !8, size: 32, align: 32, offset: 1600)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !22, file: !28, line: 1373, size: 192, align: 64, elements: !160, identifier: "_ZTSN3pov12Warps_StructE")
!160 = !{!161, !162, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !28, line: 1375, baseType: !130, size: 16, align: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !28, line: 1375, baseType: !138, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !28, line: 1375, baseType: !138, size: 64, align: 64, offset: 128)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !22, file: !28, line: 1323, size: 1280, align: 64, elements: !165, identifier: "_ZTSN3pov14Pattern_StructE")
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !130, size: 16, align: 16)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !130, size: 16, align: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !130, size: 16, align: 16, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !8, size: 32, align: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !52, size: 32, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !52, size: 32, align: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !52, size: 32, align: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !138, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !141, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !144, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !22, file: !28, line: 1045, size: 128, align: 64, elements: !178, identifier: "_ZTSN3pov16Blend_Map_StructE")
!178 = !{!179, !180, !182, !184, !185}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !28, line: 1047, baseType: !8, size: 32, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !28, line: 1048, baseType: !181, size: 16, align: 16, offset: 32)
!181 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !28, line: 1049, baseType: !183, size: 8, align: 8, offset: 48)
!183 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !28, line: 1049, baseType: !183, size: 8, align: 8, offset: 56)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !28, line: 1050, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !22, file: !28, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !22, file: !28, line: 1031, size: 256, align: 64, elements: !189, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!189 = !{!190, !191, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !28, line: 1033, baseType: !52, size: 32, align: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !28, line: 1034, baseType: !192, size: 8, align: 8, offset: 32)
!192 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !28, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!194 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !28, line: 1035, size: 192, align: 64, elements: !195, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!195 = !{!196, !201, !202, !203, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !28, line: 1037, baseType: !197, size: 160, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !22, file: !28, line: 681, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, align: 32, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 5)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !28, line: 1038, baseType: !149, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !28, line: 1039, baseType: !152, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !28, line: 1040, baseType: !34, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !28, line: 1041, baseType: !205, size: 128, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !22, file: !28, line: 676, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, align: 64, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 2)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !22, file: !28, line: 1328, size: 1472, align: 64, elements: !210, identifier: "_ZTSN3pov14Pigment_StructE")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !130, size: 16, align: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !130, size: 16, align: 16, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !130, size: 16, align: 16, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !8, size: 32, align: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !52, size: 32, align: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !52, size: 32, align: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !52, size: 32, align: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !138, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !141, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !144, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1331, baseType: !197, size: 160, align: 32, offset: 1280)
!223 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !28, line: 1330, size: 896, align: 64, elements: !224, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!224 = !{!225, !228, !231, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !22, file: !28, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !22, file: !28, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !22, file: !28, line: 677, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 192, align: 64, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !52, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !149, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, baseType: !31, size: 64, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !22, file: !28, line: 1269, size: 128, align: 64, elements: !250, identifier: "_ZTSN3pov19Density_file_StructE")
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !28, line: 1271, baseType: !8, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !28, line: 1272, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !22, file: !28, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !22, file: !28, line: 1275, size: 320, align: 64, elements: !256, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!256 = !{!257, !258, !260, !261, !262, !263, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1277, baseType: !8, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1278, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1279, baseType: !8, size: 32, align: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1279, baseType: !8, size: 32, align: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1279, baseType: !8, size: 32, align: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1280, baseType: !8, size: 32, align: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!265 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !28, line: 1281, size: 64, align: 64, elements: !266, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!266 = !{!267, !269, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !28, line: 1283, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !28, line: 1284, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !28, line: 1285, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !22, file: !28, line: 1220, size: 960, align: 64, elements: !274, identifier: "_ZTSN3pov12Image_StructE")
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !294, !295}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1222, baseType: !8, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1223, baseType: !8, size: 32, align: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1224, baseType: !8, size: 32, align: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1225, baseType: !8, size: 32, align: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1226, baseType: !8, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1227, baseType: !8, size: 32, align: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1227, baseType: !8, size: 32, align: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1228, baseType: !181, size: 16, align: 16, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1229, baseType: !183, size: 8, align: 8, offset: 240)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1230, baseType: !183, size: 8, align: 8, offset: 248)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1231, baseType: !232, size: 192, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1232, baseType: !52, size: 32, align: 32, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1232, baseType: !52, size: 32, align: 32, offset: 480)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1233, baseType: !205, size: 128, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1234, baseType: !74, size: 64, align: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1234, baseType: !74, size: 64, align: 64, offset: 704)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1235, baseType: !292, size: 64, align: 64, offset: 768)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !22, file: !28, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1236, baseType: !89, size: 64, align: 64, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !22, file: !28, line: 1161, size: 80, align: 16, elements: !297, identifier: "_ZTSN3pov19Image_Colour_StructE")
!297 = !{!298, !299, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !28, line: 1163, baseType: !130, size: 16, align: 16)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !28, line: 1163, baseType: !130, size: 16, align: 16, offset: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !28, line: 1163, baseType: !130, size: 16, align: 16, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !28, line: 1163, baseType: !130, size: 16, align: 16, offset: 48)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !28, line: 1163, baseType: !130, size: 16, align: 16, offset: 64)
!303 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !28, line: 1237, size: 64, align: 64, elements: !304, identifier: "_ZTSN3pov12Image_StructUt_E")
!304 = !{!305, !308, !311, !313}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !28, line: 1239, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !22, file: !28, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !28, line: 1240, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !22, file: !28, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !28, line: 1241, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !28, line: 1242, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !22, file: !28, line: 1166, size: 256, align: 64, elements: !316, identifier: "_ZTSN3pov18Image8_Line_StructE")
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !28, line: 1168, baseType: !268, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !28, line: 1168, baseType: !268, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !28, line: 1168, baseType: !268, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !28, line: 1168, baseType: !268, size: 64, align: 64, offset: 192)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !22, file: !28, line: 1171, size: 256, align: 64, elements: !322, identifier: "_ZTSN3pov19Image16_Line_StructE")
!322 = !{!323, !324, !325, !326}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !28, line: 1173, baseType: !270, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !28, line: 1173, baseType: !270, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !28, line: 1173, baseType: !270, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !28, line: 1173, baseType: !270, size: 64, align: 64, offset: 192)
!327 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 256, align: 64, elements: !328, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !28, line: 1330, baseType: !52, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64, offset: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 64, align: 32, elements: !332, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !28, line: 1330, baseType: !52, size: 32, align: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !28, line: 1330, baseType: !52, size: 32, align: 32, offset: 32)
!335 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 320, align: 64, elements: !336, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64, offset: 128)
!340 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 896, align: 64, elements: !341, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!341 = !{!342, !343, !344, !345, !346, !347, !349, !350}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !348, size: 64, align: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !8, size: 32, align: 32, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64, offset: 704)
!351 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 832, align: 64, elements: !352, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !232, size: 192, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16, offset: 400)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !205, size: 128, align: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !28, line: 1330, baseType: !205, size: 128, align: 64, offset: 704)
!361 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 384, align: 64, elements: !362, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!362 = !{!363, !364, !365, !366, !367, !368, !369}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !205, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16, offset: 144)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !181, size: 16, align: 16, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !74, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !28, line: 1330, baseType: !8, size: 32, align: 32, offset: 320)
!370 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !28, line: 1330, size: 128, align: 64, elements: !371, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !28, line: 1330, baseType: !89, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !28, line: 1330, baseType: !89, size: 64, align: 64, offset: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !22, file: !28, line: 1334, size: 1344, align: 64, elements: !375, identifier: "_ZTSN3pov14Tnormal_StructE")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !130, size: 16, align: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !130, size: 16, align: 16, offset: 16)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !130, size: 16, align: 16, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !8, size: 32, align: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !52, size: 32, align: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !52, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !52, size: 32, align: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !138, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !141, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !144, size: 64, align: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1337, baseType: !52, size: 32, align: 32, offset: 1280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1338, baseType: !52, size: 32, align: 32, offset: 1312)
!389 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !28, line: 1336, size: 896, align: 64, elements: !390, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !226, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !229, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !52, size: 32, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !149, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, baseType: !31, size: 64, align: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 256, align: 64, elements: !408, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !28, line: 1336, baseType: !52, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64, offset: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 64, align: 32, elements: !412, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !28, line: 1336, baseType: !52, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !28, line: 1336, baseType: !52, size: 32, align: 32, offset: 32)
!415 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 320, align: 64, elements: !416, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64, offset: 128)
!420 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 896, align: 64, elements: !421, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !348, size: 64, align: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !8, size: 32, align: 32, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64, offset: 704)
!430 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 832, align: 64, elements: !431, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !232, size: 192, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16, offset: 400)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !205, size: 128, align: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !28, line: 1336, baseType: !205, size: 128, align: 64, offset: 704)
!440 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 384, align: 64, elements: !441, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!441 = !{!442, !443, !444, !445, !446, !447, !448}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !205, size: 128, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16, offset: 144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !181, size: 16, align: 16, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !74, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !28, line: 1336, baseType: !8, size: 32, align: 32, offset: 320)
!449 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !28, line: 1336, size: 128, align: 64, elements: !450, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !28, line: 1336, baseType: !89, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !28, line: 1336, baseType: !89, size: 64, align: 64, offset: 64)
!453 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !28, line: 1325, size: 896, align: 64, elements: !454, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !226, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !229, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !52, size: 32, align: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !149, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, baseType: !31, size: 64, align: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 256, align: 64, elements: !472, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !28, line: 1325, baseType: !52, size: 32, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64, offset: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 64, align: 32, elements: !476, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !28, line: 1325, baseType: !52, size: 32, align: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !28, line: 1325, baseType: !52, size: 32, align: 32, offset: 32)
!479 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 320, align: 64, elements: !480, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64, offset: 128)
!484 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 896, align: 64, elements: !485, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !348, size: 64, align: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !8, size: 32, align: 32, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64, offset: 704)
!494 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 832, align: 64, elements: !495, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !232, size: 192, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16, offset: 400)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !205, size: 128, align: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !28, line: 1325, baseType: !205, size: 128, align: 64, offset: 704)
!504 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 384, align: 64, elements: !505, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!505 = !{!506, !507, !508, !509, !510, !511, !512}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !205, size: 128, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16, offset: 144)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !181, size: 16, align: 16, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !74, size: 64, align: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !28, line: 1325, baseType: !8, size: 32, align: 32, offset: 320)
!513 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !28, line: 1325, size: 128, align: 64, elements: !514, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !28, line: 1325, baseType: !89, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !28, line: 1325, baseType: !89, size: 64, align: 64, offset: 64)
!517 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !28, line: 1347, size: 896, align: 64, elements: !518, identifier: "_ZTSN3pov14Texture_StructUt_E")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !226, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !229, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !52, size: 32, align: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !149, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, baseType: !31, size: 64, align: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 256, align: 64, elements: !536, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !28, line: 1347, baseType: !52, size: 32, align: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64, offset: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 64, align: 32, elements: !540, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !28, line: 1347, baseType: !52, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !28, line: 1347, baseType: !52, size: 32, align: 32, offset: 32)
!543 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 320, align: 64, elements: !544, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64, offset: 128)
!548 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 896, align: 64, elements: !549, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !348, size: 64, align: 64, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !8, size: 32, align: 32, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64, offset: 704)
!558 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 832, align: 64, elements: !559, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !232, size: 192, align: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16, offset: 400)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !205, size: 128, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !28, line: 1347, baseType: !205, size: 128, align: 64, offset: 704)
!568 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 384, align: 64, elements: !569, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!569 = !{!570, !571, !572, !573, !574, !575, !576}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !205, size: 128, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16, offset: 144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !181, size: 16, align: 16, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !74, size: 64, align: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !28, line: 1347, baseType: !8, size: 32, align: 32, offset: 320)
!577 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !28, line: 1347, size: 128, align: 64, elements: !578, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !28, line: 1347, baseType: !89, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !28, line: 1347, baseType: !89, size: 64, align: 64, offset: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !22, file: !28, line: 1356, size: 928, align: 32, elements: !582, identifier: "_ZTSN3pov13Finish_StructE")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !602, !603, !604, !605, !606, !607}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1358, baseType: !52, size: 32, align: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1358, baseType: !52, size: 32, align: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1359, baseType: !52, size: 32, align: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1359, baseType: !52, size: 32, align: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1360, baseType: !52, size: 32, align: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1360, baseType: !52, size: 32, align: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1361, baseType: !52, size: 32, align: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1361, baseType: !52, size: 32, align: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1361, baseType: !52, size: 32, align: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1362, baseType: !52, size: 32, align: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1362, baseType: !52, size: 32, align: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1362, baseType: !52, size: 32, align: 32, offset: 352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1362, baseType: !52, size: 32, align: 32, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1362, baseType: !52, size: 32, align: 32, offset: 416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1363, baseType: !52, size: 32, align: 32, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1363, baseType: !52, size: 32, align: 32, offset: 480)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1364, baseType: !600, size: 96, align: 32, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !22, file: !28, line: 682, baseType: !601)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 96, align: 32, elements: !234)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1364, baseType: !600, size: 96, align: 32, offset: 608)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1364, baseType: !600, size: 96, align: 32, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1365, baseType: !52, size: 32, align: 32, offset: 800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1366, baseType: !8, size: 32, align: 32, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1367, baseType: !52, size: 32, align: 32, offset: 864)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !28, line: 1368, baseType: !8, size: 32, align: 32, offset: 896)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !22, file: !28, line: 1112, size: 512, align: 64, elements: !609, identifier: "_ZTSN3pov15Interior_StructE")
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1114, baseType: !8, size: 32, align: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1115, baseType: !8, size: 32, align: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1115, baseType: !8, size: 32, align: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1116, baseType: !52, size: 32, align: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1116, baseType: !52, size: 32, align: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1117, baseType: !52, size: 32, align: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1117, baseType: !52, size: 32, align: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1118, baseType: !52, size: 32, align: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1118, baseType: !52, size: 32, align: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1119, baseType: !197, size: 160, align: 32, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !28, line: 1120, baseType: !621, size: 64, align: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !22, file: !28, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !22, file: !28, line: 1069, size: 1728, align: 64, elements: !624, identifier: "_ZTSN3pov12Media_StructE")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1071, baseType: !8, size: 32, align: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1072, baseType: !8, size: 32, align: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1073, baseType: !8, size: 32, align: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1074, baseType: !8, size: 32, align: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1075, baseType: !8, size: 32, align: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1076, baseType: !74, size: 64, align: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1077, baseType: !8, size: 32, align: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1078, baseType: !74, size: 64, align: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1078, baseType: !74, size: 64, align: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1079, baseType: !8, size: 32, align: 32, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1080, baseType: !8, size: 32, align: 32, offset: 480)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1081, baseType: !8, size: 32, align: 32, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1082, baseType: !8, size: 32, align: 32, offset: 544)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1083, baseType: !197, size: 160, align: 32, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1084, baseType: !197, size: 160, align: 32, offset: 736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1085, baseType: !197, size: 160, align: 32, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1086, baseType: !197, size: 160, align: 32, offset: 1056)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1088, baseType: !74, size: 64, align: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1089, baseType: !74, size: 64, align: 64, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1090, baseType: !74, size: 64, align: 64, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1091, baseType: !73, size: 64, align: 64, offset: 1408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1093, baseType: !74, size: 64, align: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1094, baseType: !8, size: 32, align: 32, offset: 1536)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1095, baseType: !8, size: 32, align: 32, offset: 1568)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1097, baseType: !149, size: 64, align: 64, offset: 1600)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !28, line: 1099, baseType: !621, size: 64, align: 64, offset: 1664)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !22, file: !28, line: 1566, size: 3456, align: 64, elements: !652, identifier: "_ZTSN3pov19Light_Source_StructE")
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !697, !698, !699, !700}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !26, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !8, size: 32, align: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !31, size: 64, align: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !34, size: 64, align: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !34, size: 64, align: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !38, size: 64, align: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !31, size: 64, align: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !28, line: 1568, baseType: !31, size: 64, align: 64, offset: 448)
