; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/lighting.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Texture_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, %"struct.pov::Texture_Struct"*, %"struct.pov::Pigment_Struct"*, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Finish_Struct"*, %"struct.pov::Texture_Struct"*, i32 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }
%struct.anon.21 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }

!131 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51)
!132 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52)
!133 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53)
!134 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54)
!135 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!136 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!137 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!138 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!139 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!140 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!141 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!142 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!143 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!144 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!145 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!146 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!147 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!148 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!149 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!150 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!151 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!152 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!153 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!154 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!155 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!156 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!157 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!158 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!159 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!160 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!161 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!162 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!163 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!164 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!165 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!166 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!167 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!168 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!169 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!170 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!171 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!172 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!173 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!174 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!175 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!176 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!177 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!178 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!179 = !DIEnumerator(name: "Media_Samples", value: 99)
!180 = !DIEnumerator(name: "Media_Intervals", value: 100)
!181 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!182 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!183 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!184 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!185 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!186 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!187 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!188 = !DIEnumerator(name: "nChecked", value: 108)
!189 = !DIEnumerator(name: "nEnqueued", value: 109)
!190 = !DIEnumerator(name: "totalQueues", value: 110)
!191 = !DIEnumerator(name: "totalQueueResets", value: 111)
!192 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!193 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!194 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!195 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!196 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!197 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!198 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!199 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!200 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!201 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!202 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!203 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!204 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!205 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!206 = !DIEnumerator(name: "MaxStat", value: 126)
!207 = !{!208, !214, !219, !224, !259, !264, !277, !288, !294, !310, !324, !352, !358, !368, !377, !401, !408, !420, !426, !432, !436, !440, !445, !456, !466, !475, !479, !504, !556, !566, !581, !609, !617, !638, !646, !701, !708, !719, !726, !732, !747, !765, !769, !773, !778, !788, !798, !807, !811, !829, !833, !837, !842, !852, !862, !871, !875, !893, !897, !901, !906, !916, !926, !935, !939, !966, !971, !985, !992, !998, !1008, !399, !307, !1009, !1010, !1012, !1015, !1018, !1011, !1013, !1016, !1019, !1021, !1022, !1023, !520, !1024, !974, !1026, !1053, !1065, !1077, !1082, !1088, !1111, !1130, !1132, !1134, !1136, !1158, !1173, !23, !239, !246, !212, !1175, !77, !232, !1192, !1201, !1213}
!208 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 82, size: 64, align: 32, elements: !210, identifier: "_ZTS5div_t")
!209 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !209, line: 83, baseType: !212, size: 32, align: 32)
!212 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !209, line: 84, baseType: !212, size: 32, align: 32, offset: 32)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 87, size: 128, align: 64, elements: !215, identifier: "_ZTS6ldiv_t")
!215 = !{!216, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !209, line: 88, baseType: !217, size: 64, align: 64)
!217 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !209, line: 89, baseType: !217, size: 64, align: 64, offset: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 93, size: 128, align: 64, elements: !220, identifier: "_ZTS7lldiv_t")
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !209, line: 94, baseType: !222, size: 64, align: 64)
!222 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !209, line: 95, baseType: !222, size: 64, align: 64, offset: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !4, line: 1345, size: 1664, align: 64, elements: !225, identifier: "_ZTSN3pov14Texture_StructE")
!225 = !{!226, !228, !229, !230, !231, !233, !234, !235, !238, !241, !244, !245, !248, !251, !254, !257, !258}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !227, size: 16, align: 16)
!227 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !227, size: 16, align: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !227, size: 16, align: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !212, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !232, size: 32, align: 32, offset: 96)
!232 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !232, size: 32, align: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !232, size: 32, align: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !236, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !4, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !239, size: 64, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !4, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !242, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !4, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !246, size: 64, align: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !4, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1348, baseType: !249, size: 64, align: 64, offset: 1344)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !4, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1349, baseType: !252, size: 64, align: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !4, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1350, baseType: !255, size: 64, align: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !4, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1351, baseType: !246, size: 64, align: 64, offset: 1536)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1352, baseType: !212, size: 32, align: 32, offset: 1600)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !4, line: 1373, size: 192, align: 64, elements: !260, identifier: "_ZTSN3pov12Warps_StructE")
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !227, size: 16, align: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !236, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !236, size: 64, align: 64, offset: 128)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !4, line: 1323, size: 1280, align: 64, elements: !265, identifier: "_ZTSN3pov14Pattern_StructE")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !227, size: 16, align: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !227, size: 16, align: 16, offset: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !227, size: 16, align: 16, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !212, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !232, size: 32, align: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !232, size: 32, align: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !232, size: 32, align: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !236, size: 64, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !239, size: 64, align: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !242, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !4, line: 1045, size: 128, align: 64, elements: !278, identifier: "_ZTSN3pov16Blend_Map_StructE")
!278 = !{!279, !280, !282, !284, !285}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1047, baseType: !212, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1048, baseType: !281, size: 16, align: 16, offset: 32)
!281 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !283, size: 8, align: 8, offset: 48)
!283 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !283, size: 8, align: 8, offset: 56)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1050, baseType: !286, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !4, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !4, line: 1031, size: 256, align: 64, elements: !289, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!289 = !{!290, !291, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1033, baseType: !232, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1034, baseType: !292, size: 8, align: 8, offset: 32)
!292 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!294 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1035, size: 192, align: 64, elements: !295, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!295 = !{!296, !301, !302, !303, !304}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1037, baseType: !297, size: 160, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !298)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 160, align: 32, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 5)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1038, baseType: !249, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1039, baseType: !252, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1040, baseType: !246, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1041, baseType: !305, size: 128, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !4, line: 676, baseType: !306)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 128, align: 64, elements: !308)
!307 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!308 = !{!309}
!309 = !DISubrange(count: 2)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !4, line: 1328, size: 1472, align: 64, elements: !311, identifier: "_ZTSN3pov14Pigment_StructE")
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !227, size: 16, align: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !227, size: 16, align: 16, offset: 16)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !227, size: 16, align: 16, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !212, size: 32, align: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !232, size: 32, align: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !232, size: 32, align: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !232, size: 32, align: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !236, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !239, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !242, size: 64, align: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1331, baseType: !297, size: 160, align: 32, offset: 1280)
!324 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, size: 896, align: 64, elements: !325, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!325 = !{!326, !329, !332, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !4, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !4, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 192, align: 64, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 3)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !232, size: 32, align: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !249, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !4, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !4, line: 1269, size: 128, align: 64, elements: !353, identifier: "_ZTSN3pov19Density_file_StructE")
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1271, baseType: !212, size: 32, align: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1272, baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !4, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !4, line: 1275, size: 320, align: 64, elements: !359, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!359 = !{!360, !361, !363, !364, !365, !366, !367}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1277, baseType: !212, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1278, baseType: !362, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !212, size: 32, align: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !212, size: 32, align: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !212, size: 32, align: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1280, baseType: !212, size: 32, align: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!368 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, size: 64, align: 64, elements: !369, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!369 = !{!370, !372, !374}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1283, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1284, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1285, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !4, line: 1220, size: 960, align: 64, elements: !378, identifier: "_ZTSN3pov12Image_StructE")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !398, !400}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1222, baseType: !212, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1223, baseType: !212, size: 32, align: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1224, baseType: !212, size: 32, align: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1225, baseType: !212, size: 32, align: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1226, baseType: !212, size: 32, align: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !212, size: 32, align: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !212, size: 32, align: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1228, baseType: !281, size: 16, align: 16, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1229, baseType: !283, size: 8, align: 8, offset: 240)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1230, baseType: !283, size: 8, align: 8, offset: 248)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1231, baseType: !333, size: 192, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !232, size: 32, align: 32, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !232, size: 32, align: 32, offset: 480)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1233, baseType: !305, size: 128, align: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !307, size: 64, align: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !307, size: 64, align: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1235, baseType: !396, size: 64, align: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !4, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1236, baseType: !399, size: 64, align: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !4, line: 1161, size: 80, align: 16, elements: !402, identifier: "_ZTSN3pov19Image_Colour_StructE")
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !227, size: 16, align: 16)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !227, size: 16, align: 16, offset: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !227, size: 16, align: 16, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !227, size: 16, align: 16, offset: 48)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !227, size: 16, align: 16, offset: 64)
!408 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1237, size: 64, align: 64, elements: !409, identifier: "_ZTSN3pov12Image_StructUt_E")
!409 = !{!410, !413, !416, !418}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1239, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !4, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1240, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !4, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1241, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1242, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !4, line: 1166, size: 256, align: 64, elements: !421, identifier: "_ZTSN3pov18Image8_Line_StructE")
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !371, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !371, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !371, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !371, size: 64, align: 64, offset: 192)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !4, line: 1171, size: 256, align: 64, elements: !427, identifier: "_ZTSN3pov19Image16_Line_StructE")
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !373, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !373, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !373, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !373, size: 64, align: 64, offset: 192)
!432 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 256, align: 64, elements: !433, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !232, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 64, align: 32, elements: !437, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !232, size: 32, align: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !232, size: 32, align: 32, offset: 32)
!440 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 320, align: 64, elements: !441, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64, offset: 128)
!445 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 896, align: 64, elements: !446, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!446 = !{!447, !448, !449, !450, !451, !452, !454, !455}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !453, size: 64, align: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !212, size: 32, align: 32, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64, offset: 704)
!456 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 832, align: 64, elements: !457, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !333, size: 192, align: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16, offset: 400)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !305, size: 128, align: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !305, size: 128, align: 64, offset: 704)
!466 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 384, align: 64, elements: !467, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!467 = !{!468, !469, !470, !471, !472, !473, !474}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !305, size: 128, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16, offset: 144)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !281, size: 16, align: 16, offset: 160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !307, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !212, size: 32, align: 32, offset: 320)
!475 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 128, align: 64, elements: !476, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !399, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !399, size: 64, align: 64, offset: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !4, line: 1521, size: 960, align: 64, elements: !480, identifier: "_ZTSN3pov13Object_StructE")
!480 = !{!481, !484, !485, !486, !487, !488, !491, !492, !493, !496, !498, !501, !502, !503}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !4, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !212, size: 32, align: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !350, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !246, size: 64, align: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !246, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !489, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !4, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !350, size: 64, align: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !350, size: 64, align: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !494, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !4, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!496 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !497, size: 192, align: 32, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !499, size: 64, align: 64, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !4, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!501 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !499, size: 64, align: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !232, size: 32, align: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !376, size: 32, align: 32, offset: 928)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !4, line: 1503, size: 704, align: 64, elements: !505, identifier: "_ZTSN3pov13Method_StructE")
!505 = !{!506, !515, !521, !528, !530, !535, !540, !542, !544, !549, !554}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1505, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !4, line: 1420, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!212, !350, !511, !513}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !4, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !4, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1506, baseType: !516, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !4, line: 1421, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!212, !520, !350}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1507, baseType: !522, size: 64, align: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !4, line: 1422, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !520, !350, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !4, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!528 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1508, baseType: !529, size: 64, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !4, line: 1423, baseType: !523)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1509, baseType: !531, size: 64, align: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !4, line: 1424, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!399, !350}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1510, baseType: !536, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !4, line: 1425, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !350, !520, !499}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1511, baseType: !541, size: 64, align: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !4, line: 1426, baseType: !537)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1512, baseType: !543, size: 64, align: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !4, line: 1427, baseType: !537)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1513, baseType: !545, size: 64, align: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !4, line: 1428, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !350, !499}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1514, baseType: !550, size: 64, align: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !4, line: 1429, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !350}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1515, baseType: !555, size: 64, align: 64, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !4, line: 1430, baseType: !551)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !4, line: 1783, size: 6848, align: 64, elements: !557, identifier: "_ZTSN3pov10Ray_StructE")
!557 = !{!558, !559, !560, !561, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1785, baseType: !333, size: 192, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1786, baseType: !333, size: 192, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1787, baseType: !212, size: 32, align: 32, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1788, baseType: !376, size: 32, align: 32, offset: 416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1789, baseType: !563, size: 6400, align: 64, offset: 448)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 6400, align: 64, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 100)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !4, line: 1112, size: 512, align: 64, elements: !567, identifier: "_ZTSN3pov15Interior_StructE")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1114, baseType: !212, size: 32, align: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !212, size: 32, align: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !212, size: 32, align: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !232, size: 32, align: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !232, size: 32, align: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !232, size: 32, align: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !232, size: 32, align: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !232, size: 32, align: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !232, size: 32, align: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1119, baseType: !297, size: 160, align: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1120, baseType: !579, size: 64, align: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !4, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !4, line: 1069, size: 1728, align: 64, elements: !582, identifier: "_ZTSN3pov12Media_StructE")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1071, baseType: !212, size: 32, align: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1072, baseType: !212, size: 32, align: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1073, baseType: !212, size: 32, align: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1074, baseType: !212, size: 32, align: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1075, baseType: !212, size: 32, align: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1076, baseType: !307, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1077, baseType: !212, size: 32, align: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1078, baseType: !307, size: 64, align: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1078, baseType: !307, size: 64, align: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1079, baseType: !212, size: 32, align: 32, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1080, baseType: !212, size: 32, align: 32, offset: 480)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1081, baseType: !212, size: 32, align: 32, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1082, baseType: !212, size: 32, align: 32, offset: 544)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1083, baseType: !297, size: 160, align: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1084, baseType: !297, size: 160, align: 32, offset: 736)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1085, baseType: !297, size: 160, align: 32, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1086, baseType: !297, size: 160, align: 32, offset: 1056)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1088, baseType: !307, size: 64, align: 64, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1089, baseType: !307, size: 64, align: 64, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1090, baseType: !307, size: 64, align: 64, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1091, baseType: !520, size: 64, align: 64, offset: 1408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1093, baseType: !307, size: 64, align: 64, offset: 1472)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1094, baseType: !212, size: 32, align: 32, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1095, baseType: !212, size: 32, align: 32, offset: 1568)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1097, baseType: !249, size: 64, align: 64, offset: 1600)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1099, baseType: !579, size: 64, align: 64, offset: 1664)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !4, line: 1621, size: 192, align: 64, elements: !610, identifier: "_ZTSN3pov13istack_structE")
!610 = !{!611, !613, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1623, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1624, baseType: !614, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1625, baseType: !376, size: 32, align: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1626, baseType: !376, size: 32, align: 32, offset: 160)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !4, line: 1596, size: 1600, align: 64, elements: !618, identifier: "_ZTSN3pov10istk_entryE")
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1598, baseType: !307, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1599, baseType: !333, size: 192, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1600, baseType: !333, size: 192, align: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1601, baseType: !333, size: 192, align: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1602, baseType: !305, size: 128, align: 64, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1603, baseType: !350, size: 64, align: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1610, baseType: !212, size: 32, align: 32, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1610, baseType: !212, size: 32, align: 32, offset: 864)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1611, baseType: !307, size: 64, align: 64, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1611, baseType: !307, size: 64, align: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1612, baseType: !307, size: 64, align: 64, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1612, baseType: !307, size: 64, align: 64, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1613, baseType: !307, size: 64, align: 64, offset: 1152)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1613, baseType: !307, size: 64, align: 64, offset: 1216)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1614, baseType: !307, size: 64, align: 64, offset: 1280)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1614, baseType: !307, size: 64, align: 64, offset: 1344)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1614, baseType: !307, size: 64, align: 64, offset: 1408)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1616, baseType: !399, size: 64, align: 64, offset: 1472)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1618, baseType: !399, size: 64, align: 64, offset: 1536)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !4, line: 1002, size: 2048, align: 64, elements: !639, identifier: "_ZTSN3pov16Transform_StructE")
!639 = !{!640, !645}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !4, line: 1004, baseType: !641, size: 1024, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !4, line: 679, baseType: !642)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 1024, align: 64, elements: !643)
!643 = !{!644, !644}
!644 = !DISubrange(count: 4)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !4, line: 1005, baseType: !641, size: 1024, align: 64, offset: 1024)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !4, line: 1566, size: 3456, align: 64, elements: !647, identifier: "_ZTSN3pov19Light_Source_StructE")
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !692, !693, !694, !695}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !482, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !212, size: 32, align: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !350, size: 64, align: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !246, size: 64, align: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !246, size: 64, align: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !489, size: 64, align: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !350, size: 64, align: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !350, size: 64, align: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !494, size: 64, align: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !497, size: 192, align: 32, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !499, size: 64, align: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !499, size: 64, align: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !232, size: 32, align: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !376, size: 32, align: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !350, size: 64, align: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1569, baseType: !297, size: 160, align: 32, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1570, baseType: !333, size: 192, align: 64, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1570, baseType: !333, size: 192, align: 64, offset: 1408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1570, baseType: !333, size: 192, align: 64, offset: 1600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1570, baseType: !333, size: 192, align: 64, offset: 1792)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1570, baseType: !333, size: 192, align: 64, offset: 1984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1571, baseType: !307, size: 64, align: 64, offset: 2176)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1571, baseType: !307, size: 64, align: 64, offset: 2240)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1571, baseType: !307, size: 64, align: 64, offset: 2304)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1572, baseType: !307, size: 64, align: 64, offset: 2368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1572, baseType: !307, size: 64, align: 64, offset: 2432)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1573, baseType: !494, size: 64, align: 64, offset: 2496)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1574, baseType: !292, size: 8, align: 8, offset: 2560)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1574, baseType: !292, size: 8, align: 8, offset: 2568)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1574, baseType: !292, size: 8, align: 8, offset: 2576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1575, baseType: !679, size: 8, align: 8, offset: 2584)
!679 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1576, baseType: !679, size: 8, align: 8, offset: 2592)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1577, baseType: !292, size: 8, align: 8, offset: 2600)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1577, baseType: !292, size: 8, align: 8, offset: 2608)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1578, baseType: !292, size: 8, align: 8, offset: 2616)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1579, baseType: !212, size: 32, align: 32, offset: 2624)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1579, baseType: !212, size: 32, align: 32, offset: 2656)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1580, baseType: !212, size: 32, align: 32, offset: 2688)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1581, baseType: !212, size: 32, align: 32, offset: 2720)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1582, baseType: !212, size: 32, align: 32, offset: 2752)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1583, baseType: !690, size: 64, align: 64, offset: 2816)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1584, baseType: !350, size: 64, align: 64, offset: 2880)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1584, baseType: !350, size: 64, align: 64, offset: 2944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1585, baseType: !242, size: 64, align: 64, offset: 3008)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1586, baseType: !696, size: 384, align: 64, offset: 3072)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 384, align: 64, elements: !699)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !4, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!699 = !{!700}
!700 = !DISubrange(count: 6)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !4, line: 876, size: 192, align: 32, elements: !702, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!702 = !{!703, !707}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !4, line: 878, baseType: !704, size: 96, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !4, line: 872, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 96, align: 32, elements: !335)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !4, line: 870, baseType: !232)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !4, line: 878, baseType: !704, size: 96, align: 32, offset: 96)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !5, file: !4, line: 1557, size: 384, align: 64, elements: !709, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!709 = !{!710, !711, !714, !716, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1559, baseType: !227, size: 16, align: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1560, baseType: !712, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !5, file: !4, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1561, baseType: !715, size: 128, align: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !5, file: !4, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1562, baseType: !227, size: 16, align: 16, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1563, baseType: !718, size: 64, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !5, file: !4, line: 1534, size: 320, align: 64, elements: !720, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!720 = !{!721, !722, !723, !724}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1536, baseType: !281, size: 16, align: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1537, baseType: !281, size: 16, align: 16, offset: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1538, baseType: !497, size: 192, align: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1539, baseType: !725, size: 64, align: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !4, line: 1545, size: 128, align: 32, elements: !727, identifier: "_ZTSN3pov14Project_StructE")
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !212, size: 32, align: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !212, size: 32, align: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !212, size: 32, align: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !212, size: 32, align: 32, offset: 96)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !4, line: 1334, size: 1344, align: 64, elements: !733, identifier: "_ZTSN3pov14Tnormal_StructE")
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !227, size: 16, align: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !227, size: 16, align: 16, offset: 16)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !227, size: 16, align: 16, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !212, size: 32, align: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !232, size: 32, align: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !232, size: 32, align: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !232, size: 32, align: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !236, size: 64, align: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !239, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !242, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1337, baseType: !232, size: 32, align: 32, offset: 1280)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1338, baseType: !232, size: 32, align: 32, offset: 1312)
!747 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, size: 896, align: 64, elements: !748, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !327, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !330, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !232, size: 32, align: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !249, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !350, size: 64, align: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 256, align: 64, elements: !766, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !232, size: 32, align: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64, offset: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 64, align: 32, elements: !770, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !232, size: 32, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !232, size: 32, align: 32, offset: 32)
!773 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 320, align: 64, elements: !774, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64, offset: 128)
!778 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 896, align: 64, elements: !779, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !453, size: 64, align: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !212, size: 32, align: 32, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64, offset: 704)
!788 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 832, align: 64, elements: !789, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !333, size: 192, align: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16, offset: 400)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !305, size: 128, align: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !305, size: 128, align: 64, offset: 704)
!798 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 384, align: 64, elements: !799, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!799 = !{!800, !801, !802, !803, !804, !805, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !305, size: 128, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16, offset: 144)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !281, size: 16, align: 16, offset: 160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !307, size: 64, align: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !212, size: 32, align: 32, offset: 320)
!807 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 128, align: 64, elements: !808, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !399, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !399, size: 64, align: 64, offset: 64)
!811 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, size: 896, align: 64, elements: !812, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !327, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !330, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !333, size: 192, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !232, size: 32, align: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !281, size: 16, align: 16)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !281, size: 16, align: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !281, size: 16, align: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !249, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !350, size: 64, align: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 256, align: 64, elements: !830, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !232, size: 32, align: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !333, size: 192, align: 64, offset: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 64, align: 32, elements: !834, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !232, size: 32, align: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !232, size: 32, align: 32, offset: 32)
!837 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 320, align: 64, elements: !838, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!838 = !{!839, !840, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !307, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !307, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !333, size: 192, align: 64, offset: 128)
!842 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 896, align: 64, elements: !843, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !333, size: 192, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !333, size: 192, align: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !307, size: 64, align: 64, offset: 384)
