; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/media.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Lit_Interval_Struct" = type { i32, double, double, double }
%"struct.pov::Media_Interval_Struct" = type { i32, i32, double, double, double, [5 x float], [5 x float], [5 x float] }
%"struct.pov::photon_options_struct" = type { i32, double, double, double, i32, i32, double, double, double, i32, i32, i8*, i32, i32, %"struct.pov::photon_map_struct", i32, double, double, %"struct.pov::Object_Struct"*, double*, double*, %"struct.pov::photon_struct"**, double*, i32, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, i8, %"struct.pov::photon_map_struct", double, i32, i32, i32, i32 }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !136, line: 47, size: 32, align: 32, elements: !137, identifier: "_ZTSN3pov11PATTERN_IDSE")
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!138 = !DIEnumerator(name: "NO_PATTERN", value: 0)
!139 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!140 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!141 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!142 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!143 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!144 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!145 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!146 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!147 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!148 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!149 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!150 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!151 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!152 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!153 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!154 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!155 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!156 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!157 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!158 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!159 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!160 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!161 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!162 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!163 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!164 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!165 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!166 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!167 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!168 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!169 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!170 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!171 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!172 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!173 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!174 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!175 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!176 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!177 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!178 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!179 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!180 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!181 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!182 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!183 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!184 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!185 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!186 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!187 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!188 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !190, line: 701, size: 32, align: 32, elements: !191)
!190 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIEnumerator(name: "pRED", value: 0)
!193 = !DIEnumerator(name: "pGREEN", value: 1)
!194 = !DIEnumerator(name: "pBLUE", value: 2)
!195 = !DIEnumerator(name: "pFILTER", value: 3)
!196 = !DIEnumerator(name: "pTRANSM", value: 4)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !190, line: 692, size: 32, align: 32, elements: !198)
!198 = !{!199, !200, !201, !202}
!199 = !DIEnumerator(name: "X", value: 0)
!200 = !DIEnumerator(name: "Y", value: 1)
!201 = !DIEnumerator(name: "Z", value: 2)
!202 = !DIEnumerator(name: "T", value: 3)
!203 = !{!204, !210, !215, !220, !259, !280, !285, !298, !309, !315, !330, !345, !373, !379, !389, !398, !422, !429, !441, !447, !453, !457, !461, !466, !477, !487, !496, !500, !525, !576, !586, !599, !607, !628, !636, !657, !675, !679, !683, !688, !698, !708, !717, !721, !748, !803, !810, !821, !828, !834, !852, !856, !860, !865, !875, !885, !894, !898, !916, !920, !924, !929, !939, !949, !958, !962, !969, !420, !979, !208, !3, !228, !981, !135, !249, !257, !273, !254, !987, !989, !1006}
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 82, size: 64, align: 32, elements: !206, identifier: "_ZTS5div_t")
!205 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !205, line: 83, baseType: !208, size: 32, align: 32)
!208 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !205, line: 84, baseType: !208, size: 32, align: 32, offset: 32)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 87, size: 128, align: 64, elements: !211, identifier: "_ZTS6ldiv_t")
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !205, line: 88, baseType: !213, size: 64, align: 64)
!213 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !205, line: 89, baseType: !213, size: 64, align: 64, offset: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 93, size: 128, align: 64, elements: !216, identifier: "_ZTS7lldiv_t")
!216 = !{!217, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !205, line: 94, baseType: !218, size: 64, align: 64)
!218 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !205, line: 95, baseType: !218, size: 64, align: 64, offset: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !190, line: 1069, size: 1728, align: 64, elements: !221, identifier: "_ZTSN3pov12Media_StructE")
!221 = !{!222, !223, !224, !225, !226, !227, !229, !230, !231, !232, !233, !234, !235, !236, !242, !243, !244, !245, !246, !247, !248, !250, !251, !252, !253, !256}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1071, baseType: !208, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1072, baseType: !208, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1073, baseType: !208, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1074, baseType: !208, size: 32, align: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1075, baseType: !208, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1076, baseType: !228, size: 64, align: 64, offset: 192)
!228 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1077, baseType: !208, size: 32, align: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1078, baseType: !228, size: 64, align: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1078, baseType: !228, size: 64, align: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1079, baseType: !208, size: 32, align: 32, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1080, baseType: !208, size: 32, align: 32, offset: 480)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1081, baseType: !208, size: 32, align: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1082, baseType: !208, size: 32, align: 32, offset: 544)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1083, baseType: !237, size: 160, align: 32, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !190, line: 681, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 160, align: 32, elements: !240)
!239 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!240 = !{!241}
!241 = !DISubrange(count: 5)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1084, baseType: !237, size: 160, align: 32, offset: 736)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1085, baseType: !237, size: 160, align: 32, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1086, baseType: !237, size: 160, align: 32, offset: 1056)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1088, baseType: !228, size: 64, align: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1089, baseType: !228, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1090, baseType: !228, size: 64, align: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1091, baseType: !249, size: 64, align: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1093, baseType: !228, size: 64, align: 64, offset: 1472)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1094, baseType: !208, size: 32, align: 32, offset: 1536)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1095, baseType: !208, size: 32, align: 32, offset: 1568)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1097, baseType: !254, size: 64, align: 64, offset: 1600)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !190, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !190, line: 1099, baseType: !257, size: 64, align: 64, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !190, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !190, line: 1328, size: 1472, align: 64, elements: !260, identifier: "_ZTSN3pov14Pigment_StructE")
!260 = !{!261, !263, !264, !265, !266, !267, !268, !269, !272, !275, !278, !279}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !262, size: 16, align: 16)
!262 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !262, size: 16, align: 16, offset: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !262, size: 16, align: 16, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !208, size: 32, align: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !239, size: 32, align: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !239, size: 32, align: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !239, size: 32, align: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !270, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !190, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !273, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !190, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !276, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !190, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !190, line: 1331, baseType: !237, size: 160, align: 32, offset: 1280)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !190, line: 1373, size: 192, align: 64, elements: !281, identifier: "_ZTSN3pov12Warps_StructE")
!281 = !{!282, !283, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !190, line: 1375, baseType: !262, size: 16, align: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !190, line: 1375, baseType: !270, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !190, line: 1375, baseType: !270, size: 64, align: 64, offset: 128)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !190, line: 1323, size: 1280, align: 64, elements: !286, identifier: "_ZTSN3pov14Pattern_StructE")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !262, size: 16, align: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !262, size: 16, align: 16, offset: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !262, size: 16, align: 16, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !208, size: 32, align: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !239, size: 32, align: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !239, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !239, size: 32, align: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !270, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !273, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !276, size: 64, align: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !190, line: 1045, size: 128, align: 64, elements: !299, identifier: "_ZTSN3pov16Blend_Map_StructE")
!299 = !{!300, !301, !303, !305, !306}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !190, line: 1047, baseType: !208, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !190, line: 1048, baseType: !302, size: 16, align: 16, offset: 32)
!302 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !190, line: 1049, baseType: !304, size: 8, align: 8, offset: 48)
!304 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !190, line: 1049, baseType: !304, size: 8, align: 8, offset: 56)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !190, line: 1050, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !190, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !190, line: 1031, size: 256, align: 64, elements: !310, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!310 = !{!311, !312, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !190, line: 1033, baseType: !239, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !190, line: 1034, baseType: !313, size: 8, align: 8, offset: 32)
!313 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !190, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!315 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !190, line: 1035, size: 192, align: 64, elements: !316, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!316 = !{!317, !318, !319, !322, !325}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !190, line: 1037, baseType: !237, size: 160, align: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !190, line: 1038, baseType: !254, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !190, line: 1039, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !190, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !190, line: 1040, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !190, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !190, line: 1041, baseType: !326, size: 128, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !190, line: 676, baseType: !327)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, align: 64, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 2)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !190, line: 1334, size: 1344, align: 64, elements: !331, identifier: "_ZTSN3pov14Tnormal_StructE")
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !262, size: 16, align: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !262, size: 16, align: 16, offset: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !262, size: 16, align: 16, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !208, size: 32, align: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !239, size: 32, align: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !239, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !239, size: 32, align: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !270, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !273, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !276, size: 64, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1337, baseType: !239, size: 32, align: 32, offset: 1280)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1338, baseType: !239, size: 32, align: 32, offset: 1312)
!345 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !190, line: 1336, size: 896, align: 64, elements: !346, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!346 = !{!347, !350, !353, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !190, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !190, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !190, line: 677, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 192, align: 64, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 3)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !239, size: 32, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !254, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !190, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !190, line: 1269, size: 128, align: 64, elements: !374, identifier: "_ZTSN3pov19Density_file_StructE")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !190, line: 1271, baseType: !208, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !190, line: 1272, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !190, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !190, line: 1275, size: 320, align: 64, elements: !380, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!380 = !{!381, !382, !384, !385, !386, !387, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1277, baseType: !208, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1278, baseType: !383, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1279, baseType: !208, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1279, baseType: !208, size: 32, align: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1279, baseType: !208, size: 32, align: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1280, baseType: !208, size: 32, align: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!389 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !190, line: 1281, size: 64, align: 64, elements: !390, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!390 = !{!391, !393, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !190, line: 1283, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !190, line: 1284, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !190, line: 1285, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !190, line: 1220, size: 960, align: 64, elements: !399, identifier: "_ZTSN3pov12Image_StructE")
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !419, !421}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1222, baseType: !208, size: 32, align: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1223, baseType: !208, size: 32, align: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1224, baseType: !208, size: 32, align: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1225, baseType: !208, size: 32, align: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1226, baseType: !208, size: 32, align: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1227, baseType: !208, size: 32, align: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1227, baseType: !208, size: 32, align: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1228, baseType: !302, size: 16, align: 16, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1229, baseType: !304, size: 8, align: 8, offset: 240)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1230, baseType: !304, size: 8, align: 8, offset: 248)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1231, baseType: !354, size: 192, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1232, baseType: !239, size: 32, align: 32, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1232, baseType: !239, size: 32, align: 32, offset: 480)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1233, baseType: !326, size: 128, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1234, baseType: !228, size: 64, align: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1234, baseType: !228, size: 64, align: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1235, baseType: !417, size: 64, align: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !190, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1236, baseType: !420, size: 64, align: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !190, line: 1161, size: 80, align: 16, elements: !423, identifier: "_ZTSN3pov19Image_Colour_StructE")
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !190, line: 1163, baseType: !262, size: 16, align: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !190, line: 1163, baseType: !262, size: 16, align: 16, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !190, line: 1163, baseType: !262, size: 16, align: 16, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !190, line: 1163, baseType: !262, size: 16, align: 16, offset: 48)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !190, line: 1163, baseType: !262, size: 16, align: 16, offset: 64)
!429 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !190, line: 1237, size: 64, align: 64, elements: !430, identifier: "_ZTSN3pov12Image_StructUt_E")
!430 = !{!431, !434, !437, !439}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !190, line: 1239, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !190, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !190, line: 1240, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !190, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !190, line: 1241, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !190, line: 1242, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !190, line: 1166, size: 256, align: 64, elements: !442, identifier: "_ZTSN3pov18Image8_Line_StructE")
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !190, line: 1168, baseType: !392, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !190, line: 1168, baseType: !392, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !190, line: 1168, baseType: !392, size: 64, align: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !190, line: 1168, baseType: !392, size: 64, align: 64, offset: 192)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !190, line: 1171, size: 256, align: 64, elements: !448, identifier: "_ZTSN3pov19Image16_Line_StructE")
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !190, line: 1173, baseType: !394, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !190, line: 1173, baseType: !394, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !190, line: 1173, baseType: !394, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !190, line: 1173, baseType: !394, size: 64, align: 64, offset: 192)
!453 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 256, align: 64, elements: !454, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !190, line: 1336, baseType: !239, size: 32, align: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64, offset: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 64, align: 32, elements: !458, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !190, line: 1336, baseType: !239, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !190, line: 1336, baseType: !239, size: 32, align: 32, offset: 32)
!461 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 320, align: 64, elements: !462, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64, offset: 128)
!466 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 896, align: 64, elements: !467, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!467 = !{!468, !469, !470, !471, !472, !473, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !474, size: 64, align: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !208, size: 32, align: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64, offset: 704)
!477 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 832, align: 64, elements: !478, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !354, size: 192, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16, offset: 400)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !326, size: 128, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !190, line: 1336, baseType: !326, size: 128, align: 64, offset: 704)
!487 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 384, align: 64, elements: !488, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!488 = !{!489, !490, !491, !492, !493, !494, !495}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !326, size: 128, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16, offset: 144)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !302, size: 16, align: 16, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !228, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !190, line: 1336, baseType: !208, size: 32, align: 32, offset: 320)
!496 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !190, line: 1336, size: 128, align: 64, elements: !497, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !190, line: 1336, baseType: !420, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !190, line: 1336, baseType: !420, size: 64, align: 64, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !190, line: 1521, size: 960, align: 64, elements: !501, identifier: "_ZTSN3pov13Object_StructE")
!501 = !{!502, !505, !506, !507, !508, !509, !512, !513, !514, !517, !519, !522, !523, !524}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !190, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !208, size: 32, align: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !371, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !323, size: 64, align: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !323, size: 64, align: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !510, size: 64, align: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !190, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !371, size: 64, align: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !371, size: 64, align: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !515, size: 64, align: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !190, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!517 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !518, size: 192, align: 32, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !190, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !520, size: 64, align: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !190, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !520, size: 64, align: 64, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !239, size: 32, align: 32, offset: 896)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !190, line: 1523, baseType: !397, size: 32, align: 32, offset: 928)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !190, line: 1503, size: 704, align: 64, elements: !526, identifier: "_ZTSN3pov13Method_StructE")
!526 = !{!527, !536, !541, !548, !550, !555, !560, !562, !564, !569, !574}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1505, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !190, line: 1420, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!208, !371, !532, !534}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !190, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !190, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1506, baseType: !537, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !190, line: 1421, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!208, !249, !371}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1507, baseType: !542, size: 64, align: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !190, line: 1422, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !249, !371, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !190, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!548 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1508, baseType: !549, size: 64, align: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !190, line: 1423, baseType: !543)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1509, baseType: !551, size: 64, align: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !190, line: 1424, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!420, !371}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1510, baseType: !556, size: 64, align: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !190, line: 1425, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !371, !249, !520}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1511, baseType: !561, size: 64, align: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !190, line: 1426, baseType: !557)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1512, baseType: !563, size: 64, align: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !190, line: 1427, baseType: !557)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1513, baseType: !565, size: 64, align: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !190, line: 1428, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !371, !520}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1514, baseType: !570, size: 64, align: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !190, line: 1429, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !371}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !190, line: 1515, baseType: !575, size: 64, align: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !190, line: 1430, baseType: !571)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !190, line: 1783, size: 6848, align: 64, elements: !577, identifier: "_ZTSN3pov10Ray_StructE")
!577 = !{!578, !579, !580, !581, !582}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !190, line: 1785, baseType: !354, size: 192, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !190, line: 1786, baseType: !354, size: 192, align: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !190, line: 1787, baseType: !208, size: 32, align: 32, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !190, line: 1788, baseType: !397, size: 32, align: 32, offset: 416)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !190, line: 1789, baseType: !583, size: 6400, align: 64, offset: 448)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 6400, align: 64, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 100)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !190, line: 1112, size: 512, align: 64, elements: !587, identifier: "_ZTSN3pov15Interior_StructE")
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1114, baseType: !208, size: 32, align: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1115, baseType: !208, size: 32, align: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1115, baseType: !208, size: 32, align: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1116, baseType: !239, size: 32, align: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1116, baseType: !239, size: 32, align: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1117, baseType: !239, size: 32, align: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1117, baseType: !239, size: 32, align: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1118, baseType: !239, size: 32, align: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1118, baseType: !239, size: 32, align: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1119, baseType: !237, size: 160, align: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !190, line: 1120, baseType: !257, size: 64, align: 64, offset: 448)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !190, line: 1621, size: 192, align: 64, elements: !600, identifier: "_ZTSN3pov13istack_structE")
!600 = !{!601, !603, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !190, line: 1623, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !190, line: 1624, baseType: !604, size: 64, align: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !190, line: 1625, baseType: !397, size: 32, align: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !190, line: 1626, baseType: !397, size: 32, align: 32, offset: 160)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !190, line: 1596, size: 1600, align: 64, elements: !608, identifier: "_ZTSN3pov10istk_entryE")
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1598, baseType: !228, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1599, baseType: !354, size: 192, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1600, baseType: !354, size: 192, align: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1601, baseType: !354, size: 192, align: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1602, baseType: !326, size: 128, align: 64, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1603, baseType: !371, size: 64, align: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1610, baseType: !208, size: 32, align: 32, offset: 832)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1610, baseType: !208, size: 32, align: 32, offset: 864)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1611, baseType: !228, size: 64, align: 64, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1611, baseType: !228, size: 64, align: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1612, baseType: !228, size: 64, align: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1612, baseType: !228, size: 64, align: 64, offset: 1088)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1613, baseType: !228, size: 64, align: 64, offset: 1152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1613, baseType: !228, size: 64, align: 64, offset: 1216)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1614, baseType: !228, size: 64, align: 64, offset: 1280)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1614, baseType: !228, size: 64, align: 64, offset: 1344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1614, baseType: !228, size: 64, align: 64, offset: 1408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1616, baseType: !420, size: 64, align: 64, offset: 1472)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !190, line: 1618, baseType: !420, size: 64, align: 64, offset: 1536)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !190, line: 1002, size: 2048, align: 64, elements: !629, identifier: "_ZTSN3pov16Transform_StructE")
!629 = !{!630, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !190, line: 1004, baseType: !631, size: 1024, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !190, line: 679, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 1024, align: 64, elements: !633)
!633 = !{!634, !634}
!634 = !DISubrange(count: 4)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !190, line: 1005, baseType: !631, size: 1024, align: 64, offset: 1024)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !190, line: 1345, size: 1664, align: 64, elements: !637, identifier: "_ZTSN3pov14Texture_StructE")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !655, !656}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !262, size: 16, align: 16)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !262, size: 16, align: 16, offset: 16)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !262, size: 16, align: 16, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !208, size: 32, align: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !239, size: 32, align: 32, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !239, size: 32, align: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !239, size: 32, align: 32, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !270, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !273, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !276, size: 64, align: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, baseType: !323, size: 64, align: 64, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1348, baseType: !254, size: 64, align: 64, offset: 1344)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1349, baseType: !320, size: 64, align: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1350, baseType: !653, size: 64, align: 64, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !190, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1351, baseType: !323, size: 64, align: 64, offset: 1536)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1352, baseType: !208, size: 32, align: 32, offset: 1600)
!657 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !190, line: 1347, size: 896, align: 64, elements: !658, identifier: "_ZTSN3pov14Texture_StructUt_E")
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !348, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !351, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !239, size: 32, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !254, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, baseType: !371, size: 64, align: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 256, align: 64, elements: !676, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !190, line: 1347, baseType: !239, size: 32, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64, offset: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 64, align: 32, elements: !680, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !190, line: 1347, baseType: !239, size: 32, align: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !190, line: 1347, baseType: !239, size: 32, align: 32, offset: 32)
!683 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 320, align: 64, elements: !684, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64, offset: 128)
!688 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 896, align: 64, elements: !689, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !474, size: 64, align: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !208, size: 32, align: 32, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64, offset: 704)
!698 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 832, align: 64, elements: !699, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !354, size: 192, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16, offset: 400)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !326, size: 128, align: 64, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !190, line: 1347, baseType: !326, size: 128, align: 64, offset: 704)
!708 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 384, align: 64, elements: !709, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!709 = !{!710, !711, !712, !713, !714, !715, !716}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !326, size: 128, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16, offset: 144)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !302, size: 16, align: 16, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !228, size: 64, align: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !190, line: 1347, baseType: !208, size: 32, align: 32, offset: 320)
!717 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !190, line: 1347, size: 128, align: 64, elements: !718, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !190, line: 1347, baseType: !420, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !190, line: 1347, baseType: !420, size: 64, align: 64, offset: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !190, line: 1356, size: 928, align: 32, elements: !722, identifier: "_ZTSN3pov13Finish_StructE")
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !742, !743, !744, !745, !746, !747}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1358, baseType: !239, size: 32, align: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1358, baseType: !239, size: 32, align: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1359, baseType: !239, size: 32, align: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1359, baseType: !239, size: 32, align: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1360, baseType: !239, size: 32, align: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1360, baseType: !239, size: 32, align: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1361, baseType: !239, size: 32, align: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1361, baseType: !239, size: 32, align: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1361, baseType: !239, size: 32, align: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1362, baseType: !239, size: 32, align: 32, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1362, baseType: !239, size: 32, align: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1362, baseType: !239, size: 32, align: 32, offset: 352)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1362, baseType: !239, size: 32, align: 32, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1362, baseType: !239, size: 32, align: 32, offset: 416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1363, baseType: !239, size: 32, align: 32, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1363, baseType: !239, size: 32, align: 32, offset: 480)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1364, baseType: !740, size: 96, align: 32, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !190, line: 682, baseType: !741)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 96, align: 32, elements: !356)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1364, baseType: !740, size: 96, align: 32, offset: 608)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1364, baseType: !740, size: 96, align: 32, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1365, baseType: !239, size: 32, align: 32, offset: 800)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1366, baseType: !208, size: 32, align: 32, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1367, baseType: !239, size: 32, align: 32, offset: 864)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !190, line: 1368, baseType: !208, size: 32, align: 32, offset: 896)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !190, line: 1566, size: 3456, align: 64, elements: !749, identifier: "_ZTSN3pov19Light_Source_StructE")
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !794, !795, !796, !797}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !503, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !208, size: 32, align: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !371, size: 64, align: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !323, size: 64, align: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !323, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !510, size: 64, align: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !371, size: 64, align: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !371, size: 64, align: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !515, size: 64, align: 64, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !518, size: 192, align: 32, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !520, size: 64, align: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !520, size: 64, align: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !239, size: 32, align: 32, offset: 896)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !397, size: 32, align: 32, offset: 928)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1568, baseType: !371, size: 64, align: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1569, baseType: !237, size: 160, align: 32, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1570, baseType: !354, size: 192, align: 64, offset: 1216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1570, baseType: !354, size: 192, align: 64, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1570, baseType: !354, size: 192, align: 64, offset: 1600)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1570, baseType: !354, size: 192, align: 64, offset: 1792)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1570, baseType: !354, size: 192, align: 64, offset: 1984)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1571, baseType: !228, size: 64, align: 64, offset: 2176)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1571, baseType: !228, size: 64, align: 64, offset: 2240)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1571, baseType: !228, size: 64, align: 64, offset: 2304)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1572, baseType: !228, size: 64, align: 64, offset: 2368)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1572, baseType: !228, size: 64, align: 64, offset: 2432)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1573, baseType: !515, size: 64, align: 64, offset: 2496)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1574, baseType: !313, size: 8, align: 8, offset: 2560)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1574, baseType: !313, size: 8, align: 8, offset: 2568)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1574, baseType: !313, size: 8, align: 8, offset: 2576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1575, baseType: !781, size: 8, align: 8, offset: 2584)
!781 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1576, baseType: !781, size: 8, align: 8, offset: 2592)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1577, baseType: !313, size: 8, align: 8, offset: 2600)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1577, baseType: !313, size: 8, align: 8, offset: 2608)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1578, baseType: !313, size: 8, align: 8, offset: 2616)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1579, baseType: !208, size: 32, align: 32, offset: 2624)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1579, baseType: !208, size: 32, align: 32, offset: 2656)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1580, baseType: !208, size: 32, align: 32, offset: 2688)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1581, baseType: !208, size: 32, align: 32, offset: 2720)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1582, baseType: !208, size: 32, align: 32, offset: 2752)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1583, baseType: !792, size: 64, align: 64, offset: 2816)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1584, baseType: !371, size: 64, align: 64, offset: 2880)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1584, baseType: !371, size: 64, align: 64, offset: 2944)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1585, baseType: !276, size: 64, align: 64, offset: 3008)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !190, line: 1586, baseType: !798, size: 384, align: 64, offset: 3072)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 384, align: 64, elements: !801)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !190, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!801 = !{!802}
!802 = !DISubrange(count: 6)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !190, line: 876, size: 192, align: 32, elements: !804, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!804 = !{!805, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !190, line: 878, baseType: !806, size: 96, align: 32)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !190, line: 872, baseType: !807)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 96, align: 32, elements: !356)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !190, line: 870, baseType: !239)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !190, line: 878, baseType: !806, size: 96, align: 32, offset: 96)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !5, file: !190, line: 1557, size: 384, align: 64, elements: !811, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!811 = !{!812, !813, !816, !818, !819}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !190, line: 1559, baseType: !262, size: 16, align: 16)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !190, line: 1560, baseType: !814, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !5, file: !190, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !190, line: 1561, baseType: !817, size: 128, align: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !5, file: !190, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !190, line: 1562, baseType: !262, size: 16, align: 16, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !190, line: 1563, baseType: !820, size: 64, align: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !5, file: !190, line: 1534, size: 320, align: 64, elements: !822, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!822 = !{!823, !824, !825, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !190, line: 1536, baseType: !302, size: 16, align: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !190, line: 1537, baseType: !302, size: 16, align: 16, offset: 16)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !190, line: 1538, baseType: !518, size: 192, align: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !190, line: 1539, baseType: !827, size: 64, align: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !190, line: 1545, size: 128, align: 32, elements: !829, identifier: "_ZTSN3pov14Project_StructE")
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !190, line: 1547, baseType: !208, size: 32, align: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !190, line: 1547, baseType: !208, size: 32, align: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !190, line: 1547, baseType: !208, size: 32, align: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !190, line: 1547, baseType: !208, size: 32, align: 32, offset: 96)
!834 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !190, line: 1325, size: 896, align: 64, elements: !835, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !190, line: 1325, baseType: !348, size: 64, align: 64)
