; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/messageoutput.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov_frontend::MessageOutput" = type { %class.POVMS_MessageReceiver, [8 x %"class.pov_base::TextStreamBuffer"*], [8 x i8*], [8 x i8], i32, i8*, [80 x i8] }
%class.POVMS_MessageReceiver = type { i32 (...)**, i8*, %"struct.POVMS_MessageReceiver::HandlerNode"* }
%"struct.POVMS_MessageReceiver::HandlerNode" = type { %"struct.POVMS_MessageReceiver::HandlerNode"*, %"struct.POVMS_MessageReceiver::HandlerNode"*, i32, i32, %"class.POVMS_MessageReceiver::HandlerOO"*, %"class.POVMS_MessageReceiver::Handler"* }
%"class.POVMS_MessageReceiver::HandlerOO" = type { i32 (...)** }
%"class.POVMS_MessageReceiver::Handler" = type { i32 (...)** }
%"class.pov_base::TextStreamBuffer" = type { i32 (...)**, i8*, i32, i32, i32, i32 }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%"class.POVMS_MessageReceiver::MemberHandler" = type { %"class.POVMS_MessageReceiver::Handler", { i64, i64 }, %"class.pov_frontend::MessageOutput"* }


!194 = !DIEnumerator(name: "kPOVAttrib_FunctionVMInstrEst", value: 1180061001)
!195 = !DIEnumerator(name: "kPOVAttrib_State", value: 1400136052)
!196 = !DIEnumerator(name: "kPOVAttrib_Warning", value: 1466004078)
!197 = !DIEnumerator(name: "kPOVAttrib_Line", value: 1281977957)
!198 = !DIEnumerator(name: "kPOVAttrib_Column", value: 1131375733)
!199 = !DIEnumerator(name: "kPOVAttrib_FilePosition", value: 1179676531)
!200 = !DIEnumerator(name: "kPOVAttrib_TokenName", value: 1416588110)
!201 = !DIEnumerator(name: "kPOVAttrib_Error", value: 1165128303)
!202 = !DIEnumerator(name: "kPOVAttrib_ObjectName", value: 1330536813)
!203 = !DIEnumerator(name: "kPOVAttrib_ObjectID", value: 1330209893)
!204 = !DIEnumerator(name: "kPOVAttrib_ISectsTests", value: 1230271348)
!205 = !DIEnumerator(name: "kPOVAttrib_ISectsSucceeded", value: 1230206307)
!206 = !DIEnumerator(name: "kPOVAttrib_CommandString", value: 1131375955)
!207 = !DIEnumerator(name: "kPOVAttrib_ReturnAction", value: 1380017012)
!208 = !DIEnumerator(name: "kPOVAttrib_FrameTime", value: 1179937133)
!209 = !DIEnumerator(name: "kPOVAttrib_AnimationTime", value: 1096051053)
!210 = !DIEnumerator(name: "kPOVAttrib_IncludeHeader", value: 1231971144)
!211 = !DIEnumerator(name: "kPOVAttrib_IncludeIni", value: 1231971145)
!212 = !DIEnumerator(name: "kPOVAttrib_PreviewRefCon", value: 1347577190)
!213 = !DIEnumerator(name: "kPOVAttrib_INIFile", value: 1229351276)
!214 = !DIEnumerator(name: "kPOVAttrib_RenderOptions", value: 1380937844)
!215 = !DIEnumerator(name: "kPOVAttrib_Identifier", value: 1231316334)
!216 = !DIEnumerator(name: "kPOVAttrib_Value", value: 1449225333)
!217 = !DIEnumerator(name: "kPOVAttrib_StartColumn", value: 1281713780)
!218 = !DIEnumerator(name: "kPOVAttrib_EndColumn", value: 1382639464)
!219 = !DIEnumerator(name: "kPOVAttrib_StartRow", value: 1416589344)
!220 = !DIEnumerator(name: "kPOVAttrib_EndRow", value: 1114600564)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !223, file: !222, line: 44, size: 32, align: 32, elements: !224)
!222 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_err.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!223 = !DINamespace(name: "pov_base", scope: null, file: !222, line: 41)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!225 = !DIEnumerator(name: "kNoError", value: 0)
!226 = !DIEnumerator(name: "kNoErr", value: 0)
!227 = !DIEnumerator(name: "kParamErr", value: -1)
!228 = !DIEnumerator(name: "kMemFullErr", value: -2)
!229 = !DIEnumerator(name: "kOutOfMemoryErr", value: -2)
!230 = !DIEnumerator(name: "kInvalidDataSizeErr", value: -3)
!231 = !DIEnumerator(name: "kCannotHandleDataErr", value: -4)
!232 = !DIEnumerator(name: "kNullPointerErr", value: -5)
!233 = !DIEnumerator(name: "kChecksumErr", value: -6)
!234 = !DIEnumerator(name: "kParseErr", value: -7)
!235 = !DIEnumerator(name: "kCannotOpenFileErr", value: -8)
!236 = !DIEnumerator(name: "kInvalidDestAddrErr", value: -9)
!237 = !DIEnumerator(name: "kCannotConnectErr", value: -10)
!238 = !DIEnumerator(name: "kDisconnectedErr", value: -11)
!239 = !DIEnumerator(name: "kHostDisconnectedErr", value: -12)
!240 = !DIEnumerator(name: "kNetworkDataErr", value: -13)
!241 = !DIEnumerator(name: "kNetworkConnectionErr", value: -14)
!242 = !DIEnumerator(name: "kObjectAccessErr", value: -15)
!243 = !DIEnumerator(name: "kVersionErr", value: -16)
!244 = !DIEnumerator(name: "kFileDataErr", value: -17)
!245 = !DIEnumerator(name: "kAuthorisationErr", value: -18)
!246 = !DIEnumerator(name: "kDataTypeErr", value: -19)
!247 = !DIEnumerator(name: "kTimeoutErr", value: -20)
!248 = !DIEnumerator(name: "kInvalidContextErr", value: -21)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !250, line: 151, size: 32, align: 32, elements: !251)
!250 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!252 = !DIEnumerator(name: "kPOVMSType_Object", value: 1329744453)
!253 = !DIEnumerator(name: "kPOVMSType_LockedObject", value: 1280262987)
!254 = !DIEnumerator(name: "kPOVMSType_ResultObject", value: 1380275029)
!255 = !DIEnumerator(name: "kPOVMSType_Address", value: 1094992978)
!256 = !DIEnumerator(name: "kPOVMSType_Null", value: 1314212940)
!257 = !DIEnumerator(name: "kPOVMSType_WildCard", value: 707406378)
!258 = !DIEnumerator(name: "kPOVMSType_CString", value: 1129534546)
!259 = !DIEnumerator(name: "kPOVMSType_UnicodeText", value: 1431590996)
!260 = !DIEnumerator(name: "kPOVMSType_Int", value: 1229870132)
!261 = !DIEnumerator(name: "kPOVMSType_Long", value: 1229870136)
!262 = !DIEnumerator(name: "kPOVMSType_Float", value: 1179407412)
!263 = !DIEnumerator(name: "kPOVMSType_Double", value: 1179407416)
!264 = !DIEnumerator(name: "kPOVMSType_Bool", value: 1112493900)
!265 = !DIEnumerator(name: "kPOVMSType_Pixel", value: 1346983988)
!266 = !DIEnumerator(name: "kPOVMSType_Type", value: 1415139397)
!267 = !DIEnumerator(name: "kPOVMSType_List", value: 1279873876)
!268 = !{!269, !275, !280, !285, !293, !347, !351, !352, !417, !477, !485, !492, !528, !547, !552, !558, !564, !662, !706, !748, !755, !770, !785, !3, !830, !273, !316, !631, !278, !831, !851}
!269 = !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 82, size: 64, align: 32, elements: !271, identifier: "_ZTS5div_t")
!270 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!271 = !{!272, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !270, line: 83, baseType: !273, size: 32, align: 32)
!273 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !270, line: 84, baseType: !273, size: 32, align: 32, offset: 32)
!275 = !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 87, size: 128, align: 64, elements: !276, identifier: "_ZTS6ldiv_t")
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !270, line: 88, baseType: !278, size: 64, align: 64)
!278 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !270, line: 89, baseType: !278, size: 64, align: 64, offset: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 93, size: 128, align: 64, elements: !281, identifier: "_ZTS7lldiv_t")
!281 = !{!282, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !270, line: 94, baseType: !283, size: 64, align: 64)
!283 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !270, line: 95, baseType: !283, size: 64, align: 64, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !286, identifier: "_ZTS13__va_list_tag")
!286 = !{!287, !289, !290, !292}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !288, size: 32, align: 32)
!288 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !288, size: 32, align: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !291, size: 64, align: 64, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !294, line: 122, size: 1216, align: 64, elements: !295, identifier: "_ZTS7__sFILE")
!294 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!295 = !{!296, !299, !300, !301, !303, !304, !305, !306, !307, !311, !317, !326, !332, !333, !335, !336, !340, !344, !345, !346}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !294, line: 123, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !294, line: 124, baseType: !273, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !294, line: 125, baseType: !273, size: 32, align: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !294, line: 126, baseType: !302, size: 16, align: 16, offset: 128)
!302 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !294, line: 127, baseType: !302, size: 16, align: 16, offset: 144)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !294, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !294, line: 129, baseType: !273, size: 32, align: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !294, line: 132, baseType: !291, size: 64, align: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !294, line: 133, baseType: !308, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!273, !291}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !294, line: 134, baseType: !312, size: 64, align: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!273, !291, !315, !273}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !294, line: 135, baseType: !318, size: 64, align: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !291, !321, !273}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !294, line: 77, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !323, line: 71, baseType: !324)
!323 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !325, line: 46, baseType: !283)
!325 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !294, line: 136, baseType: !327, size: 64, align: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!273, !291, !330, !273}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !294, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !294, line: 140, baseType: !334, size: 64, align: 64, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !294, line: 141, baseType: !273, size: 32, align: 32, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !294, line: 144, baseType: !337, size: 24, align: 8, offset: 928)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 24, align: 8, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 3)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !294, line: 145, baseType: !341, size: 8, align: 8, offset: 952)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 8, align: 8, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 1)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !294, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !294, line: 151, baseType: !273, size: 32, align: 32, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !294, line: 152, baseType: !321, size: 64, align: 64, offset: 1152)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !294, line: 88, size: 128, align: 64, elements: !348, identifier: "_ZTS6__sbuf")
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !294, line: 89, baseType: !297, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !294, line: 90, baseType: !273, size: 32, align: 32, offset: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !294, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!352 = !DICompositeType(tag: DW_TAG_class_type, name: "MessageOutput", scope: !353, file: !4, line: 45, size: 2048, align: 64, elements: !354, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend13MessageOutputE")
!353 = !DINamespace(name: "pov_frontend", scope: null, file: !4, line: 41)
!354 = !{!355, !356, !361, !363, !366, !368, !369, !373, !378, !381, !384, !385, !389, !392, !395, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !414}
!355 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend13MessageOutputE", baseType: !"_ZTS21POVMS_MessageReceiver", flags: DIFlagPublic)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 64, baseType: !357, size: 512, align: 64, offset: 192, flags: DIFlagProtected)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 512, align: 64, elements: !359)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64)
!359 = !{!360}
!360 = !DISubrange(count: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "streamnames", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 65, baseType: !362, size: 512, align: 64, offset: 704, flags: DIFlagProtected)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 512, align: 64, elements: !359)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "consoleoutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 66, baseType: !364, size: 64, align: 8, offset: 1216, flags: DIFlagProtected)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 64, align: 8, elements: !359)
!365 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "output_string_buffer_size", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 92, baseType: !367, size: 32, align: 32, offset: 1280)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "output_string_buffer", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 93, baseType: !315, size: 64, align: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "status_string_buffer", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 94, baseType: !370, size: 640, align: 8, offset: 1408)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 640, align: 8, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 80)
!373 = !DISubprogram(name: "MessageOutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 48, type: !374, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !376, !377}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend13MessageOutputE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSContext", file: !250, line: 171, baseType: !291)
!378 = !DISubprogram(name: "~MessageOutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 49, type: !379, isLocal: false, isDefinition: false, scopeLine: 49, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !376}
!381 = !DISubprogram(name: "OpenStreams", linkageName: "_ZN12pov_frontend13MessageOutput11OpenStreamsEb", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 68, type: !382, isLocal: false, isDefinition: false, scopeLine: 68, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !376, !365}
!384 = !DISubprogram(name: "CloseStreams", linkageName: "_ZN12pov_frontend13MessageOutput12CloseStreamsEv", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 69, type: !379, isLocal: false, isDefinition: false, scopeLine: 69, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!385 = !DISubprogram(name: "Printfile", linkageName: "_ZN12pov_frontend13MessageOutput9PrintfileEiPKcmi", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 71, type: !386, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !376, !273, !330, !388, !273}
!388 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!389 = !DISubprogram(name: "Printf", linkageName: "_ZN12pov_frontend13MessageOutput6PrintfEiPKcz", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 72, type: !390, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !376, !273, !330, null}
!392 = !DISubprogram(name: "Flush", linkageName: "_ZN12pov_frontend13MessageOutput5FlushEi", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 73, type: !393, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !376, !273}
!395 = !DISubprogram(name: "InitInfo", linkageName: "_ZN12pov_frontend13MessageOutput8InitInfoEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 75, type: !396, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !376, !398, !398, !273}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !250, line: 173, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!400 = !DISubprogram(name: "RenderOptions", linkageName: "_ZN12pov_frontend13MessageOutput13RenderOptionsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 76, type: !396, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!401 = !DISubprogram(name: "RenderStarted", linkageName: "_ZN12pov_frontend13MessageOutput13RenderStartedEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 77, type: !396, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!402 = !DISubprogram(name: "FrameStatistics", linkageName: "_ZN12pov_frontend13MessageOutput15FrameStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 78, type: !396, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!403 = !DISubprogram(name: "ParseStatistics", linkageName: "_ZN12pov_frontend13MessageOutput15ParseStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 79, type: !396, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!404 = !DISubprogram(name: "RenderStatistics", linkageName: "_ZN12pov_frontend13MessageOutput16RenderStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 80, type: !396, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!405 = !DISubprogram(name: "RenderDone", linkageName: "_ZN12pov_frontend13MessageOutput10RenderDoneEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 81, type: !396, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!406 = !DISubprogram(name: "Progress", linkageName: "_ZN12pov_frontend13MessageOutput8ProgressEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 82, type: !396, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!407 = !DISubprogram(name: "Warning", linkageName: "_ZN12pov_frontend13MessageOutput7WarningEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 83, type: !396, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!408 = !DISubprogram(name: "Error", linkageName: "_ZN12pov_frontend13MessageOutput5ErrorEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 84, type: !396, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!409 = !DISubprogram(name: "FatalError", linkageName: "_ZN12pov_frontend13MessageOutput10FatalErrorEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 85, type: !396, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!410 = !DISubprogram(name: "DebugInfo", linkageName: "_ZN12pov_frontend13MessageOutput9DebugInfoEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 86, type: !396, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!411 = !DISubprogram(name: "FileMessage", linkageName: "_ZN12pov_frontend13MessageOutput11FileMessageEiP9POVMSData", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 88, type: !412, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !376, !273, !398}
!414 = !DISubprogram(name: "GetOptionSwitchString", linkageName: "_ZN12pov_frontend13MessageOutput21GetOptionSwitchStringEP9POVMSDatajb", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !4, line: 90, type: !415, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!415 = !DISubroutineType(types: !416)
!416 = !{!330, !376, !398, !288, !365}
!417 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_MessageReceiver", file: !418, line: 226, size: 192, align: 64, elements: !419, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTS21POVMS_MessageReceiver")
!418 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmscpp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!419 = !{!420, !425, !426, !428, !432, !435, !443, !450, !451, !452, !455, !456, !461, !465, !468, !473, !474}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_MessageReceiver", scope: !418, file: !418, baseType: !421, size: 64, flags: DIFlagArtificial)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!273}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 415, baseType: !377, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "receivers", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 416, baseType: !427, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", size: 64, align: 64)
!428 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 360, type: !429, isLocal: false, isDefinition: false, scopeLine: 360, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !431, !377}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS21POVMS_MessageReceiver", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!432 = !DISubprogram(name: "~POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 361, type: !433, isLocal: false, isDefinition: false, scopeLine: 361, containingType: !"_ZTS21POVMS_MessageReceiver", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !431}
!435 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 373, type: !436, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !431, !288, !288, !438, !291}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !418, line: 305, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !442, !442, !273, !291}
!442 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS13POVMS_Message")
!443 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 378, type: !444, isLocal: false, isDefinition: false, scopeLine: 378, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !431, !288, !288, !446, !291}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !418, line: 334, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !398, !398, !273, !291}
!450 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 393, type: !436, isLocal: false, isDefinition: false, scopeLine: 393, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!451 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 398, type: !444, isLocal: false, isDefinition: false, scopeLine: 398, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!452 = !DISubprogram(name: "Remove", linkageName: "_ZN21POVMS_MessageReceiver6RemoveEjj", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 403, type: !453, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !431, !288, !288}
!455 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 418, type: !433, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: true)
!456 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 419, type: !457, isLocal: false, isDefinition: false, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !431, !459}
!459 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!461 = !DISubprogram(name: "operator=", linkageName: "_ZN21POVMS_MessageReceiveraSERKS_", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 420, type: !462, isLocal: false, isDefinition: false, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{!464, !431, !459}
!464 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!465 = !DISubprogram(name: "ReceiveHandler", linkageName: "_ZN21POVMS_MessageReceiver14ReceiveHandlerEP9POVMSDataS1_iPv", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 422, type: !466, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!466 = !DISubroutineType(types: !467)
!467 = !{!273, !398, !398, !273, !291}
!468 = !DISubprogram(name: "AddNodeFront", linkageName: "_ZN21POVMS_MessageReceiver12AddNodeFrontEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 424, type: !469, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !431, !288, !288, !471, !472}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64)
!473 = !DISubprogram(name: "AddNodeBack", linkageName: "_ZN21POVMS_MessageReceiver11AddNodeBackEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 425, type: !469, isLocal: false, isDefinition: false, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true)
!474 = !DISubprogram(name: "RemoveNode", linkageName: "_ZN21POVMS_MessageReceiver10RemoveNodeEPNS_11HandlerNodeE", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 426, type: !475, isLocal: false, isDefinition: false, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !431, !427}
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandlerNode", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 405, size: 320, align: 64, elements: !478, identifier: "_ZTSN21POVMS_MessageReceiver11HandlerNodeE")
!478 = !{!479, !480, !481, !482, !483, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !418, line: 407, baseType: !427, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !418, line: 408, baseType: !427, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hclass", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !418, line: 409, baseType: !288, size: 32, align: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !418, line: 410, baseType: !288, size: 32, align: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "handleroo", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !418, line: 411, baseType: !471, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !418, line: 412, baseType: !472, size: 64, align: 64, offset: 256)
!485 = !DICompositeType(tag: DW_TAG_class_type, name: "HandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 233, size: 64, align: 64, elements: !486, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver9HandlerOOE")
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$HandlerOO", scope: !418, file: !418, baseType: !421, size: 64, flags: DIFlagArtificial)
!488 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver9HandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", file: !418, line: 236, type: !489, isLocal: false, isDefinition: false, scopeLine: 236, containingType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !491, !442, !442, !273}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!492 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Message", file: !418, line: 207, size: 192, align: 64, elements: !493, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS13POVMS_Message")
!493 = !{!494, !495, !499, !504, !507, !511, !514, !517, !520, !521, !524, !525}
!494 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS13POVMS_Message", baseType: !"_ZTS12POVMS_Object", flags: DIFlagPublic)
!495 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !418, line: 210, type: !496, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !498, !288, !288, !288}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS13POVMS_Message", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!499 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !418, line: 211, type: !500, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !498, !502}
!502 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObject", file: !250, line: 173, baseType: !"_ZTS9POVMSData")
!504 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !418, line: 212, type: !505, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !498, !398}
!507 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !418, line: 213, type: !508, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !498, !510}
!510 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS12POVMS_Object")
!511 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !418, line: 214, type: !512, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !498, !442}
!514 = !DISubprogram(name: "operator=", linkageName: "_ZN13POVMS_MessageaSERS_", scope: !"_ZTS13POVMS_Message", file: !418, line: 216, type: !515, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubroutineType(types: !516)
!516 = !{!442, !498, !442}
!517 = !DISubprogram(name: "GetClass", linkageName: "_ZN13POVMS_Message8GetClassEv", scope: !"_ZTS13POVMS_Message", file: !418, line: 218, type: !518, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{!288, !498}
!520 = !DISubprogram(name: "GetIdentifier", linkageName: "_ZN13POVMS_Message13GetIdentifierEv", scope: !"_ZTS13POVMS_Message", file: !418, line: 219, type: !518, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubprogram(name: "GetSourceAddress", linkageName: "_ZN13POVMS_Message16GetSourceAddressEv", scope: !"_ZTS13POVMS_Message", file: !418, line: 221, type: !522, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!291, !498}
!524 = !DISubprogram(name: "GetDestinationAddress", linkageName: "_ZN13POVMS_Message21GetDestinationAddressEv", scope: !"_ZTS13POVMS_Message", file: !418, line: 222, type: !522, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubprogram(name: "SetDestinationAddress", linkageName: "_ZN13POVMS_Message21SetDestinationAddressEPv", scope: !"_ZTS13POVMS_Message", file: !418, line: 223, type: !526, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !498, !291}
!528 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Container", file: !418, line: 50, size: 192, align: 64, elements: !529, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Container")
!529 = !{!530, !531, !532, !536, !537, !540, !543, !546}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_Container", scope: !418, file: !418, baseType: !421, size: 64, flags: DIFlagArtificial)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS15POVMS_Container", file: !418, line: 64, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 64, flags: DIFlagProtected)
!532 = !DISubprogram(name: "POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !418, line: 57, type: !533, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Container", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!536 = !DISubprogram(name: "~POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !418, line: 58, type: !533, isLocal: false, isDefinition: false, scopeLine: 58, containingType: !"_ZTS15POVMS_Container", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubprogram(name: "Type", linkageName: "_ZN15POVMS_Container4TypeEv", scope: !"_ZTS15POVMS_Container", file: !418, line: 60, type: !538, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{!288, !535}
!540 = !DISubprogram(name: "Size", linkageName: "_ZN15POVMS_Container4SizeEv", scope: !"_ZTS15POVMS_Container", file: !418, line: 61, type: !541, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!541 = !DISubroutineType(types: !542)
!542 = !{!278, !535}
!543 = !DISubprogram(name: "IsNull", linkageName: "_ZN15POVMS_Container6IsNullEv", scope: !"_ZTS15POVMS_Container", file: !418, line: 62, type: !544, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!544 = !DISubroutineType(types: !545)
!545 = !{!365, !535}
!546 = !DISubprogram(name: "DetachData", linkageName: "_ZN15POVMS_Container10DetachDataEv", scope: !"_ZTS15POVMS_Container", file: !418, line: 66, type: !533, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !250, line: 178, size: 128, align: 64, elements: !548, identifier: "_ZTS9POVMSData")
!548 = !{!549, !550, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !250, line: 180, baseType: !288, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !250, line: 181, baseType: !273, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !250, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!552 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !250, line: 182, size: 64, align: 64, elements: !553, identifier: "_ZTSN9POVMSDataUt_E")
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !250, line: 184, baseType: !291, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !250, line: 185, baseType: !399, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !250, line: 186, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !250, line: 190, size: 320, align: 64, elements: !559, identifier: "_ZTS9POVMSNode")
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !250, line: 192, baseType: !557, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !250, line: 193, baseType: !557, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !250, line: 194, baseType: !288, size: 32, align: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !250, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!564 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Object", file: !418, line: 112, size: 192, align: 64, elements: !565, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS12POVMS_Object")
!565 = !{!566, !567, !571, !574, !577, !580, !583, !586, !590, !594, !597, !598, !599, !600, !601, !604, !605, !612, !616, !619, !622, !625, !628, !632, !633, !636, !639, !642, !643, !646, !649, !650, !653, !657, !660, !661}
!566 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS12POVMS_Object", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!567 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !418, line: 117, type: !568, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570, !288}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS12POVMS_Object", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!571 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !418, line: 118, type: !572, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !570, !502}
!574 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !418, line: 119, type: !575, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !570, !398}
!577 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !418, line: 120, type: !578, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !570, !510}
!580 = !DISubprogram(name: "~POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !418, line: 121, type: !581, isLocal: false, isDefinition: false, scopeLine: 121, containingType: !"_ZTS12POVMS_Object", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !570}
!583 = !DISubprogram(name: "operator=", linkageName: "_ZN12POVMS_ObjectaSERS_", scope: !"_ZTS12POVMS_Object", file: !418, line: 123, type: !584, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!584 = !DISubroutineType(types: !585)
!585 = !{!510, !570, !510}
!586 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !418, line: 125, type: !587, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !570, !288, !589}
!589 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS15POVMS_Attribute")
!590 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !418, line: 126, type: !591, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !570, !288, !593}
!593 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS10POVMS_List")
!594 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjRS_", scope: !"_ZTS12POVMS_Object", file: !418, line: 127, type: !595, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !570, !288, !510}
!597 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !418, line: 128, type: !587, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!598 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !418, line: 129, type: !591, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!599 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjRS_", scope: !"_ZTS12POVMS_Object", file: !418, line: 130, type: !595, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubprogram(name: "Remove", linkageName: "_ZN12POVMS_Object6RemoveEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 131, type: !568, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubprogram(name: "Exist", linkageName: "_ZN12POVMS_Object5ExistEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 132, type: !602, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!602 = !DISubroutineType(types: !603)
!603 = !{!365, !570, !288}
!604 = !DISubprogram(name: "Merge", linkageName: "_ZN12POVMS_Object5MergeERS_", scope: !"_ZTS12POVMS_Object", file: !418, line: 133, type: !578, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "operator*", linkageName: "_ZNK12POVMS_ObjectdeEv", scope: !"_ZTS12POVMS_Object", file: !418, line: 135, type: !606, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !610}
!608 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS12POVMS_Object")
!612 = !DISubprogram(name: "operator->", linkageName: "_ZNK12POVMS_ObjectptEv", scope: !"_ZTS12POVMS_Object", file: !418, line: 136, type: !613, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!613 = !DISubroutineType(types: !614)
!614 = !{!615, !610}
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!616 = !DISubprogram(name: "operator()", linkageName: "_ZN12POVMS_ObjectclEv", scope: !"_ZTS12POVMS_Object", file: !418, line: 137, type: !617, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{!503, !570}
!619 = !DISubprogram(name: "SetString", linkageName: "_ZN12POVMS_Object9SetStringEjPKc", scope: !"_ZTS12POVMS_Object", file: !418, line: 139, type: !620, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !570, !288, !330}
!622 = !DISubprogram(name: "SetInt", linkageName: "_ZN12POVMS_Object6SetIntEji", scope: !"_ZTS12POVMS_Object", file: !418, line: 140, type: !623, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !570, !288, !273}
!625 = !DISubprogram(name: "SetLong", linkageName: "_ZN12POVMS_Object7SetLongEjx", scope: !"_ZTS12POVMS_Object", file: !418, line: 141, type: !626, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !570, !288, !283}
!628 = !DISubprogram(name: "SetFloat", linkageName: "_ZN12POVMS_Object8SetFloatEjf", scope: !"_ZTS12POVMS_Object", file: !418, line: 142, type: !629, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !570, !288, !631}
!631 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!632 = !DISubprogram(name: "SetBool", linkageName: "_ZN12POVMS_Object7SetBoolEji", scope: !"_ZTS12POVMS_Object", file: !418, line: 143, type: !623, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!633 = !DISubprogram(name: "SetType", linkageName: "_ZN12POVMS_Object7SetTypeEjj", scope: !"_ZTS12POVMS_Object", file: !418, line: 144, type: !634, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !570, !288, !288}
!636 = !DISubprogram(name: "GetStringLength", linkageName: "_ZN12POVMS_Object15GetStringLengthEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 145, type: !637, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{!273, !570, !288}
!639 = !DISubprogram(name: "GetString", linkageName: "_ZN12POVMS_Object9GetStringEjPci", scope: !"_ZTS12POVMS_Object", file: !418, line: 146, type: !640, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!640 = !DISubroutineType(types: !641)
!641 = !{!273, !570, !288, !315, !273}
!642 = !DISubprogram(name: "GetInt", linkageName: "_ZN12POVMS_Object6GetIntEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 147, type: !637, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubprogram(name: "GetLong", linkageName: "_ZN12POVMS_Object7GetLongEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 148, type: !644, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!644 = !DISubroutineType(types: !645)
!645 = !{!283, !570, !288}
!646 = !DISubprogram(name: "GetFloat", linkageName: "_ZN12POVMS_Object8GetFloatEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 149, type: !647, isLocal: false, isDefinition: false, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{!631, !570, !288}
!649 = !DISubprogram(name: "GetBool", linkageName: "_ZN12POVMS_Object7GetBoolEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 150, type: !637, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!650 = !DISubprogram(name: "GetType", linkageName: "_ZN12POVMS_Object7GetTypeEj", scope: !"_ZTS12POVMS_Object", file: !418, line: 151, type: !651, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!651 = !DISubroutineType(types: !652)
!652 = !{!288, !570, !288}
!653 = !DISubprogram(name: "ReadHeader", linkageName: "_ZN12POVMS_Object10ReadHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !418, line: 201, type: !654, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{!365, !570, !297, !656}
!656 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !273)
!657 = !DISubprogram(name: "ReadObject", linkageName: "_ZN12POVMS_Object10ReadObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !418, line: 202, type: !658, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true)
!658 = !DISubroutineType(types: !659)
!659 = !{!365, !570, !297, !273}
!660 = !DISubprogram(name: "WriteHeader", linkageName: "_ZN12POVMS_Object11WriteHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !418, line: 203, type: !654, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true)
!661 = !DISubprogram(name: "WriteObject", linkageName: "_ZN12POVMS_Object11WriteObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !418, line: 204, type: !658, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true)
!662 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Attribute", file: !418, line: 69, size: 192, align: 64, elements: !663, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Attribute")
!663 = !{!664, !665, !669, !672, !675, !678, !681, !684, !687, !692, !695, !696, !699, !703}
!664 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS15POVMS_Attribute", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!665 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 72, type: !666, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Attribute", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!669 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 73, type: !670, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !668, !330}
!672 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 74, type: !673, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !668, !273}
!675 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 75, type: !676, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !668, !283}
!678 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 76, type: !679, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !668, !631}
!681 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 77, type: !682, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !668, !365}
!684 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 78, type: !685, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !668, !288}
!687 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 79, type: !688, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !668, !690}
!690 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttribute", file: !250, line: 174, baseType: !"_ZTS9POVMSData")
!692 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 80, type: !693, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !668, !589}
!695 = !DISubprogram(name: "~POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 81, type: !666, isLocal: false, isDefinition: false, scopeLine: 81, containingType: !"_ZTS15POVMS_Attribute", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubprogram(name: "operator=", linkageName: "_ZN15POVMS_AttributeaSERS_", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 83, type: !697, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!697 = !DISubroutineType(types: !698)
!698 = !{!589, !668, !589}
!699 = !DISubprogram(name: "Get", linkageName: "_ZN15POVMS_Attribute3GetEjPvPi", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 85, type: !700, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !668, !288, !291, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!703 = !DISubprogram(name: "Set", linkageName: "_ZN15POVMS_Attribute3SetEjPvi", scope: !"_ZTS15POVMS_Attribute", file: !418, line: 86, type: !704, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !668, !288, !291, !273}
!706 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_List", file: !418, line: 89, size: 192, align: 64, elements: !707, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS10POVMS_List")
!707 = !{!708, !709, !713, !718, !721, !722, !725, !728, !729, !732, !735, !738, !741, !742, !743, !744, !747}
!708 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS10POVMS_List", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!709 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !418, line: 92, type: !710, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS10POVMS_List", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!713 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !418, line: 93, type: !714, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !712, !716}
!716 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttributeList", file: !250, line: 175, baseType: !"_ZTS9POVMSData")
!718 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !418, line: 94, type: !719, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !712, !593}
!721 = !DISubprogram(name: "~POVMS_List", scope: !"_ZTS10POVMS_List", file: !418, line: 95, type: !710, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTS10POVMS_List", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!722 = !DISubprogram(name: "operator=", linkageName: "_ZN10POVMS_ListaSERS_", scope: !"_ZTS10POVMS_List", file: !418, line: 97, type: !723, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!723 = !DISubroutineType(types: !724)
!724 = !{!593, !712, !593}
!725 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !418, line: 99, type: !726, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !712, !589}
!728 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendERS_", scope: !"_ZTS10POVMS_List", file: !418, line: 100, type: !719, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!729 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !418, line: 101, type: !730, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !712, !510}
!732 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !418, line: 102, type: !733, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !712, !273, !589}
!735 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !418, line: 103, type: !736, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !712, !273, !593}
!738 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !418, line: 104, type: !739, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !712, !273, !510}
!741 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !418, line: 105, type: !733, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!742 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !418, line: 106, type: !736, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!743 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !418, line: 107, type: !739, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!744 = !DISubprogram(name: "RemoveNth", linkageName: "_ZN10POVMS_List9RemoveNthEi", scope: !"_ZTS10POVMS_List", file: !418, line: 108, type: !745, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !712, !273}
!747 = !DISubprogram(name: "Clear", linkageName: "_ZN10POVMS_List5ClearEv", scope: !"_ZTS10POVMS_List", file: !418, line: 109, type: !710, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!748 = !DICompositeType(tag: DW_TAG_class_type, name: "Handler", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 238, size: 64, align: 64, elements: !749, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver7HandlerE")
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Handler", scope: !418, file: !418, baseType: !421, size: 64, flags: DIFlagArtificial)
!751 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver7Handler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver7HandlerE", file: !418, line: 241, type: !752, isLocal: false, isDefinition: false, scopeLine: 241, containingType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !754, !398, !398, !273}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 302, size: 192, align: 64, elements: !756, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE")
!756 = !{!757, !758, !759, !760, !764, !767}
!757 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", flags: DIFlagPublic)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !418, line: 327, baseType: !438, size: 64, align: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !418, line: 328, baseType: !291, size: 64, align: 64, offset: 128)
!760 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !418, line: 307, type: !761, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!764 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !418, line: 313, type: !765, isLocal: false, isDefinition: false, scopeLine: 313, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !763, !438, !291}
!767 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver17FunctionHandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !418, line: 319, type: !768, isLocal: false, isDefinition: false, scopeLine: 319, containingType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !763, !442, !442, !273}
!770 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandler", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 331, size: 192, align: 64, elements: !771, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver15FunctionHandlerE")
!771 = !{!772, !773, !774, !775, !779, !782}
!772 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", flags: DIFlagPublic)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !418, line: 356, baseType: !446, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !418, line: 357, baseType: !291, size: 64, align: 64, offset: 128)
!775 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !418, line: 336, type: !776, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!779 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !418, line: 342, type: !780, isLocal: false, isDefinition: false, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !778, !446, !291}
!782 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver15FunctionHandler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !418, line: 348, type: !783, isLocal: false, isDefinition: false, scopeLine: 348, containingType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !778, !398, !398, !273}
!785 = !DICompositeType(tag: DW_TAG_class_type, name: "TextStreamBuffer", scope: !223, file: !786, line: 51, size: 256, align: 64, elements: !787, vtableHolder: !"_ZTSN8pov_base16TextStreamBufferE", identifier: "_ZTSN8pov_base16TextStreamBufferE")
!786 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!787 = !{!788, !789, !790, !791, !792, !793, !794, !801, !804, !807, !810, !811, !814, !817, !822, !823, !826, !827, !828, !829}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$TextStreamBuffer", scope: !786, file: !786, baseType: !421, size: 64, flags: DIFlagArtificial)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 69, baseType: !315, size: 64, align: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "boffset", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 70, baseType: !288, size: 32, align: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 71, baseType: !288, size: 32, align: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 72, baseType: !288, size: 32, align: 32, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "curline", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 73, baseType: !288, size: 32, align: 32, offset: 224)
!794 = !DISubprogram(name: "TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 54, type: !795, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !797, !798, !288}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !799, line: 30, baseType: !800)
!799 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !325, line: 92, baseType: !388)
!801 = !DISubprogram(name: "~TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 55, type: !802, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !797}
!804 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base16TextStreamBuffer6printfEPKcz", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 57, type: !805, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !797, !330, null}
!807 = !DISubprogram(name: "print", linkageName: "_ZN8pov_base16TextStreamBuffer5printEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 58, type: !808, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !797, !330}
!810 = !DISubprogram(name: "puts", linkageName: "_ZN8pov_base16TextStreamBuffer4putsEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 59, type: !808, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!811 = !DISubprogram(name: "putc", linkageName: "_ZN8pov_base16TextStreamBuffer4putcEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 60, type: !812, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !797, !273}
!814 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEPKcmi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 61, type: !815, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !797, !330, !388, !273}
!817 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEP7__sFILEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 62, type: !818, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !797, !820, !273}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !294, line: 153, baseType: !"_ZTS7__sFILE")
!822 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base16TextStreamBuffer5flushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 63, type: !802, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!823 = !DISubprogram(name: "lineoutput", linkageName: "_ZN8pov_base16TextStreamBuffer10lineoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 65, type: !824, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !797, !330, !288}
!826 = !DISubprogram(name: "directoutput", linkageName: "_ZN8pov_base16TextStreamBuffer12directoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 66, type: !824, isLocal: false, isDefinition: false, scopeLine: 66, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!827 = !DISubprogram(name: "rawoutput", linkageName: "_ZN8pov_base16TextStreamBuffer9rawoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 67, type: !824, isLocal: false, isDefinition: false, scopeLine: 67, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!828 = !DISubprogram(name: "lineflush", linkageName: "_ZN8pov_base16TextStreamBuffer9lineflushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 75, type: !802, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true)
!829 = !DISubprogram(name: "directflush", linkageName: "_ZN8pov_base16TextStreamBuffer11directflushEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !786, line: 76, type: !824, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true)
!830 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!831 = !DICompositeType(tag: DW_TAG_class_type, name: "MemberHandler<pov_frontend::MessageOutput>", scope: !"_ZTS21POVMS_MessageReceiver", file: !418, line: 273, size: 256, align: 64, elements: !832, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", templateParams: !849, identifier: "_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE")
!832 = !{!833, !834, !837, !839, !843, !846}
!833 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", flags: DIFlagPublic)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", file: !418, line: 298, baseType: !835, size: 128, align: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemberHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", file: !418, line: 276, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !396, size: 128, extraData: !"_ZTSN12pov_frontend13MessageOutputE")
!837 = !DIDerivedType(tag: DW_TAG_member, name: "classptr", scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", file: !418, line: 299, baseType: !838, size: 64, align: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend13MessageOutputE", size: 64, align: 64)
!839 = !DISubprogram(name: "MemberHandler", scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", file: !418, line: 278, type: !840, isLocal: false, isDefinition: false, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!843 = !DISubprogram(name: "MemberHandler", scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", file: !418, line: 284, type: !844, isLocal: false, isDefinition: false, scopeLine: 284, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !842, !838, !835}
!846 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEE4CallEP9POVMSDataS5_i", scope: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", file: !418, line: 290, type: !847, isLocal: false, isDefinition: false, scopeLine: 290, containingType: !"_ZTSN21POVMS_MessageReceiver13MemberHandlerIN12pov_frontend13MessageOutputEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !842, !398, !398, !273}
!849 = !{!850}
!850 = !DITemplateTypeParameter(name: "T", type: !"_ZTSN12pov_frontend13MessageOutputE")
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "__less<int, int>", scope: !853, file: !852, line: 699, size: 8, align: 8, elements: !856, templateParams: !864, identifier: "_ZTSNSt3__16__lessIiiEE")
!852 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/algorithm", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!853 = !DINamespace(name: "__1", scope: !855, file: !854, line: 369)
!854 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!855 = !DINamespace(name: "std", scope: null, file: !854, line: 368)
!856 = !{!857}
!857 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt3__16__lessIiiEclERKiS3_", scope: !"_ZTSNSt3__16__lessIiiEE", file: !852, line: 702, type: !858, isLocal: false, isDefinition: false, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true)
!858 = !DISubroutineType(types: !859)
!859 = !{!365, !860, !862, !862}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16__lessIiiEE")
!862 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!864 = !{!865, !866}
!865 = !DITemplateTypeParameter(name: "_T1", type: !273)
!866 = !DITemplateTypeParameter(name: "_T2", type: !273)
!867 = !{!868, !875, !878, !881, !884, !891, !907, !911, !926, !957, !973, !982, !993, !1019, !1028, !1039, !1045, !1051, !1060, !1068, !1076, !1083, !1089, !1092, !1103, !1109, !1114, !1120, !1126, !1134, !1142, !1151, !1157, !1161}
