; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/normal.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon.33 }
%union.anon.33 = type { i8* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, float, float }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !70, subprograms: !829, globals: !1090, imports: !1101)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/normal.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !59, !64}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !4, line: 47, size: 32, align: 32, elements: !7, identifier: "_ZTSN3pov11PATTERN_IDSE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!8 = !DIEnumerator(name: "NO_PATTERN", value: 0)
!9 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!10 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!11 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!12 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!13 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!14 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!15 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!16 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!17 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!18 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!19 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!20 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!21 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!22 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!23 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!24 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!25 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!26 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!27 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!28 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!29 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!30 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!31 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!32 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!33 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!34 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!35 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!36 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!37 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!38 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!39 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!40 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!41 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!42 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!43 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!44 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!45 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!46 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!47 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!48 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!49 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!50 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!51 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!52 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!53 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!54 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!55 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!56 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!57 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!58 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 686, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "U", value: 0)
!63 = !DIEnumerator(name: "V", value: 1)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 692, size: 32, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "X", value: 0)
!67 = !DIEnumerator(name: "Y", value: 1)
!68 = !DIEnumerator(name: "Z", value: 2)
!69 = !DIEnumerator(name: "T", value: 3)
!70 = !{!71, !77, !82, !87, !110, !115, !128, !139, !145, !167, !181, !209, !215, !225, !234, !258, !265, !277, !283, !289, !293, !297, !302, !313, !323, !332, !336, !361, !413, !423, !438, !466, !474, !495, !503, !524, !542, !546, !550, !555, !565, !575, !584, !588, !615, !670, !677, !688, !695, !701, !719, !723, !727, !732, !742, !752, !761, !765, !783, !787, !791, !796, !806, !816, !825, !156, !102, !95, !256, !3, !164}
!71 = !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 82, size: 64, align: 32, elements: !73, identifier: "_ZTS5div_t")
!72 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !72, line: 83, baseType: !75, size: 32, align: 32)
!75 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !72, line: 84, baseType: !75, size: 32, align: 32, offset: 32)
!77 = !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 87, size: 128, align: 64, elements: !78, identifier: "_ZTS6ldiv_t")
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !72, line: 88, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !72, line: 89, baseType: !80, size: 64, align: 64, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 93, size: 128, align: 64, elements: !83, identifier: "_ZTS7lldiv_t")
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !72, line: 94, baseType: !85, size: 64, align: 64)
!85 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !72, line: 95, baseType: !85, size: 64, align: 64, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !60, line: 1334, size: 1344, align: 64, elements: !88, identifier: "_ZTSN3pov14Tnormal_StructE")
!88 = !{!89, !91, !92, !93, !94, !96, !97, !98, !101, !104, !107, !108, !109}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !90, size: 16, align: 16)
!90 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !90, size: 16, align: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !90, size: 16, align: 16, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !75, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !95, size: 32, align: 32, offset: 96)
!95 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !95, size: 32, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !95, size: 32, align: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !99, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !60, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !102, size: 64, align: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !60, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !105, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !60, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1337, baseType: !95, size: 32, align: 32, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1338, baseType: !95, size: 32, align: 32, offset: 1312)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !60, line: 1373, size: 192, align: 64, elements: !111, identifier: "_ZTSN3pov12Warps_StructE")
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !90, size: 16, align: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !99, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !99, size: 64, align: 64, offset: 128)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !60, line: 1323, size: 1280, align: 64, elements: !116, identifier: "_ZTSN3pov14Pattern_StructE")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !90, size: 16, align: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !90, size: 16, align: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !90, size: 16, align: 16, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !75, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !95, size: 32, align: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !95, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !95, size: 32, align: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !99, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !102, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !105, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !60, line: 1045, size: 128, align: 64, elements: !129, identifier: "_ZTSN3pov16Blend_Map_StructE")
!129 = !{!130, !131, !133, !135, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1047, baseType: !75, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1048, baseType: !132, size: 16, align: 16, offset: 32)
!132 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !134, size: 8, align: 8, offset: 48)
!134 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !134, size: 8, align: 8, offset: 56)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1050, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !60, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !60, line: 1031, size: 256, align: 64, elements: !140, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!140 = !{!141, !142, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1033, baseType: !95, size: 32, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1034, baseType: !143, size: 8, align: 8, offset: 32)
!143 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1035, size: 192, align: 64, elements: !146, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!146 = !{!147, !152, !155, !158, !161}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1037, baseType: !148, size: 160, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !60, line: 681, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 160, align: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 5)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1038, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !60, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1039, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !60, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1040, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !60, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1041, baseType: !162, size: 128, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !60, line: 676, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, align: 64, elements: !165)
!164 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!165 = !{!166}
!166 = !DISubrange(count: 2)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !60, line: 1328, size: 1472, align: 64, elements: !168, identifier: "_ZTSN3pov14Pigment_StructE")
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !90, size: 16, align: 16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !90, size: 16, align: 16, offset: 16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !90, size: 16, align: 16, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !75, size: 32, align: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !95, size: 32, align: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !95, size: 32, align: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !95, size: 32, align: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !99, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !102, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !105, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1331, baseType: !148, size: 160, align: 32, offset: 1280)
!181 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, size: 896, align: 64, elements: !182, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!182 = !{!183, !186, !189, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !60, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !60, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !60, line: 677, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 192, align: 64, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !95, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !153, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !60, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !60, line: 1269, size: 128, align: 64, elements: !210, identifier: "_ZTSN3pov19Density_file_StructE")
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1271, baseType: !75, size: 32, align: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1272, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !60, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !60, line: 1275, size: 320, align: 64, elements: !216, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!216 = !{!217, !218, !220, !221, !222, !223, !224}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1277, baseType: !75, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1278, baseType: !219, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !75, size: 32, align: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !75, size: 32, align: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !75, size: 32, align: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1280, baseType: !75, size: 32, align: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!225 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, size: 64, align: 64, elements: !226, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!226 = !{!227, !229, !231}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1283, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1284, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1285, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !60, line: 1220, size: 960, align: 64, elements: !235, identifier: "_ZTSN3pov12Image_StructE")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !255, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1222, baseType: !75, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1223, baseType: !75, size: 32, align: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1224, baseType: !75, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1225, baseType: !75, size: 32, align: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1226, baseType: !75, size: 32, align: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !75, size: 32, align: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !75, size: 32, align: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1228, baseType: !132, size: 16, align: 16, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1229, baseType: !134, size: 8, align: 8, offset: 240)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1230, baseType: !134, size: 8, align: 8, offset: 248)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1231, baseType: !190, size: 192, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !95, size: 32, align: 32, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !95, size: 32, align: 32, offset: 480)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1233, baseType: !162, size: 128, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !164, size: 64, align: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !164, size: 64, align: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1235, baseType: !253, size: 64, align: 64, offset: 768)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !60, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1236, baseType: !256, size: 64, align: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !60, line: 1161, size: 80, align: 16, elements: !259, identifier: "_ZTSN3pov19Image_Colour_StructE")
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !90, size: 16, align: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !90, size: 16, align: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !90, size: 16, align: 16, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !90, size: 16, align: 16, offset: 48)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !90, size: 16, align: 16, offset: 64)
!265 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1237, size: 64, align: 64, elements: !266, identifier: "_ZTSN3pov12Image_StructUt_E")
!266 = !{!267, !270, !273, !275}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1239, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !60, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1240, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !60, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1241, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1242, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !60, line: 1166, size: 256, align: 64, elements: !278, identifier: "_ZTSN3pov18Image8_Line_StructE")
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !228, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !228, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !228, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !228, size: 64, align: 64, offset: 192)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !60, line: 1171, size: 256, align: 64, elements: !284, identifier: "_ZTSN3pov19Image16_Line_StructE")
!284 = !{!285, !286, !287, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !230, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !230, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !230, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !230, size: 64, align: 64, offset: 192)
!289 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 256, align: 64, elements: !290, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !60, line: 1330, baseType: !95, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64, offset: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 64, align: 32, elements: !294, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !60, line: 1330, baseType: !95, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !60, line: 1330, baseType: !95, size: 32, align: 32, offset: 32)
!297 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 320, align: 64, elements: !298, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!298 = !{!299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64, offset: 128)
!302 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 896, align: 64, elements: !303, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!303 = !{!304, !305, !306, !307, !308, !309, !311, !312}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !310, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !75, size: 32, align: 32, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64, offset: 704)
!313 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 832, align: 64, elements: !314, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !190, size: 192, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16, offset: 400)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !162, size: 128, align: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !162, size: 128, align: 64, offset: 704)
!323 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 384, align: 64, elements: !324, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!324 = !{!325, !326, !327, !328, !329, !330, !331}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !162, size: 128, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16, offset: 144)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !132, size: 16, align: 16, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !164, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !75, size: 32, align: 32, offset: 320)
!332 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 128, align: 64, elements: !333, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !60, line: 1330, baseType: !256, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !60, line: 1330, baseType: !256, size: 64, align: 64, offset: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !60, line: 1521, size: 960, align: 64, elements: !337, identifier: "_ZTSN3pov13Object_StructE")
!337 = !{!338, !341, !342, !343, !344, !345, !348, !349, !350, !353, !355, !358, !359, !360}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !60, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !75, size: 32, align: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !207, size: 64, align: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !159, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !159, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !346, size: 64, align: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !60, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !207, size: 64, align: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !207, size: 64, align: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !351, size: 64, align: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !60, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !354, size: 192, align: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !60, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !356, size: 64, align: 64, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !60, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !356, size: 64, align: 64, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !95, size: 32, align: 32, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !233, size: 32, align: 32, offset: 928)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !60, line: 1503, size: 704, align: 64, elements: !362, identifier: "_ZTSN3pov13Method_StructE")
!362 = !{!363, !372, !378, !385, !387, !392, !397, !399, !401, !406, !411}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1505, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !60, line: 1420, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!75, !207, !368, !370}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !60, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !60, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1506, baseType: !373, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !60, line: 1421, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!75, !377, !207}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1507, baseType: !379, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !60, line: 1422, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !377, !207, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !60, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!385 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1508, baseType: !386, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !60, line: 1423, baseType: !380)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1509, baseType: !388, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !60, line: 1424, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!256, !207}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1510, baseType: !393, size: 64, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !60, line: 1425, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !207, !377, !356}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1511, baseType: !398, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !60, line: 1426, baseType: !394)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1512, baseType: !400, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !60, line: 1427, baseType: !394)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1513, baseType: !402, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !60, line: 1428, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !207, !356}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1514, baseType: !407, size: 64, align: 64, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !60, line: 1429, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !207}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1515, baseType: !412, size: 64, align: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !60, line: 1430, baseType: !408)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !60, line: 1783, size: 6848, align: 64, elements: !414, identifier: "_ZTSN3pov10Ray_StructE")
!414 = !{!415, !416, !417, !418, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1785, baseType: !190, size: 192, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1786, baseType: !190, size: 192, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1787, baseType: !75, size: 32, align: 32, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1788, baseType: !233, size: 32, align: 32, offset: 416)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1789, baseType: !420, size: 6400, align: 64, offset: 448)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 6400, align: 64, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 100)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !60, line: 1112, size: 512, align: 64, elements: !424, identifier: "_ZTSN3pov15Interior_StructE")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1114, baseType: !75, size: 32, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !75, size: 32, align: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !75, size: 32, align: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !95, size: 32, align: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !95, size: 32, align: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !95, size: 32, align: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !95, size: 32, align: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !95, size: 32, align: 32, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !95, size: 32, align: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1119, baseType: !148, size: 160, align: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1120, baseType: !436, size: 64, align: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !60, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !60, line: 1069, size: 1728, align: 64, elements: !439, identifier: "_ZTSN3pov12Media_StructE")
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1071, baseType: !75, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1072, baseType: !75, size: 32, align: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1073, baseType: !75, size: 32, align: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1074, baseType: !75, size: 32, align: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1075, baseType: !75, size: 32, align: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1076, baseType: !164, size: 64, align: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1077, baseType: !75, size: 32, align: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !164, size: 64, align: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !164, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1079, baseType: !75, size: 32, align: 32, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1080, baseType: !75, size: 32, align: 32, offset: 480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1081, baseType: !75, size: 32, align: 32, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1082, baseType: !75, size: 32, align: 32, offset: 544)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1083, baseType: !148, size: 160, align: 32, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1084, baseType: !148, size: 160, align: 32, offset: 736)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1085, baseType: !148, size: 160, align: 32, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1086, baseType: !148, size: 160, align: 32, offset: 1056)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1088, baseType: !164, size: 64, align: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1089, baseType: !164, size: 64, align: 64, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1090, baseType: !164, size: 64, align: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1091, baseType: !377, size: 64, align: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1093, baseType: !164, size: 64, align: 64, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1094, baseType: !75, size: 32, align: 32, offset: 1536)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1095, baseType: !75, size: 32, align: 32, offset: 1568)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1097, baseType: !153, size: 64, align: 64, offset: 1600)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1099, baseType: !436, size: 64, align: 64, offset: 1664)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !60, line: 1621, size: 192, align: 64, elements: !467, identifier: "_ZTSN3pov13istack_structE")
!467 = !{!468, !470, !472, !473}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1623, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1624, baseType: !471, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1625, baseType: !233, size: 32, align: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1626, baseType: !233, size: 32, align: 32, offset: 160)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !60, line: 1596, size: 1600, align: 64, elements: !475, identifier: "_ZTSN3pov10istk_entryE")
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1598, baseType: !164, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1599, baseType: !190, size: 192, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1600, baseType: !190, size: 192, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1601, baseType: !190, size: 192, align: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1602, baseType: !162, size: 128, align: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1603, baseType: !207, size: 64, align: 64, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !75, size: 32, align: 32, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !75, size: 32, align: 32, offset: 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !164, size: 64, align: 64, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !164, size: 64, align: 64, offset: 960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !164, size: 64, align: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !164, size: 64, align: 64, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !164, size: 64, align: 64, offset: 1152)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !164, size: 64, align: 64, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !164, size: 64, align: 64, offset: 1280)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !164, size: 64, align: 64, offset: 1344)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !164, size: 64, align: 64, offset: 1408)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1616, baseType: !256, size: 64, align: 64, offset: 1472)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1618, baseType: !256, size: 64, align: 64, offset: 1536)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !60, line: 1002, size: 2048, align: 64, elements: !496, identifier: "_ZTSN3pov16Transform_StructE")
!496 = !{!497, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1004, baseType: !498, size: 1024, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !60, line: 679, baseType: !499)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, align: 64, elements: !500)
!500 = !{!501, !501}
!501 = !DISubrange(count: 4)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1005, baseType: !498, size: 1024, align: 64, offset: 1024)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !60, line: 1345, size: 1664, align: 64, elements: !504, identifier: "_ZTSN3pov14Texture_StructE")
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !522, !523}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !90, size: 16, align: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !90, size: 16, align: 16, offset: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !90, size: 16, align: 16, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !75, size: 32, align: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !95, size: 32, align: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !95, size: 32, align: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !95, size: 32, align: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !99, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !102, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !105, size: 64, align: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !159, size: 64, align: 64, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1348, baseType: !153, size: 64, align: 64, offset: 1344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1349, baseType: !156, size: 64, align: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1350, baseType: !520, size: 64, align: 64, offset: 1472)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !60, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1351, baseType: !159, size: 64, align: 64, offset: 1536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1352, baseType: !75, size: 32, align: 32, offset: 1600)
!524 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, size: 896, align: 64, elements: !525, identifier: "_ZTSN3pov14Texture_StructUt_E")
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !184, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !187, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !95, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !153, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !207, size: 64, align: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 256, align: 64, elements: !543, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !95, size: 32, align: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 64, align: 32, elements: !547, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !95, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !95, size: 32, align: 32, offset: 32)
!550 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 320, align: 64, elements: !551, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64, offset: 128)
!555 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 896, align: 64, elements: !556, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !310, size: 64, align: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !75, size: 32, align: 32, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64, offset: 704)
!565 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 832, align: 64, elements: !566, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !190, size: 192, align: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16, offset: 400)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !162, size: 128, align: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !162, size: 128, align: 64, offset: 704)
!575 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 384, align: 64, elements: !576, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!576 = !{!577, !578, !579, !580, !581, !582, !583}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !162, size: 128, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16, offset: 144)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !132, size: 16, align: 16, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !164, size: 64, align: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !75, size: 32, align: 32, offset: 320)
!584 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 128, align: 64, elements: !585, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !256, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !256, size: 64, align: 64, offset: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !60, line: 1356, size: 928, align: 32, elements: !589, identifier: "_ZTSN3pov13Finish_StructE")
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !609, !610, !611, !612, !613, !614}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !95, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !95, size: 32, align: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !95, size: 32, align: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !95, size: 32, align: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !95, size: 32, align: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !95, size: 32, align: 32, offset: 160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !95, size: 32, align: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !95, size: 32, align: 32, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !95, size: 32, align: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !95, size: 32, align: 32, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !95, size: 32, align: 32, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !95, size: 32, align: 32, offset: 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !95, size: 32, align: 32, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !95, size: 32, align: 32, offset: 416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1363, baseType: !95, size: 32, align: 32, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1363, baseType: !95, size: 32, align: 32, offset: 480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !607, size: 96, align: 32, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !60, line: 682, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 96, align: 32, elements: !192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !607, size: 96, align: 32, offset: 608)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !607, size: 96, align: 32, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1365, baseType: !95, size: 32, align: 32, offset: 800)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1366, baseType: !75, size: 32, align: 32, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1367, baseType: !95, size: 32, align: 32, offset: 864)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1368, baseType: !75, size: 32, align: 32, offset: 896)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !60, line: 1566, size: 3456, align: 64, elements: !616, identifier: "_ZTSN3pov19Light_Source_StructE")
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !661, !662, !663, !664}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !339, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !75, size: 32, align: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !207, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !159, size: 64, align: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !159, size: 64, align: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !346, size: 64, align: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !207, size: 64, align: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !207, size: 64, align: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !351, size: 64, align: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !354, size: 192, align: 32, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !356, size: 64, align: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !356, size: 64, align: 64, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !95, size: 32, align: 32, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !233, size: 32, align: 32, offset: 928)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !207, size: 64, align: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1569, baseType: !148, size: 160, align: 32, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !190, size: 192, align: 64, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !190, size: 192, align: 64, offset: 1408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !190, size: 192, align: 64, offset: 1600)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !190, size: 192, align: 64, offset: 1792)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !190, size: 192, align: 64, offset: 1984)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1571, baseType: !164, size: 64, align: 64, offset: 2176)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1571, baseType: !164, size: 64, align: 64, offset: 2240)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1571, baseType: !164, size: 64, align: 64, offset: 2304)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1572, baseType: !164, size: 64, align: 64, offset: 2368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1572, baseType: !164, size: 64, align: 64, offset: 2432)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1573, baseType: !351, size: 64, align: 64, offset: 2496)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1574, baseType: !143, size: 8, align: 8, offset: 2560)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1574, baseType: !143, size: 8, align: 8, offset: 2568)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1574, baseType: !143, size: 8, align: 8, offset: 2576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1575, baseType: !648, size: 8, align: 8, offset: 2584)
!648 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1576, baseType: !648, size: 8, align: 8, offset: 2592)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1577, baseType: !143, size: 8, align: 8, offset: 2600)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1577, baseType: !143, size: 8, align: 8, offset: 2608)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1578, baseType: !143, size: 8, align: 8, offset: 2616)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1579, baseType: !75, size: 32, align: 32, offset: 2624)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1579, baseType: !75, size: 32, align: 32, offset: 2656)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1580, baseType: !75, size: 32, align: 32, offset: 2688)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1581, baseType: !75, size: 32, align: 32, offset: 2720)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1582, baseType: !75, size: 32, align: 32, offset: 2752)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1583, baseType: !659, size: 64, align: 64, offset: 2816)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1584, baseType: !207, size: 64, align: 64, offset: 2880)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1584, baseType: !207, size: 64, align: 64, offset: 2944)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1585, baseType: !105, size: 64, align: 64, offset: 3008)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1586, baseType: !665, size: 384, align: 64, offset: 3072)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 384, align: 64, elements: !668)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !60, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!668 = !{!669}
!669 = !DISubrange(count: 6)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !60, line: 876, size: 192, align: 32, elements: !671, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!671 = !{!672, !676}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !60, line: 878, baseType: !673, size: 96, align: 32)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !60, line: 872, baseType: !674)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 96, align: 32, elements: !192)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !60, line: 870, baseType: !95)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !60, line: 878, baseType: !673, size: 96, align: 32, offset: 96)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !5, file: !60, line: 1557, size: 384, align: 64, elements: !678, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!678 = !{!679, !680, !683, !685, !686}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !60, line: 1559, baseType: !90, size: 16, align: 16)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !60, line: 1560, baseType: !681, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !5, file: !60, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !60, line: 1561, baseType: !684, size: 128, align: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !5, file: !60, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !60, line: 1562, baseType: !90, size: 16, align: 16, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !60, line: 1563, baseType: !687, size: 64, align: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !5, file: !60, line: 1534, size: 320, align: 64, elements: !689, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !60, line: 1536, baseType: !132, size: 16, align: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !60, line: 1537, baseType: !132, size: 16, align: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !60, line: 1538, baseType: !354, size: 192, align: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !60, line: 1539, baseType: !694, size: 64, align: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !60, line: 1545, size: 128, align: 32, elements: !696, identifier: "_ZTSN3pov14Project_StructE")
!696 = !{!697, !698, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !60, line: 1547, baseType: !75, size: 32, align: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !60, line: 1547, baseType: !75, size: 32, align: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !60, line: 1547, baseType: !75, size: 32, align: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !60, line: 1547, baseType: !75, size: 32, align: 32, offset: 96)
!701 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, size: 896, align: 64, elements: !702, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !184, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !187, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !190, size: 192, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !95, size: 32, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !132, size: 16, align: 16)
