; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/objects.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::istack_struct" = type { %"struct.pov::istack_struct"*, %"struct.pov::istk_entry"*, i32, i32 }
%"struct.pov::istk_entry" = type { double, [3 x double], [3 x double], [3 x double], [2 x double], %"struct.pov::Object_Struct"*, i32, i32, double, double, double, double, double, double, double, double, double, i8*, i8* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!67 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!68 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!69 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!70 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!71 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!72 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!73 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!74 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!75 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!76 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!77 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!78 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!79 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!80 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!81 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!82 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!83 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!84 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!85 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!86 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!87 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!88 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!89 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!90 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!91 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!92 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!93 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!94 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!95 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!96 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!97 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!98 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!99 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!100 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!101 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!102 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!103 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!104 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!105 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!106 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!107 = !DIEnumerator(name: "Media_Samples", value: 99)
!108 = !DIEnumerator(name: "Media_Intervals", value: 100)
!109 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!110 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!111 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!112 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!113 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!114 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!115 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!116 = !DIEnumerator(name: "nChecked", value: 108)
!117 = !DIEnumerator(name: "nEnqueued", value: 109)
!118 = !DIEnumerator(name: "totalQueues", value: 110)
!119 = !DIEnumerator(name: "totalQueueResets", value: 111)
!120 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!121 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!122 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!123 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!124 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!125 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 692, size: 32, align: 32, elements: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !{!138, !139, !140, !141}
!138 = !DIEnumerator(name: "X", value: 0)
!139 = !DIEnumerator(name: "Y", value: 1)
!140 = !DIEnumerator(name: "Z", value: 2)
!141 = !DIEnumerator(name: "T", value: 3)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 686, size: 32, align: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIEnumerator(name: "U", value: 0)
!145 = !DIEnumerator(name: "V", value: 1)
!146 = !{!147, !153, !158, !163, !172, !205, !233, !285, !295, !314, !344, !365, !370, !383, !394, !400, !409, !424, !446, !452, !462, !470, !493, !500, !512, !518, !524, !528, !532, !537, !548, !558, !567, !571, !592, !610, !614, !618, !623, !633, !643, !652, !656, !683, !701, !705, !709, !714, !724, !734, !743, !747, !765, !769, !773, !778, !788, !798, !807, !811, !819, !874, !881, !892, !899, !3, !189, !217, !203, !242, !255}
!147 = !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 82, size: 64, align: 32, elements: !149, identifier: "_ZTS5div_t")
!148 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !148, line: 83, baseType: !151, size: 32, align: 32)
!151 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !148, line: 84, baseType: !151, size: 32, align: 32, offset: 32)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 87, size: 128, align: 64, elements: !154, identifier: "_ZTS6ldiv_t")
!154 = !{!155, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !148, line: 88, baseType: !156, size: 64, align: 64)
!156 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !148, line: 89, baseType: !156, size: 64, align: 64, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 93, size: 128, align: 64, elements: !159, identifier: "_ZTS7lldiv_t")
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !148, line: 94, baseType: !161, size: 64, align: 64)
!161 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !148, line: 95, baseType: !161, size: 64, align: 64, offset: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !136, line: 1621, size: 192, align: 64, elements: !164, identifier: "_ZTSN3pov13istack_structE")
!164 = !{!165, !167, !169, !171}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1623, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1624, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1625, baseType: !170, size: 32, align: 32, offset: 128)
!170 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1626, baseType: !170, size: 32, align: 32, offset: 160)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !136, line: 1596, size: 1600, align: 64, elements: !173, identifier: "_ZTSN3pov10istk_entryE")
!173 = !{!174, !176, !181, !182, !183, !188, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1598, baseType: !175, size: 64, align: 64)
!175 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1599, baseType: !177, size: 192, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !136, line: 677, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 192, align: 64, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1600, baseType: !177, size: 192, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1601, baseType: !177, size: 192, align: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1602, baseType: !184, size: 128, align: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !136, line: 676, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, align: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1603, baseType: !189, size: 64, align: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !136, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1610, baseType: !151, size: 32, align: 32, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1610, baseType: !151, size: 32, align: 32, offset: 864)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1611, baseType: !175, size: 64, align: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1611, baseType: !175, size: 64, align: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1612, baseType: !175, size: 64, align: 64, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1612, baseType: !175, size: 64, align: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1613, baseType: !175, size: 64, align: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1613, baseType: !175, size: 64, align: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1614, baseType: !175, size: 64, align: 64, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1614, baseType: !175, size: 64, align: 64, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1614, baseType: !175, size: 64, align: 64, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1616, baseType: !203, size: 64, align: 64, offset: 1472)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1618, baseType: !203, size: 64, align: 64, offset: 1536)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !136, line: 1521, size: 960, align: 64, elements: !206, identifier: "_ZTSN3pov13Object_StructE")
!206 = !{!207, !210, !211, !212, !215, !216, !219, !220, !221, !224, !226, !229, !230, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !136, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !151, size: 32, align: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !189, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !213, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !136, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !213, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !217, size: 64, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !136, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !189, size: 64, align: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !189, size: 64, align: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !222, size: 64, align: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !136, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !225, size: 192, align: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !136, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !227, size: 64, align: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !136, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !227, size: 64, align: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !231, size: 32, align: 32, offset: 896)
!231 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !170, size: 32, align: 32, offset: 928)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !136, line: 1503, size: 704, align: 64, elements: !234, identifier: "_ZTSN3pov13Method_StructE")
!234 = !{!235, !244, !250, !257, !259, !264, !269, !271, !273, !278, !283}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1505, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !136, line: 1420, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!151, !189, !240, !242}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !136, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !136, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1506, baseType: !245, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !136, line: 1421, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!151, !249, !189}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1507, baseType: !251, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !136, line: 1422, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !249, !189, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !136, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1508, baseType: !258, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !136, line: 1423, baseType: !252)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1509, baseType: !260, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !136, line: 1424, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!203, !189}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1510, baseType: !265, size: 64, align: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !136, line: 1425, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !189, !249, !227}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1511, baseType: !270, size: 64, align: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !136, line: 1426, baseType: !266)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1512, baseType: !272, size: 64, align: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !136, line: 1427, baseType: !266)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1513, baseType: !274, size: 64, align: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !136, line: 1428, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !189, !227}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1514, baseType: !279, size: 64, align: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !136, line: 1429, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !189}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1515, baseType: !284, size: 64, align: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !136, line: 1430, baseType: !280)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !136, line: 1783, size: 6848, align: 64, elements: !286, identifier: "_ZTSN3pov10Ray_StructE")
!286 = !{!287, !288, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1785, baseType: !177, size: 192, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1786, baseType: !177, size: 192, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1787, baseType: !151, size: 32, align: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1788, baseType: !170, size: 32, align: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1789, baseType: !292, size: 6400, align: 64, offset: 448)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 6400, align: 64, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 100)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !136, line: 1112, size: 512, align: 64, elements: !296, identifier: "_ZTSN3pov15Interior_StructE")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !311}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1114, baseType: !151, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !151, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !151, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !231, size: 32, align: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !231, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !231, size: 32, align: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !231, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !231, size: 32, align: 32, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !231, size: 32, align: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1119, baseType: !307, size: 160, align: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !136, line: 681, baseType: !308)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 160, align: 32, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 5)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1120, baseType: !312, size: 64, align: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !136, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !136, line: 1069, size: 1728, align: 64, elements: !315, identifier: "_ZTSN3pov12Media_StructE")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !343}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1071, baseType: !151, size: 32, align: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1072, baseType: !151, size: 32, align: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1073, baseType: !151, size: 32, align: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1074, baseType: !151, size: 32, align: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1075, baseType: !151, size: 32, align: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1076, baseType: !175, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1077, baseType: !151, size: 32, align: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1078, baseType: !175, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1078, baseType: !175, size: 64, align: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1079, baseType: !151, size: 32, align: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1080, baseType: !151, size: 32, align: 32, offset: 480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1081, baseType: !151, size: 32, align: 32, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1082, baseType: !151, size: 32, align: 32, offset: 544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1083, baseType: !307, size: 160, align: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1084, baseType: !307, size: 160, align: 32, offset: 736)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1085, baseType: !307, size: 160, align: 32, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1086, baseType: !307, size: 160, align: 32, offset: 1056)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1088, baseType: !175, size: 64, align: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1089, baseType: !175, size: 64, align: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1090, baseType: !175, size: 64, align: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1091, baseType: !249, size: 64, align: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1093, baseType: !175, size: 64, align: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1094, baseType: !151, size: 32, align: 32, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1095, baseType: !151, size: 32, align: 32, offset: 1568)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1097, baseType: !341, size: 64, align: 64, offset: 1600)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !136, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1099, baseType: !312, size: 64, align: 64, offset: 1664)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !136, line: 1328, size: 1472, align: 64, elements: !345, identifier: "_ZTSN3pov14Pigment_StructE")
!345 = !{!346, !348, !349, !350, !351, !352, !353, !354, !357, !360, !363, !364}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !347, size: 16, align: 16)
!347 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !347, size: 16, align: 16, offset: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !347, size: 16, align: 16, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !151, size: 32, align: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !231, size: 32, align: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !231, size: 32, align: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !231, size: 32, align: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !355, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !136, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !358, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !136, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !361, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !136, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1331, baseType: !307, size: 160, align: 32, offset: 1280)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !136, line: 1373, size: 192, align: 64, elements: !366, identifier: "_ZTSN3pov12Warps_StructE")
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !347, size: 16, align: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !355, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !355, size: 64, align: 64, offset: 128)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !136, line: 1323, size: 1280, align: 64, elements: !371, identifier: "_ZTSN3pov14Pattern_StructE")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !347, size: 16, align: 16)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !347, size: 16, align: 16, offset: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !347, size: 16, align: 16, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !151, size: 32, align: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !231, size: 32, align: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !231, size: 32, align: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !231, size: 32, align: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !355, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !358, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !361, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !136, line: 1045, size: 128, align: 64, elements: !384, identifier: "_ZTSN3pov16Blend_Map_StructE")
!384 = !{!385, !386, !388, !390, !391}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1047, baseType: !151, size: 32, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1048, baseType: !387, size: 16, align: 16, offset: 32)
!387 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !389, size: 8, align: 8, offset: 48)
!389 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !389, size: 8, align: 8, offset: 56)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1050, baseType: !392, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !136, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !136, line: 1031, size: 256, align: 64, elements: !395, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!395 = !{!396, !397, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1033, baseType: !231, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1034, baseType: !398, size: 8, align: 8, offset: 32)
!398 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!400 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1035, size: 192, align: 64, elements: !401, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!401 = !{!402, !403, !404, !407, !408}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1037, baseType: !307, size: 160, align: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1038, baseType: !341, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1039, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !136, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1040, baseType: !213, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1041, baseType: !184, size: 128, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !136, line: 1334, size: 1344, align: 64, elements: !410, identifier: "_ZTSN3pov14Tnormal_StructE")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !347, size: 16, align: 16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !347, size: 16, align: 16, offset: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !347, size: 16, align: 16, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !151, size: 32, align: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !231, size: 32, align: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !231, size: 32, align: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !231, size: 32, align: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !355, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !358, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !361, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1337, baseType: !231, size: 32, align: 32, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1338, baseType: !231, size: 32, align: 32, offset: 1312)
!424 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, size: 896, align: 64, elements: !425, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!425 = !{!426, !429, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !136, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !136, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !231, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !341, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !189, size: 64, align: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !136, line: 1269, size: 128, align: 64, elements: !447, identifier: "_ZTSN3pov19Density_file_StructE")
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1271, baseType: !151, size: 32, align: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1272, baseType: !450, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !136, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !136, line: 1275, size: 320, align: 64, elements: !453, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!453 = !{!454, !455, !457, !458, !459, !460, !461}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1277, baseType: !151, size: 32, align: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1278, baseType: !456, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !151, size: 32, align: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !151, size: 32, align: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !151, size: 32, align: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1280, baseType: !151, size: 32, align: 32, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!462 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, size: 64, align: 64, elements: !463, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!463 = !{!464, !466, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1283, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1284, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1285, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !136, line: 1220, size: 960, align: 64, elements: !471, identifier: "_ZTSN3pov12Image_StructE")
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !491, !492}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1222, baseType: !151, size: 32, align: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1223, baseType: !151, size: 32, align: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1224, baseType: !151, size: 32, align: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1225, baseType: !151, size: 32, align: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1226, baseType: !151, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !151, size: 32, align: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !151, size: 32, align: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1228, baseType: !387, size: 16, align: 16, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1229, baseType: !389, size: 8, align: 8, offset: 240)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1230, baseType: !389, size: 8, align: 8, offset: 248)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1231, baseType: !177, size: 192, align: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !231, size: 32, align: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !231, size: 32, align: 32, offset: 480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1233, baseType: !184, size: 128, align: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !175, size: 64, align: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !175, size: 64, align: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1235, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !136, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1236, baseType: !203, size: 64, align: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !136, line: 1161, size: 80, align: 16, elements: !494, identifier: "_ZTSN3pov19Image_Colour_StructE")
!494 = !{!495, !496, !497, !498, !499}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !347, size: 16, align: 16)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !347, size: 16, align: 16, offset: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !347, size: 16, align: 16, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !347, size: 16, align: 16, offset: 48)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !347, size: 16, align: 16, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1237, size: 64, align: 64, elements: !501, identifier: "_ZTSN3pov12Image_StructUt_E")
!501 = !{!502, !505, !508, !510}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1239, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !136, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1240, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !136, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1241, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1242, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !136, line: 1166, size: 256, align: 64, elements: !513, identifier: "_ZTSN3pov18Image8_Line_StructE")
!513 = !{!514, !515, !516, !517}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !465, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !465, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !465, size: 64, align: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !465, size: 64, align: 64, offset: 192)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !136, line: 1171, size: 256, align: 64, elements: !519, identifier: "_ZTSN3pov19Image16_Line_StructE")
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !467, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !467, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !467, size: 64, align: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !467, size: 64, align: 64, offset: 192)
!524 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 256, align: 64, elements: !525, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !231, size: 32, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64, offset: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 64, align: 32, elements: !529, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !231, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !231, size: 32, align: 32, offset: 32)
!532 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 320, align: 64, elements: !533, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64, offset: 128)
!537 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 896, align: 64, elements: !538, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!538 = !{!539, !540, !541, !542, !543, !544, !546, !547}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !545, size: 64, align: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !151, size: 32, align: 32, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64, offset: 704)
!548 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 832, align: 64, elements: !549, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !177, size: 192, align: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16, offset: 400)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !184, size: 128, align: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !184, size: 128, align: 64, offset: 704)
!558 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 384, align: 64, elements: !559, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!559 = !{!560, !561, !562, !563, !564, !565, !566}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !184, size: 128, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16, offset: 144)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !387, size: 16, align: 16, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !175, size: 64, align: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !151, size: 32, align: 32, offset: 320)
!567 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 128, align: 64, elements: !568, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !203, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !203, size: 64, align: 64, offset: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !136, line: 1345, size: 1664, align: 64, elements: !572, identifier: "_ZTSN3pov14Texture_StructE")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !590, !591}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !347, size: 16, align: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !347, size: 16, align: 16, offset: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !347, size: 16, align: 16, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !151, size: 32, align: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !231, size: 32, align: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !231, size: 32, align: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !231, size: 32, align: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !355, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !358, size: 64, align: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !361, size: 64, align: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !213, size: 64, align: 64, offset: 1280)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1348, baseType: !341, size: 64, align: 64, offset: 1344)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1349, baseType: !405, size: 64, align: 64, offset: 1408)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1350, baseType: !588, size: 64, align: 64, offset: 1472)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !136, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1351, baseType: !213, size: 64, align: 64, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1352, baseType: !151, size: 32, align: 32, offset: 1600)
!592 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, size: 896, align: 64, elements: !593, identifier: "_ZTSN3pov14Texture_StructUt_E")
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !427, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !430, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !231, size: 32, align: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !341, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !189, size: 64, align: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 256, align: 64, elements: !611, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !231, size: 32, align: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64, offset: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 64, align: 32, elements: !615, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !231, size: 32, align: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !231, size: 32, align: 32, offset: 32)
!618 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 320, align: 64, elements: !619, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!619 = !{!620, !621, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64, offset: 128)
!623 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 896, align: 64, elements: !624, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !545, size: 64, align: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !151, size: 32, align: 32, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64, offset: 704)
!633 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 832, align: 64, elements: !634, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !177, size: 192, align: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16, offset: 400)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !184, size: 128, align: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !184, size: 128, align: 64, offset: 704)
!643 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 384, align: 64, elements: !644, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!644 = !{!645, !646, !647, !648, !649, !650, !651}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !184, size: 128, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16, offset: 144)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !387, size: 16, align: 16, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !175, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !151, size: 32, align: 32, offset: 320)
!652 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 128, align: 64, elements: !653, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !203, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !203, size: 64, align: 64, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !136, line: 1356, size: 928, align: 32, elements: !657, identifier: "_ZTSN3pov13Finish_StructE")
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !677, !678, !679, !680, !681, !682}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !231, size: 32, align: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !231, size: 32, align: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !231, size: 32, align: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !231, size: 32, align: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !231, size: 32, align: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !231, size: 32, align: 32, offset: 160)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !231, size: 32, align: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !231, size: 32, align: 32, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !231, size: 32, align: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !231, size: 32, align: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !231, size: 32, align: 32, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !231, size: 32, align: 32, offset: 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !231, size: 32, align: 32, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !231, size: 32, align: 32, offset: 416)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !231, size: 32, align: 32, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !231, size: 32, align: 32, offset: 480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !675, size: 96, align: 32, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !136, line: 682, baseType: !676)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 96, align: 32, elements: !179)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !675, size: 96, align: 32, offset: 608)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !675, size: 96, align: 32, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1365, baseType: !231, size: 32, align: 32, offset: 800)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1366, baseType: !151, size: 32, align: 32, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1367, baseType: !231, size: 32, align: 32, offset: 864)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1368, baseType: !151, size: 32, align: 32, offset: 896)
!683 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, size: 896, align: 64, elements: !684, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !427, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !430, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !231, size: 32, align: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !341, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !189, size: 64, align: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 256, align: 64, elements: !702, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !136, line: 1325, baseType: !231, size: 32, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 64, align: 32, elements: !706, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !136, line: 1325, baseType: !231, size: 32, align: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !136, line: 1325, baseType: !231, size: 32, align: 32, offset: 32)
!709 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 320, align: 64, elements: !710, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64, offset: 128)
!714 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 896, align: 64, elements: !715, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !545, size: 64, align: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !151, size: 32, align: 32, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64, offset: 704)
!724 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 832, align: 64, elements: !725, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !177, size: 192, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16, offset: 400)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !184, size: 128, align: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !184, size: 128, align: 64, offset: 704)
!734 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 384, align: 64, elements: !735, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!735 = !{!736, !737, !738, !739, !740, !741, !742}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !184, size: 128, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16, offset: 144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !387, size: 16, align: 16, offset: 160)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !175, size: 64, align: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !151, size: 32, align: 32, offset: 320)
!743 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 128, align: 64, elements: !744, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !136, line: 1325, baseType: !203, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !136, line: 1325, baseType: !203, size: 64, align: 64, offset: 64)
!747 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, size: 896, align: 64, elements: !748, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !427, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !430, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !177, size: 192, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !231, size: 32, align: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !387, size: 16, align: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !387, size: 16, align: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !387, size: 16, align: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !341, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !189, size: 64, align: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 256, align: 64, elements: !766, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !231, size: 32, align: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !177, size: 192, align: 64, offset: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 64, align: 32, elements: !770, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !231, size: 32, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !231, size: 32, align: 32, offset: 32)
!773 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 320, align: 64, elements: !774, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !175, size: 64, align: 64)
