; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/octree.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"struct.pov::ot_node_struct" = type { %"struct.pov::ot_id_struct", %"struct.pov::ot_block_struct"*, [8 x %"struct.pov::ot_node_struct"*] }
%"struct.pov::ot_id_struct" = type { i32, i32, i32, i32 }
%"struct.pov::ot_block_struct" = type { %"struct.pov::ot_block_struct"*, [3 x double], [3 x double], float, float, float, float, float, float, float, float, float, [3 x float], float, float, [3 x double], i16 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !19, subprograms: !355, globals: !608, imports: !609)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/octree.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !12}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 692, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "X", value: 0)
!9 = !DIEnumerator(name: "Y", value: 1)
!10 = !DIEnumerator(name: "Z", value: 2)
!11 = !DIEnumerator(name: "T", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 701, size: 32, align: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "pRED", value: 0)
!15 = !DIEnumerator(name: "pGREEN", value: 1)
!16 = !DIEnumerator(name: "pBLUE", value: 2)
!17 = !DIEnumerator(name: "pFILTER", value: 3)
!18 = !DIEnumerator(name: "pTRANSM", value: 4)
!19 = !{!20, !26, !31, !36, !50, !56, !46, !24, !62, !67, !84, !146, !208, !252, !256, !180, !257, !258, !83, !42, !326, !343}
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 82, size: 64, align: 32, elements: !22, identifier: "_ZTS5div_t")
!21 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !21, line: 83, baseType: !24, size: 32, align: 32)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !21, line: 84, baseType: !24, size: 32, align: 32, offset: 32)
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 87, size: 128, align: 64, elements: !27, identifier: "_ZTS6ldiv_t")
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !21, line: 88, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !21, line: 89, baseType: !29, size: 64, align: 64, offset: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 93, size: 128, align: 64, elements: !32, identifier: "_ZTS7lldiv_t")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !21, line: 94, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !21, line: 95, baseType: !34, size: 64, align: 64, offset: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ot_node_struct", scope: !5, file: !37, line: 80, size: 704, align: 64, elements: !38, identifier: "_ZTSN3pov14ot_node_structE")
!37 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/octree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!38 = !{!39, !41, !44}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Id", scope: !"_ZTSN3pov14ot_node_structE", file: !37, line: 82, baseType: !40, size: 128, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "OT_ID", scope: !5, file: !37, line: 56, baseType: !"_ZTSN3pov12ot_id_structE")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Values", scope: !"_ZTSN3pov14ot_node_structE", file: !37, line: 83, baseType: !42, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "OT_BLOCK", scope: !5, file: !37, line: 55, baseType: !"_ZTSN3pov15ot_block_structE")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Kids", scope: !"_ZTSN3pov14ot_node_structE", file: !37, line: 84, baseType: !45, size: 512, align: 64, offset: 192)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 512, align: 64, elements: !48)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "OT_NODE", scope: !5, file: !37, line: 57, baseType: !"_ZTSN3pov14ot_node_structE")
!48 = !{!49}
!49 = !DISubrange(count: 8)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ot_id_struct", scope: !5, file: !37, line: 73, size: 128, align: 32, elements: !51, identifier: "_ZTSN3pov12ot_id_structE")
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTSN3pov12ot_id_structE", file: !37, line: 75, baseType: !24, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTSN3pov12ot_id_structE", file: !37, line: 75, baseType: !24, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !"_ZTSN3pov12ot_id_structE", file: !37, line: 75, baseType: !24, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov12ot_id_structE", file: !37, line: 76, baseType: !24, size: 32, align: 32, offset: 96)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "ot_block_struct", scope: !5, file: !37, line: 61, size: 1152, align: 64, elements: !57, identifier: "_ZTSN3pov15ot_block_structE")
!57 = !{!58, !59, !65, !66, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !80, !81, !82}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 63, baseType: !42, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Point", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 64, baseType: !60, size: 192, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 192, align: 64, elements: !63)
!62 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "S_Normal", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 64, baseType: !60, size: 192, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "drdx", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 448)
!67 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dgdx", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 480)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dbdx", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "drdy", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 544)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dgdy", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dbdy", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 608)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "drdz", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dgdz", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 672)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dbdz", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 65, baseType: !67, size: 32, align: 32, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Illuminance", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 66, baseType: !77, size: 96, align: 32, offset: 736)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !4, line: 682, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 96, align: 32, elements: !63)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Harmonic_Mean_Distance", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 67, baseType: !67, size: 32, align: 32, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Nearest_Distance", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 67, baseType: !67, size: 32, align: 32, offset: 864)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "To_Nearest_Surface", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 68, baseType: !60, size: 192, align: 64, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Bounce_Depth", scope: !"_ZTSN3pov15ot_block_structE", file: !37, line: 69, baseType: !83, size: 16, align: 16, offset: 1088)
!83 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !86, file: !85, line: 150, size: 320, align: 64, elements: !87, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!85 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DINamespace(name: "pov_base", scope: null, file: !85, line: 37)
!87 = !{!88, !89, !95, !98, !104, !109, !113, !116, !120, !123, !126, !130, !133, !134, !137, !138, !141, !142, !145}
!88 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!89 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 153, type: !90, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !92, !93}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!95 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 154, type: !96, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !92}
!98 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 156, type: !99, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !92, !101, null}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 158, type: !105, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !92, !108}
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!108 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!109 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 159, type: !110, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!107, !92, !112}
!112 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!113 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 160, type: !114, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!114 = !DISubroutineType(types: !115)
!115 = !{!107, !92, !94}
!116 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 161, type: !117, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{!107, !92, !119}
!119 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!120 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 162, type: !121, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!121 = !DISubroutineType(types: !122)
!122 = !{!107, !92}
!123 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 164, type: !124, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!124 = !DISubroutineType(types: !125)
!125 = !{!107, !92, !101}
!126 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 165, type: !127, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{!107, !92, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!130 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 166, type: !131, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!131 = !DISubroutineType(types: !132)
!132 = !{!107, !92, !103}
!133 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 167, type: !105, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!134 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 168, type: !135, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubroutineType(types: !136)
!136 = !{!107, !92, !83}
!137 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 169, type: !110, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 170, type: !139, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{!107, !92, !24}
!141 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 171, type: !114, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 172, type: !143, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{!107, !92, !29}
!145 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !85, line: 173, type: !117, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !86, file: !85, line: 84, size: 320, align: 64, elements: !147, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!147 = !{!148, !153, !155, !159, !160, !161, !163, !167, !170, !173, !176, !181, !182, !185, !188, !189, !190, !193, !196, !199, !204, !207}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !85, file: !85, baseType: !149, size: 64, flags: DIFlagArtificial)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!24}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 110, baseType: !154, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!154 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 111, baseType: !156, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !158, line: 153, baseType: !"_ZTS7__sFILE")
!158 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 113, baseType: !94, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 114, baseType: !94, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 115, baseType: !162, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!163 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 87, type: !164, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166, !94, !94}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!167 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 88, type: !168, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !166}
!170 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 94, type: !171, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!154, !166, !101, !94}
!173 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 95, type: !174, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!174 = !DISubroutineType(types: !175)
!175 = !{!154, !166}
!176 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 96, type: !177, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !166, !180, !119}
!179 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!181 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 97, type: !177, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 98, type: !183, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!179, !166, !119, !94}
!185 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 100, type: !186, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!94, !166}
!188 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 101, type: !186, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 102, type: !174, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 103, type: !191, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!191 = !DISubroutineType(types: !192)
!192 = !{!119, !166}
!193 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 104, type: !194, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{!179, !166}
!196 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 105, type: !197, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{!101, !166}
!199 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 107, type: !200, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{!180, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!204 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 108, type: !205, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubroutineType(types: !206)
!206 = !{!154, !202}
!207 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !85, line: 112, type: !194, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !158, line: 122, size: 1216, align: 64, elements: !209, identifier: "_ZTS7__sFILE")
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !222, !226, !235, !239, !240, !242, !243, !245, !249, !250, !251}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !158, line: 123, baseType: !129, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !158, line: 124, baseType: !24, size: 32, align: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !158, line: 125, baseType: !24, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !158, line: 126, baseType: !83, size: 16, align: 16, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !158, line: 127, baseType: !83, size: 16, align: 16, offset: 144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !158, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !158, line: 129, baseType: !24, size: 32, align: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !158, line: 132, baseType: !180, size: 64, align: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !158, line: 133, baseType: !219, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!24, !180}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !158, line: 134, baseType: !223, size: 64, align: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!24, !180, !162, !24}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !158, line: 135, baseType: !227, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !180, !230, !24}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !158, line: 77, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !232, line: 71, baseType: !233)
!232 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !234, line: 46, baseType: !34)
!234 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !158, line: 136, baseType: !236, size: 64, align: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!24, !180, !101, !24}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !158, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !158, line: 140, baseType: !241, size: 64, align: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !158, line: 141, baseType: !24, size: 32, align: 32, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !158, line: 144, baseType: !244, size: 24, align: 8, offset: 928)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 24, align: 8, elements: !63)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !158, line: 145, baseType: !246, size: 8, align: 8, offset: 952)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8, align: 8, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !158, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !158, line: 151, baseType: !24, size: 32, align: 32, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !158, line: 152, baseType: !230, size: 64, align: 64, offset: 1152)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !158, line: 88, size: 128, align: 64, elements: !253, identifier: "_ZTS6__sbuf")
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !158, line: 89, baseType: !129, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !158, line: 90, baseType: !24, size: 32, align: 32, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !158, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !86, file: !85, line: 118, size: 320, align: 64, elements: !259, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!259 = !{!260, !261, !265, !268, !271, !272, !273, !276, !281, !285, !289, !293, !297, !301, !305, !309, !310, !311, !312, !313, !314, !315, !316, !317, !320, !323}
!260 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!261 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 121, type: !262, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !264, !93}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!265 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 122, type: !266, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !264}
!268 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 124, type: !269, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!269 = !DISubroutineType(types: !270)
!270 = !{!24, !264}
!271 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 125, type: !269, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 126, type: !269, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 127, type: !274, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!29, !264}
!276 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 128, type: !277, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !264, !280}
!279 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!280 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !103)
!281 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !85, line: 129, type: !282, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!282 = !DISubroutineType(types: !283)
!283 = !{!279, !264, !284}
!284 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108)
