; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/optout.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::intersection_stats_info" = type { i32, i32, i32, i8* }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }

@.str = private unnamed_addr constant [12 x i8] c"Chris Cason\00", align 1
@.str1 = private unnamed_addr constant [19 x i8] c"Thorsten Froehlich\00", align 1
@.str2 = private unnamed_addr constant [12 x i8] c"Nathan Kopp\00", align 1
@.str3 = private unnamed_addr constant [11 x i8] c"Ron Parker\00", align 1
@_ZN3pov18Primary_DevelopersE = global [5 x i8*] [i8* getelementptr inbounds ([12 x i8]* @.str, i32 0, i32 0), i8* getelementptr inbounds ([19 x i8]* @.str1, i32 0, i32 0), i8* getelementptr inbounds ([12 x i8]* @.str2, i32 0, i32 0), i8* getelementptr inbounds ([11 x i8]* @.str3, i32 0, i32 0), i8* null], align 16
@.str4 = private unnamed_addr constant [12 x i8] c"Steve Anger\00", align 1

!49 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41)
!50 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42)
!51 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43)
!52 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44)
!53 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45)
!54 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46)
!55 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47)
!56 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48)
!57 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49)
!58 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50)
!59 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51)
!60 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52)
!61 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53)
!62 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54)
!63 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!64 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!65 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!66 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!67 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!68 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!69 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!70 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!71 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!72 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!73 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!74 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!75 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!76 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!77 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!78 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!79 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!80 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!81 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!82 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!83 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!84 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!85 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!86 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!87 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!88 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!89 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!90 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!91 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!92 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!93 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!94 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!95 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!96 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!97 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!98 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!99 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!100 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!101 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!102 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!103 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!104 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!105 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!106 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!107 = !DIEnumerator(name: "Media_Samples", value: 99)
!108 = !DIEnumerator(name: "Media_Intervals", value: 100)
!109 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!110 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!111 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!112 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!113 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!114 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!115 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!116 = !DIEnumerator(name: "nChecked", value: 108)
!117 = !DIEnumerator(name: "nEnqueued", value: 109)
!118 = !DIEnumerator(name: "totalQueues", value: 110)
!119 = !DIEnumerator(name: "totalQueueResets", value: 111)
!120 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!121 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!122 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!123 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!124 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!125 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !{!136, !142, !147, !152, !3, !161, !168, !176}
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 82, size: 64, align: 32, elements: !138, identifier: "_ZTS5div_t")
!137 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !137, line: 83, baseType: !140, size: 32, align: 32)
!140 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !137, line: 84, baseType: !140, size: 32, align: 32, offset: 32)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 87, size: 128, align: 64, elements: !143, identifier: "_ZTS6ldiv_t")
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !137, line: 88, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !137, line: 89, baseType: !145, size: 64, align: 64, offset: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 93, size: 128, align: 64, elements: !148, identifier: "_ZTS7lldiv_t")
!148 = !{!149, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !137, line: 94, baseType: !150, size: 64, align: 64)
!150 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !137, line: 95, baseType: !150, size: 64, align: 64, offset: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "intersection_stats_info", scope: !5, file: !4, line: 307, size: 192, align: 64, elements: !153, identifier: "_ZTSN3pov23intersection_stats_infoE")
!153 = !{!154, !155, !157, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "povms_id", scope: !"_ZTSN3pov23intersection_stats_infoE", file: !4, line: 309, baseType: !140, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "stat_test_id", scope: !"_ZTSN3pov23intersection_stats_infoE", file: !4, line: 310, baseType: !156, size: 32, align: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "Stats", scope: !5, file: !4, line: 305, baseType: !"_ZTSN3pov5STATSE")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "stat_suc_id", scope: !"_ZTSN3pov23intersection_stats_infoE", file: !4, line: 311, baseType: !156, size: 32, align: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "infotext", scope: !"_ZTSN3pov23intersection_stats_infoE", file: !4, line: 312, baseType: !159, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !162, line: 178, size: 128, align: 64, elements: !163, identifier: "_ZTS9POVMSData")
!162 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!163 = !{!164, !166, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !162, line: 180, baseType: !165, size: 32, align: 32)
!165 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !162, line: 181, baseType: !140, size: 32, align: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !162, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!168 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !162, line: 182, size: 64, align: 64, elements: !169, identifier: "_ZTSN9POVMSDataUt_E")
!169 = !{!170, !172, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !162, line: 184, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !162, line: 185, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !162, line: 186, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !162, line: 190, size: 320, align: 64, elements: !177, identifier: "_ZTS9POVMSNode")
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !162, line: 192, baseType: !175, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !162, line: 193, baseType: !175, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !162, line: 194, baseType: !165, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !162, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!182 = !{!183, !191, !199, !205, !214, !217, !223}
!183 = !DISubprogram(name: "Extract_Version", linkageName: "_ZN3pov15Extract_VersionEPKc", scope: !5, file: !1, line: 299, type: !184, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @_ZN3pov15Extract_VersionEPKc, variables: !188)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!188 = !{!189, !190}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !183, file: !1, line: 299, type: !186)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !183, file: !1, line: 301, type: !140)
!191 = !DISubprogram(name: "GetOptionSwitchString", linkageName: "_ZN3pov21GetOptionSwitchStringEP9POVMSDataj", scope: !5, file: !1, line: 322, type: !192, isLocal: false, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.POVMSData*, i32)* @_ZN3pov21GetOptionSwitchStringEP9POVMSDataj, variables: !195)
!192 = !DISubroutineType(types: !193)
!193 = !{!159, !194, !165}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !162, line: 173, baseType: !173)
!195 = !{!196, !197, !198}
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !191, file: !1, line: 322, type: !194)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !191, file: !1, line: 322, type: !165)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !191, file: !1, line: 324, type: !140)
!199 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !200, file: !200, line: 237, type: !201, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !203)
!200 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!201 = !DISubroutineType(types: !202)
!202 = !{!140, !140}
!203 = !{!204}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !199, file: !200, line: 237, type: !140)
!205 = !DISubprogram(name: "__isctype", linkageName: "_Z9__isctypeim", scope: !200, file: !200, line: 164, type: !206, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !211)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !208, !210}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !209, line: 70, baseType: !140)
!209 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!210 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!211 = !{!212, !213}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !205, file: !200, line: 164, type: !208)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !205, file: !200, line: 164, type: !210)
!214 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !200, file: !200, line: 212, type: !201, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, variables: !215)
!215 = !{!216}
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !214, file: !200, line: 212, type: !140)
!217 = !DISubprogram(name: "__istype", linkageName: "_Z8__istypeim", scope: !200, file: !200, line: 153, type: !218, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !220)
!218 = !DISubroutineType(types: !219)
!219 = !{!140, !208, !210}
!220 = !{!221, !222}
