; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/parsestr.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!461 = !DIEnumerator(name: "VECTOR_4D_ID_TOKEN", value: 453)
!462 = !DIEnumerator(name: "UV_MAPPING_TOKEN", value: 454)
!463 = !DIEnumerator(name: "UV_VECTORS_TOKEN", value: 455)
!464 = !DIEnumerator(name: "MESH2_TOKEN", value: 456)
!465 = !DIEnumerator(name: "VERTEX_VECTORS_TOKEN", value: 457)
!466 = !DIEnumerator(name: "NORMAL_VECTORS_TOKEN", value: 458)
!467 = !DIEnumerator(name: "FACE_INDICES_TOKEN", value: 459)
!468 = !DIEnumerator(name: "NORMAL_INDICES_TOKEN", value: 460)
!469 = !DIEnumerator(name: "UV_INDICES_TOKEN", value: 461)
!470 = !DIEnumerator(name: "TEXTURE_LIST_TOKEN", value: 462)
!471 = !DIEnumerator(name: "IMAGE_PATTERN_TOKEN", value: 463)
!472 = !DIEnumerator(name: "USE_ALPHA_TOKEN", value: 464)
!473 = !DIEnumerator(name: "DOUBLE_ILLUMINATE_TOKEN", value: 465)
!474 = !DIEnumerator(name: "INSIDE_VECTOR_TOKEN", value: 466)
!475 = !DIEnumerator(name: "PHOTONS_TOKEN", value: 467)
!476 = !DIEnumerator(name: "STEPS_TOKEN", value: 468)
!477 = !DIEnumerator(name: "PASS_THROUGH_TOKEN", value: 469)
!478 = !DIEnumerator(name: "COLLECT_TOKEN", value: 470)
!479 = !DIEnumerator(name: "AUTOSTOP_TOKEN", value: 471)
!480 = !DIEnumerator(name: "GATHER_TOKEN", value: 472)
!481 = !DIEnumerator(name: "SPLIT_UNION_TOKEN", value: 473)
!482 = !DIEnumerator(name: "EXPAND_THRESHOLDS_TOKEN", value: 474)
!483 = !DIEnumerator(name: "SPACING_TOKEN", value: 475)
!484 = !DIEnumerator(name: "TARGET_TOKEN", value: 476)
!485 = !DIEnumerator(name: "PARAMETRIC_TOKEN", value: 477)
!486 = !DIEnumerator(name: "PRECOMPUTE_TOKEN", value: 478)
!487 = !DIEnumerator(name: "CONTAINED_BY_TOKEN", value: 479)
!488 = !DIEnumerator(name: "ISOSURFACE_TOKEN", value: 480)
!489 = !DIEnumerator(name: "METHOD_TOKEN", value: 481)
!490 = !DIEnumerator(name: "ACCURACY_TOKEN", value: 482)
!491 = !DIEnumerator(name: "MAX_GRADIENT_TOKEN", value: 483)
!492 = !DIEnumerator(name: "MAX_TRACE_TOKEN", value: 484)
!493 = !DIEnumerator(name: "FUNCTION_TOKEN", value: 485)
!494 = !DIEnumerator(name: "EVALUATE_TOKEN", value: 486)
!495 = !DIEnumerator(name: "FUNCT_ID_TOKEN", value: 487)
!496 = !DIEnumerator(name: "VECTFUNCT_ID_TOKEN", value: 488)
!497 = !DIEnumerator(name: "ALL_INTERSECTIONS_TOKEN", value: 489)
!498 = !DIEnumerator(name: "DISPERSION_TOKEN", value: 490)
!499 = !DIEnumerator(name: "DISPERSION_SAMPLES_TOKEN", value: 491)
!500 = !DIEnumerator(name: "ORIENT_TOKEN", value: 492)
!501 = !DIEnumerator(name: "CIRCULAR_TOKEN", value: 493)
!502 = !DIEnumerator(name: "NO_IMAGE_TOKEN", value: 494)
!503 = !DIEnumerator(name: "NO_REFLECTION_TOKEN", value: 495)
!504 = !DIEnumerator(name: "LIGHT_GROUP_TOKEN", value: 496)
!505 = !DIEnumerator(name: "NATURAL_SPLINE_TOKEN", value: 497)
!506 = !DIEnumerator(name: "B_SPLINE_TOKEN", value: 498)
!507 = !DIEnumerator(name: "TOLERANCE_TOKEN", value: 499)
!508 = !DIEnumerator(name: "PROJECTED_THROUGH_TOKEN", value: 500)
!509 = !DIEnumerator(name: "PARALLEL_TOKEN", value: 501)
!510 = !DIEnumerator(name: "SPHERE_SWEEP_TOKEN", value: 502)
!511 = !DIEnumerator(name: "SPLINE_TOKEN", value: 503)
!512 = !DIEnumerator(name: "SPLINE_ID_TOKEN", value: 504)
!513 = !DIEnumerator(name: "PATTERN_TOKEN", value: 505)
!514 = !DIEnumerator(name: "FACETS_TOKEN", value: 506)
!515 = !DIEnumerator(name: "SLOPE_TOKEN", value: 507)
!516 = !DIEnumerator(name: "SOLID_TOKEN", value: 508)
!517 = !DIEnumerator(name: "COORDS_TOKEN", value: 509)
!518 = !DIEnumerator(name: "SIZE_TOKEN", value: 510)
!519 = !DIEnumerator(name: "METRIC_TOKEN", value: 511)
!520 = !DIEnumerator(name: "FORM_TOKEN", value: 512)
!521 = !DIEnumerator(name: "ORIENTATION_TOKEN", value: 513)
!522 = !DIEnumerator(name: "TOROIDAL_TOKEN", value: 514)
!523 = !DIEnumerator(name: "DIST_EXP_TOKEN", value: 515)
!524 = !DIEnumerator(name: "MAJOR_RADIUS_TOKEN", value: 516)
!525 = !DIEnumerator(name: "JPEG_TOKEN", value: 517)
!526 = !DIEnumerator(name: "AA_THRESHOLD_TOKEN", value: 518)
!527 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519)
!528 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520)
!529 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521)
!530 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522)
!531 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523)
!532 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524)
!533 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525)
!534 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526)
!535 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527)
!536 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528)
!537 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529)
!538 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530)
!539 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531)
!540 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532)
!541 = !DIEnumerator(name: "JULIA_TOKEN", value: 533)
!542 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534)
!543 = !DIEnumerator(name: "LAST_TOKEN", value: 535)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !545, line: 692, size: 32, align: 32, elements: !546)
!545 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!546 = !{!547, !548, !549, !550}
!547 = !DIEnumerator(name: "X", value: 0)
!548 = !DIEnumerator(name: "Y", value: 1)
!549 = !DIEnumerator(name: "Z", value: 2)
!550 = !DIEnumerator(name: "T", value: 3)
!551 = !{!552, !558, !563, !568, !623, !627, !628, !582, !635, !3, !556, !573, !572, !636, !591, !592, !637}
!552 = !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 82, size: 64, align: 32, elements: !554, identifier: "_ZTS5div_t")
!553 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !553, line: 83, baseType: !556, size: 32, align: 32)
!556 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !553, line: 84, baseType: !556, size: 32, align: 32, offset: 32)
!558 = !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 87, size: 128, align: 64, elements: !559, identifier: "_ZTS6ldiv_t")
!559 = !{!560, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !553, line: 88, baseType: !561, size: 64, align: 64)
!561 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !553, line: 89, baseType: !561, size: 64, align: 64, offset: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 93, size: 128, align: 64, elements: !564, identifier: "_ZTS7lldiv_t")
!564 = !{!565, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !553, line: 94, baseType: !566, size: 64, align: 64)
!566 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !553, line: 95, baseType: !566, size: 64, align: 64, offset: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !569, line: 122, size: 1216, align: 64, elements: !570, identifier: "_ZTS7__sFILE")
!569 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!570 = !{!571, !574, !575, !576, !578, !579, !580, !581, !583, !587, !593, !602, !608, !609, !611, !612, !616, !620, !621, !622}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !569, line: 123, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !569, line: 124, baseType: !556, size: 32, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !569, line: 125, baseType: !556, size: 32, align: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !569, line: 126, baseType: !577, size: 16, align: 16, offset: 128)
!577 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !569, line: 127, baseType: !577, size: 16, align: 16, offset: 144)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !569, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !569, line: 129, baseType: !556, size: 32, align: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !569, line: 132, baseType: !582, size: 64, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !569, line: 133, baseType: !584, size: 64, align: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!556, !582}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !569, line: 134, baseType: !588, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!556, !582, !591, !556}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !569, line: 135, baseType: !594, size: 64, align: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!597, !582, !597, !556}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !569, line: 77, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !599, line: 71, baseType: !600)
!599 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !601, line: 46, baseType: !566)
!601 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !569, line: 136, baseType: !603, size: 64, align: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!556, !582, !606, !556}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !569, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !569, line: 140, baseType: !610, size: 64, align: 64, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !569, line: 141, baseType: !556, size: 32, align: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !569, line: 144, baseType: !613, size: 24, align: 8, offset: 928)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 24, align: 8, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 3)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !569, line: 145, baseType: !617, size: 8, align: 8, offset: 952)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 8, align: 8, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 1)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !569, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !569, line: 151, baseType: !556, size: 32, align: 32, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !569, line: 152, baseType: !597, size: 64, align: 64, offset: 1152)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !569, line: 88, size: 128, align: 64, elements: !624, identifier: "_ZTS6__sbuf")
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !569, line: 89, baseType: !572, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !569, line: 90, baseType: !556, size: 32, align: 32, offset: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !569, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !629, identifier: "_ZTS13__va_list_tag")
!629 = !{!630, !632, !633, !634}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !631, size: 32, align: 32)
!631 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !631, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !582, size: 64, align: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !582, size: 64, align: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!638 = !{!639, !647, !656, !672, !694, !701, !706, !713, !717, !721, !740, !748, !762, !775, !783, !789, !797, !803, !810, !816, !820, !826}
!639 = !DISubprogram(name: "Parse_C_String", linkageName: "_ZN3pov14Parse_C_StringEb", scope: !5, file: !1, line: 115, type: !640, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i1)* @_ZN3pov14Parse_C_StringEb, variables: !643)
!640 = !DISubroutineType(types: !641)
!641 = !{!591, !642}
!642 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!643 = !{!644, !645, !646}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !639, file: !1, line: 115, type: !642)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !639, file: !1, line: 117, type: !635)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "New", scope: !639, file: !1, line: 118, type: !591)
!647 = !DISubprogram(name: "Parse_String", linkageName: "_ZN3pov12Parse_StringEb", scope: !5, file: !1, line: 144, type: !648, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: i16* (i1)* @_ZN3pov12Parse_StringEb, variables: !650)
!648 = !DISubroutineType(types: !649)
!649 = !{!635, !642}
!650 = !{!651, !652, !653, !654}
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !647, file: !1, line: 144, type: !642)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "New", scope: !647, file: !1, line: 146, type: !635)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !647, file: !1, line: 147, type: !556)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Exit_Flag", scope: !655, file: !1, line: 149, type: !556)
!655 = distinct !DILexicalBlock(scope: !647, file: !1, line: 149, column: 2)
!656 = !DISubprogram(name: "Parse_Str", linkageName: "_ZN3pov9Parse_StrEb", scope: !5, file: !1, line: 224, type: !648, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i16* (i1)* @_ZN3pov9Parse_StrEb, variables: !657)
!657 = !{!658, !659, !660, !664, !668, !670, !671}
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !656, file: !1, line: 224, type: !642)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !656, file: !1, line: 226, type: !591)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp3", scope: !656, file: !1, line: 227, type: !661)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 1024, align: 8, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 128)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp4", scope: !656, file: !1, line: 228, type: !665)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 2048, align: 8, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 256)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !656, file: !1, line: 229, type: !669)
!669 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !656, file: !1, line: 230, type: !556)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !656, file: !1, line: 230, type: !556)
