; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/parse.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Camera_Struct" = type { [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], double, double, i32, double, double, i32, double, double, double, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Transform_Struct"* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, float, float }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }
%struct.anon.21 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }

!749 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!750 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!751 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!752 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!753 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!754 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!755 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!756 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!757 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!758 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!759 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!760 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!761 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!762 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!763 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!764 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!765 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!766 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!767 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!768 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!769 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!770 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!771 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!772 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!773 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!774 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!775 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!776 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!777 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!778 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!779 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!780 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!781 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!782 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!783 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!784 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!785 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!786 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!787 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!788 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!789 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!790 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!791 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!792 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!793 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!794 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!795 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!796 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!797 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!798 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !206, file: !800, line: 692, size: 32, align: 32, elements: !801)
!800 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!801 = !{!802, !803, !804, !805}
!802 = !DIEnumerator(name: "X", value: 0)
!803 = !DIEnumerator(name: "Y", value: 1)
!804 = !DIEnumerator(name: "Z", value: 2)
!805 = !DIEnumerator(name: "T", value: 3)
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !206, file: !800, line: 701, size: 32, align: 32, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIEnumerator(name: "pRED", value: 0)
!809 = !DIEnumerator(name: "pGREEN", value: 1)
!810 = !DIEnumerator(name: "pBLUE", value: 2)
!811 = !DIEnumerator(name: "pFILTER", value: 3)
!812 = !DIEnumerator(name: "pTRANSM", value: 4)
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !206, file: !800, line: 686, size: 32, align: 32, elements: !814)
!814 = !{!815, !816}
!815 = !DIEnumerator(name: "U", value: 0)
!816 = !DIEnumerator(name: "V", value: 1)
!817 = !{!818, !824, !829, !834, !889, !893, !894, !901, !929, !952, !957, !970, !979, !984, !1003, !1017, !1041, !1047, !1056, !1063, !1086, !1093, !1105, !1111, !1117, !1121, !1125, !1130, !1141, !1151, !1160, !1164, !1187, !1239, !1249, !1264, !1292, !1300, !1321, !1329, !1350, !1368, !1372, !1376, !1381, !1391, !1401, !1410, !1414, !1441, !1496, !1503, !1514, !1521, !1527, !1545, !1549, !1553, !1558, !1568, !1578, !1587, !1591, !1609, !1613, !1617, !1622, !1632, !1642, !1651, !1655, !1660, !1667, !1673, !1675, !857, !204, !1203, !848, !1683, !1699, !1708, !1724, !1039, !745, !1731, !822, !1736, !1755, !1757, !1779, !1781, !927, !1782, !1790, !1792, !1793, !1802, !1809, !1863, !1932, !1986, !1990, !2015, !1486, !1138, !2066, !2067, !992, !924, !1262, !1174, !2071, !996, !947, !2073, !1722, !1697, !2075, !2081, !2083, !2094, !2096, !2098, !2100, !2104, !2120, !2125, !944, !1179, !1729, !2127, !2155, !2167, !2178, !2183, !2189, !2191, !2214, !2231, !2252, !1346, !1060, !1788, !2254, !2292, !2296, !2300, !2304, !2313, !843, !1501, !2315, !2348, !2352, !2356, !2360, !2368, !2370, !2428, !2404, !2432, !2451, !2453, !2482, !2486, !2497, !2473, !2499, !2518, !2520, !2542, !2544, !2566, !2568, !2587, !2589, !2608, !2610, !2636, !2646, !2652, !2667, !2672, !2678, !2680, !2701, !2706, !2708, !2744, !2750, !2763, !2769, !2771, !2798, !2805, !2811, !2813, !2831, !2222, !2148, !2227, !2209, !2833, !2867, !2874, !2876, !2900, !2902, !2929, !2931, !2953, !2984, !2989, !2997, !2999, !3017, !3019, !3025, !3041, !897, !3052}
!818 = !DICompositeType(tag: DW_TAG_structure_type, file: !819, line: 82, size: 64, align: 32, elements: !820, identifier: "_ZTS5div_t")
!819 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!820 = !{!821, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !819, line: 83, baseType: !822, size: 32, align: 32)
!822 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !819, line: 84, baseType: !822, size: 32, align: 32, offset: 32)
!824 = !DICompositeType(tag: DW_TAG_structure_type, file: !819, line: 87, size: 128, align: 64, elements: !825, identifier: "_ZTS6ldiv_t")
!825 = !{!826, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !819, line: 88, baseType: !827, size: 64, align: 64)
!827 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !819, line: 89, baseType: !827, size: 64, align: 64, offset: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, file: !819, line: 93, size: 128, align: 64, elements: !830, identifier: "_ZTS7lldiv_t")
!830 = !{!831, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !819, line: 94, baseType: !832, size: 64, align: 64)
!832 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !819, line: 95, baseType: !832, size: 64, align: 64, offset: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !835, line: 122, size: 1216, align: 64, elements: !836, identifier: "_ZTS7__sFILE")
!835 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!836 = !{!837, !840, !841, !842, !844, !845, !846, !847, !849, !853, !859, !868, !874, !875, !877, !878, !882, !886, !887, !888}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !835, line: 123, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, align: 64)
!839 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !835, line: 124, baseType: !822, size: 32, align: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !835, line: 125, baseType: !822, size: 32, align: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !835, line: 126, baseType: !843, size: 16, align: 16, offset: 128)
!843 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !835, line: 127, baseType: !843, size: 16, align: 16, offset: 144)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !835, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !835, line: 129, baseType: !822, size: 32, align: 32, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !835, line: 132, baseType: !848, size: 64, align: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !835, line: 133, baseType: !850, size: 64, align: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!822, !848}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !835, line: 134, baseType: !854, size: 64, align: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64, align: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!822, !848, !857, !822}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64, align: 64)
!858 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !835, line: 135, baseType: !860, size: 64, align: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!863, !848, !863, !822}
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !835, line: 77, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !865, line: 71, baseType: !866)
!865 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !867, line: 46, baseType: !832)
!867 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !835, line: 136, baseType: !869, size: 64, align: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!822, !848, !872, !822}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !835, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !835, line: 140, baseType: !876, size: 64, align: 64, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !835, line: 141, baseType: !822, size: 32, align: 32, offset: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !835, line: 144, baseType: !879, size: 24, align: 8, offset: 928)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 24, align: 8, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 3)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !835, line: 145, baseType: !883, size: 8, align: 8, offset: 952)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 8, align: 8, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 1)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !835, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !835, line: 151, baseType: !822, size: 32, align: 32, offset: 1088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !835, line: 152, baseType: !863, size: 64, align: 64, offset: 1152)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !835, line: 88, size: 128, align: 64, elements: !890, identifier: "_ZTS6__sbuf")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !835, line: 89, baseType: !838, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !835, line: 90, baseType: !822, size: 32, align: 32, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !835, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !895, identifier: "_ZTS13__va_list_tag")
!895 = !{!896, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !897, size: 32, align: 32)
!897 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !897, size: 32, align: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !848, size: 64, align: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !848, size: 64, align: 64, offset: 128)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera_Struct", scope: !206, file: !902, line: 66, size: 2048, align: 64, elements: !903, identifier: "_ZTSN3pov13Camera_StructE")
!902 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/camera.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!903 = !{!904, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !926}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Location", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 68, baseType: !905, size: 192, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !206, file: !800, line: 677, baseType: !906)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 192, align: 64, elements: !880)
!907 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 69, baseType: !905, size: 192, align: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Up", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 70, baseType: !905, size: 192, align: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Right", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 71, baseType: !905, size: 192, align: 64, offset: 576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Sky", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 72, baseType: !905, size: 192, align: 64, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "Look_At", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 73, baseType: !905, size: 192, align: 64, offset: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "Focal_Point", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 74, baseType: !905, size: 192, align: 64, offset: 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Focal_Distance", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 75, baseType: !907, size: 64, align: 64, offset: 1344)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Aperture", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 75, baseType: !907, size: 64, align: 64, offset: 1408)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Blur_Samples", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 76, baseType: !822, size: 32, align: 32, offset: 1472)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 77, baseType: !907, size: 64, align: 64, offset: 1536)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 78, baseType: !907, size: 64, align: 64, offset: 1600)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 79, baseType: !822, size: 32, align: 32, offset: 1664)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Angle", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 80, baseType: !907, size: 64, align: 64, offset: 1728)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "H_Angle", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 81, baseType: !907, size: 64, align: 64, offset: 1792)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "V_Angle", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 82, baseType: !907, size: 64, align: 64, offset: 1856)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 83, baseType: !924, size: 64, align: 64, offset: 1920)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !206, file: !800, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Camera_StructE", file: !902, line: 84, baseType: !927, size: 64, align: 64, offset: 1984)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !206, file: !800, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !206, file: !800, line: 1334, size: 1344, align: 64, elements: !930, identifier: "_ZTSN3pov14Tnormal_StructE")
!930 = !{!931, !933, !934, !935, !936, !938, !939, !940, !943, !946, !949, !950, !951}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !932, size: 16, align: 16)
!932 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !932, size: 16, align: 16, offset: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !932, size: 16, align: 16, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !822, size: 32, align: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !937, size: 32, align: 32, offset: 96)
!937 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !937, size: 32, align: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !937, size: 32, align: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !941, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !206, file: !800, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!943 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !944, size: 64, align: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !206, file: !800, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !947, size: 64, align: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !206, file: !800, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!949 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1337, baseType: !937, size: 32, align: 32, offset: 1280)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !800, line: 1338, baseType: !937, size: 32, align: 32, offset: 1312)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !206, file: !800, line: 1373, size: 192, align: 64, elements: !953, identifier: "_ZTSN3pov12Warps_StructE")
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !800, line: 1375, baseType: !932, size: 16, align: 16)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !800, line: 1375, baseType: !941, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !800, line: 1375, baseType: !941, size: 64, align: 64, offset: 128)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !206, file: !800, line: 1323, size: 1280, align: 64, elements: !958, identifier: "_ZTSN3pov14Pattern_StructE")
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !932, size: 16, align: 16)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !932, size: 16, align: 16, offset: 16)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !932, size: 16, align: 16, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !822, size: 32, align: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !937, size: 32, align: 32, offset: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !937, size: 32, align: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !937, size: 32, align: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !941, size: 64, align: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !944, size: 64, align: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !947, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !800, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !206, file: !800, line: 1045, size: 128, align: 64, elements: !971, identifier: "_ZTSN3pov16Blend_Map_StructE")
!971 = !{!972, !973, !974, !975, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !800, line: 1047, baseType: !822, size: 32, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !800, line: 1048, baseType: !843, size: 16, align: 16, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !800, line: 1049, baseType: !858, size: 8, align: 8, offset: 48)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !800, line: 1049, baseType: !858, size: 8, align: 8, offset: 56)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !800, line: 1050, baseType: !977, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !206, file: !800, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !206, file: !800, line: 1031, size: 256, align: 64, elements: !980, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!980 = !{!981, !982, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !800, line: 1033, baseType: !937, size: 32, align: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !800, line: 1034, baseType: !839, size: 8, align: 8, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !800, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!984 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !800, line: 1035, size: 192, align: 64, elements: !985, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!985 = !{!986, !991, !994, !995, !998}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !800, line: 1037, baseType: !987, size: 160, align: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !206, file: !800, line: 681, baseType: !988)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 160, align: 32, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 5)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !800, line: 1038, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !206, file: !800, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!994 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !800, line: 1039, baseType: !924, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !800, line: 1040, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !206, file: !800, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!998 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !800, line: 1041, baseType: !999, size: 128, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !206, file: !800, line: 676, baseType: !1000)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 128, align: 64, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 2)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !206, file: !800, line: 1328, size: 1472, align: 64, elements: !1004, identifier: "_ZTSN3pov14Pigment_StructE")
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !932, size: 16, align: 16)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !932, size: 16, align: 16, offset: 16)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !932, size: 16, align: 16, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !822, size: 32, align: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !937, size: 32, align: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !937, size: 32, align: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !937, size: 32, align: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !941, size: 64, align: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !944, size: 64, align: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !947, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1331, baseType: !987, size: 160, align: 32, offset: 1280)
!1017 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !800, line: 1330, size: 896, align: 64, elements: !1018, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!1018 = !{!1019, !1022, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !206, file: !800, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !206, file: !800, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !937, size: 32, align: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !992, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !206, file: !800, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !206, file: !800, line: 1269, size: 128, align: 64, elements: !1042, identifier: "_ZTSN3pov19Density_file_StructE")
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !800, line: 1271, baseType: !822, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !800, line: 1272, baseType: !1045, size: 64, align: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !206, file: !800, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !206, file: !800, line: 1275, size: 320, align: 64, elements: !1048, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1277, baseType: !822, size: 32, align: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1278, baseType: !857, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1279, baseType: !822, size: 32, align: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1279, baseType: !822, size: 32, align: 32, offset: 160)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1279, baseType: !822, size: 32, align: 32, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1280, baseType: !822, size: 32, align: 32, offset: 224)
!1055 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!1056 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !800, line: 1281, size: 64, align: 64, elements: !1057, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!1057 = !{!1058, !1059, !1061}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !800, line: 1283, baseType: !838, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !800, line: 1284, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !800, line: 1285, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !206, file: !800, line: 1220, size: 960, align: 64, elements: !1064, identifier: "_ZTSN3pov12Image_StructE")
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1084, !1085}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1222, baseType: !822, size: 32, align: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1223, baseType: !822, size: 32, align: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1224, baseType: !822, size: 32, align: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1225, baseType: !822, size: 32, align: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1226, baseType: !822, size: 32, align: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1227, baseType: !822, size: 32, align: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1227, baseType: !822, size: 32, align: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1228, baseType: !843, size: 16, align: 16, offset: 224)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1229, baseType: !858, size: 8, align: 8, offset: 240)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1230, baseType: !858, size: 8, align: 8, offset: 248)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1231, baseType: !905, size: 192, align: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1232, baseType: !937, size: 32, align: 32, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1232, baseType: !937, size: 32, align: 32, offset: 480)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1233, baseType: !999, size: 128, align: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1234, baseType: !907, size: 64, align: 64, offset: 640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1234, baseType: !907, size: 64, align: 64, offset: 704)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1235, baseType: !1082, size: 64, align: 64, offset: 768)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !206, file: !800, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1236, baseType: !848, size: 64, align: 64, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !206, file: !800, line: 1161, size: 80, align: 16, elements: !1087, identifier: "_ZTSN3pov19Image_Colour_StructE")
!1087 = !{!1088, !1089, !1090, !1091, !1092}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !800, line: 1163, baseType: !932, size: 16, align: 16)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !800, line: 1163, baseType: !932, size: 16, align: 16, offset: 16)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !800, line: 1163, baseType: !932, size: 16, align: 16, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !800, line: 1163, baseType: !932, size: 16, align: 16, offset: 48)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !800, line: 1163, baseType: !932, size: 16, align: 16, offset: 64)
!1093 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !800, line: 1237, size: 64, align: 64, elements: !1094, identifier: "_ZTSN3pov12Image_StructUt_E")
!1094 = !{!1095, !1098, !1101, !1103}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !800, line: 1239, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !206, file: !800, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !800, line: 1240, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !206, file: !800, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !800, line: 1241, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !800, line: 1242, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !206, file: !800, line: 1166, size: 256, align: 64, elements: !1106, identifier: "_ZTSN3pov18Image8_Line_StructE")
!1106 = !{!1107, !1108, !1109, !1110}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !800, line: 1168, baseType: !838, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !800, line: 1168, baseType: !838, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !800, line: 1168, baseType: !838, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !800, line: 1168, baseType: !838, size: 64, align: 64, offset: 192)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !206, file: !800, line: 1171, size: 256, align: 64, elements: !1112, identifier: "_ZTSN3pov19Image16_Line_StructE")
!1112 = !{!1113, !1114, !1115, !1116}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !800, line: 1173, baseType: !1060, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !800, line: 1173, baseType: !1060, size: 64, align: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !800, line: 1173, baseType: !1060, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !800, line: 1173, baseType: !1060, size: 64, align: 64, offset: 192)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 256, align: 64, elements: !1118, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !800, line: 1330, baseType: !937, size: 32, align: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64, offset: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 64, align: 32, elements: !1122, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !800, line: 1330, baseType: !937, size: 32, align: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !800, line: 1330, baseType: !937, size: 32, align: 32, offset: 32)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 320, align: 64, elements: !1126, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64, offset: 128)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 896, align: 64, elements: !1131, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1139, !1140}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !1138, size: 64, align: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !822, size: 32, align: 32, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64, offset: 704)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 832, align: 64, elements: !1142, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !905, size: 192, align: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16, offset: 400)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !999, size: 128, align: 64, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !800, line: 1330, baseType: !999, size: 128, align: 64, offset: 704)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 384, align: 64, elements: !1152, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158, !1159}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !999, size: 128, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16, offset: 144)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !843, size: 16, align: 16, offset: 160)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !907, size: 64, align: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !800, line: 1330, baseType: !822, size: 32, align: 32, offset: 320)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !800, line: 1330, size: 128, align: 64, elements: !1161, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !800, line: 1330, baseType: !848, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !800, line: 1330, baseType: !848, size: 64, align: 64, offset: 64)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !206, file: !800, line: 1521, size: 960, align: 64, elements: !1165, identifier: "_ZTSN3pov13Object_StructE")
!1165 = !{!1166, !1169, !1170, !1171, !1172, !1173, !1176, !1177, !1178, !1181, !1183, !1184, !1185, !1186}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !206, file: !800, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !822, size: 32, align: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1039, size: 64, align: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !996, size: 64, align: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !996, size: 64, align: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1174, size: 64, align: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !206, file: !800, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1039, size: 64, align: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1039, size: 64, align: 64, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1179, size: 64, align: 64, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !206, file: !800, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !1182, size: 192, align: 32, offset: 576)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !206, file: !800, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !927, size: 64, align: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !927, size: 64, align: 64, offset: 832)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !937, size: 32, align: 32, offset: 896)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !800, line: 1523, baseType: !897, size: 32, align: 32, offset: 928)
!1187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !206, file: !800, line: 1503, size: 704, align: 64, elements: !1188, identifier: "_ZTSN3pov13Method_StructE")
!1188 = !{!1189, !1198, !1204, !1211, !1213, !1218, !1223, !1225, !1227, !1232, !1237}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1505, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !206, file: !800, line: 1420, baseType: !1191)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!822, !1039, !1194, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !206, file: !800, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !206, file: !800, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1506, baseType: !1199, size: 64, align: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !206, file: !800, line: 1421, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!822, !1203, !1039}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1507, baseType: !1205, size: 64, align: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !206, file: !800, line: 1422, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !1203, !1039, !1209}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !206, file: !800, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1508, baseType: !1212, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !206, file: !800, line: 1423, baseType: !1206)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1509, baseType: !1214, size: 64, align: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !206, file: !800, line: 1424, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!848, !1039}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1510, baseType: !1219, size: 64, align: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !206, file: !800, line: 1425, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !1039, !1203, !927}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1511, baseType: !1224, size: 64, align: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !206, file: !800, line: 1426, baseType: !1220)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1512, baseType: !1226, size: 64, align: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !206, file: !800, line: 1427, baseType: !1220)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1513, baseType: !1228, size: 64, align: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !206, file: !800, line: 1428, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{null, !1039, !927}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1514, baseType: !1233, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !206, file: !800, line: 1429, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !1039}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !800, line: 1515, baseType: !1238, size: 64, align: 64, offset: 640)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !206, file: !800, line: 1430, baseType: !1234)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !206, file: !800, line: 1783, size: 6848, align: 64, elements: !1240, identifier: "_ZTSN3pov10Ray_StructE")
!1240 = !{!1241, !1242, !1243, !1244, !1245}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !800, line: 1785, baseType: !905, size: 192, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !800, line: 1786, baseType: !905, size: 192, align: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !800, line: 1787, baseType: !822, size: 32, align: 32, offset: 384)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !800, line: 1788, baseType: !897, size: 32, align: 32, offset: 416)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !800, line: 1789, baseType: !1246, size: 6400, align: 64, offset: 448)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 6400, align: 64, elements: !1247)
!1247 = !{!1248}
!1248 = !DISubrange(count: 100)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !206, file: !800, line: 1112, size: 512, align: 64, elements: !1250, identifier: "_ZTSN3pov15Interior_StructE")
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1114, baseType: !822, size: 32, align: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1115, baseType: !822, size: 32, align: 32, offset: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1115, baseType: !822, size: 32, align: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1116, baseType: !937, size: 32, align: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1116, baseType: !937, size: 32, align: 32, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1117, baseType: !937, size: 32, align: 32, offset: 160)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1117, baseType: !937, size: 32, align: 32, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1118, baseType: !937, size: 32, align: 32, offset: 224)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1118, baseType: !937, size: 32, align: 32, offset: 256)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1119, baseType: !987, size: 160, align: 32, offset: 288)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !800, line: 1120, baseType: !1262, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !206, file: !800, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !206, file: !800, line: 1069, size: 1728, align: 64, elements: !1265, identifier: "_ZTSN3pov12Media_StructE")
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1071, baseType: !822, size: 32, align: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1072, baseType: !822, size: 32, align: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1073, baseType: !822, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1074, baseType: !822, size: 32, align: 32, offset: 96)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1075, baseType: !822, size: 32, align: 32, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1076, baseType: !907, size: 64, align: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1077, baseType: !822, size: 32, align: 32, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1078, baseType: !907, size: 64, align: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1078, baseType: !907, size: 64, align: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1079, baseType: !822, size: 32, align: 32, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1080, baseType: !822, size: 32, align: 32, offset: 480)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1081, baseType: !822, size: 32, align: 32, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1082, baseType: !822, size: 32, align: 32, offset: 544)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1083, baseType: !987, size: 160, align: 32, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1084, baseType: !987, size: 160, align: 32, offset: 736)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1085, baseType: !987, size: 160, align: 32, offset: 896)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1086, baseType: !987, size: 160, align: 32, offset: 1056)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1088, baseType: !907, size: 64, align: 64, offset: 1216)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1089, baseType: !907, size: 64, align: 64, offset: 1280)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1090, baseType: !907, size: 64, align: 64, offset: 1344)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1091, baseType: !1203, size: 64, align: 64, offset: 1408)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1093, baseType: !907, size: 64, align: 64, offset: 1472)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1094, baseType: !822, size: 32, align: 32, offset: 1536)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1095, baseType: !822, size: 32, align: 32, offset: 1568)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1097, baseType: !992, size: 64, align: 64, offset: 1600)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !800, line: 1099, baseType: !1262, size: 64, align: 64, offset: 1664)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !206, file: !800, line: 1621, size: 192, align: 64, elements: !1293, identifier: "_ZTSN3pov13istack_structE")
!1293 = !{!1294, !1296, !1298, !1299}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !800, line: 1623, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !800, line: 1624, baseType: !1297, size: 64, align: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !800, line: 1625, baseType: !897, size: 32, align: 32, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !800, line: 1626, baseType: !897, size: 32, align: 32, offset: 160)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !206, file: !800, line: 1596, size: 1600, align: 64, elements: !1301, identifier: "_ZTSN3pov10istk_entryE")
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1598, baseType: !907, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1599, baseType: !905, size: 192, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1600, baseType: !905, size: 192, align: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1601, baseType: !905, size: 192, align: 64, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1602, baseType: !999, size: 128, align: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1603, baseType: !1039, size: 64, align: 64, offset: 768)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1610, baseType: !822, size: 32, align: 32, offset: 832)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1610, baseType: !822, size: 32, align: 32, offset: 864)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1611, baseType: !907, size: 64, align: 64, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1611, baseType: !907, size: 64, align: 64, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1612, baseType: !907, size: 64, align: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1612, baseType: !907, size: 64, align: 64, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1613, baseType: !907, size: 64, align: 64, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1613, baseType: !907, size: 64, align: 64, offset: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1614, baseType: !907, size: 64, align: 64, offset: 1280)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1614, baseType: !907, size: 64, align: 64, offset: 1344)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1614, baseType: !907, size: 64, align: 64, offset: 1408)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1616, baseType: !848, size: 64, align: 64, offset: 1472)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !800, line: 1618, baseType: !848, size: 64, align: 64, offset: 1536)
!1321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !206, file: !800, line: 1002, size: 2048, align: 64, elements: !1322, identifier: "_ZTSN3pov16Transform_StructE")
!1322 = !{!1323, !1328}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !800, line: 1004, baseType: !1324, size: 1024, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !206, file: !800, line: 679, baseType: !1325)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 1024, align: 64, elements: !1326)
!1326 = !{!1327, !1327}
!1327 = !DISubrange(count: 4)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !800, line: 1005, baseType: !1324, size: 1024, align: 64, offset: 1024)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !206, file: !800, line: 1345, size: 1664, align: 64, elements: !1330, identifier: "_ZTSN3pov14Texture_StructE")
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1348, !1349}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !932, size: 16, align: 16)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !932, size: 16, align: 16, offset: 16)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !932, size: 16, align: 16, offset: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !822, size: 32, align: 32, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !937, size: 32, align: 32, offset: 96)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !937, size: 32, align: 32, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !937, size: 32, align: 32, offset: 160)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !941, size: 64, align: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !944, size: 64, align: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !947, size: 64, align: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, baseType: !996, size: 64, align: 64, offset: 1280)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1348, baseType: !992, size: 64, align: 64, offset: 1344)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1349, baseType: !924, size: 64, align: 64, offset: 1408)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1350, baseType: !1346, size: 64, align: 64, offset: 1472)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !206, file: !800, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1351, baseType: !996, size: 64, align: 64, offset: 1536)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1352, baseType: !822, size: 32, align: 32, offset: 1600)
!1350 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !800, line: 1347, size: 896, align: 64, elements: !1351, identifier: "_ZTSN3pov14Texture_StructUt_E")
!1351 = !{!1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !1020, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !1023, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !937, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !992, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, baseType: !1039, size: 64, align: 64)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 256, align: 64, elements: !1369, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!1369 = !{!1370, !1371}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !800, line: 1347, baseType: !937, size: 32, align: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64, offset: 64)
!1372 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 64, align: 32, elements: !1373, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!1373 = !{!1374, !1375}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !800, line: 1347, baseType: !937, size: 32, align: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !800, line: 1347, baseType: !937, size: 32, align: 32, offset: 32)
!1376 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 320, align: 64, elements: !1377, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!1377 = !{!1378, !1379, !1380}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64, offset: 128)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 896, align: 64, elements: !1382, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!1382 = !{!1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 384)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 448)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16, offset: 512)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !1138, size: 64, align: 64, offset: 576)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !822, size: 32, align: 32, offset: 640)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64, offset: 704)
!1391 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 832, align: 64, elements: !1392, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!1392 = !{!1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !905, size: 192, align: 64, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16, offset: 400)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 448)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 512)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !999, size: 128, align: 64, offset: 576)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !800, line: 1347, baseType: !999, size: 128, align: 64, offset: 704)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 384, align: 64, elements: !1402, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!1402 = !{!1403, !1404, !1405, !1406, !1407, !1408, !1409}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !999, size: 128, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16, offset: 144)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !843, size: 16, align: 16, offset: 160)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !907, size: 64, align: 64, offset: 256)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !800, line: 1347, baseType: !822, size: 32, align: 32, offset: 320)
!1410 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !800, line: 1347, size: 128, align: 64, elements: !1411, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!1411 = !{!1412, !1413}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !800, line: 1347, baseType: !848, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !800, line: 1347, baseType: !848, size: 64, align: 64, offset: 64)
!1414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !206, file: !800, line: 1356, size: 928, align: 32, elements: !1415, identifier: "_ZTSN3pov13Finish_StructE")
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1435, !1436, !1437, !1438, !1439, !1440}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1358, baseType: !937, size: 32, align: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1358, baseType: !937, size: 32, align: 32, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1359, baseType: !937, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1359, baseType: !937, size: 32, align: 32, offset: 96)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1360, baseType: !937, size: 32, align: 32, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1360, baseType: !937, size: 32, align: 32, offset: 160)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1361, baseType: !937, size: 32, align: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1361, baseType: !937, size: 32, align: 32, offset: 224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1361, baseType: !937, size: 32, align: 32, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1362, baseType: !937, size: 32, align: 32, offset: 288)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1362, baseType: !937, size: 32, align: 32, offset: 320)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1362, baseType: !937, size: 32, align: 32, offset: 352)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1362, baseType: !937, size: 32, align: 32, offset: 384)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1362, baseType: !937, size: 32, align: 32, offset: 416)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1363, baseType: !937, size: 32, align: 32, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1363, baseType: !937, size: 32, align: 32, offset: 480)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1364, baseType: !1433, size: 96, align: 32, offset: 512)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !206, file: !800, line: 682, baseType: !1434)
!1434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 96, align: 32, elements: !880)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1364, baseType: !1433, size: 96, align: 32, offset: 608)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1364, baseType: !1433, size: 96, align: 32, offset: 704)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1365, baseType: !937, size: 32, align: 32, offset: 800)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1366, baseType: !822, size: 32, align: 32, offset: 832)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1367, baseType: !937, size: 32, align: 32, offset: 864)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !800, line: 1368, baseType: !822, size: 32, align: 32, offset: 896)
!1441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !206, file: !800, line: 1566, size: 3456, align: 64, elements: !1442, identifier: "_ZTSN3pov19Light_Source_StructE")
!1442 = !{!1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1487, !1488, !1489, !1490}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1167, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !822, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1039, size: 64, align: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !996, size: 64, align: 64, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !996, size: 64, align: 64, offset: 256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1174, size: 64, align: 64, offset: 320)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1039, size: 64, align: 64, offset: 384)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1039, size: 64, align: 64, offset: 448)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1179, size: 64, align: 64, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !1182, size: 192, align: 32, offset: 576)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !800, line: 1568, baseType: !927, size: 64, align: 64, offset: 768)
