; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/parstxtr.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Texture_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, %"struct.pov::Texture_Struct"*, %"struct.pov::Pigment_Struct"*, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Finish_Struct"*, %"struct.pov::Texture_Struct"*, i32 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }
%struct.anon.21 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }

!544 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !545, line: 47, size: 32, align: 32, elements: !546, identifier: "_ZTSN3pov11PATTERN_IDSE")
!545 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!547 = !DIEnumerator(name: "NO_PATTERN", value: 0)
!548 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!549 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!550 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!551 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!552 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!553 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!554 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!555 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!556 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!557 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!558 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!559 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!560 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!561 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!562 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!563 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!564 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!565 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!566 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!567 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!568 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!569 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!570 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!571 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!572 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!573 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!574 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!575 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!576 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!577 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!578 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!579 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!580 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!581 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!582 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!583 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!584 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!585 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!586 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!587 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!588 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!589 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!590 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!591 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!592 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!593 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!594 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!595 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!596 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!597 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!598 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !599, line: 701, size: 32, align: 32, elements: !600)
!599 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!600 = !{!601, !602, !603, !604, !605}
!601 = !DIEnumerator(name: "pRED", value: 0)
!602 = !DIEnumerator(name: "pGREEN", value: 1)
!603 = !DIEnumerator(name: "pBLUE", value: 2)
!604 = !DIEnumerator(name: "pFILTER", value: 3)
!605 = !DIEnumerator(name: "pTRANSM", value: 4)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !599, line: 692, size: 32, align: 32, elements: !607)
!607 = !{!608, !609, !610, !611}
!608 = !DIEnumerator(name: "X", value: 0)
!609 = !DIEnumerator(name: "Y", value: 1)
!610 = !DIEnumerator(name: "Z", value: 2)
!611 = !DIEnumerator(name: "T", value: 3)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !599, line: 686, size: 32, align: 32, elements: !613)
!613 = !{!614, !615}
!614 = !DIEnumerator(name: "U", value: 0)
!615 = !DIEnumerator(name: "V", value: 1)
!616 = !{!617, !623, !628, !633, !688, !692, !693, !700, !735, !740, !753, !762, !767, !783, !797, !823, !829, !838, !845, !868, !875, !887, !893, !899, !903, !907, !912, !923, !933, !942, !946, !971, !1023, !1033, !1048, !1076, !1084, !1105, !1113, !1168, !1175, !1186, !1193, !1199, !1214, !1232, !1236, !1240, !1245, !1255, !1265, !1274, !1278, !1296, !1300, !1304, !1309, !1319, !1329, !1338, !1342, !1360, !1364, !1368, !1373, !1383, !1393, !1402, !1406, !708, !621, !3, !647, !725, !715, !544, !728, !731, !722, !1046, !956, !1433, !1434, !1450, !1448, !1444, !1459, !1473, !1475, !1481, !1479, !1483, !1488, !1490, !642, !920, !1491, !1523, !1577, !1646, !1700, !884, !780, !842, !881, !703, !1704, !1714, !1731, !1738, !1745, !1753, !1760, !1762, !1764, !1766, !1768, !1770}
!617 = !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 82, size: 64, align: 32, elements: !619, identifier: "_ZTS5div_t")
!618 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!619 = !{!620, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !618, line: 83, baseType: !621, size: 32, align: 32)
!621 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !618, line: 84, baseType: !621, size: 32, align: 32, offset: 32)
!623 = !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 87, size: 128, align: 64, elements: !624, identifier: "_ZTS6ldiv_t")
!624 = !{!625, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !618, line: 88, baseType: !626, size: 64, align: 64)
!626 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !618, line: 89, baseType: !626, size: 64, align: 64, offset: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 93, size: 128, align: 64, elements: !629, identifier: "_ZTS7lldiv_t")
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !618, line: 94, baseType: !631, size: 64, align: 64)
!631 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !618, line: 95, baseType: !631, size: 64, align: 64, offset: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !634, line: 122, size: 1216, align: 64, elements: !635, identifier: "_ZTS7__sFILE")
!634 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!635 = !{!636, !639, !640, !641, !643, !644, !645, !646, !648, !652, !658, !667, !673, !674, !676, !677, !681, !685, !686, !687}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !634, line: 123, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !634, line: 124, baseType: !621, size: 32, align: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !634, line: 125, baseType: !621, size: 32, align: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !634, line: 126, baseType: !642, size: 16, align: 16, offset: 128)
!642 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !634, line: 127, baseType: !642, size: 16, align: 16, offset: 144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !634, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !634, line: 129, baseType: !621, size: 32, align: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !634, line: 132, baseType: !647, size: 64, align: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !634, line: 133, baseType: !649, size: 64, align: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!621, !647}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !634, line: 134, baseType: !653, size: 64, align: 64, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!621, !647, !656, !621}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !634, line: 135, baseType: !659, size: 64, align: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !647, !662, !621}
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !634, line: 77, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !664, line: 71, baseType: !665)
!664 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !666, line: 46, baseType: !631)
!666 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !634, line: 136, baseType: !668, size: 64, align: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!621, !647, !671, !621}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !634, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !634, line: 140, baseType: !675, size: 64, align: 64, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !634, line: 141, baseType: !621, size: 32, align: 32, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !634, line: 144, baseType: !678, size: 24, align: 8, offset: 928)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 24, align: 8, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 3)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !634, line: 145, baseType: !682, size: 8, align: 8, offset: 952)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 8, align: 8, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 1)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !634, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !634, line: 151, baseType: !621, size: 32, align: 32, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !634, line: 152, baseType: !662, size: 64, align: 64, offset: 1152)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !634, line: 88, size: 128, align: 64, elements: !689, identifier: "_ZTS6__sbuf")
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !634, line: 89, baseType: !637, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !634, line: 90, baseType: !621, size: 32, align: 32, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !634, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !694, identifier: "_ZTS13__va_list_tag")
!694 = !{!695, !697, !698, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !696, size: 32, align: 32)
!696 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !696, size: 32, align: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !647, size: 64, align: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !647, size: 64, align: 64, offset: 128)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !599, line: 1345, size: 1664, align: 64, elements: !701, identifier: "_ZTSN3pov14Texture_StructE")
!701 = !{!702, !704, !705, !706, !707, !709, !710, !711, !714, !717, !720, !721, !724, !727, !730, !733, !734}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !703, size: 16, align: 16)
!703 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !703, size: 16, align: 16, offset: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !703, size: 16, align: 16, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !621, size: 32, align: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !708, size: 32, align: 32, offset: 96)
!708 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !708, size: 32, align: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !708, size: 32, align: 32, offset: 160)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !712, size: 64, align: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !599, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !715, size: 64, align: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !599, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !718, size: 64, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !599, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1347, baseType: !722, size: 64, align: 64, offset: 1280)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !599, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1348, baseType: !725, size: 64, align: 64, offset: 1344)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !599, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1349, baseType: !728, size: 64, align: 64, offset: 1408)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !599, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1350, baseType: !731, size: 64, align: 64, offset: 1472)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !599, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1351, baseType: !722, size: 64, align: 64, offset: 1536)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !599, line: 1352, baseType: !621, size: 32, align: 32, offset: 1600)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !599, line: 1373, size: 192, align: 64, elements: !736, identifier: "_ZTSN3pov12Warps_StructE")
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !599, line: 1375, baseType: !703, size: 16, align: 16)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !599, line: 1375, baseType: !712, size: 64, align: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !599, line: 1375, baseType: !712, size: 64, align: 64, offset: 128)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !599, line: 1323, size: 1280, align: 64, elements: !741, identifier: "_ZTSN3pov14Pattern_StructE")
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !703, size: 16, align: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !703, size: 16, align: 16, offset: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !703, size: 16, align: 16, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !621, size: 32, align: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !708, size: 32, align: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !708, size: 32, align: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !708, size: 32, align: 32, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !712, size: 64, align: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !715, size: 64, align: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !718, size: 64, align: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !599, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !599, line: 1045, size: 128, align: 64, elements: !754, identifier: "_ZTSN3pov16Blend_Map_StructE")
!754 = !{!755, !756, !757, !758, !759}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !599, line: 1047, baseType: !621, size: 32, align: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !599, line: 1048, baseType: !642, size: 16, align: 16, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !599, line: 1049, baseType: !657, size: 8, align: 8, offset: 48)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !599, line: 1049, baseType: !657, size: 8, align: 8, offset: 56)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !599, line: 1050, baseType: !760, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !599, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !599, line: 1031, size: 256, align: 64, elements: !763, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !599, line: 1033, baseType: !708, size: 32, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !599, line: 1034, baseType: !638, size: 8, align: 8, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !599, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!767 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !599, line: 1035, size: 192, align: 64, elements: !768, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!768 = !{!769, !774, !775, !776, !777}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !599, line: 1037, baseType: !770, size: 160, align: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !599, line: 681, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 160, align: 32, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 5)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !599, line: 1038, baseType: !725, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !599, line: 1039, baseType: !728, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !599, line: 1040, baseType: !722, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !599, line: 1041, baseType: !778, size: 128, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !599, line: 676, baseType: !779)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 128, align: 64, elements: !781)
!780 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!781 = !{!782}
!782 = !DISubrange(count: 2)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !599, line: 1328, size: 1472, align: 64, elements: !784, identifier: "_ZTSN3pov14Pigment_StructE")
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !703, size: 16, align: 16)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !703, size: 16, align: 16, offset: 16)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !703, size: 16, align: 16, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !621, size: 32, align: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !708, size: 32, align: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !708, size: 32, align: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !708, size: 32, align: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !712, size: 64, align: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !715, size: 64, align: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !718, size: 64, align: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1331, baseType: !770, size: 160, align: 32, offset: 1280)
!797 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !599, line: 1330, size: 896, align: 64, elements: !798, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!798 = !{!799, !802, !805, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !599, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !599, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !599, line: 677, baseType: !807)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 192, align: 64, elements: !679)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !708, size: 32, align: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !725, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !599, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !599, line: 1269, size: 128, align: 64, elements: !824, identifier: "_ZTSN3pov19Density_file_StructE")
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !599, line: 1271, baseType: !621, size: 32, align: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !599, line: 1272, baseType: !827, size: 64, align: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !599, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !599, line: 1275, size: 320, align: 64, elements: !830, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!830 = !{!831, !832, !833, !834, !835, !836, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1277, baseType: !621, size: 32, align: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1278, baseType: !656, size: 64, align: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1279, baseType: !621, size: 32, align: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1279, baseType: !621, size: 32, align: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1279, baseType: !621, size: 32, align: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1280, baseType: !621, size: 32, align: 32, offset: 224)
!837 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!838 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !599, line: 1281, size: 64, align: 64, elements: !839, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!839 = !{!840, !841, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !599, line: 1283, baseType: !637, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !599, line: 1284, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !599, line: 1285, baseType: !844, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !599, line: 1220, size: 960, align: 64, elements: !846, identifier: "_ZTSN3pov12Image_StructE")
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !866, !867}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1222, baseType: !621, size: 32, align: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1223, baseType: !621, size: 32, align: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1224, baseType: !621, size: 32, align: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1225, baseType: !621, size: 32, align: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1226, baseType: !621, size: 32, align: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1227, baseType: !621, size: 32, align: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1227, baseType: !621, size: 32, align: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1228, baseType: !642, size: 16, align: 16, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1229, baseType: !657, size: 8, align: 8, offset: 240)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1230, baseType: !657, size: 8, align: 8, offset: 248)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1231, baseType: !806, size: 192, align: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1232, baseType: !708, size: 32, align: 32, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1232, baseType: !708, size: 32, align: 32, offset: 480)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1233, baseType: !778, size: 128, align: 64, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1234, baseType: !780, size: 64, align: 64, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1234, baseType: !780, size: 64, align: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1235, baseType: !864, size: 64, align: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !599, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1236, baseType: !647, size: 64, align: 64, offset: 832)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !599, line: 1161, size: 80, align: 16, elements: !869, identifier: "_ZTSN3pov19Image_Colour_StructE")
!869 = !{!870, !871, !872, !873, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !599, line: 1163, baseType: !703, size: 16, align: 16)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !599, line: 1163, baseType: !703, size: 16, align: 16, offset: 16)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !599, line: 1163, baseType: !703, size: 16, align: 16, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !599, line: 1163, baseType: !703, size: 16, align: 16, offset: 48)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !599, line: 1163, baseType: !703, size: 16, align: 16, offset: 64)
!875 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !599, line: 1237, size: 64, align: 64, elements: !876, identifier: "_ZTSN3pov12Image_StructUt_E")
!876 = !{!877, !880, !883, !885}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !599, line: 1239, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !599, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !599, line: 1240, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !599, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !599, line: 1241, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !599, line: 1242, baseType: !886, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !599, line: 1166, size: 256, align: 64, elements: !888, identifier: "_ZTSN3pov18Image8_Line_StructE")
!888 = !{!889, !890, !891, !892}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !599, line: 1168, baseType: !637, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !599, line: 1168, baseType: !637, size: 64, align: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !599, line: 1168, baseType: !637, size: 64, align: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !599, line: 1168, baseType: !637, size: 64, align: 64, offset: 192)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !599, line: 1171, size: 256, align: 64, elements: !894, identifier: "_ZTSN3pov19Image16_Line_StructE")
!894 = !{!895, !896, !897, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !599, line: 1173, baseType: !842, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !599, line: 1173, baseType: !842, size: 64, align: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !599, line: 1173, baseType: !842, size: 64, align: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !599, line: 1173, baseType: !842, size: 64, align: 64, offset: 192)
!899 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 256, align: 64, elements: !900, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !599, line: 1330, baseType: !708, size: 32, align: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64, offset: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 64, align: 32, elements: !904, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !599, line: 1330, baseType: !708, size: 32, align: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !599, line: 1330, baseType: !708, size: 32, align: 32, offset: 32)
!907 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 320, align: 64, elements: !908, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64, offset: 128)
!912 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 896, align: 64, elements: !913, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!913 = !{!914, !915, !916, !917, !918, !919, !921, !922}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !920, size: 64, align: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !621, size: 32, align: 32, offset: 640)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64, offset: 704)
!923 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 832, align: 64, elements: !924, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!924 = !{!925, !926, !927, !928, !929, !930, !931, !932}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !806, size: 192, align: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16, offset: 400)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !778, size: 128, align: 64, offset: 576)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !599, line: 1330, baseType: !778, size: 128, align: 64, offset: 704)
!933 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 384, align: 64, elements: !934, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!934 = !{!935, !936, !937, !938, !939, !940, !941}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !778, size: 128, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16, offset: 144)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !642, size: 16, align: 16, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !780, size: 64, align: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !599, line: 1330, baseType: !621, size: 32, align: 32, offset: 320)
!942 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !599, line: 1330, size: 128, align: 64, elements: !943, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !599, line: 1330, baseType: !647, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !599, line: 1330, baseType: !647, size: 64, align: 64, offset: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !599, line: 1521, size: 960, align: 64, elements: !947, identifier: "_ZTSN3pov13Object_StructE")
!947 = !{!948, !951, !952, !953, !954, !955, !958, !959, !960, !963, !965, !968, !969, !970}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !599, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !621, size: 32, align: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !821, size: 64, align: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !722, size: 64, align: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !722, size: 64, align: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !956, size: 64, align: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !599, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !821, size: 64, align: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !821, size: 64, align: 64, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !961, size: 64, align: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !599, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!963 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !964, size: 192, align: 32, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !599, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !966, size: 64, align: 64, offset: 768)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !599, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!968 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !966, size: 64, align: 64, offset: 832)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !708, size: 32, align: 32, offset: 896)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !599, line: 1523, baseType: !696, size: 32, align: 32, offset: 928)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !599, line: 1503, size: 704, align: 64, elements: !972, identifier: "_ZTSN3pov13Method_StructE")
!972 = !{!973, !982, !988, !995, !997, !1002, !1007, !1009, !1011, !1016, !1021}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1505, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !599, line: 1420, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!621, !821, !978, !980}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !599, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !599, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1506, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !599, line: 1421, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!621, !987, !821}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1507, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !599, line: 1422, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !987, !821, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !599, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!995 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1508, baseType: !996, size: 64, align: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !599, line: 1423, baseType: !990)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1509, baseType: !998, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !599, line: 1424, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!647, !821}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1510, baseType: !1003, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !599, line: 1425, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !821, !987, !966}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1511, baseType: !1008, size: 64, align: 64, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !599, line: 1426, baseType: !1004)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1512, baseType: !1010, size: 64, align: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !599, line: 1427, baseType: !1004)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1513, baseType: !1012, size: 64, align: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !599, line: 1428, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !821, !966}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1514, baseType: !1017, size: 64, align: 64, offset: 576)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !599, line: 1429, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !821}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !599, line: 1515, baseType: !1022, size: 64, align: 64, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !599, line: 1430, baseType: !1018)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !599, line: 1783, size: 6848, align: 64, elements: !1024, identifier: "_ZTSN3pov10Ray_StructE")
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !599, line: 1785, baseType: !806, size: 192, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !599, line: 1786, baseType: !806, size: 192, align: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !599, line: 1787, baseType: !621, size: 32, align: 32, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !599, line: 1788, baseType: !696, size: 32, align: 32, offset: 416)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !599, line: 1789, baseType: !1030, size: 6400, align: 64, offset: 448)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 6400, align: 64, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 100)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !599, line: 1112, size: 512, align: 64, elements: !1034, identifier: "_ZTSN3pov15Interior_StructE")
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1114, baseType: !621, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1115, baseType: !621, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1115, baseType: !621, size: 32, align: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1116, baseType: !708, size: 32, align: 32, offset: 96)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1116, baseType: !708, size: 32, align: 32, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1117, baseType: !708, size: 32, align: 32, offset: 160)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1117, baseType: !708, size: 32, align: 32, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1118, baseType: !708, size: 32, align: 32, offset: 224)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1118, baseType: !708, size: 32, align: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1119, baseType: !770, size: 160, align: 32, offset: 288)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !599, line: 1120, baseType: !1046, size: 64, align: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !599, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !599, line: 1069, size: 1728, align: 64, elements: !1049, identifier: "_ZTSN3pov12Media_StructE")
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1071, baseType: !621, size: 32, align: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1072, baseType: !621, size: 32, align: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1073, baseType: !621, size: 32, align: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1074, baseType: !621, size: 32, align: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1075, baseType: !621, size: 32, align: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1076, baseType: !780, size: 64, align: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1077, baseType: !621, size: 32, align: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1078, baseType: !780, size: 64, align: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1078, baseType: !780, size: 64, align: 64, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1079, baseType: !621, size: 32, align: 32, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1080, baseType: !621, size: 32, align: 32, offset: 480)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1081, baseType: !621, size: 32, align: 32, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1082, baseType: !621, size: 32, align: 32, offset: 544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1083, baseType: !770, size: 160, align: 32, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1084, baseType: !770, size: 160, align: 32, offset: 736)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1085, baseType: !770, size: 160, align: 32, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1086, baseType: !770, size: 160, align: 32, offset: 1056)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1088, baseType: !780, size: 64, align: 64, offset: 1216)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1089, baseType: !780, size: 64, align: 64, offset: 1280)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1090, baseType: !780, size: 64, align: 64, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1091, baseType: !987, size: 64, align: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1093, baseType: !780, size: 64, align: 64, offset: 1472)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1094, baseType: !621, size: 32, align: 32, offset: 1536)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1095, baseType: !621, size: 32, align: 32, offset: 1568)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1097, baseType: !725, size: 64, align: 64, offset: 1600)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !599, line: 1099, baseType: !1046, size: 64, align: 64, offset: 1664)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !599, line: 1621, size: 192, align: 64, elements: !1077, identifier: "_ZTSN3pov13istack_structE")
!1077 = !{!1078, !1080, !1082, !1083}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !599, line: 1623, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !599, line: 1624, baseType: !1081, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !599, line: 1625, baseType: !696, size: 32, align: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !599, line: 1626, baseType: !696, size: 32, align: 32, offset: 160)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !599, line: 1596, size: 1600, align: 64, elements: !1085, identifier: "_ZTSN3pov10istk_entryE")
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1598, baseType: !780, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1599, baseType: !806, size: 192, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1600, baseType: !806, size: 192, align: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1601, baseType: !806, size: 192, align: 64, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1602, baseType: !778, size: 128, align: 64, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1603, baseType: !821, size: 64, align: 64, offset: 768)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1610, baseType: !621, size: 32, align: 32, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1610, baseType: !621, size: 32, align: 32, offset: 864)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1611, baseType: !780, size: 64, align: 64, offset: 896)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1611, baseType: !780, size: 64, align: 64, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1612, baseType: !780, size: 64, align: 64, offset: 1024)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1612, baseType: !780, size: 64, align: 64, offset: 1088)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1613, baseType: !780, size: 64, align: 64, offset: 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1613, baseType: !780, size: 64, align: 64, offset: 1216)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1614, baseType: !780, size: 64, align: 64, offset: 1280)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1614, baseType: !780, size: 64, align: 64, offset: 1344)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1614, baseType: !780, size: 64, align: 64, offset: 1408)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1616, baseType: !647, size: 64, align: 64, offset: 1472)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !599, line: 1618, baseType: !647, size: 64, align: 64, offset: 1536)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !599, line: 1002, size: 2048, align: 64, elements: !1106, identifier: "_ZTSN3pov16Transform_StructE")
!1106 = !{!1107, !1112}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !599, line: 1004, baseType: !1108, size: 1024, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !599, line: 679, baseType: !1109)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 1024, align: 64, elements: !1110)
!1110 = !{!1111, !1111}
!1111 = !DISubrange(count: 4)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !599, line: 1005, baseType: !1108, size: 1024, align: 64, offset: 1024)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !599, line: 1566, size: 3456, align: 64, elements: !1114, identifier: "_ZTSN3pov19Light_Source_StructE")
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1159, !1160, !1161, !1162}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !949, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !621, size: 32, align: 32, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !821, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !722, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !722, size: 64, align: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !956, size: 64, align: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !821, size: 64, align: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !821, size: 64, align: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !961, size: 64, align: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !964, size: 192, align: 32, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !966, size: 64, align: 64, offset: 768)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !966, size: 64, align: 64, offset: 832)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !708, size: 32, align: 32, offset: 896)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !696, size: 32, align: 32, offset: 928)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1568, baseType: !821, size: 64, align: 64, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1569, baseType: !770, size: 160, align: 32, offset: 1024)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1570, baseType: !806, size: 192, align: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1570, baseType: !806, size: 192, align: 64, offset: 1408)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1570, baseType: !806, size: 192, align: 64, offset: 1600)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1570, baseType: !806, size: 192, align: 64, offset: 1792)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1570, baseType: !806, size: 192, align: 64, offset: 1984)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1571, baseType: !780, size: 64, align: 64, offset: 2176)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1571, baseType: !780, size: 64, align: 64, offset: 2240)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1571, baseType: !780, size: 64, align: 64, offset: 2304)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1572, baseType: !780, size: 64, align: 64, offset: 2368)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1572, baseType: !780, size: 64, align: 64, offset: 2432)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1573, baseType: !961, size: 64, align: 64, offset: 2496)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1574, baseType: !638, size: 8, align: 8, offset: 2560)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1574, baseType: !638, size: 8, align: 8, offset: 2568)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1574, baseType: !638, size: 8, align: 8, offset: 2576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1575, baseType: !1146, size: 8, align: 8, offset: 2584)
!1146 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1576, baseType: !1146, size: 8, align: 8, offset: 2592)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1577, baseType: !638, size: 8, align: 8, offset: 2600)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1577, baseType: !638, size: 8, align: 8, offset: 2608)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1578, baseType: !638, size: 8, align: 8, offset: 2616)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1579, baseType: !621, size: 32, align: 32, offset: 2624)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1579, baseType: !621, size: 32, align: 32, offset: 2656)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1580, baseType: !621, size: 32, align: 32, offset: 2688)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1581, baseType: !621, size: 32, align: 32, offset: 2720)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1582, baseType: !621, size: 32, align: 32, offset: 2752)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1583, baseType: !1157, size: 64, align: 64, offset: 2816)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1584, baseType: !821, size: 64, align: 64, offset: 2880)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1584, baseType: !821, size: 64, align: 64, offset: 2944)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1585, baseType: !718, size: 64, align: 64, offset: 3008)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !599, line: 1586, baseType: !1163, size: 384, align: 64, offset: 3072)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 384, align: 64, elements: !1166)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !599, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!1166 = !{!1167}
!1167 = !DISubrange(count: 6)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !599, line: 876, size: 192, align: 32, elements: !1169, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!1169 = !{!1170, !1174}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !599, line: 878, baseType: !1171, size: 96, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !599, line: 872, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1173, size: 96, align: 32, elements: !679)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !599, line: 870, baseType: !708)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !599, line: 878, baseType: !1171, size: 96, align: 32, offset: 96)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !5, file: !599, line: 1557, size: 384, align: 64, elements: !1176, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!1176 = !{!1177, !1178, !1181, !1183, !1184}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !599, line: 1559, baseType: !703, size: 16, align: 16)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !599, line: 1560, baseType: !1179, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !5, file: !599, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !599, line: 1561, baseType: !1182, size: 128, align: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !5, file: !599, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !599, line: 1562, baseType: !703, size: 16, align: 16, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !599, line: 1563, baseType: !1185, size: 64, align: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !5, file: !599, line: 1534, size: 320, align: 64, elements: !1187, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!1187 = !{!1188, !1189, !1190, !1191}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !599, line: 1536, baseType: !642, size: 16, align: 16)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !599, line: 1537, baseType: !642, size: 16, align: 16, offset: 16)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !599, line: 1538, baseType: !964, size: 192, align: 32, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !599, line: 1539, baseType: !1192, size: 64, align: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !599, line: 1545, size: 128, align: 32, elements: !1194, identifier: "_ZTSN3pov14Project_StructE")
!1194 = !{!1195, !1196, !1197, !1198}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !599, line: 1547, baseType: !621, size: 32, align: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !599, line: 1547, baseType: !621, size: 32, align: 32, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !599, line: 1547, baseType: !621, size: 32, align: 32, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !599, line: 1547, baseType: !621, size: 32, align: 32, offset: 96)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !599, line: 1334, size: 1344, align: 64, elements: !1200, identifier: "_ZTSN3pov14Tnormal_StructE")
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !703, size: 16, align: 16)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !703, size: 16, align: 16, offset: 16)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !703, size: 16, align: 16, offset: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !621, size: 32, align: 32, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !708, size: 32, align: 32, offset: 96)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !708, size: 32, align: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !708, size: 32, align: 32, offset: 160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !712, size: 64, align: 64, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !715, size: 64, align: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !718, size: 64, align: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1337, baseType: !708, size: 32, align: 32, offset: 1280)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1338, baseType: !708, size: 32, align: 32, offset: 1312)
!1214 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !599, line: 1336, size: 896, align: 64, elements: !1215, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !800, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !803, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !708, size: 32, align: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !642, size: 16, align: 16)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !642, size: 16, align: 16)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !642, size: 16, align: 16)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !725, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, baseType: !821, size: 64, align: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, size: 256, align: 64, elements: !1233, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !599, line: 1336, baseType: !708, size: 32, align: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64, offset: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, size: 64, align: 32, elements: !1237, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !599, line: 1336, baseType: !708, size: 32, align: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !599, line: 1336, baseType: !708, size: 32, align: 32, offset: 32)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, size: 320, align: 64, elements: !1241, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !599, line: 1336, baseType: !780, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !599, line: 1336, baseType: !780, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64, offset: 128)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, size: 896, align: 64, elements: !1246, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!1246 = !{!1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !780, size: 64, align: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !780, size: 64, align: 64, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !642, size: 16, align: 16, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !920, size: 64, align: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !621, size: 32, align: 32, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64, offset: 704)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !599, line: 1336, size: 832, align: 64, elements: !1256, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!1256 = !{!1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !806, size: 192, align: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !642, size: 16, align: 16, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !642, size: 16, align: 16, offset: 400)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !780, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !780, size: 64, align: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !599, line: 1336, baseType: !778, size: 128, align: 64, offset: 576)
