; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon.33 }
%union.anon.33 = type { i8* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }

!30 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!31 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!32 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!33 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!34 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!35 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!36 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!37 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!38 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!39 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!40 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!41 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!42 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!43 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!44 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!45 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!46 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!47 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!48 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!49 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!50 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!51 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!52 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!53 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!54 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!55 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!56 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!57 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!58 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 692, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "X", value: 0)
!63 = !DIEnumerator(name: "Y", value: 1)
!64 = !DIEnumerator(name: "Z", value: 2)
!65 = !DIEnumerator(name: "T", value: 3)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !68, file: !67, line: 51, size: 32, align: 32, elements: !69)
!67 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DINamespace(name: "pov_base", scope: null, file: !67, line: 37)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!70 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!71 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!72 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!73 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!74 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!75 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!76 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!77 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!78 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!79 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!80 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!81 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!82 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!83 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!84 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!85 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!86 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!87 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!88 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!89 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!90 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!91 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN8pov_base6IOBaseE", file: !67, line: 92, size: 32, align: 32, elements: !93, identifier: "_ZTSN8pov_base6IOBaseUt1_E")
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "seek_set", value: 0)
!95 = !DIEnumerator(name: "seek_cur", value: 1)
!96 = !DIEnumerator(name: "seek_end", value: 2)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 686, size: 32, align: 32, elements: !98)
!98 = !{!99, !100}
!99 = !DIEnumerator(name: "U", value: 0)
!100 = !DIEnumerator(name: "V", value: 1)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 701, size: 32, align: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIEnumerator(name: "pRED", value: 0)
!104 = !DIEnumerator(name: "pGREEN", value: 1)
!105 = !DIEnumerator(name: "pBLUE", value: 2)
!106 = !DIEnumerator(name: "pFILTER", value: 3)
!107 = !DIEnumerator(name: "pTRANSM", value: 4)
!108 = !{!109, !115, !120, !125, !180, !184, !185, !192, !213, !218, !227, !232, !254, !268, !294, !300, !309, !316, !339, !346, !358, !364, !370, !374, !378, !383, !394, !404, !413, !417, !442, !494, !504, !519, !547, !555, !576, !584, !605, !623, !627, !631, !636, !646, !656, !665, !669, !684, !702, !706, !710, !715, !725, !735, !744, !748, !775, !830, !837, !848, !855, !861, !879, !883, !887, !892, !902, !912, !921, !251, !3, !292, !391, !139, !925, !929, !938, !940, !947, !113, !271, !298, !949, !1019, !92, !315, !313, !129, !148, !1077, !1094, !1104, !1108, !195, !188}
!109 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 82, size: 64, align: 32, elements: !111, identifier: "_ZTS5div_t")
!110 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !110, line: 83, baseType: !113, size: 32, align: 32)
!113 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !110, line: 84, baseType: !113, size: 32, align: 32, offset: 32)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 87, size: 128, align: 64, elements: !116, identifier: "_ZTS6ldiv_t")
!116 = !{!117, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !110, line: 88, baseType: !118, size: 64, align: 64)
!118 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !110, line: 89, baseType: !118, size: 64, align: 64, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 93, size: 128, align: 64, elements: !121, identifier: "_ZTS7lldiv_t")
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !110, line: 94, baseType: !123, size: 64, align: 64)
!123 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !110, line: 95, baseType: !123, size: 64, align: 64, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !126, line: 122, size: 1216, align: 64, elements: !127, identifier: "_ZTS7__sFILE")
!126 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !{!128, !131, !132, !133, !135, !136, !137, !138, !140, !144, !150, !159, !165, !166, !168, !169, !173, !177, !178, !179}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !126, line: 123, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !126, line: 124, baseType: !113, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !126, line: 125, baseType: !113, size: 32, align: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !126, line: 126, baseType: !134, size: 16, align: 16, offset: 128)
!134 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !126, line: 127, baseType: !134, size: 16, align: 16, offset: 144)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !126, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !126, line: 129, baseType: !113, size: 32, align: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !126, line: 132, baseType: !139, size: 64, align: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !126, line: 133, baseType: !141, size: 64, align: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!113, !139}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !126, line: 134, baseType: !145, size: 64, align: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!113, !139, !148, !113}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !126, line: 135, baseType: !151, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !139, !154, !113}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !126, line: 77, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !156, line: 71, baseType: !157)
!156 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !158, line: 46, baseType: !123)
!158 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !126, line: 136, baseType: !160, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!113, !139, !163, !113}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !126, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !126, line: 140, baseType: !167, size: 64, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !126, line: 141, baseType: !113, size: 32, align: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !126, line: 144, baseType: !170, size: 24, align: 8, offset: 928)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 24, align: 8, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 3)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !126, line: 145, baseType: !174, size: 8, align: 8, offset: 952)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8, align: 8, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !126, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !126, line: 151, baseType: !113, size: 32, align: 32, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !126, line: 152, baseType: !154, size: 64, align: 64, offset: 1152)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !126, line: 88, size: 128, align: 64, elements: !181, identifier: "_ZTS6__sbuf")
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !126, line: 89, baseType: !129, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !126, line: 90, baseType: !113, size: 32, align: 32, offset: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !126, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !186, identifier: "_ZTS13__va_list_tag")
!186 = !{!187, !189, !190, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !188, size: 32, align: 32)
!188 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !188, size: 32, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !139, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !139, size: 64, align: 64, offset: 128)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !60, line: 1323, size: 1280, align: 64, elements: !193, identifier: "_ZTSN3pov14Pattern_StructE")
!193 = !{!194, !196, !197, !198, !199, !201, !202, !203, !206, !209, !212}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !195, size: 16, align: 16)
!195 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !195, size: 16, align: 16, offset: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !195, size: 16, align: 16, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !113, size: 32, align: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !200, size: 32, align: 32, offset: 96)
!200 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !200, size: 32, align: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !200, size: 32, align: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !204, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !60, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !207, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !60, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !60, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !60, line: 1373, size: 192, align: 64, elements: !214, identifier: "_ZTSN3pov12Warps_StructE")
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !195, size: 16, align: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !204, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !204, size: 64, align: 64, offset: 128)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !60, line: 1045, size: 128, align: 64, elements: !219, identifier: "_ZTSN3pov16Blend_Map_StructE")
!219 = !{!220, !221, !222, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1047, baseType: !113, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1048, baseType: !134, size: 16, align: 16, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !149, size: 8, align: 8, offset: 48)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !149, size: 8, align: 8, offset: 56)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1050, baseType: !225, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !60, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !60, line: 1031, size: 256, align: 64, elements: !228, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1033, baseType: !200, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1034, baseType: !130, size: 8, align: 8, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!232 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1035, size: 192, align: 64, elements: !233, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!233 = !{!234, !239, !242, !245, !248}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1037, baseType: !235, size: 160, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !60, line: 681, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 160, align: 32, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 5)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1038, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !60, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1039, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !60, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1040, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !60, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1041, baseType: !249, size: 128, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !60, line: 676, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 128, align: 64, elements: !252)
!251 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !60, line: 1328, size: 1472, align: 64, elements: !255, identifier: "_ZTSN3pov14Pigment_StructE")
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !195, size: 16, align: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !195, size: 16, align: 16, offset: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !195, size: 16, align: 16, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !113, size: 32, align: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !200, size: 32, align: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !200, size: 32, align: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !200, size: 32, align: 32, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !204, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !207, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !210, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1331, baseType: !235, size: 160, align: 32, offset: 1280)
!268 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, size: 896, align: 64, elements: !269, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!269 = !{!270, !273, !276, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !60, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !60, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !60, line: 677, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 192, align: 64, elements: !171)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !200, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !240, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !60, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !60, line: 1269, size: 128, align: 64, elements: !295, identifier: "_ZTSN3pov19Density_file_StructE")
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1271, baseType: !113, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1272, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !60, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !60, line: 1275, size: 320, align: 64, elements: !301, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1277, baseType: !113, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1278, baseType: !148, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !113, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !113, size: 32, align: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !113, size: 32, align: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1280, baseType: !113, size: 32, align: 32, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!309 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, size: 64, align: 64, elements: !310, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!310 = !{!311, !312, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1283, baseType: !129, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1284, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1285, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !60, line: 1220, size: 960, align: 64, elements: !317, identifier: "_ZTSN3pov12Image_StructE")
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !337, !338}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1222, baseType: !113, size: 32, align: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1223, baseType: !113, size: 32, align: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1224, baseType: !113, size: 32, align: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1225, baseType: !113, size: 32, align: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1226, baseType: !113, size: 32, align: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !113, size: 32, align: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !113, size: 32, align: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1228, baseType: !134, size: 16, align: 16, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1229, baseType: !149, size: 8, align: 8, offset: 240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1230, baseType: !149, size: 8, align: 8, offset: 248)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1231, baseType: !277, size: 192, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !200, size: 32, align: 32, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !200, size: 32, align: 32, offset: 480)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1233, baseType: !249, size: 128, align: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !251, size: 64, align: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !251, size: 64, align: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1235, baseType: !335, size: 64, align: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !60, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1236, baseType: !139, size: 64, align: 64, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !60, line: 1161, size: 80, align: 16, elements: !340, identifier: "_ZTSN3pov19Image_Colour_StructE")
!340 = !{!341, !342, !343, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !195, size: 16, align: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !195, size: 16, align: 16, offset: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !195, size: 16, align: 16, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !195, size: 16, align: 16, offset: 48)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !195, size: 16, align: 16, offset: 64)
!346 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1237, size: 64, align: 64, elements: !347, identifier: "_ZTSN3pov12Image_StructUt_E")
!347 = !{!348, !351, !354, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1239, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !60, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1240, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !60, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1241, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1242, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !60, line: 1166, size: 256, align: 64, elements: !359, identifier: "_ZTSN3pov18Image8_Line_StructE")
!359 = !{!360, !361, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !129, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !129, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !129, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !129, size: 64, align: 64, offset: 192)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !60, line: 1171, size: 256, align: 64, elements: !365, identifier: "_ZTSN3pov19Image16_Line_StructE")
!365 = !{!366, !367, !368, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !313, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !313, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !313, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !313, size: 64, align: 64, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 256, align: 64, elements: !371, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !60, line: 1330, baseType: !200, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64, offset: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 64, align: 32, elements: !375, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !60, line: 1330, baseType: !200, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !60, line: 1330, baseType: !200, size: 32, align: 32, offset: 32)
!378 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 320, align: 64, elements: !379, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64, offset: 128)
!383 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 896, align: 64, elements: !384, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!384 = !{!385, !386, !387, !388, !389, !390, !392, !393}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !391, size: 64, align: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !113, size: 32, align: 32, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64, offset: 704)
!394 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 832, align: 64, elements: !395, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !277, size: 192, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16, offset: 400)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !249, size: 128, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !249, size: 128, align: 64, offset: 704)
!404 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 384, align: 64, elements: !405, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!405 = !{!406, !407, !408, !409, !410, !411, !412}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !249, size: 128, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16, offset: 144)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !134, size: 16, align: 16, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !251, size: 64, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !113, size: 32, align: 32, offset: 320)
!413 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 128, align: 64, elements: !414, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !60, line: 1330, baseType: !139, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !60, line: 1330, baseType: !139, size: 64, align: 64, offset: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !60, line: 1521, size: 960, align: 64, elements: !418, identifier: "_ZTSN3pov13Object_StructE")
!418 = !{!419, !422, !423, !424, !425, !426, !429, !430, !431, !434, !436, !439, !440, !441}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !60, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !113, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !292, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !246, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !246, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !427, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !60, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !292, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !292, size: 64, align: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !432, size: 64, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !60, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !435, size: 192, align: 32, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !60, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !437, size: 64, align: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !60, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!439 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !437, size: 64, align: 64, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !200, size: 32, align: 32, offset: 896)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !188, size: 32, align: 32, offset: 928)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !60, line: 1503, size: 704, align: 64, elements: !443, identifier: "_ZTSN3pov13Method_StructE")
!443 = !{!444, !453, !459, !466, !468, !473, !478, !480, !482, !487, !492}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1505, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !60, line: 1420, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!113, !292, !449, !451}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !60, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !60, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1506, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !60, line: 1421, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!113, !458, !292}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1507, baseType: !460, size: 64, align: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !60, line: 1422, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !458, !292, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !60, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!466 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1508, baseType: !467, size: 64, align: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !60, line: 1423, baseType: !461)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1509, baseType: !469, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !60, line: 1424, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!139, !292}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1510, baseType: !474, size: 64, align: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !60, line: 1425, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !292, !458, !437}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1511, baseType: !479, size: 64, align: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !60, line: 1426, baseType: !475)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1512, baseType: !481, size: 64, align: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !60, line: 1427, baseType: !475)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1513, baseType: !483, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !60, line: 1428, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !292, !437}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1514, baseType: !488, size: 64, align: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !60, line: 1429, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !292}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1515, baseType: !493, size: 64, align: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !60, line: 1430, baseType: !489)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !60, line: 1783, size: 6848, align: 64, elements: !495, identifier: "_ZTSN3pov10Ray_StructE")
!495 = !{!496, !497, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1785, baseType: !277, size: 192, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1786, baseType: !277, size: 192, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1787, baseType: !113, size: 32, align: 32, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1788, baseType: !188, size: 32, align: 32, offset: 416)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1789, baseType: !501, size: 6400, align: 64, offset: 448)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 6400, align: 64, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 100)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !60, line: 1112, size: 512, align: 64, elements: !505, identifier: "_ZTSN3pov15Interior_StructE")
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1114, baseType: !113, size: 32, align: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !113, size: 32, align: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !113, size: 32, align: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !200, size: 32, align: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !200, size: 32, align: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !200, size: 32, align: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !200, size: 32, align: 32, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !200, size: 32, align: 32, offset: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !200, size: 32, align: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1119, baseType: !235, size: 160, align: 32, offset: 288)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1120, baseType: !517, size: 64, align: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !60, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !60, line: 1069, size: 1728, align: 64, elements: !520, identifier: "_ZTSN3pov12Media_StructE")
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1071, baseType: !113, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1072, baseType: !113, size: 32, align: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1073, baseType: !113, size: 32, align: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1074, baseType: !113, size: 32, align: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1075, baseType: !113, size: 32, align: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1076, baseType: !251, size: 64, align: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1077, baseType: !113, size: 32, align: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !251, size: 64, align: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !251, size: 64, align: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1079, baseType: !113, size: 32, align: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1080, baseType: !113, size: 32, align: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1081, baseType: !113, size: 32, align: 32, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1082, baseType: !113, size: 32, align: 32, offset: 544)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1083, baseType: !235, size: 160, align: 32, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1084, baseType: !235, size: 160, align: 32, offset: 736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1085, baseType: !235, size: 160, align: 32, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1086, baseType: !235, size: 160, align: 32, offset: 1056)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1088, baseType: !251, size: 64, align: 64, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1089, baseType: !251, size: 64, align: 64, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1090, baseType: !251, size: 64, align: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1091, baseType: !458, size: 64, align: 64, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1093, baseType: !251, size: 64, align: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1094, baseType: !113, size: 32, align: 32, offset: 1536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1095, baseType: !113, size: 32, align: 32, offset: 1568)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1097, baseType: !240, size: 64, align: 64, offset: 1600)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1099, baseType: !517, size: 64, align: 64, offset: 1664)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !60, line: 1621, size: 192, align: 64, elements: !548, identifier: "_ZTSN3pov13istack_structE")
!548 = !{!549, !551, !553, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1623, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1624, baseType: !552, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1625, baseType: !188, size: 32, align: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1626, baseType: !188, size: 32, align: 32, offset: 160)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !60, line: 1596, size: 1600, align: 64, elements: !556, identifier: "_ZTSN3pov10istk_entryE")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1598, baseType: !251, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1599, baseType: !277, size: 192, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1600, baseType: !277, size: 192, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1601, baseType: !277, size: 192, align: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1602, baseType: !249, size: 128, align: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1603, baseType: !292, size: 64, align: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !113, size: 32, align: 32, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !113, size: 32, align: 32, offset: 864)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !251, size: 64, align: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !251, size: 64, align: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !251, size: 64, align: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !251, size: 64, align: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !251, size: 64, align: 64, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !251, size: 64, align: 64, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !251, size: 64, align: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !251, size: 64, align: 64, offset: 1344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !251, size: 64, align: 64, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1616, baseType: !139, size: 64, align: 64, offset: 1472)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1618, baseType: !139, size: 64, align: 64, offset: 1536)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !60, line: 1002, size: 2048, align: 64, elements: !577, identifier: "_ZTSN3pov16Transform_StructE")
!577 = !{!578, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1004, baseType: !579, size: 1024, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !60, line: 679, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 1024, align: 64, elements: !581)
!581 = !{!582, !582}
!582 = !DISubrange(count: 4)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1005, baseType: !579, size: 1024, align: 64, offset: 1024)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !60, line: 1345, size: 1664, align: 64, elements: !585, identifier: "_ZTSN3pov14Texture_StructE")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !603, !604}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !195, size: 16, align: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !195, size: 16, align: 16, offset: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !195, size: 16, align: 16, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !113, size: 32, align: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !200, size: 32, align: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !200, size: 32, align: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !200, size: 32, align: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !204, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !207, size: 64, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !210, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !246, size: 64, align: 64, offset: 1280)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1348, baseType: !240, size: 64, align: 64, offset: 1344)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1349, baseType: !243, size: 64, align: 64, offset: 1408)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1350, baseType: !601, size: 64, align: 64, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !60, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1351, baseType: !246, size: 64, align: 64, offset: 1536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1352, baseType: !113, size: 32, align: 32, offset: 1600)
!605 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, size: 896, align: 64, elements: !606, identifier: "_ZTSN3pov14Texture_StructUt_E")
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !271, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !274, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !200, size: 32, align: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !240, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !292, size: 64, align: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 256, align: 64, elements: !624, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !200, size: 32, align: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64, offset: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 64, align: 32, elements: !628, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !200, size: 32, align: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !200, size: 32, align: 32, offset: 32)
!631 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 320, align: 64, elements: !632, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64, offset: 128)
!636 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 896, align: 64, elements: !637, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !391, size: 64, align: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !113, size: 32, align: 32, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64, offset: 704)
!646 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 832, align: 64, elements: !647, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !277, size: 192, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16, offset: 400)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !249, size: 128, align: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !249, size: 128, align: 64, offset: 704)
!656 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 384, align: 64, elements: !657, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!657 = !{!658, !659, !660, !661, !662, !663, !664}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !249, size: 128, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16, offset: 144)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !134, size: 16, align: 16, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !251, size: 64, align: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !113, size: 32, align: 32, offset: 320)
!665 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 128, align: 64, elements: !666, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !139, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !139, size: 64, align: 64, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !60, line: 1334, size: 1344, align: 64, elements: !670, identifier: "_ZTSN3pov14Tnormal_StructE")
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !195, size: 16, align: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !195, size: 16, align: 16, offset: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !195, size: 16, align: 16, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !113, size: 32, align: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !200, size: 32, align: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !200, size: 32, align: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !200, size: 32, align: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !204, size: 64, align: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !207, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !210, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1337, baseType: !200, size: 32, align: 32, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1338, baseType: !200, size: 32, align: 32, offset: 1312)
!684 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, size: 896, align: 64, elements: !685, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !271, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !274, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !200, size: 32, align: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !240, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !292, size: 64, align: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 256, align: 64, elements: !703, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !60, line: 1336, baseType: !200, size: 32, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64, offset: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 64, align: 32, elements: !707, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !60, line: 1336, baseType: !200, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !60, line: 1336, baseType: !200, size: 32, align: 32, offset: 32)
!710 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 320, align: 64, elements: !711, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64, offset: 128)
!715 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 896, align: 64, elements: !716, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !391, size: 64, align: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !113, size: 32, align: 32, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64, offset: 704)
!725 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 832, align: 64, elements: !726, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !277, size: 192, align: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16, offset: 400)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !249, size: 128, align: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !249, size: 128, align: 64, offset: 704)
!735 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 384, align: 64, elements: !736, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!736 = !{!737, !738, !739, !740, !741, !742, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !249, size: 128, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16, offset: 144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !134, size: 16, align: 16, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !251, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !113, size: 32, align: 32, offset: 320)
!744 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 128, align: 64, elements: !745, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !60, line: 1336, baseType: !139, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !60, line: 1336, baseType: !139, size: 64, align: 64, offset: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !60, line: 1356, size: 928, align: 32, elements: !749, identifier: "_ZTSN3pov13Finish_StructE")
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !769, !770, !771, !772, !773, !774}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !200, size: 32, align: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !200, size: 32, align: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !200, size: 32, align: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !200, size: 32, align: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !200, size: 32, align: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !200, size: 32, align: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !200, size: 32, align: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !200, size: 32, align: 32, offset: 224)
