; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pgm.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"struct.pov::Image_Struct" = type { i32, i32, i32, i32, i32, i32, i32, i16, i8, i8, [3 x double], float, float, [2 x double], double, double, %"struct.pov::Image_Colour_Struct"*, i8*, %union.anon }
%"struct.pov::Image_Colour_Struct" = type { i16, i16, i16, i16, i16 }
%union.anon = type { %"struct.pov::Image8_Line_Struct"* }
%"struct.pov::Image8_Line_Struct" = type { i8*, i8*, i8*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !29, subprograms: !303, globals: !386, imports: !387)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pgm.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 51, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!8 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!9 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!10 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!11 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!12 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!13 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!14 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!15 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!16 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!17 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!18 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!19 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!20 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!21 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!22 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!23 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!24 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!25 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!26 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!27 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!28 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!29 = !{!30, !36, !41, !46, !122, !185, !232, !236, !71, !237, !271, !278, !291, !297, !118, !255, !267, !290, !188, !287, !288, !86}
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 82, size: 64, align: 32, elements: !32, identifier: "_ZTS5div_t")
!31 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !31, line: 83, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !31, line: 84, baseType: !34, size: 32, align: 32, offset: 32)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 87, size: 128, align: 64, elements: !37, identifier: "_ZTS6ldiv_t")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !31, line: 88, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !31, line: 89, baseType: !39, size: 64, align: 64, offset: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 93, size: 128, align: 64, elements: !42, identifier: "_ZTS7lldiv_t")
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !31, line: 94, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !31, line: 95, baseType: !44, size: 64, align: 64, offset: 64)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !4, line: 118, size: 320, align: 64, elements: !47, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!47 = !{!48, !49, !55, !58, !61, !62, !63, !66, !72, !77, !82, !87, !91, !95, !99, !104, !105, !106, !107, !108, !109, !110, !111, !112, !115, !119}
!48 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!49 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 121, type: !50, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !53}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 122, type: !56, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !52}
!58 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 124, type: !59, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!59 = !DISubroutineType(types: !60)
!60 = !{!34, !52}
!61 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 125, type: !59, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!62 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 126, type: !59, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!63 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 127, type: !64, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!64 = !DISubroutineType(types: !65)
!65 = !{!39, !52}
!66 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 128, type: !67, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !52, !70}
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!70 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !71)
!71 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 129, type: !73, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!73 = !DISubroutineType(types: !74)
!74 = !{!69, !52, !75}
!75 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !76)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 130, type: !78, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!78 = !DISubroutineType(types: !79)
!79 = !{!69, !52, !80}
!80 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !81)
!81 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!82 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 131, type: !83, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!83 = !DISubroutineType(types: !84)
!84 = !{!69, !52, !85}
!85 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !86)
!86 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!87 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 132, type: !88, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!88 = !DISubroutineType(types: !89)
!89 = !{!69, !52, !90}
!90 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!91 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 133, type: !92, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!92 = !DISubroutineType(types: !93)
!93 = !{!69, !52, !94}
!94 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !54)
!95 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 134, type: !96, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!96 = !DISubroutineType(types: !97)
!97 = !{!69, !52, !98}
!98 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39)
!99 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 135, type: !100, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!100 = !DISubroutineType(types: !101)
!101 = !{!69, !52, !102}
!102 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !103)
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 137, type: !96, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!105 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 138, type: !88, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!106 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 139, type: !78, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!107 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 140, type: !67, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!108 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 141, type: !100, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!109 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 142, type: !92, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 143, type: !83, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!111 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 144, type: !73, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!112 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 145, type: !113, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!113 = !DISubroutineType(types: !114)
!114 = !{!69, !52, !34}
!115 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 146, type: !116, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!116 = !DISubroutineType(types: !117)
!117 = !{!69, !52, !118, !103}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!119 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 147, type: !120, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!120 = !DISubroutineType(types: !121)
!121 = !{!69, !52, !103}
!122 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !4, line: 84, size: 320, align: 64, elements: !123, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!123 = !{!124, !129, !131, !135, !136, !137, !138, !142, !145, !150, !153, !158, !159, !162, !165, !166, !167, !170, !173, !176, !181, !184}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !125, size: 64, flags: DIFlagArtificial)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!34}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !130, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!130 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !132, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !134, line: 153, baseType: !"_ZTS7__sFILE")
!134 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !54, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !54, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !118, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!138 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !139, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141, !54, !54}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!142 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !143, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !141}
!145 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !146, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubroutineType(types: !147)
!147 = !{!130, !141, !148, !54}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!150 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !151, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!151 = !DISubroutineType(types: !152)
!152 = !{!130, !141}
!153 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !154, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !141, !157, !103}
!156 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!158 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !154, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!159 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !160, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!160 = !DISubroutineType(types: !161)
!161 = !{!156, !141, !103, !54}
!162 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !163, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{!54, !141}
!165 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !163, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !151, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !168, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!168 = !DISubroutineType(types: !169)
!169 = !{!103, !141}
!170 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !171, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!156, !141}
!173 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !174, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!174 = !DISubroutineType(types: !175)
!175 = !{!148, !141}
!176 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !177, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!177 = !DISubroutineType(types: !178)
!178 = !{!157, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!181 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !182, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!182 = !DISubroutineType(types: !183)
!183 = !{!130, !179}
!184 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !171, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !134, line: 122, size: 1216, align: 64, elements: !186, identifier: "_ZTS7__sFILE")
!186 = !{!187, !189, !190, !191, !192, !193, !194, !195, !196, !200, !204, !213, !217, !218, !220, !221, !225, !229, !230, !231}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !134, line: 123, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !134, line: 124, baseType: !34, size: 32, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !134, line: 125, baseType: !34, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !134, line: 126, baseType: !81, size: 16, align: 16, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !134, line: 127, baseType: !81, size: 16, align: 16, offset: 144)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !134, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !134, line: 129, baseType: !34, size: 32, align: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !134, line: 132, baseType: !157, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !134, line: 133, baseType: !197, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!34, !157}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !134, line: 134, baseType: !201, size: 64, align: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!34, !157, !118, !34}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !134, line: 135, baseType: !205, size: 64, align: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !157, !208, !34}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !134, line: 77, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !210, line: 71, baseType: !211)
!210 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !212, line: 46, baseType: !44)
!212 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !134, line: 136, baseType: !214, size: 64, align: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!34, !157, !148, !34}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !134, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !134, line: 140, baseType: !219, size: 64, align: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !134, line: 141, baseType: !34, size: 32, align: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !134, line: 144, baseType: !222, size: 24, align: 8, offset: 928)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, align: 8, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 3)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !134, line: 145, baseType: !226, size: 8, align: 8, offset: 952)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, align: 8, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !134, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !134, line: 151, baseType: !34, size: 32, align: 32, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !134, line: 152, baseType: !208, size: 64, align: 64, offset: 1152)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !134, line: 88, size: 128, align: 64, elements: !233, identifier: "_ZTS6__sbuf")
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !134, line: 89, baseType: !188, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !134, line: 90, baseType: !34, size: 32, align: 32, offset: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !134, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !239, file: !238, line: 1220, size: 960, align: 64, elements: !241, identifier: "_ZTSN3pov12Image_StructE")
!238 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!239 = !DINamespace(name: "pov", scope: null, file: !240, line: 36)
!240 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !256, !258, !259, !264, !265, !266, !269, !270}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1222, baseType: !34, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1223, baseType: !34, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1224, baseType: !34, size: 32, align: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1225, baseType: !34, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1226, baseType: !34, size: 32, align: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1227, baseType: !34, size: 32, align: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1227, baseType: !34, size: 32, align: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1228, baseType: !81, size: 16, align: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1229, baseType: !71, size: 8, align: 8, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1230, baseType: !71, size: 8, align: 8, offset: 248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1231, baseType: !253, size: 192, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !239, file: !238, line: 677, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 192, align: 64, elements: !223)
!255 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1232, baseType: !257, size: 32, align: 32, offset: 448)
!257 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1232, baseType: !257, size: 32, align: 32, offset: 480)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1233, baseType: !260, size: 128, align: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !239, file: !238, line: 676, baseType: !261)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 128, align: 64, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 2)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1234, baseType: !255, size: 64, align: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1234, baseType: !255, size: 64, align: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1235, baseType: !267, size: 64, align: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !239, file: !238, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1236, baseType: !157, size: 64, align: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !239, file: !238, line: 1161, size: 80, align: 16, elements: !272, identifier: "_ZTSN3pov19Image_Colour_StructE")
!272 = !{!273, !274, !275, !276, !277}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !238, line: 1163, baseType: !86, size: 16, align: 16)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !238, line: 1163, baseType: !86, size: 16, align: 16, offset: 16)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !238, line: 1163, baseType: !86, size: 16, align: 16, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !238, line: 1163, baseType: !86, size: 16, align: 16, offset: 48)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !238, line: 1163, baseType: !86, size: 16, align: 16, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !238, line: 1237, size: 64, align: 64, elements: !279, identifier: "_ZTSN3pov12Image_StructUt_E")
!279 = !{!280, !283, !286, !289}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !238, line: 1239, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !239, file: !238, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !238, line: 1240, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !239, file: !238, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !238, line: 1241, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !238, line: 1242, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !239, file: !238, line: 1166, size: 256, align: 64, elements: !292, identifier: "_ZTSN3pov18Image8_Line_StructE")
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !238, line: 1168, baseType: !188, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !238, line: 1168, baseType: !188, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !238, line: 1168, baseType: !188, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !238, line: 1168, baseType: !188, size: 64, align: 64, offset: 192)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !239, file: !238, line: 1171, size: 256, align: 64, elements: !298, identifier: "_ZTSN3pov19Image16_Line_StructE")
!298 = !{!299, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !238, line: 1173, baseType: !288, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !238, line: 1173, baseType: !288, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !238, line: 1173, baseType: !288, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !238, line: 1173, baseType: !288, size: 64, align: 64, offset: 192)
!303 = !{!304, !316, !343, !346, !352, !359, !362, !365, !371, !375}
!304 = !DISubprogram(name: "Read_ASCII_File_Number", linkageName: "_ZN3pov22Read_ASCII_File_NumberEPN8pov_base7IStreamE", scope: !239, file: !1, line: 79, type: !305, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%"class.pov_base::IStream"*)* @_ZN3pov22Read_ASCII_File_NumberEPN8pov_base7IStreamE, variables: !308)
!305 = !DISubroutineType(types: !306)
!306 = !{!34, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!308 = !{!309, !310, !311, !312}
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filep", arg: 1, scope: !304, file: !1, line: 79, type: !307)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !304, file: !1, line: 81, type: !34)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !304, file: !1, line: 82, type: !34)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !304, file: !1, line: 83, type: !313)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 400, align: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 50)
!316 = !DISubprogram(name: "Read_PGM_Image", linkageName: "_ZN3pov14Read_PGM_ImageEPNS_12Image_StructEPc", scope: !239, file: !1, line: 137, type: !317, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: void (%"struct.pov::Image_Struct"*, i8*)* @_ZN3pov14Read_PGM_ImageEPNS_12Image_StructEPc, variables: !321)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !319, !118}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !239, file: !238, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!321 = !{!322, !323, !324, !325, !327, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Image", arg: 1, scope: !316, file: !1, line: 137, type: !319)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !316, file: !1, line: 137, type: !118)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filep", scope: !316, file: !1, line: 139, type: !307)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header", scope: !316, file: !1, line: 140, type: !326)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, align: 8, elements: !262)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !316, file: !1, line: 141, type: !328)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8192, align: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 1024)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !316, file: !1, line: 142, type: !118)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbr", scope: !316, file: !1, line: 143, type: !34)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "width", scope: !316, file: !1, line: 145, type: !34)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "height", scope: !316, file: !1, line: 145, type: !34)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !316, file: !1, line: 146, type: !54)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmap", scope: !316, file: !1, line: 148, type: !267)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map_line", scope: !316, file: !1, line: 149, type: !188)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_hi", scope: !316, file: !1, line: 150, type: !34)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_lo", scope: !316, file: !1, line: 150, type: !34)
