; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/photons.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::photon_options_struct" = type { i32, double, double, double, i32, i32, double, double, double, i32, i32, i8*, i32, i32, %"struct.pov::photon_map_struct", i32, double, double, %"struct.pov::Object_Struct"*, double*, double*, %"struct.pov::photon_struct"**, double*, i32, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, i8, %"struct.pov::photon_map_struct", double, i32, i32, i32, i32 }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!93 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!94 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!95 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!96 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!97 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!98 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!99 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!100 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!101 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!102 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!103 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!104 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!105 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!106 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!107 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!108 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!109 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!110 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!111 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!112 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!113 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!114 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!115 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!116 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!117 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!118 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!119 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!120 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!121 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!122 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!123 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!124 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!125 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!126 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!127 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!128 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!129 = !DIEnumerator(name: "Media_Samples", value: 99)
!130 = !DIEnumerator(name: "Media_Intervals", value: 100)
!131 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!132 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!133 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!134 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!135 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!136 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!137 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!138 = !DIEnumerator(name: "nChecked", value: 108)
!139 = !DIEnumerator(name: "nEnqueued", value: 109)
!140 = !DIEnumerator(name: "totalQueues", value: 110)
!141 = !DIEnumerator(name: "totalQueueResets", value: 111)
!142 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!143 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!144 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!145 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!146 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!147 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!148 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!149 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!150 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!151 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!152 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!153 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!154 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!155 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!156 = !DIEnumerator(name: "MaxStat", value: 126)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !158, line: 692, size: 32, align: 32, elements: !159)
!158 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !{!160, !161, !162, !163}
!160 = !DIEnumerator(name: "X", value: 0)
!161 = !DIEnumerator(name: "Y", value: 1)
!162 = !DIEnumerator(name: "Z", value: 2)
!163 = !DIEnumerator(name: "T", value: 3)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !158, line: 701, size: 32, align: 32, elements: !165)
!165 = !{!166, !167, !168, !169, !170}
!166 = !DIEnumerator(name: "pRED", value: 0)
!167 = !DIEnumerator(name: "pGREEN", value: 1)
!168 = !DIEnumerator(name: "pBLUE", value: 2)
!169 = !DIEnumerator(name: "pFILTER", value: 3)
!170 = !DIEnumerator(name: "pTRANSM", value: 4)
!171 = !{!172, !178, !183, !188, !240, !251, !270, !295, !347, !359, !378, !408, !429, !434, !447, !457, !462, !475, !490, !512, !518, !527, !535, !558, !565, !577, !583, !589, !593, !597, !602, !613, !623, !632, !636, !657, !675, !679, !683, !688, !698, !708, !717, !721, !747, !765, !769, !773, !778, !788, !798, !807, !811, !829, !833, !837, !842, !852, !862, !871, !875, !883, !904, !911, !965, !972, !983, !990, !220, !217, !193, !325, !996, !27, !268, !243, !1003, !1050, !1054, !1055, !1074, !221, !176, !1076}
!172 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 82, size: 64, align: 32, elements: !174, identifier: "_ZTS5div_t")
!173 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !173, line: 83, baseType: !176, size: 32, align: 32)
!176 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !173, line: 84, baseType: !176, size: 32, align: 32, offset: 32)
!178 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 87, size: 128, align: 64, elements: !179, identifier: "_ZTS6ldiv_t")
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !173, line: 88, baseType: !181, size: 64, align: 64)
!181 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !173, line: 89, baseType: !181, size: 64, align: 64, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 93, size: 128, align: 64, elements: !184, identifier: "_ZTS7lldiv_t")
!184 = !{!185, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !173, line: 94, baseType: !186, size: 64, align: 64)
!186 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !173, line: 95, baseType: !186, size: 64, align: 64, offset: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "photon_options_struct", scope: !5, file: !189, line: 132, size: 2432, align: 64, elements: !190, identifier: "_ZTSN3pov21photon_options_structE")
!189 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/photons.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!190 = !{!191, !192, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !206, !207, !208, !210, !211, !212, !213, !216, !218, !219, !223, !224, !225, !226, !228, !229, !232, !234, !235, !236, !237, !238, !239}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "photonsEnabled", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 135, baseType: !176, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceSeparation", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 137, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "globalSeparation", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 138, baseType: !193, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "expandTolerance", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 140, baseType: !193, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "minExpandCount", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 141, baseType: !176, size: 32, align: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Trace_Level", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 143, baseType: !176, size: 32, align: 32, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_Bailout", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 144, baseType: !193, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "jitter", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 146, baseType: !193, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "autoStopPercent", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 147, baseType: !193, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "minGatherCount", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 149, baseType: !176, size: 32, align: 32, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "maxGatherCount", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 150, baseType: !176, size: 32, align: 32, offset: 544)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 152, baseType: !204, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "saveFile", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 153, baseType: !176, size: 32, align: 32, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "loadFile", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 154, baseType: !176, size: 32, align: 32, offset: 672)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "photonMap", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 160, baseType: !209, size: 384, align: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHOTON_MAP", scope: !5, file: !189, line: 115, baseType: !"_ZTSN3pov17photon_map_structE")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hitObject", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 163, baseType: !176, size: 32, align: 32, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "photonSpread", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 164, baseType: !193, size: 64, align: 64, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "photonDepth", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 165, baseType: !193, size: 64, align: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "photonObject", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 166, baseType: !214, size: 64, align: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !158, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cosTheta", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 172, baseType: !217, size: 64, align: 64, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sinTheta", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 173, baseType: !217, size: 64, align: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "photonGatherList", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 177, baseType: !220, size: 64, align: 64, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHOTON", scope: !5, file: !189, line: 54, baseType: !"_ZTSN3pov13photon_structE")
!223 = !DIDerivedType(tag: DW_TAG_member, name: "photonDistances", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 178, baseType: !217, size: 64, align: 64, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "passThruThis", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 183, baseType: !176, size: 32, align: 32, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "passThruPrev", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 184, baseType: !176, size: 32, align: 32, offset: 1632)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lightFlags", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 185, baseType: !227, size: 32, align: 32, offset: 1664)
!227 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "objectFlags", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 186, baseType: !227, size: 32, align: 32, offset: 1696)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Light", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 187, baseType: !230, size: 64, align: 64, offset: 1728)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !158, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Is_Global", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 188, baseType: !233, size: 8, align: 8, offset: 1792)
!233 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mediaPhotonMap", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 199, baseType: !209, size: 384, align: 64, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mediaSpacingFactor", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 201, baseType: !193, size: 64, align: 64, offset: 2240)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "maxMediaSteps", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 202, baseType: !176, size: 32, align: 32, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceCount", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 204, baseType: !176, size: 32, align: 32, offset: 2336)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "globalCount", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 205, baseType: !176, size: 32, align: 32, offset: 2368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "photonReflectionBlur", scope: !"_ZTSN3pov21photon_options_structE", file: !189, line: 207, baseType: !176, size: 32, align: 32, offset: 2400)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "photon_map_struct", scope: !5, file: !189, line: 117, size: 384, align: 64, elements: !241, identifier: "_ZTSN3pov17photon_map_structE")
!241 = !{!242, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 119, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PHOTON_BLOCK", scope: !5, file: !189, line: 66, baseType: !221)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "numBlocks", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 120, baseType: !176, size: 32, align: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "numPhotons", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 121, baseType: !176, size: 32, align: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "minGatherRad", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 123, baseType: !193, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "minGatherRadMult", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 124, baseType: !193, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "gatherRadStep", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 125, baseType: !193, size: 64, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gatherNumSteps", scope: !"_ZTSN3pov17photon_map_structE", file: !189, line: 126, baseType: !176, size: 32, align: 32, offset: 320)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "photon_struct", scope: !5, file: !189, line: 56, size: 160, align: 32, elements: !252, identifier: "_ZTSN3pov13photon_structE")
!252 = !{!253, !259, !266, !267, !269}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Loc", scope: !"_ZTSN3pov13photon_structE", file: !189, line: 57, baseType: !254, size: 96, align: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNGL_VECT", scope: !5, file: !158, line: 683, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 96, align: 32, elements: !257)
!256 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov13photon_structE", file: !189, line: 58, baseType: !260, size: 32, align: 8, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMALL_COLOUR", scope: !5, file: !261, line: 45, baseType: !262)
!261 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/colutils.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 32, align: 8, elements: !264)
!263 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!264 = !{!265}
!265 = !DISubrange(count: 4)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !"_ZTSN3pov13photon_structE", file: !189, line: 59, baseType: !263, size: 8, align: 8, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !"_ZTSN3pov13photon_structE", file: !189, line: 60, baseType: !268, size: 8, align: 8, offset: 136)
!268 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !"_ZTSN3pov13photon_structE", file: !189, line: 60, baseType: !268, size: 8, align: 8, offset: 144)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !158, line: 1521, size: 960, align: 64, elements: !271, identifier: "_ZTSN3pov13Object_StructE")
!271 = !{!272, !275, !276, !277, !280, !281, !284, !285, !286, !287, !289, !292, !293, !294}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !158, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !176, size: 32, align: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !214, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !278, size: 64, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !158, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !278, size: 64, align: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !282, size: 64, align: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !158, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !214, size: 64, align: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !214, size: 64, align: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !230, size: 64, align: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !288, size: 192, align: 32, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !158, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !290, size: 64, align: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !158, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !290, size: 64, align: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !256, size: 32, align: 32, offset: 896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !227, size: 32, align: 32, offset: 928)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !158, line: 1503, size: 704, align: 64, elements: !296, identifier: "_ZTSN3pov13Method_StructE")
!296 = !{!297, !306, !311, !318, !320, !326, !331, !333, !335, !340, !345}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1505, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !158, line: 1420, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!176, !214, !302, !304}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !158, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !158, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1506, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !158, line: 1421, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!176, !217, !214}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1507, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !158, line: 1422, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !217, !214, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !158, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1508, baseType: !319, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !158, line: 1423, baseType: !313)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1509, baseType: !321, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !158, line: 1424, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !214}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1510, baseType: !327, size: 64, align: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !158, line: 1425, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !214, !217, !290}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1511, baseType: !332, size: 64, align: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !158, line: 1426, baseType: !328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1512, baseType: !334, size: 64, align: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !158, line: 1427, baseType: !328)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1513, baseType: !336, size: 64, align: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !158, line: 1428, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !214, !290}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1514, baseType: !341, size: 64, align: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !158, line: 1429, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !214}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1515, baseType: !346, size: 64, align: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !158, line: 1430, baseType: !342)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !158, line: 1783, size: 6848, align: 64, elements: !348, identifier: "_ZTSN3pov10Ray_StructE")
!348 = !{!349, !352, !353, !354, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1785, baseType: !350, size: 192, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !158, line: 677, baseType: !351)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 192, align: 64, elements: !257)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1786, baseType: !350, size: 192, align: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1787, baseType: !176, size: 32, align: 32, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1788, baseType: !227, size: 32, align: 32, offset: 416)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1789, baseType: !356, size: 6400, align: 64, offset: 448)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 6400, align: 64, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 100)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !158, line: 1112, size: 512, align: 64, elements: !360, identifier: "_ZTSN3pov15Interior_StructE")
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !375}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1114, baseType: !176, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1115, baseType: !176, size: 32, align: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1115, baseType: !176, size: 32, align: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1116, baseType: !256, size: 32, align: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1116, baseType: !256, size: 32, align: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1117, baseType: !256, size: 32, align: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1117, baseType: !256, size: 32, align: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1118, baseType: !256, size: 32, align: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1118, baseType: !256, size: 32, align: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1119, baseType: !371, size: 160, align: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !158, line: 681, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 160, align: 32, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 5)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1120, baseType: !376, size: 64, align: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !158, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !158, line: 1069, size: 1728, align: 64, elements: !379, identifier: "_ZTSN3pov12Media_StructE")
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1071, baseType: !176, size: 32, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1072, baseType: !176, size: 32, align: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1073, baseType: !176, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1074, baseType: !176, size: 32, align: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1075, baseType: !176, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1076, baseType: !193, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1077, baseType: !176, size: 32, align: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1078, baseType: !193, size: 64, align: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1078, baseType: !193, size: 64, align: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1079, baseType: !176, size: 32, align: 32, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1080, baseType: !176, size: 32, align: 32, offset: 480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1081, baseType: !176, size: 32, align: 32, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1082, baseType: !176, size: 32, align: 32, offset: 544)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1083, baseType: !371, size: 160, align: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1084, baseType: !371, size: 160, align: 32, offset: 736)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1085, baseType: !371, size: 160, align: 32, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1086, baseType: !371, size: 160, align: 32, offset: 1056)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1088, baseType: !193, size: 64, align: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1089, baseType: !193, size: 64, align: 64, offset: 1280)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1090, baseType: !193, size: 64, align: 64, offset: 1344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1091, baseType: !217, size: 64, align: 64, offset: 1408)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1093, baseType: !193, size: 64, align: 64, offset: 1472)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1094, baseType: !176, size: 32, align: 32, offset: 1536)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1095, baseType: !176, size: 32, align: 32, offset: 1568)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1097, baseType: !405, size: 64, align: 64, offset: 1600)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !158, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1099, baseType: !376, size: 64, align: 64, offset: 1664)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !158, line: 1328, size: 1472, align: 64, elements: !409, identifier: "_ZTSN3pov14Pigment_StructE")
!409 = !{!410, !412, !413, !414, !415, !416, !417, !418, !421, !424, !427, !428}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !411, size: 16, align: 16)
!411 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !411, size: 16, align: 16, offset: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !411, size: 16, align: 16, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !176, size: 32, align: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !256, size: 32, align: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !256, size: 32, align: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !256, size: 32, align: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !419, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !158, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !422, size: 64, align: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !158, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !425, size: 64, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !158, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1331, baseType: !371, size: 160, align: 32, offset: 1280)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !158, line: 1373, size: 192, align: 64, elements: !430, identifier: "_ZTSN3pov12Warps_StructE")
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !411, size: 16, align: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !419, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !419, size: 64, align: 64, offset: 128)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !158, line: 1323, size: 1280, align: 64, elements: !435, identifier: "_ZTSN3pov14Pattern_StructE")
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !411, size: 16, align: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !411, size: 16, align: 16, offset: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !411, size: 16, align: 16, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !176, size: 32, align: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !256, size: 32, align: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !256, size: 32, align: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !256, size: 32, align: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !419, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !422, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !425, size: 64, align: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !158, line: 1045, size: 128, align: 64, elements: !448, identifier: "_ZTSN3pov16Blend_Map_StructE")
!448 = !{!449, !450, !452, !453, !454}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1047, baseType: !176, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1048, baseType: !451, size: 16, align: 16, offset: 32)
!451 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1049, baseType: !205, size: 8, align: 8, offset: 48)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1049, baseType: !205, size: 8, align: 8, offset: 56)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1050, baseType: !455, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !158, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !158, line: 1031, size: 256, align: 64, elements: !458, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1033, baseType: !256, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1034, baseType: !263, size: 8, align: 8, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!462 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1035, size: 192, align: 64, elements: !463, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!463 = !{!464, !465, !466, !469, !470}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1037, baseType: !371, size: 160, align: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1038, baseType: !405, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1039, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !158, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1040, baseType: !278, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1041, baseType: !471, size: 128, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !158, line: 676, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, align: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 2)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !158, line: 1334, size: 1344, align: 64, elements: !476, identifier: "_ZTSN3pov14Tnormal_StructE")
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !411, size: 16, align: 16)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !411, size: 16, align: 16, offset: 16)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !411, size: 16, align: 16, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !176, size: 32, align: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !256, size: 32, align: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !256, size: 32, align: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !256, size: 32, align: 32, offset: 160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !419, size: 64, align: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !422, size: 64, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !425, size: 64, align: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1337, baseType: !256, size: 32, align: 32, offset: 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1338, baseType: !256, size: 32, align: 32, offset: 1312)
!490 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, size: 896, align: 64, elements: !491, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!491 = !{!492, !495, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !158, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !158, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !256, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !405, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !214, size: 64, align: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !158, line: 1269, size: 128, align: 64, elements: !513, identifier: "_ZTSN3pov19Density_file_StructE")
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !158, line: 1271, baseType: !176, size: 32, align: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !158, line: 1272, baseType: !516, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !158, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !158, line: 1275, size: 320, align: 64, elements: !519, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!519 = !{!520, !521, !522, !523, !524, !525, !526}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1277, baseType: !176, size: 32, align: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1278, baseType: !204, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !176, size: 32, align: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !176, size: 32, align: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !176, size: 32, align: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1280, baseType: !176, size: 32, align: 32, offset: 224)
!526 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!527 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1281, size: 64, align: 64, elements: !528, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!528 = !{!529, !531, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1283, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1284, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1285, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !158, line: 1220, size: 960, align: 64, elements: !536, identifier: "_ZTSN3pov12Image_StructE")
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !556, !557}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1222, baseType: !176, size: 32, align: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1223, baseType: !176, size: 32, align: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1224, baseType: !176, size: 32, align: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1225, baseType: !176, size: 32, align: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1226, baseType: !176, size: 32, align: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1227, baseType: !176, size: 32, align: 32, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1227, baseType: !176, size: 32, align: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1228, baseType: !451, size: 16, align: 16, offset: 224)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1229, baseType: !205, size: 8, align: 8, offset: 240)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1230, baseType: !205, size: 8, align: 8, offset: 248)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1231, baseType: !350, size: 192, align: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1232, baseType: !256, size: 32, align: 32, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1232, baseType: !256, size: 32, align: 32, offset: 480)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1233, baseType: !471, size: 128, align: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1234, baseType: !193, size: 64, align: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1234, baseType: !193, size: 64, align: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1235, baseType: !554, size: 64, align: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !158, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1236, baseType: !325, size: 64, align: 64, offset: 832)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !158, line: 1161, size: 80, align: 16, elements: !559, identifier: "_ZTSN3pov19Image_Colour_StructE")
!559 = !{!560, !561, !562, !563, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !411, size: 16, align: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !411, size: 16, align: 16, offset: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !411, size: 16, align: 16, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !411, size: 16, align: 16, offset: 48)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !411, size: 16, align: 16, offset: 64)
!565 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1237, size: 64, align: 64, elements: !566, identifier: "_ZTSN3pov12Image_StructUt_E")
!566 = !{!567, !570, !573, !575}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1239, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !158, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1240, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !158, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1241, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1242, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !158, line: 1166, size: 256, align: 64, elements: !578, identifier: "_ZTSN3pov18Image8_Line_StructE")
!578 = !{!579, !580, !581, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !530, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !530, size: 64, align: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !530, size: 64, align: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !530, size: 64, align: 64, offset: 192)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !158, line: 1171, size: 256, align: 64, elements: !584, identifier: "_ZTSN3pov19Image16_Line_StructE")
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !532, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !532, size: 64, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !532, size: 64, align: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !532, size: 64, align: 64, offset: 192)
!589 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 256, align: 64, elements: !590, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !158, line: 1336, baseType: !256, size: 32, align: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64, offset: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 64, align: 32, elements: !594, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !158, line: 1336, baseType: !256, size: 32, align: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !158, line: 1336, baseType: !256, size: 32, align: 32, offset: 32)
!597 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 320, align: 64, elements: !598, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64, offset: 128)
!602 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 896, align: 64, elements: !603, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!603 = !{!604, !605, !606, !607, !608, !609, !611, !612}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !610, size: 64, align: 64, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !176, size: 32, align: 32, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64, offset: 704)
!613 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 832, align: 64, elements: !614, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !350, size: 192, align: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16, offset: 400)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !471, size: 128, align: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !471, size: 128, align: 64, offset: 704)
!623 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 384, align: 64, elements: !624, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!624 = !{!625, !626, !627, !628, !629, !630, !631}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !471, size: 128, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16, offset: 144)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !451, size: 16, align: 16, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !193, size: 64, align: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !176, size: 32, align: 32, offset: 320)
!632 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 128, align: 64, elements: !633, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !158, line: 1336, baseType: !325, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !158, line: 1336, baseType: !325, size: 64, align: 64, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !158, line: 1345, size: 1664, align: 64, elements: !637, identifier: "_ZTSN3pov14Texture_StructE")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !655, !656}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !411, size: 16, align: 16)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !411, size: 16, align: 16, offset: 16)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !411, size: 16, align: 16, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !176, size: 32, align: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !256, size: 32, align: 32, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !256, size: 32, align: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !256, size: 32, align: 32, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !419, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !422, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !425, size: 64, align: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !278, size: 64, align: 64, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1348, baseType: !405, size: 64, align: 64, offset: 1344)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1349, baseType: !467, size: 64, align: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1350, baseType: !653, size: 64, align: 64, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !158, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1351, baseType: !278, size: 64, align: 64, offset: 1536)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1352, baseType: !176, size: 32, align: 32, offset: 1600)
!657 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, size: 896, align: 64, elements: !658, identifier: "_ZTSN3pov14Texture_StructUt_E")
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !493, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !496, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !256, size: 32, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !405, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !214, size: 64, align: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 256, align: 64, elements: !676, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !158, line: 1347, baseType: !256, size: 32, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64, offset: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 64, align: 32, elements: !680, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !158, line: 1347, baseType: !256, size: 32, align: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !158, line: 1347, baseType: !256, size: 32, align: 32, offset: 32)
!683 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 320, align: 64, elements: !684, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64, offset: 128)
!688 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 896, align: 64, elements: !689, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !610, size: 64, align: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !176, size: 32, align: 32, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64, offset: 704)
!698 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 832, align: 64, elements: !699, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !350, size: 192, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16, offset: 400)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !471, size: 128, align: 64, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !471, size: 128, align: 64, offset: 704)
!708 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 384, align: 64, elements: !709, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!709 = !{!710, !711, !712, !713, !714, !715, !716}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !471, size: 128, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16, offset: 144)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !451, size: 16, align: 16, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !193, size: 64, align: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !176, size: 32, align: 32, offset: 320)
!717 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 128, align: 64, elements: !718, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !158, line: 1347, baseType: !325, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !158, line: 1347, baseType: !325, size: 64, align: 64, offset: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !158, line: 1356, size: 928, align: 32, elements: !722, identifier: "_ZTSN3pov13Finish_StructE")
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !741, !742, !743, !744, !745, !746}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1358, baseType: !256, size: 32, align: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1358, baseType: !256, size: 32, align: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1359, baseType: !256, size: 32, align: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1359, baseType: !256, size: 32, align: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1360, baseType: !256, size: 32, align: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1360, baseType: !256, size: 32, align: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1361, baseType: !256, size: 32, align: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1361, baseType: !256, size: 32, align: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1361, baseType: !256, size: 32, align: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !256, size: 32, align: 32, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !256, size: 32, align: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !256, size: 32, align: 32, offset: 352)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !256, size: 32, align: 32, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !256, size: 32, align: 32, offset: 416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1363, baseType: !256, size: 32, align: 32, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1363, baseType: !256, size: 32, align: 32, offset: 480)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1364, baseType: !740, size: 96, align: 32, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !158, line: 682, baseType: !255)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1364, baseType: !740, size: 96, align: 32, offset: 608)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1364, baseType: !740, size: 96, align: 32, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1365, baseType: !256, size: 32, align: 32, offset: 800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1366, baseType: !176, size: 32, align: 32, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1367, baseType: !256, size: 32, align: 32, offset: 864)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1368, baseType: !176, size: 32, align: 32, offset: 896)
!747 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, size: 896, align: 64, elements: !748, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !493, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !496, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !256, size: 32, align: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !451, size: 16, align: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !451, size: 16, align: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !451, size: 16, align: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !405, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, baseType: !214, size: 64, align: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 256, align: 64, elements: !766, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !158, line: 1325, baseType: !256, size: 32, align: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64, offset: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 64, align: 32, elements: !770, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !158, line: 1325, baseType: !256, size: 32, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !158, line: 1325, baseType: !256, size: 32, align: 32, offset: 32)
!773 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 320, align: 64, elements: !774, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !158, line: 1325, baseType: !193, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !158, line: 1325, baseType: !193, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64, offset: 128)
!778 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 896, align: 64, elements: !779, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !193, size: 64, align: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !193, size: 64, align: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !451, size: 16, align: 16, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !610, size: 64, align: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !176, size: 32, align: 32, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64, offset: 704)
!788 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 832, align: 64, elements: !789, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !350, size: 192, align: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !451, size: 16, align: 16, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !451, size: 16, align: 16, offset: 400)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !193, size: 64, align: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !193, size: 64, align: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !471, size: 128, align: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !158, line: 1325, baseType: !471, size: 128, align: 64, offset: 704)
!798 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !158, line: 1325, size: 384, align: 64, elements: !799, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!799 = !{!800, !801, !802, !803, !804, !805, !806}
