; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pigment.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Pigment_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, [5 x float] }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.0 }
%union.anon.0 = type { %struct.anon.5 }
%struct.anon.5 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::istk_entry" = type { double, [3 x double], [3 x double], [3 x double], [2 x double], %"struct.pov::Object_Struct"*, i32, i32, double, double, double, double, double, double, double, double, double, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !77, subprograms: !836, globals: !933, imports: !960)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pigment.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !59, !67, !71}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !4, line: 47, size: 32, align: 32, elements: !7, identifier: "_ZTSN3pov11PATTERN_IDSE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!8 = !DIEnumerator(name: "NO_PATTERN", value: 0)
!9 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!10 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!11 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!12 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!13 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!14 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!15 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!16 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!17 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!18 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!19 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!20 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!21 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!22 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!23 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!24 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!25 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!26 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!27 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!28 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!29 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!30 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!31 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!32 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!33 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!34 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!35 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!36 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!37 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!38 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!39 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!40 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!41 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!42 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!43 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!44 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!45 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!46 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!47 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!48 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!49 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!50 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!51 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!52 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!53 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!54 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!55 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!56 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!57 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!58 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 701, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !{!62, !63, !64, !65, !66}
!62 = !DIEnumerator(name: "pRED", value: 0)
!63 = !DIEnumerator(name: "pGREEN", value: 1)
!64 = !DIEnumerator(name: "pBLUE", value: 2)
!65 = !DIEnumerator(name: "pFILTER", value: 3)
!66 = !DIEnumerator(name: "pTRANSM", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 686, size: 32, align: 32, elements: !68)
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "U", value: 0)
!70 = !DIEnumerator(name: "V", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 692, size: 32, align: 32, elements: !72)
!72 = !{!73, !74, !75, !76}
!73 = !DIEnumerator(name: "X", value: 0)
!74 = !DIEnumerator(name: "Y", value: 1)
!75 = !DIEnumerator(name: "Z", value: 2)
!76 = !DIEnumerator(name: "T", value: 3)
!77 = !{!78, !84, !89, !94, !105, !112, !134, !155, !160, !173, !201, !207, !217, !226, !250, !257, !269, !275, !281, !285, !289, !294, !305, !315, !324, !328, !353, !405, !415, !430, !458, !466, !487, !495, !516, !534, !538, !542, !547, !557, !567, !576, !580, !595, !613, !617, !621, !626, !636, !646, !655, !659, !686, !741, !748, !759, !766, !772, !790, !794, !798, !803, !813, !823, !832, !120, !148, !3, !248}
!78 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 82, size: 64, align: 32, elements: !80, identifier: "_ZTS5div_t")
!79 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !79, line: 83, baseType: !82, size: 32, align: 32)
!82 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !79, line: 84, baseType: !82, size: 32, align: 32, offset: 32)
!84 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 87, size: 128, align: 64, elements: !85, identifier: "_ZTS6ldiv_t")
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !79, line: 88, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !79, line: 89, baseType: !87, size: 64, align: 64, offset: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 93, size: 128, align: 64, elements: !90, identifier: "_ZTS7lldiv_t")
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !79, line: 94, baseType: !92, size: 64, align: 64)
!92 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !79, line: 95, baseType: !92, size: 64, align: 64, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !60, line: 1045, size: 128, align: 64, elements: !95, identifier: "_ZTSN3pov16Blend_Map_StructE")
!95 = !{!96, !97, !99, !101, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1047, baseType: !82, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1048, baseType: !98, size: 16, align: 16, offset: 32)
!98 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !100, size: 8, align: 8, offset: 48)
!100 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !100, size: 8, align: 8, offset: 56)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1050, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !60, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !60, line: 1031, size: 256, align: 64, elements: !106, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!106 = !{!107, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1033, baseType: !108, size: 32, align: 32)
!108 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1034, baseType: !110, size: 8, align: 8, offset: 32)
!110 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1035, size: 192, align: 64, elements: !113, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!113 = !{!114, !119, !122, !125, !128}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1037, baseType: !115, size: 160, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !60, line: 681, baseType: !116)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 160, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 5)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1038, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !60, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1039, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !60, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1040, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !60, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1041, baseType: !129, size: 128, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !60, line: 676, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, align: 64, elements: !132)
!131 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !60, line: 1328, size: 1472, align: 64, elements: !135, identifier: "_ZTSN3pov14Pigment_StructE")
!135 = !{!136, !138, !139, !140, !141, !142, !143, !144, !147, !150, !153, !154}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !137, size: 16, align: 16)
!137 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !137, size: 16, align: 16, offset: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !137, size: 16, align: 16, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !82, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !108, size: 32, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !108, size: 32, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !108, size: 32, align: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !60, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !60, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !151, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !60, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1331, baseType: !115, size: 160, align: 32, offset: 1280)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !60, line: 1373, size: 192, align: 64, elements: !156, identifier: "_ZTSN3pov12Warps_StructE")
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !137, size: 16, align: 16)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !145, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !145, size: 64, align: 64, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !60, line: 1323, size: 1280, align: 64, elements: !161, identifier: "_ZTSN3pov14Pattern_StructE")
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !137, size: 16, align: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !137, size: 16, align: 16, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !137, size: 16, align: 16, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !82, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !108, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !108, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !108, size: 32, align: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !145, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !148, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !151, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!173 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, size: 896, align: 64, elements: !174, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!174 = !{!175, !178, !181, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !60, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !60, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !60, line: 677, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, align: 64, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 3)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !108, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !120, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !60, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !60, line: 1269, size: 128, align: 64, elements: !202, identifier: "_ZTSN3pov19Density_file_StructE")
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1271, baseType: !82, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1272, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !60, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !60, line: 1275, size: 320, align: 64, elements: !208, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!208 = !{!209, !210, !212, !213, !214, !215, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1277, baseType: !82, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1278, baseType: !211, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !82, size: 32, align: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !82, size: 32, align: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !82, size: 32, align: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1280, baseType: !82, size: 32, align: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!217 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, size: 64, align: 64, elements: !218, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!218 = !{!219, !221, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1283, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1284, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1285, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !60, line: 1220, size: 960, align: 64, elements: !227, identifier: "_ZTSN3pov12Image_StructE")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !249}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1222, baseType: !82, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1223, baseType: !82, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1224, baseType: !82, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1225, baseType: !82, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1226, baseType: !82, size: 32, align: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !82, size: 32, align: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !82, size: 32, align: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1228, baseType: !98, size: 16, align: 16, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1229, baseType: !100, size: 8, align: 8, offset: 240)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1230, baseType: !100, size: 8, align: 8, offset: 248)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1231, baseType: !182, size: 192, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !108, size: 32, align: 32, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !108, size: 32, align: 32, offset: 480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1233, baseType: !129, size: 128, align: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !131, size: 64, align: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !131, size: 64, align: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1235, baseType: !245, size: 64, align: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !60, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1236, baseType: !248, size: 64, align: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !60, line: 1161, size: 80, align: 16, elements: !251, identifier: "_ZTSN3pov19Image_Colour_StructE")
!251 = !{!252, !253, !254, !255, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !137, size: 16, align: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !137, size: 16, align: 16, offset: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !137, size: 16, align: 16, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !137, size: 16, align: 16, offset: 48)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !137, size: 16, align: 16, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1237, size: 64, align: 64, elements: !258, identifier: "_ZTSN3pov12Image_StructUt_E")
!258 = !{!259, !262, !265, !267}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1239, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !60, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1240, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !60, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!265 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1241, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1242, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !60, line: 1166, size: 256, align: 64, elements: !270, identifier: "_ZTSN3pov18Image8_Line_StructE")
!270 = !{!271, !272, !273, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !220, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !220, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !220, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !220, size: 64, align: 64, offset: 192)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !60, line: 1171, size: 256, align: 64, elements: !276, identifier: "_ZTSN3pov19Image16_Line_StructE")
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !222, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !222, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !222, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !222, size: 64, align: 64, offset: 192)
!281 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 256, align: 64, elements: !282, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !60, line: 1325, baseType: !108, size: 32, align: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 64, align: 32, elements: !286, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !60, line: 1325, baseType: !108, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !60, line: 1325, baseType: !108, size: 32, align: 32, offset: 32)
!289 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 320, align: 64, elements: !290, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64, offset: 128)
!294 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 896, align: 64, elements: !295, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!295 = !{!296, !297, !298, !299, !300, !301, !303, !304}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !302, size: 64, align: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !82, size: 32, align: 32, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64, offset: 704)
!305 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 832, align: 64, elements: !306, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !182, size: 192, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16, offset: 400)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !129, size: 128, align: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !60, line: 1325, baseType: !129, size: 128, align: 64, offset: 704)
!315 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 384, align: 64, elements: !316, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!316 = !{!317, !318, !319, !320, !321, !322, !323}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !129, size: 128, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16, offset: 144)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !98, size: 16, align: 16, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !131, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !60, line: 1325, baseType: !82, size: 32, align: 32, offset: 320)
!324 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !60, line: 1325, size: 128, align: 64, elements: !325, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !60, line: 1325, baseType: !248, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !60, line: 1325, baseType: !248, size: 64, align: 64, offset: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !60, line: 1521, size: 960, align: 64, elements: !329, identifier: "_ZTSN3pov13Object_StructE")
!329 = !{!330, !333, !334, !335, !336, !337, !340, !341, !342, !345, !347, !350, !351, !352}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !60, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !82, size: 32, align: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !199, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !126, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !126, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !338, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !60, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !199, size: 64, align: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !199, size: 64, align: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !343, size: 64, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !60, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !346, size: 192, align: 32, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !60, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !348, size: 64, align: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !60, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!350 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !348, size: 64, align: 64, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !108, size: 32, align: 32, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !225, size: 32, align: 32, offset: 928)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !60, line: 1503, size: 704, align: 64, elements: !354, identifier: "_ZTSN3pov13Method_StructE")
!354 = !{!355, !364, !370, !377, !379, !384, !389, !391, !393, !398, !403}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1505, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !60, line: 1420, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!82, !199, !360, !362}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !60, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !60, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1506, baseType: !365, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !60, line: 1421, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!82, !369, !199}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1507, baseType: !371, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !60, line: 1422, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !369, !199, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !60, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!377 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1508, baseType: !378, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !60, line: 1423, baseType: !372)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1509, baseType: !380, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !60, line: 1424, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!248, !199}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1510, baseType: !385, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !60, line: 1425, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !199, !369, !348}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1511, baseType: !390, size: 64, align: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !60, line: 1426, baseType: !386)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1512, baseType: !392, size: 64, align: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !60, line: 1427, baseType: !386)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1513, baseType: !394, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !60, line: 1428, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !199, !348}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1514, baseType: !399, size: 64, align: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !60, line: 1429, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !199}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1515, baseType: !404, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !60, line: 1430, baseType: !400)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !60, line: 1783, size: 6848, align: 64, elements: !406, identifier: "_ZTSN3pov10Ray_StructE")
!406 = !{!407, !408, !409, !410, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1785, baseType: !182, size: 192, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1786, baseType: !182, size: 192, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1787, baseType: !82, size: 32, align: 32, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1788, baseType: !225, size: 32, align: 32, offset: 416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1789, baseType: !412, size: 6400, align: 64, offset: 448)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 6400, align: 64, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 100)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !60, line: 1112, size: 512, align: 64, elements: !416, identifier: "_ZTSN3pov15Interior_StructE")
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1114, baseType: !82, size: 32, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !82, size: 32, align: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !82, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !108, size: 32, align: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !108, size: 32, align: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !108, size: 32, align: 32, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !108, size: 32, align: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !108, size: 32, align: 32, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !108, size: 32, align: 32, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1119, baseType: !115, size: 160, align: 32, offset: 288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1120, baseType: !428, size: 64, align: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !60, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !60, line: 1069, size: 1728, align: 64, elements: !431, identifier: "_ZTSN3pov12Media_StructE")
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1071, baseType: !82, size: 32, align: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1072, baseType: !82, size: 32, align: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1073, baseType: !82, size: 32, align: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1074, baseType: !82, size: 32, align: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1075, baseType: !82, size: 32, align: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1076, baseType: !131, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1077, baseType: !82, size: 32, align: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !131, size: 64, align: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !131, size: 64, align: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1079, baseType: !82, size: 32, align: 32, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1080, baseType: !82, size: 32, align: 32, offset: 480)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1081, baseType: !82, size: 32, align: 32, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1082, baseType: !82, size: 32, align: 32, offset: 544)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1083, baseType: !115, size: 160, align: 32, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1084, baseType: !115, size: 160, align: 32, offset: 736)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1085, baseType: !115, size: 160, align: 32, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1086, baseType: !115, size: 160, align: 32, offset: 1056)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1088, baseType: !131, size: 64, align: 64, offset: 1216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1089, baseType: !131, size: 64, align: 64, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1090, baseType: !131, size: 64, align: 64, offset: 1344)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1091, baseType: !369, size: 64, align: 64, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1093, baseType: !131, size: 64, align: 64, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1094, baseType: !82, size: 32, align: 32, offset: 1536)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1095, baseType: !82, size: 32, align: 32, offset: 1568)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1097, baseType: !120, size: 64, align: 64, offset: 1600)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1099, baseType: !428, size: 64, align: 64, offset: 1664)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !60, line: 1621, size: 192, align: 64, elements: !459, identifier: "_ZTSN3pov13istack_structE")
!459 = !{!460, !462, !464, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1623, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1624, baseType: !463, size: 64, align: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1625, baseType: !225, size: 32, align: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1626, baseType: !225, size: 32, align: 32, offset: 160)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !60, line: 1596, size: 1600, align: 64, elements: !467, identifier: "_ZTSN3pov10istk_entryE")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1598, baseType: !131, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1599, baseType: !182, size: 192, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1600, baseType: !182, size: 192, align: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1601, baseType: !182, size: 192, align: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1602, baseType: !129, size: 128, align: 64, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1603, baseType: !199, size: 64, align: 64, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !82, size: 32, align: 32, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !82, size: 32, align: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !131, size: 64, align: 64, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !131, size: 64, align: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !131, size: 64, align: 64, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !131, size: 64, align: 64, offset: 1088)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !131, size: 64, align: 64, offset: 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !131, size: 64, align: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !131, size: 64, align: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !131, size: 64, align: 64, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !131, size: 64, align: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1616, baseType: !248, size: 64, align: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1618, baseType: !248, size: 64, align: 64, offset: 1536)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !60, line: 1002, size: 2048, align: 64, elements: !488, identifier: "_ZTSN3pov16Transform_StructE")
!488 = !{!489, !494}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1004, baseType: !490, size: 1024, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !60, line: 679, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 1024, align: 64, elements: !492)
!492 = !{!493, !493}
!493 = !DISubrange(count: 4)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1005, baseType: !490, size: 1024, align: 64, offset: 1024)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !60, line: 1345, size: 1664, align: 64, elements: !496, identifier: "_ZTSN3pov14Texture_StructE")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !514, !515}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !137, size: 16, align: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !137, size: 16, align: 16, offset: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !137, size: 16, align: 16, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !82, size: 32, align: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !108, size: 32, align: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !108, size: 32, align: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !108, size: 32, align: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !148, size: 64, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !151, size: 64, align: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !126, size: 64, align: 64, offset: 1280)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1348, baseType: !120, size: 64, align: 64, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1349, baseType: !123, size: 64, align: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1350, baseType: !512, size: 64, align: 64, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !60, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1351, baseType: !126, size: 64, align: 64, offset: 1536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1352, baseType: !82, size: 32, align: 32, offset: 1600)
!516 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, size: 896, align: 64, elements: !517, identifier: "_ZTSN3pov14Texture_StructUt_E")
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !176, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !179, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !108, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !120, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !199, size: 64, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 256, align: 64, elements: !535, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !108, size: 32, align: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64, offset: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 64, align: 32, elements: !539, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !108, size: 32, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !108, size: 32, align: 32, offset: 32)
!542 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 320, align: 64, elements: !543, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64, offset: 128)
!547 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 896, align: 64, elements: !548, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !302, size: 64, align: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !82, size: 32, align: 32, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64, offset: 704)
!557 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 832, align: 64, elements: !558, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !182, size: 192, align: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16, offset: 400)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !129, size: 128, align: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !129, size: 128, align: 64, offset: 704)
!567 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 384, align: 64, elements: !568, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!568 = !{!569, !570, !571, !572, !573, !574, !575}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !129, size: 128, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16, offset: 144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !98, size: 16, align: 16, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !131, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !82, size: 32, align: 32, offset: 320)
!576 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 128, align: 64, elements: !577, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !248, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !248, size: 64, align: 64, offset: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !60, line: 1334, size: 1344, align: 64, elements: !581, identifier: "_ZTSN3pov14Tnormal_StructE")
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !137, size: 16, align: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !137, size: 16, align: 16, offset: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !137, size: 16, align: 16, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !82, size: 32, align: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !108, size: 32, align: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !108, size: 32, align: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !108, size: 32, align: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !148, size: 64, align: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !151, size: 64, align: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1337, baseType: !108, size: 32, align: 32, offset: 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1338, baseType: !108, size: 32, align: 32, offset: 1312)
!595 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, size: 896, align: 64, elements: !596, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !176, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !179, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !108, size: 32, align: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !120, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !199, size: 64, align: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 256, align: 64, elements: !614, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !60, line: 1336, baseType: !108, size: 32, align: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64, offset: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 64, align: 32, elements: !618, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !60, line: 1336, baseType: !108, size: 32, align: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !60, line: 1336, baseType: !108, size: 32, align: 32, offset: 32)
!621 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 320, align: 64, elements: !622, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64, offset: 128)
!626 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 896, align: 64, elements: !627, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !302, size: 64, align: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !82, size: 32, align: 32, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64, offset: 704)
!636 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 832, align: 64, elements: !637, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !182, size: 192, align: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16, offset: 400)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !129, size: 128, align: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !129, size: 128, align: 64, offset: 704)
!646 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 384, align: 64, elements: !647, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!647 = !{!648, !649, !650, !651, !652, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !129, size: 128, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16, offset: 144)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !98, size: 16, align: 16, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !131, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !82, size: 32, align: 32, offset: 320)
!655 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 128, align: 64, elements: !656, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !60, line: 1336, baseType: !248, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !60, line: 1336, baseType: !248, size: 64, align: 64, offset: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !60, line: 1356, size: 928, align: 32, elements: !660, identifier: "_ZTSN3pov13Finish_StructE")
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !680, !681, !682, !683, !684, !685}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !108, size: 32, align: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !108, size: 32, align: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !108, size: 32, align: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !108, size: 32, align: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !108, size: 32, align: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !108, size: 32, align: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !108, size: 32, align: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !108, size: 32, align: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !108, size: 32, align: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !108, size: 32, align: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !108, size: 32, align: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !108, size: 32, align: 32, offset: 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !108, size: 32, align: 32, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !108, size: 32, align: 32, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1363, baseType: !108, size: 32, align: 32, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1363, baseType: !108, size: 32, align: 32, offset: 480)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !678, size: 96, align: 32, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !60, line: 682, baseType: !679)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 96, align: 32, elements: !184)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !678, size: 96, align: 32, offset: 608)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !678, size: 96, align: 32, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1365, baseType: !108, size: 32, align: 32, offset: 800)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1366, baseType: !82, size: 32, align: 32, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1367, baseType: !108, size: 32, align: 32, offset: 864)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1368, baseType: !82, size: 32, align: 32, offset: 896)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !60, line: 1566, size: 3456, align: 64, elements: !687, identifier: "_ZTSN3pov19Light_Source_StructE")
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !732, !733, !734, !735}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !331, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !82, size: 32, align: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !199, size: 64, align: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !126, size: 64, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !126, size: 64, align: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !338, size: 64, align: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !199, size: 64, align: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !199, size: 64, align: 64, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !343, size: 64, align: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !346, size: 192, align: 32, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !348, size: 64, align: 64, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !348, size: 64, align: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !108, size: 32, align: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !225, size: 32, align: 32, offset: 928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !199, size: 64, align: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1569, baseType: !115, size: 160, align: 32, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !182, size: 192, align: 64, offset: 1216)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !182, size: 192, align: 64, offset: 1408)
