; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::mem_node" = type { i64, %"struct.pov::mem_node"*, %"struct.pov::mem_node"*, i32, i8*, i32 }
%"class.pov_base::OStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@_ZN3povL9num_nodesE = internal unnamed_addr global i64 0, align 8
@_ZN3povL6poolnoE = internal unnamed_addr global i32 0, align 4
@_ZN3povL7memlistE = internal unnamed_addr global %"struct.pov::mem_node"* null, align 8
@_ZN3povL8leak_msgE = internal unnamed_addr global i1 false
@.str = private unnamed_addr constant [55 x i8] c"Attempt to malloc zero size block (File: %s Line: %d).\00", align 1
@.str1 = private unnamed_addr constant [55 x i8] c"Attempt to calloc zero size block (File: %s Line: %d).\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"Attempt to free NULL pointer (File: %s Line: %d).\00", align 1
@.str3 = private unnamed_addr constant [11 x i8] c"Memory.Log\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !53, subprograms: !262, globals: !375, imports: !384)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !29}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 51, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!8 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!9 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!10 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!11 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!12 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!13 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!14 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!15 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!16 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!17 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!18 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!19 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!20 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!21 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!22 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!23 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!24 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!25 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!26 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!27 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!28 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !31, file: !30, line: 54, size: 32, align: 32, elements: !33)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DINamespace(name: "pov", scope: null, file: !32, line: 36)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!34 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1)
!35 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2)
!36 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3)
!37 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4)
!38 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5)
!39 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6)
!40 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7)
!41 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8)
!42 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9)
!43 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10)
!44 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11)
!45 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12)
!46 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13)
!47 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14)
!48 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15)
!49 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16)
!50 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17)
!51 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18)
!52 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19)
!53 = !{!54, !60, !65, !70, !87, !79, !88, !89, !146, !206, !251, !255, !77, !58, !256}
!54 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 82, size: 64, align: 32, elements: !56, identifier: "_ZTS5div_t")
!55 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !55, line: 83, baseType: !58, size: 32, align: 32)
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !55, line: 84, baseType: !58, size: 32, align: 32, offset: 32)
!60 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 87, size: 128, align: 64, elements: !61, identifier: "_ZTS6ldiv_t")
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !55, line: 88, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !55, line: 89, baseType: !63, size: 64, align: 64, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 93, size: 128, align: 64, elements: !66, identifier: "_ZTS7lldiv_t")
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !55, line: 94, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !55, line: 95, baseType: !68, size: 64, align: 64, offset: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "mem_node", scope: !31, file: !1, line: 184, size: 384, align: 64, elements: !71, identifier: "_ZTSN3pov8mem_nodeE")
!71 = !{!72, !78, !80, !81, !82, !86}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTSN3pov8mem_nodeE", file: !1, line: 191, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 30, baseType: !75)
!74 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !76, line: 92, baseType: !77)
!76 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !"_ZTSN3pov8mem_nodeE", file: !1, line: 195, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov8mem_nodeE", size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov8mem_nodeE", file: !1, line: 196, baseType: !79, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "poolno", scope: !"_ZTSN3pov8mem_nodeE", file: !1, line: 197, baseType: !58, size: 32, align: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !"_ZTSN3pov8mem_nodeE", file: !1, line: 200, baseType: !83, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !"_ZTSN3pov8mem_nodeE", file: !1, line: 201, baseType: !58, size: 32, align: 32, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !4, line: 150, size: 320, align: 64, elements: !90, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!90 = !{!91, !92, !98, !101, !104, !109, !113, !116, !119, !122, !125, !129, !132, !133, !137, !138, !141, !142, !145}
!91 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!92 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 153, type: !93, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !96}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!98 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 154, type: !99, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !95}
!101 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 156, type: !102, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !95, !83, null}
!104 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 158, type: !105, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !95, !108}
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!108 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!109 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 159, type: !110, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!107, !95, !112}
!112 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!113 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 160, type: !114, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!114 = !DISubroutineType(types: !115)
!115 = !{!107, !95, !97}
!116 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 161, type: !117, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{!107, !95, !77}
!119 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 162, type: !120, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!120 = !DISubroutineType(types: !121)
!121 = !{!107, !95}
!122 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 164, type: !123, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!123 = !DISubroutineType(types: !124)
!124 = !{!107, !95, !83}
!125 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 165, type: !126, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!126 = !DISubroutineType(types: !127)
!127 = !{!107, !95, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!129 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 166, type: !130, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{!107, !95, !85}
!132 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 167, type: !105, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 168, type: !134, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!134 = !DISubroutineType(types: !135)
!135 = !{!107, !95, !136}
!136 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!137 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 169, type: !110, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 170, type: !139, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{!107, !95, !58}
!141 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 171, type: !114, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 172, type: !143, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{!107, !95, !63}
!145 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 173, type: !117, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !4, line: 84, size: 320, align: 64, elements: !147, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!147 = !{!148, !153, !155, !159, !160, !161, !162, !166, !169, !172, !175, !179, !180, !183, !186, !187, !188, !191, !194, !197, !202, !205}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !149, size: 64, flags: DIFlagArtificial)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!58}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !154, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!154 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !156, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !158, line: 153, baseType: !"_ZTS7__sFILE")
!158 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !97, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !97, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !88, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!162 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !163, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !165, !97, !97}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!166 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !167, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !165}
!169 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !170, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubroutineType(types: !171)
!171 = !{!154, !165, !83, !97}
!172 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !173, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{!154, !165}
!175 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !176, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !165, !87, !77}
!178 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!179 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !176, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !181, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!178, !165, !77, !97}
!183 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !184, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!184 = !DISubroutineType(types: !185)
!185 = !{!97, !165}
!186 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !184, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!187 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !173, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!188 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !189, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!77, !165}
!191 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !192, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubroutineType(types: !193)
!193 = !{!178, !165}
!194 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !195, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!195 = !DISubroutineType(types: !196)
!196 = !{!83, !165}
!197 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !198, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{!87, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!202 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !203, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{!154, !200}
!205 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !192, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !158, line: 122, size: 1216, align: 64, elements: !207, identifier: "_ZTS7__sFILE")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !220, !224, !232, !236, !237, !239, !240, !244, !248, !249, !250}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !158, line: 123, baseType: !128, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !158, line: 124, baseType: !58, size: 32, align: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !158, line: 125, baseType: !58, size: 32, align: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !158, line: 126, baseType: !136, size: 16, align: 16, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !158, line: 127, baseType: !136, size: 16, align: 16, offset: 144)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !158, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !158, line: 129, baseType: !58, size: 32, align: 32, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !158, line: 132, baseType: !87, size: 64, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !158, line: 133, baseType: !217, size: 64, align: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!58, !87}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !158, line: 134, baseType: !221, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!58, !87, !88, !58}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !158, line: 135, baseType: !225, size: 64, align: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !87, !228, !58}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !158, line: 77, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !230, line: 71, baseType: !231)
!230 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !76, line: 46, baseType: !68)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !158, line: 136, baseType: !233, size: 64, align: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!58, !87, !83, !58}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !158, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !158, line: 140, baseType: !238, size: 64, align: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !158, line: 141, baseType: !58, size: 32, align: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !158, line: 144, baseType: !241, size: 24, align: 8, offset: 928)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 24, align: 8, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 3)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !158, line: 145, baseType: !245, size: 8, align: 8, offset: 952)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8, align: 8, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !158, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !158, line: 151, baseType: !58, size: 32, align: 32, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !158, line: 152, baseType: !228, size: 64, align: 64, offset: 1152)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !158, line: 88, size: 128, align: 64, elements: !252, identifier: "_ZTS6__sbuf")
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !158, line: 89, baseType: !128, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !158, line: 90, baseType: !58, size: 32, align: 32, offset: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !158, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemStats_Struct", scope: !31, file: !1, line: 278, size: 256, align: 64, elements: !257, identifier: "_ZTSN3pov15MemStats_StructE")
!257 = !{!258, !259, !260, !261}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "smallest_alloc", scope: !"_ZTSN3pov15MemStats_StructE", file: !1, line: 280, baseType: !73, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "largest_alloc", scope: !"_ZTSN3pov15MemStats_StructE", file: !1, line: 281, baseType: !73, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "current_mem_usage", scope: !"_ZTSN3pov15MemStats_StructE", file: !1, line: 282, baseType: !73, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "largest_mem_usage", scope: !"_ZTSN3pov15MemStats_StructE", file: !1, line: 283, baseType: !73, size: 64, align: 64, offset: 192)
!262 = !{!263, !267, !278, !289, !303, !312, !313, !320, !326, !332, !348, !351, !352, !353, !354, !359, !362, !363, !370}
!263 = !DISubprogram(name: "mem_init", linkageName: "_ZN3pov8mem_initEv", scope: !31, file: !1, line: 307, type: !264, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov8mem_initEv, variables: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{null}
!266 = !{}
!267 = !DISubprogram(name: "pov_malloc", linkageName: "_ZN3pov10pov_mallocEmPKciS1_", scope: !31, file: !1, line: 345, type: !268, isLocal: false, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i8*, i32, i8*)* @_ZN3pov10pov_mallocEmPKciS1_, variables: !270)
!268 = !DISubroutineType(types: !269)
!269 = !{!87, !73, !83, !58, !83}
!270 = !{!271, !272, !273, !274, !275, !276, !277}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !267, file: !1, line: 345, type: !73)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 2, scope: !267, file: !1, line: 345, type: !83)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 3, scope: !267, file: !1, line: 345, type: !58)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 4, scope: !267, file: !1, line: 345, type: !83)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !267, file: !1, line: 347, type: !87)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totalsize", scope: !267, file: !1, line: 348, type: !73)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !267, file: !1, line: 350, type: !79)
!278 = !DISubprogram(name: "pov_calloc", linkageName: "_ZN3pov10pov_callocEmmPKciS1_", scope: !31, file: !1, line: 416, type: !279, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i64, i8*, i32, i8*)* @_ZN3pov10pov_callocEmmPKciS1_, variables: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{!87, !73, !73, !83, !58, !83}
!281 = !{!282, !283, !284, !285, !286, !287, !288}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nitems", arg: 1, scope: !278, file: !1, line: 416, type: !73)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !278, file: !1, line: 416, type: !73)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !278, file: !1, line: 416, type: !83)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 4, scope: !278, file: !1, line: 416, type: !58)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 5, scope: !278, file: !1, line: 416, type: !83)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !278, file: !1, line: 418, type: !87)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "actsize", scope: !278, file: !1, line: 419, type: !73)
!289 = !DISubprogram(name: "pov_realloc", linkageName: "_ZN3pov11pov_reallocEPvmPKciS2_", scope: !31, file: !1, line: 440, type: !290, isLocal: false, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64, i8*, i32, i8*)* @_ZN3pov11pov_reallocEPvmPKciS2_, variables: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{!87, !87, !73, !83, !58, !83}
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !289, file: !1, line: 440, type: !87)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !289, file: !1, line: 440, type: !73)
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !289, file: !1, line: 440, type: !83)
