; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_util.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov_base::POV_File_Extensions" = type { [4 x i8*] }
%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !29, subprograms: !314, globals: !397, imports: !398)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_util.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 51, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!8 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!9 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!10 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!11 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!12 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!13 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!14 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!15 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!16 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!17 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!18 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!19 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!20 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!21 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!22 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!23 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!24 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!25 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!26 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!27 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!28 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!29 = !{!30, !36, !41, !34, !46, !47, !54, !62, !68, !74, !149, !211, !258, !262, !263}
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 82, size: 64, align: 32, elements: !32, identifier: "_ZTS5div_t")
!31 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !31, line: 83, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !31, line: 84, baseType: !34, size: 32, align: 32, offset: 32)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 87, size: 128, align: 64, elements: !37, identifier: "_ZTS6ldiv_t")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !31, line: 88, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !31, line: 89, baseType: !39, size: 64, align: 64, offset: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 93, size: 128, align: 64, elements: !42, identifier: "_ZTS7lldiv_t")
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !31, line: 94, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !31, line: 95, baseType: !44, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !48, line: 178, size: 128, align: 64, elements: !49, identifier: "_ZTS9POVMSData")
!48 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !{!50, !52, !53}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !48, line: 180, baseType: !51, size: 32, align: 32)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !48, line: 181, baseType: !34, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !48, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!54 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !48, line: 182, size: 64, align: 64, elements: !55, identifier: "_ZTSN9POVMSDataUt_E")
!55 = !{!56, !58, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !48, line: 184, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !48, line: 185, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !48, line: 186, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !48, line: 190, size: 320, align: 64, elements: !63, identifier: "_ZTS9POVMSNode")
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !48, line: 192, baseType: !61, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !48, line: 193, baseType: !61, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !48, line: 194, baseType: !51, size: 32, align: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !48, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 204, size: 192, align: 64, elements: !69, identifier: "_ZTS13__va_list_tag")
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, line: 204, baseType: !51, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, line: 204, baseType: !51, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, line: 204, baseType: !57, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, line: 204, baseType: !57, size: 64, align: 64, offset: 128)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !4, line: 118, size: 320, align: 64, elements: !75, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!75 = !{!76, !77, !82, !85, !88, !89, !90, !93, !99, !104, !109, !114, !118, !122, !126, !131, !132, !133, !134, !135, !136, !137, !138, !139, !142, !146}
!76 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!77 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 121, type: !78, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80, !81}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!82 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 122, type: !83, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !80}
!85 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 124, type: !86, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!86 = !DISubroutineType(types: !87)
!87 = !{!34, !80}
!88 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 125, type: !86, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!89 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 126, type: !86, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!90 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 127, type: !91, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!91 = !DISubroutineType(types: !92)
!92 = !{!39, !80}
!93 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 128, type: !94, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !80, !97}
!96 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!97 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 129, type: !100, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!100 = !DISubroutineType(types: !101)
!101 = !{!96, !80, !102}
!102 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !103)
!103 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!104 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 130, type: !105, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!105 = !DISubroutineType(types: !106)
!106 = !{!96, !80, !107}
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108)
!108 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!109 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 131, type: !110, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!96, !80, !112}
!112 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !113)
!113 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!114 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 132, type: !115, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!115 = !DISubroutineType(types: !116)
!116 = !{!96, !80, !117}
!117 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!118 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 133, type: !119, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!119 = !DISubroutineType(types: !120)
!120 = !{!96, !80, !121}
!121 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !51)
!122 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 134, type: !123, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!123 = !DISubroutineType(types: !124)
!124 = !{!96, !80, !125}
!125 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39)
!126 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 135, type: !127, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{!96, !80, !129}
!129 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !130)
!130 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!131 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 137, type: !123, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!132 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 138, type: !115, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!133 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 139, type: !105, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!134 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 140, type: !94, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 141, type: !127, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!136 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 142, type: !119, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!137 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 143, type: !110, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 144, type: !100, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 145, type: !140, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!140 = !DISubroutineType(types: !141)
!141 = !{!96, !80, !34}
!142 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 146, type: !143, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{!96, !80, !145, !130}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!146 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 147, type: !147, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubroutineType(types: !148)
!148 = !{!96, !80, !130}
!149 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !4, line: 84, size: 320, align: 64, elements: !150, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!150 = !{!151, !156, !158, !162, !163, !164, !165, !169, !172, !177, !180, !184, !185, !188, !191, !192, !193, !196, !199, !202, !207, !210}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !152, size: 64, flags: DIFlagArtificial)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!34}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !157, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!157 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !159, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !161, line: 153, baseType: !"_ZTS7__sFILE")
!161 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !51, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !51, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !145, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!165 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !166, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !51, !51}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!169 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !170, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !168}
!172 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !173, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!173 = !DISubroutineType(types: !174)
!174 = !{!157, !168, !175, !51}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!177 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !178, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{!157, !168}
!180 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !181, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !168, !57, !130}
!183 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!184 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !181, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!185 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !186, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!183, !168, !130, !51}
!188 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !189, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubroutineType(types: !190)
!190 = !{!51, !168}
!191 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !189, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!192 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !178, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!193 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !194, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{!130, !168}
!196 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !197, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{!183, !168}
!199 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !200, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{!175, !168}
!202 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !203, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{!57, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!207 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !208, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{!157, !205}
!210 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !197, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !161, line: 122, size: 1216, align: 64, elements: !212, identifier: "_ZTS7__sFILE")
!212 = !{!213, !215, !216, !217, !218, !219, !220, !221, !222, !226, !230, !239, !243, !244, !246, !247, !251, !255, !256, !257}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !161, line: 123, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !161, line: 124, baseType: !34, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !161, line: 125, baseType: !34, size: 32, align: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !161, line: 126, baseType: !108, size: 16, align: 16, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !161, line: 127, baseType: !108, size: 16, align: 16, offset: 144)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !161, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !161, line: 129, baseType: !34, size: 32, align: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !161, line: 132, baseType: !57, size: 64, align: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !161, line: 133, baseType: !223, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!34, !57}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !161, line: 134, baseType: !227, size: 64, align: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!34, !57, !145, !34}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !161, line: 135, baseType: !231, size: 64, align: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !57, !234, !34}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !161, line: 77, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !236, line: 71, baseType: !237)
!236 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !238, line: 46, baseType: !44)
!238 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !161, line: 136, baseType: !240, size: 64, align: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!34, !57, !175, !34}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !161, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !161, line: 140, baseType: !245, size: 64, align: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !161, line: 141, baseType: !34, size: 32, align: 32, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !161, line: 144, baseType: !248, size: 24, align: 8, offset: 928)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 24, align: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 3)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !161, line: 145, baseType: !252, size: 8, align: 8, offset: 952)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8, align: 8, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 1)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !161, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !161, line: 151, baseType: !34, size: 32, align: 32, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !161, line: 152, baseType: !234, size: 64, align: 64, offset: 1152)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !161, line: 88, size: 128, align: 64, elements: !259, identifier: "_ZTS6__sbuf")
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !161, line: 89, baseType: !214, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !161, line: 90, baseType: !34, size: 32, align: 32, offset: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !161, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!263 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !4, line: 150, size: 320, align: 64, elements: !264, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!264 = !{!265, !266, !270, !273, !276, !280, !283, !286, !289, !292, !295, !298, !301, !302, !305, !306, !309, !310, !313}
!265 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!266 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 153, type: !267, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !269, !81}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!270 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 154, type: !271, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !269}
!273 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 156, type: !274, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !269, !175, null}
!276 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 158, type: !277, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !269, !103}
!279 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!280 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 159, type: !281, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{!279, !269, !113}
!283 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 160, type: !284, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!279, !269, !51}
!286 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 161, type: !287, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!279, !269, !130}
!289 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 162, type: !290, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{!279, !269}
!292 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 164, type: !293, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!293 = !DISubroutineType(types: !294)
!294 = !{!279, !269, !175}
