; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"struct.pov::Frame_Struct" = type { %"struct.pov::Camera_Struct"*, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Object_Struct"*, double, double, double, [5 x float], [5 x float], [5 x float], %"struct.pov::Media_Struct"*, %"struct.pov::Fog_Struct"*, %"struct.pov::Rainbow_Struct"*, %"struct.pov::Skysphere_Struct"*, %"struct.pov::light_group_light_struct"* }

!347 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!348 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!349 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!350 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!351 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!352 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!353 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!354 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!355 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!356 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!357 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!358 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!359 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!360 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!361 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!362 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!363 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!364 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!365 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!366 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!367 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!368 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!369 = !DIEnumerator(name: "Media_Samples", value: 99)
!370 = !DIEnumerator(name: "Media_Intervals", value: 100)
!371 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!372 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!373 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!374 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!375 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!376 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!377 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!378 = !DIEnumerator(name: "nChecked", value: 108)
!379 = !DIEnumerator(name: "nEnqueued", value: 109)
!380 = !DIEnumerator(name: "totalQueues", value: 110)
!381 = !DIEnumerator(name: "totalQueueResets", value: 111)
!382 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!383 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!384 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!385 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!386 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!387 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!388 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!389 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!390 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!391 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!392 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!393 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!394 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!395 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!396 = !DIEnumerator(name: "MaxStat", value: 126)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, align: 32, elements: !398)
!398 = !{!399, !400, !401, !402}
!399 = !DIEnumerator(name: "kPOVMsgClass_RenderControl", value: 1131704940)
!400 = !DIEnumerator(name: "kPOVMsgClass_RenderOutput", value: 1333097584)
!401 = !DIEnumerator(name: "kPOVMsgClass_IniOptions", value: 1231972687)
!402 = !DIEnumerator(name: "kPOVMsgClass_Miscellaneous", value: 1298756451)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 78, size: 32, align: 32, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!405 = !DIEnumerator(name: "kPOVMsgIdent_InitInfo", value: 1231964526)
!406 = !DIEnumerator(name: "kPOVMsgIdent_RenderOptions", value: 1380937844)
!407 = !DIEnumerator(name: "kPOVMsgIdent_RenderAll", value: 1380019308)
!408 = !DIEnumerator(name: "kPOVMsgIdent_RenderArea", value: 1380020837)
!409 = !DIEnumerator(name: "kPOVMsgIdent_RenderPause", value: 1380999541)
!410 = !DIEnumerator(name: "kPOVMsgIdent_RenderStop", value: 1381201007)
!411 = !DIEnumerator(name: "kPOVMsgIdent_RenderStarted", value: 1381135726)
!412 = !DIEnumerator(name: "kPOVMsgIdent_RenderDone", value: 1380281956)
!413 = !DIEnumerator(name: "kPOVMsgIdent_FrameStatistics", value: 1179874401)
!414 = !DIEnumerator(name: "kPOVMsgIdent_ParseStatistics", value: 1347646561)
!415 = !DIEnumerator(name: "kPOVMsgIdent_RenderStatistics", value: 1381200993)
!416 = !DIEnumerator(name: "kPOVMsgIdent_Progress", value: 1349676903)
!417 = !DIEnumerator(name: "kPOVMsgIdent_Warning", value: 1466004078)
!418 = !DIEnumerator(name: "kPOVMsgIdent_Error", value: 1165128279)
!419 = !DIEnumerator(name: "kPOVMsgIdent_FatalError", value: 1165128262)
!420 = !DIEnumerator(name: "kPOVMsgIdent_Debug", value: 1147303271)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 198, size: 32, align: 32, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIEnumerator(name: "kPOVMSSendMode_Invalid", value: 0)
!424 = !DIEnumerator(name: "kPOVMSSendMode_NoReply", value: 1)
!425 = !DIEnumerator(name: "kPOVMSSendMode_WaitReply", value: 2)
!426 = !DIEnumerator(name: "kPOVMSSendMode_WantReceipt", value: 3)
!427 = !{!428, !434, !439, !444, !499, !503, !504, !511, !516, !523, !529, !3, !458, !258, !267, !432, !538}
!428 = !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 82, size: 64, align: 32, elements: !430, identifier: "_ZTS5div_t")
!429 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!430 = !{!431, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !429, line: 83, baseType: !432, size: 32, align: 32)
!432 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !429, line: 84, baseType: !432, size: 32, align: 32, offset: 32)
!434 = !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 87, size: 128, align: 64, elements: !435, identifier: "_ZTS6ldiv_t")
!435 = !{!436, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !429, line: 88, baseType: !437, size: 64, align: 64)
!437 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !429, line: 89, baseType: !437, size: 64, align: 64, offset: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 93, size: 128, align: 64, elements: !440, identifier: "_ZTS7lldiv_t")
!440 = !{!441, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !429, line: 94, baseType: !442, size: 64, align: 64)
!442 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !429, line: 95, baseType: !442, size: 64, align: 64, offset: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !445, line: 122, size: 1216, align: 64, elements: !446, identifier: "_ZTS7__sFILE")
!445 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!446 = !{!447, !450, !451, !452, !454, !455, !456, !457, !459, !463, !469, !478, !484, !485, !487, !488, !492, !496, !497, !498}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !445, line: 123, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !445, line: 124, baseType: !432, size: 32, align: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !445, line: 125, baseType: !432, size: 32, align: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !445, line: 126, baseType: !453, size: 16, align: 16, offset: 128)
!453 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !445, line: 127, baseType: !453, size: 16, align: 16, offset: 144)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !445, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !445, line: 129, baseType: !432, size: 32, align: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !445, line: 132, baseType: !458, size: 64, align: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !445, line: 133, baseType: !460, size: 64, align: 64, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!432, !458}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !445, line: 134, baseType: !464, size: 64, align: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!432, !458, !467, !432}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !445, line: 135, baseType: !470, size: 64, align: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !458, !473, !432}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !445, line: 77, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !475, line: 71, baseType: !476)
!475 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !477, line: 46, baseType: !442)
!477 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !445, line: 136, baseType: !479, size: 64, align: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!432, !458, !482, !432}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !445, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !445, line: 140, baseType: !486, size: 64, align: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !445, line: 141, baseType: !432, size: 32, align: 32, offset: 896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !445, line: 144, baseType: !489, size: 24, align: 8, offset: 928)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 24, align: 8, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 3)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !445, line: 145, baseType: !493, size: 8, align: 8, offset: 952)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 8, align: 8, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 1)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !445, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !445, line: 151, baseType: !432, size: 32, align: 32, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !445, line: 152, baseType: !473, size: 64, align: 64, offset: 1152)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !445, line: 88, size: 128, align: 64, elements: !500, identifier: "_ZTS6__sbuf")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !445, line: 89, baseType: !448, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !445, line: 90, baseType: !432, size: 32, align: 32, offset: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !445, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !505, identifier: "_ZTS13__va_list_tag")
!505 = !{!506, !508, !509, !510}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !507, size: 32, align: 32)
!507 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !507, size: 32, align: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !458, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !458, size: 64, align: 64, offset: 128)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !240, line: 178, size: 128, align: 64, elements: !512, identifier: "_ZTS9POVMSData")
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !240, line: 180, baseType: !507, size: 32, align: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !240, line: 181, baseType: !432, size: 32, align: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !240, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!516 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !240, line: 182, size: 64, align: 64, elements: !517, identifier: "_ZTSN9POVMSDataUt_E")
!517 = !{!518, !519, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !240, line: 184, baseType: !458, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !240, line: 185, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !240, line: 186, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !240, line: 190, size: 320, align: 64, elements: !524, identifier: "_ZTS9POVMSNode")
!524 = !{!525, !526, !527, !528}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !240, line: 192, baseType: !522, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !240, line: 193, baseType: !522, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !240, line: 194, baseType: !507, size: 32, align: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !240, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "shelldata", scope: !5, file: !4, line: 84, size: 2080, align: 32, elements: !530, identifier: "_ZTSN3pov9shelldataE")
!530 = !{!531, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Ret", scope: !"_ZTSN3pov9shelldataE", file: !4, line: 86, baseType: !532, size: 32, align: 32)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHELLRET", scope: !5, file: !4, line: 82, baseType: !"_ZTSN3pov8shellretE")
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Inverse", scope: !"_ZTSN3pov9shelldataE", file: !4, line: 87, baseType: !432, size: 32, align: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Command", scope: !"_ZTSN3pov9shelldataE", file: !4, line: 88, baseType: !535, size: 2000, align: 8, offset: 64)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 2000, align: 8, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 250)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "__less<int, int>", scope: !540, file: !539, line: 699, size: 8, align: 8, elements: !543, templateParams: !552, identifier: "_ZTSNSt3__16__lessIiiEE")
!539 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/algorithm", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!540 = !DINamespace(name: "__1", scope: !542, file: !541, line: 369)
!541 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!542 = !DINamespace(name: "std", scope: null, file: !541, line: 368)
!543 = !{!544}
!544 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt3__16__lessIiiEclERKiS3_", scope: !"_ZTSNSt3__16__lessIiiEE", file: !539, line: 702, type: !545, isLocal: false, isDefinition: false, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{!547, !548, !550, !550}
!547 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16__lessIiiEE")
!550 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!552 = !{!553, !554}
!553 = !DITemplateTypeParameter(name: "_T1", type: !432)
!554 = !DITemplateTypeParameter(name: "_T2", type: !432)
!555 = !{!556, !572, !584, !603, !607, !621, !630, !637, !647, !663, !671, !680, !686, !690, !697, !701, !706, !714, !721, !729, !738}
!556 = !DISubprogram(name: "BuildCommand", linkageName: "_ZN3pov12BuildCommandEP9POVMSDatajPNS_9shelldataE", scope: !5, file: !1, line: 137, type: !557, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.POVMSData*, i32, %"struct.pov::shelldata"*)* @_ZN3pov12BuildCommandEP9POVMSDatajPNS_9shelldataE, variables: !562)
!557 = !DISubroutineType(types: !558)
!558 = !{!432, !559, !507, !560}
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !240, line: 173, baseType: !520)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHELLDATA", scope: !5, file: !4, line: 89, baseType: !"_ZTSN3pov9shelldataE")
!562 = !{!563, !564, !565, !566, !568, !569}
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !556, file: !1, line: 137, type: !559)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !556, file: !1, line: 137, type: !507)
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 3, scope: !556, file: !1, line: 137, type: !560)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !556, file: !1, line: 139, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObject", file: !240, line: 173, baseType: !"_ZTS9POVMSData")
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !556, file: !1, line: 140, type: !432)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !570, file: !1, line: 147, type: !432)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 146, column: 4)
!571 = distinct !DILexicalBlock(scope: !556, file: !1, line: 145, column: 7)
