; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.POVMSStreamOrderTables = type { [4 x i32], [4 x i32], [8 x i32], [8 x i32], [4 x i32], [4 x i32], [4 x i32], [4 x i32] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.POVMSContextData = type { i32, %struct.POVMSReceiveHandlerNode*, %struct.POVMS_Sys_QueueNode_Default*, %struct.POVMSData }
%struct.POVMSReceiveHandlerNode = type { %struct.POVMSReceiveHandlerNode*, %struct.POVMSReceiveHandlerNode*, i32, i32, i8*, i32 (%struct.POVMSData*, %struct.POVMSData*, i32, i8*)* }
%struct.POVMS_Sys_QueueNode_Default = type { i32, i32, %struct.POVMS_Sys_QueueDataNode_Default*, %struct.POVMS_Sys_QueueDataNode_Default* }
%struct.POVMS_Sys_QueueDataNode_Default = type { %struct.POVMS_Sys_QueueDataNode_Default*, i8*, i32 }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%struct.POVMSNode = type { %struct.POVMSNode*, %struct.POVMSNode*, i32, %struct.POVMSData }

@POVMSStreamOrderTables = global %struct.POVMSStreamOrderTables zeroinitializer, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !71, subprograms: !168, globals: !922, imports: !924)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !31, !50, !56, !62}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 44, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_err.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 41)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!7 = !DIEnumerator(name: "kNoError", value: 0)
!8 = !DIEnumerator(name: "kNoErr", value: 0)
!9 = !DIEnumerator(name: "kParamErr", value: -1)
!10 = !DIEnumerator(name: "kMemFullErr", value: -2)
!11 = !DIEnumerator(name: "kOutOfMemoryErr", value: -2)
!12 = !DIEnumerator(name: "kInvalidDataSizeErr", value: -3)
!13 = !DIEnumerator(name: "kCannotHandleDataErr", value: -4)
!14 = !DIEnumerator(name: "kNullPointerErr", value: -5)
!15 = !DIEnumerator(name: "kChecksumErr", value: -6)
!16 = !DIEnumerator(name: "kParseErr", value: -7)
!17 = !DIEnumerator(name: "kCannotOpenFileErr", value: -8)
!18 = !DIEnumerator(name: "kInvalidDestAddrErr", value: -9)
!19 = !DIEnumerator(name: "kCannotConnectErr", value: -10)
!20 = !DIEnumerator(name: "kDisconnectedErr", value: -11)
!21 = !DIEnumerator(name: "kHostDisconnectedErr", value: -12)
!22 = !DIEnumerator(name: "kNetworkDataErr", value: -13)
!23 = !DIEnumerator(name: "kNetworkConnectionErr", value: -14)
!24 = !DIEnumerator(name: "kObjectAccessErr", value: -15)
!25 = !DIEnumerator(name: "kVersionErr", value: -16)
!26 = !DIEnumerator(name: "kFileDataErr", value: -17)
!27 = !DIEnumerator(name: "kAuthorisationErr", value: -18)
!28 = !DIEnumerator(name: "kDataTypeErr", value: -19)
!29 = !DIEnumerator(name: "kTimeoutErr", value: -20)
!30 = !DIEnumerator(name: "kInvalidContextErr", value: -21)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 151, size: 32, align: 32, elements: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!34 = !DIEnumerator(name: "kPOVMSType_Object", value: 1329744453)
!35 = !DIEnumerator(name: "kPOVMSType_LockedObject", value: 1280262987)
!36 = !DIEnumerator(name: "kPOVMSType_ResultObject", value: 1380275029)
!37 = !DIEnumerator(name: "kPOVMSType_Address", value: 1094992978)
!38 = !DIEnumerator(name: "kPOVMSType_Null", value: 1314212940)
!39 = !DIEnumerator(name: "kPOVMSType_WildCard", value: 707406378)
!40 = !DIEnumerator(name: "kPOVMSType_CString", value: 1129534546)
!41 = !DIEnumerator(name: "kPOVMSType_UnicodeText", value: 1431590996)
!42 = !DIEnumerator(name: "kPOVMSType_Int", value: 1229870132)
!43 = !DIEnumerator(name: "kPOVMSType_Long", value: 1229870136)
!44 = !DIEnumerator(name: "kPOVMSType_Float", value: 1179407412)
!45 = !DIEnumerator(name: "kPOVMSType_Double", value: 1179407416)
!46 = !DIEnumerator(name: "kPOVMSType_Bool", value: 1112493900)
!47 = !DIEnumerator(name: "kPOVMSType_Pixel", value: 1346983988)
!48 = !DIEnumerator(name: "kPOVMSType_Type", value: 1415139397)
!49 = !DIEnumerator(name: "kPOVMSType_List", value: 1279873876)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 198, size: 32, align: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "kPOVMSSendMode_Invalid", value: 0)
!53 = !DIEnumerator(name: "kPOVMSSendMode_NoReply", value: 1)
!54 = !DIEnumerator(name: "kPOVMSSendMode_WaitReply", value: 2)
!55 = !DIEnumerator(name: "kPOVMSSendMode_WantReceipt", value: 3)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 73, size: 32, align: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "kFalseErr", value: 1)
!59 = !DIEnumerator(name: "kOutOfSyncErr", value: 2)
!60 = !DIEnumerator(name: "kNotNowErr", value: 2)
!61 = !DIEnumerator(name: "kQueueFullErr", value: 3)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 140, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70}
!64 = !DIEnumerator(name: "kPOVMSObjectClassID", value: 1329810497)
!65 = !DIEnumerator(name: "kPOVMSMessageClassID", value: 1296256065)
!66 = !DIEnumerator(name: "kPOVMSMessageIdentID", value: 1296647237)
!67 = !DIEnumerator(name: "kPOVMSSourceAddressID", value: 1297306179)
!68 = !DIEnumerator(name: "kPOVMSDestinationAddressID", value: 1296323412)
!69 = !DIEnumerator(name: "kPOVMSMessageTimeoutID", value: 1414485332)
!70 = !DIEnumerator(name: "kPOVMSMessageErrorID", value: 1296388690)
!71 = !{!72, !78, !83, !88, !104, !113, !128, !133, !139, !145, !152, !157, !158, !121, !76, !159, !108, !138, !161, !163, !164, !165, !167, !127, !166, !118, !110, !150}
!72 = !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 82, size: 64, align: 32, elements: !74, identifier: "_ZTS5div_t")
!73 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !73, line: 83, baseType: !76, size: 32, align: 32)
!76 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !73, line: 84, baseType: !76, size: 32, align: 32, offset: 32)
!78 = !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 87, size: 128, align: 64, elements: !79, identifier: "_ZTS6ldiv_t")
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !73, line: 88, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !73, line: 89, baseType: !81, size: 64, align: 64, offset: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 93, size: 128, align: 64, elements: !84, identifier: "_ZTS7lldiv_t")
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !73, line: 94, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !73, line: 95, baseType: !86, size: 64, align: 64, offset: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSStreamOrderTables", file: !1, line: 200, size: 1280, align: 32, elements: !89, identifier: "_ZTS22POVMSStreamOrderTables")
!89 = !{!90, !94, !95, !99, !100, !101, !102, !103}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "int_write", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 202, baseType: !91, size: 128, align: 32)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, align: 32, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "int_read", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 202, baseType: !91, size: 128, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "long_write", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 203, baseType: !96, size: 256, align: 32, offset: 256)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, align: 32, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "long_read", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 203, baseType: !96, size: 256, align: 32, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "float_write", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 204, baseType: !91, size: 128, align: 32, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "float_read", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 204, baseType: !91, size: 128, align: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type_write", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 205, baseType: !91, size: 128, align: 32, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type_read", scope: !"_ZTS22POVMSStreamOrderTables", file: !1, line: 205, baseType: !91, size: 128, align: 32, offset: 1152)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSContextData", file: !1, line: 187, size: 320, align: 64, elements: !105, identifier: "_ZTS16POVMSContextData")
!105 = !{!106, !107, !109, !111}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !"_ZTS16POVMSContextData", file: !1, line: 189, baseType: !76, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "receivehandlerroot", scope: !"_ZTS16POVMSContextData", file: !1, line: 190, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS23POVMSReceiveHandlerNode", size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !"_ZTS16POVMSContextData", file: !1, line: 191, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS27POVMS_Sys_QueueNode_Default", size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !"_ZTS16POVMSContextData", file: !1, line: 192, baseType: !112, size: 128, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObject", file: !32, line: 173, baseType: !"_ZTS9POVMSData")
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSReceiveHandlerNode", file: !1, line: 177, size: 320, align: 64, elements: !114, identifier: "_ZTS23POVMSReceiveHandlerNode")
!114 = !{!115, !116, !117, !119, !120, !122}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS23POVMSReceiveHandlerNode", file: !1, line: 179, baseType: !108, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS23POVMSReceiveHandlerNode", file: !1, line: 180, baseType: !108, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "handledclass", scope: !"_ZTS23POVMSReceiveHandlerNode", file: !1, line: 181, baseType: !118, size: 32, align: 32, offset: 128)
!118 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "handledid", scope: !"_ZTS23POVMSReceiveHandlerNode", file: !1, line: 182, baseType: !118, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "handlerprivatedata", scope: !"_ZTS23POVMSReceiveHandlerNode", file: !1, line: 183, baseType: !121, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !"_ZTS23POVMSReceiveHandlerNode", file: !1, line: 184, baseType: !123, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!76, !126, !126, !76, !121}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !32, line: 173, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !32, line: 178, size: 128, align: 64, elements: !129, identifier: "_ZTS9POVMSData")
!129 = !{!130, !131, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !32, line: 180, baseType: !118, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !32, line: 181, baseType: !76, size: 32, align: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !32, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !32, line: 182, size: 64, align: 64, elements: !134, identifier: "_ZTSN9POVMSDataUt_E")
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !32, line: 184, baseType: !121, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !32, line: 185, baseType: !127, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !32, line: 186, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !32, line: 190, size: 320, align: 64, elements: !140, identifier: "_ZTS9POVMSNode")
!140 = !{!141, !142, !143, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !32, line: 192, baseType: !138, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !32, line: 193, baseType: !138, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !32, line: 194, baseType: !118, size: 32, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !32, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMS_Sys_QueueNode_Default", file: !1, line: 72, size: 192, align: 64, elements: !146, identifier: "_ZTS27POVMS_Sys_QueueNode_Default")
!146 = !{!147, !148, !149, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !"_ZTS27POVMS_Sys_QueueNode_Default", file: !1, line: 74, baseType: !76, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !"_ZTS27POVMS_Sys_QueueNode_Default", file: !1, line: 75, baseType: !76, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !"_ZTS27POVMS_Sys_QueueNode_Default", file: !1, line: 76, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS31POVMS_Sys_QueueDataNode_Default", size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS27POVMS_Sys_QueueNode_Default", file: !1, line: 77, baseType: !150, size: 64, align: 64, offset: 128)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMS_Sys_QueueDataNode_Default", file: !1, line: 65, size: 192, align: 64, elements: !153, identifier: "_ZTS31POVMS_Sys_QueueDataNode_Default")
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS31POVMS_Sys_QueueDataNode_Default", file: !1, line: 67, baseType: !150, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS31POVMS_Sys_QueueDataNode_Default", file: !1, line: 68, baseType: !121, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !"_ZTS31POVMS_Sys_QueueDataNode_Default", file: !1, line: 69, baseType: !76, size: 32, align: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS16POVMSContextData", size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSContext", file: !32, line: 171, baseType: !121)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!168 = !{!169, !177, !183, !191, !201, !212, !221, !244, !270, !282, !288, !294, !302, !306, !316, !323, !331, !339, !346, !353, !361, !368, !382, !389, !395, !403, !410, !417, !425, !432, !440, !448, !457, !463, !469, !473, !477, !488, !496, !504, !510, !514, !521, !531, !540, !550, !557, !563, !568, !574, !581, !585, !592, !597, !602, !605, !611, !619, !629, !635, !641, !647, !651, !659, !667, !670, !677, !683, !691, !696, !702, !711, !720, !729, !738, !746, !753, !764, !775, !784, !795, !811, !821, !832, !838, !843, !864, !873, !878, !883, !888, !900, !912}
!169 = !DISubprogram(name: "POVMS_OpenContext", linkageName: "_Z17POVMS_OpenContextPPv", scope: !1, file: !1, line: 268, type: !170, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**)* @_Z17POVMS_OpenContextPPv, variables: !173)
!170 = !DISubroutineType(types: !171)
!171 = !{!76, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!173 = !{!174, !175, !176}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "contextrefptr", arg: 1, scope: !169, file: !1, line: 268, type: !172)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !169, file: !1, line: 270, type: !157)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !169, file: !1, line: 271, type: !76)
!177 = !DISubprogram(name: "POVMS_CloseContext", linkageName: "_Z18POVMS_CloseContextPv", scope: !1, file: !1, line: 312, type: !178, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @_Z18POVMS_CloseContextPv, variables: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!76, !158}
!180 = !{!181, !182}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "contextref", arg: 1, scope: !177, file: !1, line: 312, type: !158)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !177, file: !1, line: 314, type: !157)
!183 = !DISubprogram(name: "POVMS_GetContextAddress", linkageName: "_Z23POVMS_GetContextAddressPvPS_", scope: !1, file: !1, line: 350, type: !184, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8**)* @_Z23POVMS_GetContextAddressPvPS_, variables: !187)
!184 = !DISubroutineType(types: !185)
!185 = !{!76, !158, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!187 = !{!188, !189, !190}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "contextref", arg: 1, scope: !183, file: !1, line: 350, type: !158)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "addrptr", arg: 2, scope: !183, file: !1, line: 350, type: !186)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !183, file: !1, line: 352, type: !157)
