; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povray.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov_base::PlatformBase" = type { i32 (...)** }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"struct.pov::Texture_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.26, %"struct.pov::Texture_Struct"*, %"struct.pov::Pigment_Struct"*, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Finish_Struct"*, %"struct.pov::Texture_Struct"*, i32 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.18 }
%union.anon.18 = type { %struct.anon.22 }
%struct.anon.22 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }

!240 = !DIEnumerator(name: "kPOVMsgClass_IniOptions", value: 1231972687)
!241 = !DIEnumerator(name: "kPOVMsgClass_Miscellaneous", value: 1298756451)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 78, size: 32, align: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!244 = !DIEnumerator(name: "kPOVMsgIdent_InitInfo", value: 1231964526)
!245 = !DIEnumerator(name: "kPOVMsgIdent_RenderOptions", value: 1380937844)
!246 = !DIEnumerator(name: "kPOVMsgIdent_RenderAll", value: 1380019308)
!247 = !DIEnumerator(name: "kPOVMsgIdent_RenderArea", value: 1380020837)
!248 = !DIEnumerator(name: "kPOVMsgIdent_RenderPause", value: 1380999541)
!249 = !DIEnumerator(name: "kPOVMsgIdent_RenderStop", value: 1381201007)
!250 = !DIEnumerator(name: "kPOVMsgIdent_RenderStarted", value: 1381135726)
!251 = !DIEnumerator(name: "kPOVMsgIdent_RenderDone", value: 1380281956)
!252 = !DIEnumerator(name: "kPOVMsgIdent_FrameStatistics", value: 1179874401)
!253 = !DIEnumerator(name: "kPOVMsgIdent_ParseStatistics", value: 1347646561)
!254 = !DIEnumerator(name: "kPOVMsgIdent_RenderStatistics", value: 1381200993)
!255 = !DIEnumerator(name: "kPOVMsgIdent_Progress", value: 1349676903)
!256 = !DIEnumerator(name: "kPOVMsgIdent_Warning", value: 1466004078)
!257 = !DIEnumerator(name: "kPOVMsgIdent_Error", value: 1165128279)
!258 = !DIEnumerator(name: "kPOVMsgIdent_FatalError", value: 1165128262)
!259 = !DIEnumerator(name: "kPOVMsgIdent_Debug", value: 1147303271)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !262, file: !261, line: 54, size: 32, align: 32, elements: !264)
!261 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DINamespace(name: "pov", scope: null, file: !263, line: 36)
!263 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!265 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1)
!266 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2)
!267 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3)
!268 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4)
!269 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5)
!270 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6)
!271 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7)
!272 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8)
!273 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9)
!274 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10)
!275 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11)
!276 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12)
!277 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13)
!278 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14)
!279 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15)
!280 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16)
!281 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17)
!282 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18)
!283 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "shelltype", scope: !262, file: !285, line: 63, size: 32, align: 32, elements: !286, identifier: "_ZTSN3pov9shelltypeE")
!285 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/userio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "PRE_SCENE_SHL", value: 0)
!288 = !DIEnumerator(name: "PRE_FRAME_SHL", value: 1)
!289 = !DIEnumerator(name: "POST_FRAME_SHL", value: 2)
!290 = !DIEnumerator(name: "POST_SCENE_SHL", value: 3)
!291 = !DIEnumerator(name: "USER_ABORT_SHL", value: 4)
!292 = !DIEnumerator(name: "FATAL_SHL", value: 5)
!293 = !DIEnumerator(name: "MAX_SHL", value: 6)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "shellret", scope: !262, file: !285, line: 74, size: 32, align: 32, elements: !295, identifier: "_ZTSN3pov8shellretE")
!295 = !{!296, !297, !298, !299, !300, !301}
!296 = !DIEnumerator(name: "IGNORE_RET", value: 0)
!297 = !DIEnumerator(name: "QUIT_RET", value: 1)
!298 = !DIEnumerator(name: "USER_RET", value: 2)
!299 = !DIEnumerator(name: "FATAL_RET", value: 3)
!300 = !DIEnumerator(name: "SKIP_ONCE_RET", value: 4)
!301 = !DIEnumerator(name: "ALL_SKIP_RET", value: 5)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 73, size: 32, align: 32, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIEnumerator(name: "kFalseErr", value: 1)
!305 = !DIEnumerator(name: "kOutOfSyncErr", value: 2)
!306 = !DIEnumerator(name: "kNotNowErr", value: 2)
!307 = !DIEnumerator(name: "kQueueFullErr", value: 3)
!308 = !{!309, !315, !320, !325, !380, !384, !385, !392, !420, !490, !545, !596, !313, !611, !638, !696, !704, !711, !747, !766, !771, !777, !783, !880, !924, !966, !973, !988, !1003, !1027, !1085, !32, !1128, !1165, !1267, !1272, !1278, !1303, !1348, !284, !294}
!309 = !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 82, size: 64, align: 32, elements: !311, identifier: "_ZTS5div_t")
!310 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !310, line: 83, baseType: !313, size: 32, align: 32)
!313 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !310, line: 84, baseType: !313, size: 32, align: 32, offset: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 87, size: 128, align: 64, elements: !316, identifier: "_ZTS6ldiv_t")
!316 = !{!317, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !310, line: 88, baseType: !318, size: 64, align: 64)
!318 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !310, line: 89, baseType: !318, size: 64, align: 64, offset: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 93, size: 128, align: 64, elements: !321, identifier: "_ZTS7lldiv_t")
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !310, line: 94, baseType: !323, size: 64, align: 64)
!323 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !310, line: 95, baseType: !323, size: 64, align: 64, offset: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !326, line: 122, size: 1216, align: 64, elements: !327, identifier: "_ZTS7__sFILE")
!326 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!327 = !{!328, !331, !332, !333, !335, !336, !337, !338, !340, !344, !350, !359, !365, !366, !368, !369, !373, !377, !378, !379}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !326, line: 123, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !326, line: 124, baseType: !313, size: 32, align: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !326, line: 125, baseType: !313, size: 32, align: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !326, line: 126, baseType: !334, size: 16, align: 16, offset: 128)
!334 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !326, line: 127, baseType: !334, size: 16, align: 16, offset: 144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !326, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !326, line: 129, baseType: !313, size: 32, align: 32, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !326, line: 132, baseType: !339, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !326, line: 133, baseType: !341, size: 64, align: 64, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!313, !339}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !326, line: 134, baseType: !345, size: 64, align: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!313, !339, !348, !313}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !326, line: 135, baseType: !351, size: 64, align: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !339, !354, !313}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !326, line: 77, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !356, line: 71, baseType: !357)
!356 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !358, line: 46, baseType: !323)
!358 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !326, line: 136, baseType: !360, size: 64, align: 64, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!313, !339, !363, !313}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !326, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !326, line: 140, baseType: !367, size: 64, align: 64, offset: 832)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !326, line: 141, baseType: !313, size: 32, align: 32, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !326, line: 144, baseType: !370, size: 24, align: 8, offset: 928)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 24, align: 8, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 3)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !326, line: 145, baseType: !374, size: 8, align: 8, offset: 952)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 8, align: 8, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 1)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !326, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !326, line: 151, baseType: !313, size: 32, align: 32, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !326, line: 152, baseType: !354, size: 64, align: 64, offset: 1152)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !326, line: 88, size: 128, align: 64, elements: !381, identifier: "_ZTS6__sbuf")
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !326, line: 89, baseType: !329, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !326, line: 90, baseType: !313, size: 32, align: 32, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !326, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !386, identifier: "_ZTS13__va_list_tag")
!386 = !{!387, !389, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !388, size: 32, align: 32)
!388 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !388, size: 32, align: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !339, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !339, size: 64, align: 64, offset: 128)
!392 = !DICompositeType(tag: DW_TAG_class_type, name: "PlatformBase", scope: !5, file: !393, line: 44, size: 64, align: 64, elements: !394, vtableHolder: !"_ZTSN8pov_base12PlatformBaseE", identifier: "_ZTSN8pov_base12PlatformBaseE")
!393 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/platformbase.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!394 = !{!395, !400, !402, !406, !407, !412, !416}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$PlatformBase", scope: !393, file: !393, baseType: !396, size: 64, flags: DIFlagArtificial)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!313}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !"_ZTSN8pov_base12PlatformBaseE", file: !393, line: 55, baseType: !401, flags: DIFlagStaticMember)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base12PlatformBaseE", size: 64, align: 64)
!402 = !DISubprogram(name: "PlatformBase", scope: !"_ZTSN8pov_base12PlatformBaseE", file: !393, line: 47, type: !403, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base12PlatformBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!406 = !DISubprogram(name: "~PlatformBase", scope: !"_ZTSN8pov_base12PlatformBaseE", file: !393, line: 48, type: !403, isLocal: false, isDefinition: false, scopeLine: 48, containingType: !"_ZTSN8pov_base12PlatformBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubprogram(name: "CreateIStream", linkageName: "_ZN8pov_base12PlatformBase13CreateIStreamEj", scope: !"_ZTSN8pov_base12PlatformBaseE", file: !393, line: 50, type: !408, isLocal: false, isDefinition: false, scopeLine: 50, containingType: !"_ZTSN8pov_base12PlatformBaseE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{!410, !405, !411}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!412 = !DISubprogram(name: "CreateOStream", linkageName: "_ZN8pov_base12PlatformBase13CreateOStreamEj", scope: !"_ZTSN8pov_base12PlatformBaseE", file: !393, line: 51, type: !413, isLocal: false, isDefinition: false, scopeLine: 51, containingType: !"_ZTSN8pov_base12PlatformBaseE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !405, !411}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!416 = !DISubprogram(name: "GetPlatformBaseReference", linkageName: "_ZN8pov_base12PlatformBase24GetPlatformBaseReferenceEv", scope: !"_ZTSN8pov_base12PlatformBaseE", file: !393, line: 53, type: !417, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!417 = !DISubroutineType(types: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base12PlatformBaseE")
!420 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !6, line: 118, size: 320, align: 64, elements: !421, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!421 = !{!422, !423, !427, !430, !433, !434, !435, !438, !443, !447, !451, !456, !460, !464, !468, !473, !474, !475, !476, !477, !478, !479, !480, !481, !484, !487}
!422 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!423 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 121, type: !424, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !426, !411}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!427 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 122, type: !428, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !426}
!430 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 124, type: !431, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!431 = !DISubroutineType(types: !432)
!432 = !{!313, !426}
!433 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 125, type: !431, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!434 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 126, type: !431, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 127, type: !436, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!318, !426}
!438 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 128, type: !439, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !426, !442}
!441 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!442 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !349)
!443 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 129, type: !444, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{!441, !426, !446}
!446 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !330)
!447 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 130, type: !448, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{!441, !426, !450}
!450 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !334)
!451 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 131, type: !452, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!441, !426, !454}
!454 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !455)
!455 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!456 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 132, type: !457, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!441, !426, !459}
!459 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !313)
!460 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 133, type: !461, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!441, !426, !463}
!463 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !388)
!464 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 134, type: !465, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{!441, !426, !467}
!467 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !318)
!468 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 135, type: !469, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!469 = !DISubroutineType(types: !470)
!470 = !{!441, !426, !471}
!471 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !472)
!472 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!473 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 137, type: !465, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!474 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 138, type: !457, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!475 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 139, type: !448, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 140, type: !439, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 141, type: !469, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 142, type: !461, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 143, type: !452, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!480 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 144, type: !444, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 145, type: !482, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{!441, !426, !313}
!484 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 146, type: !485, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!441, !426, !348, !472}
!487 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 147, type: !488, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{!441, !426, !472}
!490 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !6, line: 84, size: 320, align: 64, elements: !491, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!491 = !{!492, !493, !495, !498, !499, !500, !501, !505, !508, !511, !514, !518, !519, !522, !525, !526, !527, !530, !533, !536, !541, !544}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !6, file: !6, baseType: !396, size: 64, flags: DIFlagArtificial)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 110, baseType: !494, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!494 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 111, baseType: !496, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !326, line: 153, baseType: !"_ZTS7__sFILE")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 113, baseType: !388, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 114, baseType: !388, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 115, baseType: !348, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!501 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 87, type: !502, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504, !388, !388}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!505 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 88, type: !506, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !504}
!508 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 94, type: !509, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{!494, !504, !363, !388}
!511 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 95, type: !512, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubroutineType(types: !513)
!513 = !{!494, !504}
!514 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 96, type: !515, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubroutineType(types: !516)
!516 = !{!517, !504, !339, !472}
!517 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!518 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 97, type: !515, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 98, type: !520, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubroutineType(types: !521)
!521 = !{!517, !504, !472, !388}
!522 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 100, type: !523, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!523 = !DISubroutineType(types: !524)
!524 = !{!388, !504}
!525 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 101, type: !523, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 102, type: !512, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!527 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 103, type: !528, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{!472, !504}
!530 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 104, type: !531, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!531 = !DISubroutineType(types: !532)
!532 = !{!517, !504}
!533 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 105, type: !534, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!534 = !DISubroutineType(types: !535)
!535 = !{!363, !504}
!536 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 107, type: !537, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{!339, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!541 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 108, type: !542, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{!494, !539}
!544 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 112, type: !531, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!545 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !6, line: 150, size: 320, align: 64, elements: !546, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!546 = !{!547, !548, !552, !555, !558, !562, !565, !568, !571, !574, !577, !580, !583, !584, !587, !588, !591, !592, !595}
!547 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!548 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 153, type: !549, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551, !411}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!552 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 154, type: !553, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !551}
!555 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 156, type: !556, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !551, !363, null}
!558 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 158, type: !559, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!559 = !DISubroutineType(types: !560)
!560 = !{!561, !551, !330}
!561 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!562 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 159, type: !563, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!563 = !DISubroutineType(types: !564)
!564 = !{!561, !551, !455}
!565 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 160, type: !566, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{!561, !551, !388}
!568 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 161, type: !569, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!561, !551, !472}
!571 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 162, type: !572, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!572 = !DISubroutineType(types: !573)
!573 = !{!561, !551}
!574 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 164, type: !575, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!575 = !DISubroutineType(types: !576)
!576 = !{!561, !551, !363}
!577 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 165, type: !578, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{!561, !551, !329}
!580 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 166, type: !581, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!581 = !DISubroutineType(types: !582)
!582 = !{!561, !551, !349}
!583 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 167, type: !559, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!584 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 168, type: !585, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{!561, !551, !334}
!587 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 169, type: !563, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!588 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 170, type: !589, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!561, !551, !313}
!591 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 171, type: !566, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!592 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 172, type: !593, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{!561, !551, !318}
!595 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 173, type: !569, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DICompositeType(tag: DW_TAG_class_type, name: "DefaultPlatformBase", scope: !5, file: !597, line: 42, size: 64, align: 64, elements: !598, vtableHolder: !"_ZTSN8pov_base12PlatformBaseE", identifier: "_ZTSN8pov_base19DefaultPlatformBaseE")
!597 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/defaultplatformbase.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!598 = !{!599, !600, !604, !605, !608}
!599 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base19DefaultPlatformBaseE", baseType: !"_ZTSN8pov_base12PlatformBaseE", flags: DIFlagPublic)
!600 = !DISubprogram(name: "DefaultPlatformBase", scope: !"_ZTSN8pov_base19DefaultPlatformBaseE", file: !597, line: 45, type: !601, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base19DefaultPlatformBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!604 = !DISubprogram(name: "~DefaultPlatformBase", scope: !"_ZTSN8pov_base19DefaultPlatformBaseE", file: !597, line: 46, type: !601, isLocal: false, isDefinition: false, scopeLine: 46, containingType: !"_ZTSN8pov_base19DefaultPlatformBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubprogram(name: "CreateIStream", linkageName: "_ZN8pov_base19DefaultPlatformBase13CreateIStreamEj", scope: !"_ZTSN8pov_base19DefaultPlatformBaseE", file: !597, line: 48, type: !606, isLocal: false, isDefinition: false, scopeLine: 48, containingType: !"_ZTSN8pov_base19DefaultPlatformBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!606 = !DISubroutineType(types: !607)
!607 = !{!410, !603, !411}
!608 = !DISubprogram(name: "CreateOStream", linkageName: "_ZN8pov_base19DefaultPlatformBase13CreateOStreamEj", scope: !"_ZTSN8pov_base19DefaultPlatformBaseE", file: !597, line: 49, type: !609, isLocal: false, isDefinition: false, scopeLine: 49, containingType: !"_ZTSN8pov_base19DefaultPlatformBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!609 = !DISubroutineType(types: !610)
!610 = !{!415, !603, !411}
!611 = !DICompositeType(tag: DW_TAG_class_type, name: "DefaultRenderFrontend", scope: !613, file: !612, line: 46, size: 2240, align: 64, elements: !615, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend21DefaultRenderFrontendE")
!612 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/defaultrenderfrontend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!613 = !DINamespace(name: "pov_frontend", scope: null, file: !614, line: 41)
!614 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/messageoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!615 = !{!616, !617, !623, !626, !629, !630, !631, !634, !637}
!616 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", baseType: !"_ZTSN12pov_frontend14RenderFrontendE", flags: DIFlagPublic)
!617 = !DISubprogram(name: "DefaultRenderFrontend", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 49, type: !618, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !620, !621, !339}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSContext", file: !622, line: 171, baseType: !339)
!622 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!623 = !DISubprogram(name: "~DefaultRenderFrontend", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 50, type: !624, isLocal: false, isDefinition: false, scopeLine: 50, containingType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !620}
!626 = !DISubprogram(name: "BannerPrintf", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend12BannerPrintfEPKcz", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 52, type: !627, isLocal: false, isDefinition: false, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !620, !363, null}
!629 = !DISubprogram(name: "BannerFlush", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend11BannerFlushEv", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 53, type: !624, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!630 = !DISubprogram(name: "PrintHelpScreens", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend16PrintHelpScreensEv", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 55, type: !624, isLocal: false, isDefinition: false, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!631 = !DISubprogram(name: "PrintUsage", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend10PrintUsageEi", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 56, type: !632, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !620, !313}
!634 = !DISubprogram(name: "OpenStreams", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend11OpenStreamsEb", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 72, type: !635, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !620, !494}
!637 = !DISubprogram(name: "CloseStreams", linkageName: "_ZN12pov_frontend21DefaultRenderFrontend12CloseStreamsEv", scope: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", file: !612, line: 73, type: !624, isLocal: false, isDefinition: false, scopeLine: 73, containingType: !"_ZTSN12pov_frontend21DefaultRenderFrontendE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!638 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_MessageReceiver", file: !639, line: 226, size: 192, align: 64, elements: !640, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTS21POVMS_MessageReceiver")
!639 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmscpp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!640 = !{!641, !642, !643, !645, !649, !652, !660, !669, !670, !671, !674, !675, !680, !684, !687, !692, !693}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_MessageReceiver", scope: !639, file: !639, baseType: !396, size: 64, flags: DIFlagArtificial)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 415, baseType: !621, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "receivers", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 416, baseType: !644, size: 64, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", size: 64, align: 64)
!645 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 360, type: !646, isLocal: false, isDefinition: false, scopeLine: 360, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !648, !621}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS21POVMS_MessageReceiver", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!649 = !DISubprogram(name: "~POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 361, type: !650, isLocal: false, isDefinition: false, scopeLine: 361, containingType: !"_ZTS21POVMS_MessageReceiver", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !648}
!652 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 373, type: !653, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !648, !388, !388, !655, !339}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !639, line: 305, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !659, !659, !313, !339}
!659 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS13POVMS_Message")
!660 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 378, type: !661, isLocal: false, isDefinition: false, scopeLine: 378, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !648, !388, !388, !663, !339}
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !639, line: 334, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !667, !667, !313, !339}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !622, line: 173, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!669 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 393, type: !653, isLocal: false, isDefinition: false, scopeLine: 393, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!670 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 398, type: !661, isLocal: false, isDefinition: false, scopeLine: 398, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!671 = !DISubprogram(name: "Remove", linkageName: "_ZN21POVMS_MessageReceiver6RemoveEjj", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 403, type: !672, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !648, !388, !388}
!674 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 418, type: !650, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: true)
!675 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 419, type: !676, isLocal: false, isDefinition: false, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !648, !678}
!678 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!680 = !DISubprogram(name: "operator=", linkageName: "_ZN21POVMS_MessageReceiveraSERKS_", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 420, type: !681, isLocal: false, isDefinition: false, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true)
!681 = !DISubroutineType(types: !682)
!682 = !{!683, !648, !678}
!683 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!684 = !DISubprogram(name: "ReceiveHandler", linkageName: "_ZN21POVMS_MessageReceiver14ReceiveHandlerEP9POVMSDataS1_iPv", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 422, type: !685, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!685 = !DISubroutineType(types: !686)
!686 = !{!313, !667, !667, !313, !339}
!687 = !DISubprogram(name: "AddNodeFront", linkageName: "_ZN21POVMS_MessageReceiver12AddNodeFrontEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 424, type: !688, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !648, !388, !388, !690, !691}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64)
!692 = !DISubprogram(name: "AddNodeBack", linkageName: "_ZN21POVMS_MessageReceiver11AddNodeBackEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 425, type: !688, isLocal: false, isDefinition: false, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "RemoveNode", linkageName: "_ZN21POVMS_MessageReceiver10RemoveNodeEPNS_11HandlerNodeE", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 426, type: !694, isLocal: false, isDefinition: false, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !648, !644}
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandlerNode", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 405, size: 320, align: 64, elements: !697, identifier: "_ZTSN21POVMS_MessageReceiver11HandlerNodeE")
!697 = !{!698, !699, !700, !701, !702, !703}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !639, line: 407, baseType: !644, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !639, line: 408, baseType: !644, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hclass", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !639, line: 409, baseType: !388, size: 32, align: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !639, line: 410, baseType: !388, size: 32, align: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "handleroo", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !639, line: 411, baseType: !690, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !639, line: 412, baseType: !691, size: 64, align: 64, offset: 256)
!704 = !DICompositeType(tag: DW_TAG_class_type, name: "HandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 233, size: 64, align: 64, elements: !705, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver9HandlerOOE")
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$HandlerOO", scope: !639, file: !639, baseType: !396, size: 64, flags: DIFlagArtificial)
!707 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver9HandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", file: !639, line: 236, type: !708, isLocal: false, isDefinition: false, scopeLine: 236, containingType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !710, !659, !659, !313}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!711 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Message", file: !639, line: 207, size: 192, align: 64, elements: !712, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS13POVMS_Message")
!712 = !{!713, !714, !718, !723, !726, !730, !733, !736, !739, !740, !743, !744}
!713 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS13POVMS_Message", baseType: !"_ZTS12POVMS_Object", flags: DIFlagPublic)
!714 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !639, line: 210, type: !715, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !717, !388, !388, !388}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS13POVMS_Message", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!718 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !639, line: 211, type: !719, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !717, !721}
!721 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObject", file: !622, line: 173, baseType: !"_ZTS9POVMSData")
!723 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !639, line: 212, type: !724, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !717, !667}
!726 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !639, line: 213, type: !727, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !717, !729}
!729 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS12POVMS_Object")
!730 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !639, line: 214, type: !731, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !717, !659}
!733 = !DISubprogram(name: "operator=", linkageName: "_ZN13POVMS_MessageaSERS_", scope: !"_ZTS13POVMS_Message", file: !639, line: 216, type: !734, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{!659, !717, !659}
!736 = !DISubprogram(name: "GetClass", linkageName: "_ZN13POVMS_Message8GetClassEv", scope: !"_ZTS13POVMS_Message", file: !639, line: 218, type: !737, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{!388, !717}
!739 = !DISubprogram(name: "GetIdentifier", linkageName: "_ZN13POVMS_Message13GetIdentifierEv", scope: !"_ZTS13POVMS_Message", file: !639, line: 219, type: !737, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!740 = !DISubprogram(name: "GetSourceAddress", linkageName: "_ZN13POVMS_Message16GetSourceAddressEv", scope: !"_ZTS13POVMS_Message", file: !639, line: 221, type: !741, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!741 = !DISubroutineType(types: !742)
!742 = !{!339, !717}
!743 = !DISubprogram(name: "GetDestinationAddress", linkageName: "_ZN13POVMS_Message21GetDestinationAddressEv", scope: !"_ZTS13POVMS_Message", file: !639, line: 222, type: !741, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!744 = !DISubprogram(name: "SetDestinationAddress", linkageName: "_ZN13POVMS_Message21SetDestinationAddressEPv", scope: !"_ZTS13POVMS_Message", file: !639, line: 223, type: !745, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !717, !339}
!747 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Container", file: !639, line: 50, size: 192, align: 64, elements: !748, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Container")
!748 = !{!749, !750, !751, !755, !756, !759, !762, !765}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_Container", scope: !639, file: !639, baseType: !396, size: 64, flags: DIFlagArtificial)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS15POVMS_Container", file: !639, line: 64, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 64, flags: DIFlagProtected)
!751 = !DISubprogram(name: "POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !639, line: 57, type: !752, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Container", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!755 = !DISubprogram(name: "~POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !639, line: 58, type: !752, isLocal: false, isDefinition: false, scopeLine: 58, containingType: !"_ZTS15POVMS_Container", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!756 = !DISubprogram(name: "Type", linkageName: "_ZN15POVMS_Container4TypeEv", scope: !"_ZTS15POVMS_Container", file: !639, line: 60, type: !757, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!757 = !DISubroutineType(types: !758)
!758 = !{!388, !754}
!759 = !DISubprogram(name: "Size", linkageName: "_ZN15POVMS_Container4SizeEv", scope: !"_ZTS15POVMS_Container", file: !639, line: 61, type: !760, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!760 = !DISubroutineType(types: !761)
!761 = !{!318, !754}
!762 = !DISubprogram(name: "IsNull", linkageName: "_ZN15POVMS_Container6IsNullEv", scope: !"_ZTS15POVMS_Container", file: !639, line: 62, type: !763, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!763 = !DISubroutineType(types: !764)
!764 = !{!494, !754}
!765 = !DISubprogram(name: "DetachData", linkageName: "_ZN15POVMS_Container10DetachDataEv", scope: !"_ZTS15POVMS_Container", file: !639, line: 66, type: !752, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !622, line: 178, size: 128, align: 64, elements: !767, identifier: "_ZTS9POVMSData")
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !622, line: 180, baseType: !388, size: 32, align: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !622, line: 181, baseType: !313, size: 32, align: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !622, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!771 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !622, line: 182, size: 64, align: 64, elements: !772, identifier: "_ZTSN9POVMSDataUt_E")
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !622, line: 184, baseType: !339, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !622, line: 185, baseType: !668, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !622, line: 186, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !622, line: 190, size: 320, align: 64, elements: !778, identifier: "_ZTS9POVMSNode")
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !622, line: 192, baseType: !776, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !622, line: 193, baseType: !776, size: 64, align: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !622, line: 194, baseType: !388, size: 32, align: 32, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !622, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!783 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Object", file: !639, line: 112, size: 192, align: 64, elements: !784, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS12POVMS_Object")
!784 = !{!785, !786, !790, !793, !796, !799, !802, !805, !809, !813, !816, !817, !818, !819, !820, !823, !824, !831, !835, !838, !841, !844, !847, !851, !852, !855, !858, !861, !862, !865, !868, !869, !872, !875, !878, !879}
!785 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS12POVMS_Object", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!786 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !639, line: 117, type: !787, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !789, !388}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS12POVMS_Object", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!790 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !639, line: 118, type: !791, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !789, !721}
!793 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !639, line: 119, type: !794, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !789, !667}
!796 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !639, line: 120, type: !797, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !789, !729}
!799 = !DISubprogram(name: "~POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !639, line: 121, type: !800, isLocal: false, isDefinition: false, scopeLine: 121, containingType: !"_ZTS12POVMS_Object", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !789}
!802 = !DISubprogram(name: "operator=", linkageName: "_ZN12POVMS_ObjectaSERS_", scope: !"_ZTS12POVMS_Object", file: !639, line: 123, type: !803, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!803 = !DISubroutineType(types: !804)
!804 = !{!729, !789, !729}
!805 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !639, line: 125, type: !806, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !789, !388, !808}
!808 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS15POVMS_Attribute")
!809 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !639, line: 126, type: !810, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !789, !388, !812}
!812 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS10POVMS_List")
!813 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjRS_", scope: !"_ZTS12POVMS_Object", file: !639, line: 127, type: !814, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !789, !388, !729}
!816 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !639, line: 128, type: !806, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!817 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !639, line: 129, type: !810, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!818 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjRS_", scope: !"_ZTS12POVMS_Object", file: !639, line: 130, type: !814, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!819 = !DISubprogram(name: "Remove", linkageName: "_ZN12POVMS_Object6RemoveEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 131, type: !787, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!820 = !DISubprogram(name: "Exist", linkageName: "_ZN12POVMS_Object5ExistEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 132, type: !821, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!821 = !DISubroutineType(types: !822)
!822 = !{!494, !789, !388}
!823 = !DISubprogram(name: "Merge", linkageName: "_ZN12POVMS_Object5MergeERS_", scope: !"_ZTS12POVMS_Object", file: !639, line: 133, type: !797, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!824 = !DISubprogram(name: "operator*", linkageName: "_ZNK12POVMS_ObjectdeEv", scope: !"_ZTS12POVMS_Object", file: !639, line: 135, type: !825, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !829}
!827 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS12POVMS_Object")
!831 = !DISubprogram(name: "operator->", linkageName: "_ZNK12POVMS_ObjectptEv", scope: !"_ZTS12POVMS_Object", file: !639, line: 136, type: !832, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !829}
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!835 = !DISubprogram(name: "operator()", linkageName: "_ZN12POVMS_ObjectclEv", scope: !"_ZTS12POVMS_Object", file: !639, line: 137, type: !836, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!836 = !DISubroutineType(types: !837)
!837 = !{!722, !789}
!838 = !DISubprogram(name: "SetString", linkageName: "_ZN12POVMS_Object9SetStringEjPKc", scope: !"_ZTS12POVMS_Object", file: !639, line: 139, type: !839, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !789, !388, !363}
!841 = !DISubprogram(name: "SetInt", linkageName: "_ZN12POVMS_Object6SetIntEji", scope: !"_ZTS12POVMS_Object", file: !639, line: 140, type: !842, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !789, !388, !313}
!844 = !DISubprogram(name: "SetLong", linkageName: "_ZN12POVMS_Object7SetLongEjx", scope: !"_ZTS12POVMS_Object", file: !639, line: 141, type: !845, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !789, !388, !323}
!847 = !DISubprogram(name: "SetFloat", linkageName: "_ZN12POVMS_Object8SetFloatEjf", scope: !"_ZTS12POVMS_Object", file: !639, line: 142, type: !848, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !789, !388, !850}
!850 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!851 = !DISubprogram(name: "SetBool", linkageName: "_ZN12POVMS_Object7SetBoolEji", scope: !"_ZTS12POVMS_Object", file: !639, line: 143, type: !842, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!852 = !DISubprogram(name: "SetType", linkageName: "_ZN12POVMS_Object7SetTypeEjj", scope: !"_ZTS12POVMS_Object", file: !639, line: 144, type: !853, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !789, !388, !388}
!855 = !DISubprogram(name: "GetStringLength", linkageName: "_ZN12POVMS_Object15GetStringLengthEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 145, type: !856, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!856 = !DISubroutineType(types: !857)
!857 = !{!313, !789, !388}
!858 = !DISubprogram(name: "GetString", linkageName: "_ZN12POVMS_Object9GetStringEjPci", scope: !"_ZTS12POVMS_Object", file: !639, line: 146, type: !859, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!859 = !DISubroutineType(types: !860)
!860 = !{!313, !789, !388, !348, !313}
!861 = !DISubprogram(name: "GetInt", linkageName: "_ZN12POVMS_Object6GetIntEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 147, type: !856, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!862 = !DISubprogram(name: "GetLong", linkageName: "_ZN12POVMS_Object7GetLongEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 148, type: !863, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!863 = !DISubroutineType(types: !864)
!864 = !{!323, !789, !388}
!865 = !DISubprogram(name: "GetFloat", linkageName: "_ZN12POVMS_Object8GetFloatEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 149, type: !866, isLocal: false, isDefinition: false, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!866 = !DISubroutineType(types: !867)
!867 = !{!850, !789, !388}
!868 = !DISubprogram(name: "GetBool", linkageName: "_ZN12POVMS_Object7GetBoolEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 150, type: !856, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!869 = !DISubprogram(name: "GetType", linkageName: "_ZN12POVMS_Object7GetTypeEj", scope: !"_ZTS12POVMS_Object", file: !639, line: 151, type: !870, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!870 = !DISubroutineType(types: !871)
!871 = !{!388, !789, !388}
!872 = !DISubprogram(name: "ReadHeader", linkageName: "_ZN12POVMS_Object10ReadHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !639, line: 201, type: !873, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true)
!873 = !DISubroutineType(types: !874)
!874 = !{!494, !789, !329, !459}
!875 = !DISubprogram(name: "ReadObject", linkageName: "_ZN12POVMS_Object10ReadObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !639, line: 202, type: !876, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true)
!876 = !DISubroutineType(types: !877)
!877 = !{!494, !789, !329, !313}
!878 = !DISubprogram(name: "WriteHeader", linkageName: "_ZN12POVMS_Object11WriteHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !639, line: 203, type: !873, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true)
!879 = !DISubprogram(name: "WriteObject", linkageName: "_ZN12POVMS_Object11WriteObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !639, line: 204, type: !876, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true)
!880 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Attribute", file: !639, line: 69, size: 192, align: 64, elements: !881, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Attribute")
!881 = !{!882, !883, !887, !890, !893, !896, !899, !902, !905, !910, !913, !914, !917, !921}
!882 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS15POVMS_Attribute", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!883 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 72, type: !884, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Attribute", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!887 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 73, type: !888, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !886, !363}
!890 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 74, type: !891, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !886, !313}
!893 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 75, type: !894, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !886, !323}
!896 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 76, type: !897, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !886, !850}
!899 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 77, type: !900, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !886, !494}
!902 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 78, type: !903, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !886, !388}
!905 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 79, type: !906, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !886, !908}
!908 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttribute", file: !622, line: 174, baseType: !"_ZTS9POVMSData")
!910 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 80, type: !911, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !886, !808}
!913 = !DISubprogram(name: "~POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 81, type: !884, isLocal: false, isDefinition: false, scopeLine: 81, containingType: !"_ZTS15POVMS_Attribute", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!914 = !DISubprogram(name: "operator=", linkageName: "_ZN15POVMS_AttributeaSERS_", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 83, type: !915, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!915 = !DISubroutineType(types: !916)
!916 = !{!808, !886, !808}
!917 = !DISubprogram(name: "Get", linkageName: "_ZN15POVMS_Attribute3GetEjPvPi", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 85, type: !918, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !886, !388, !339, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!921 = !DISubprogram(name: "Set", linkageName: "_ZN15POVMS_Attribute3SetEjPvi", scope: !"_ZTS15POVMS_Attribute", file: !639, line: 86, type: !922, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !886, !388, !339, !313}
!924 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_List", file: !639, line: 89, size: 192, align: 64, elements: !925, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS10POVMS_List")
!925 = !{!926, !927, !931, !936, !939, !940, !943, !946, !947, !950, !953, !956, !959, !960, !961, !962, !965}
!926 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS10POVMS_List", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!927 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !639, line: 92, type: !928, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS10POVMS_List", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!931 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !639, line: 93, type: !932, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !930, !934}
!934 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttributeList", file: !622, line: 175, baseType: !"_ZTS9POVMSData")
!936 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !639, line: 94, type: !937, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !930, !812}
!939 = !DISubprogram(name: "~POVMS_List", scope: !"_ZTS10POVMS_List", file: !639, line: 95, type: !928, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTS10POVMS_List", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!940 = !DISubprogram(name: "operator=", linkageName: "_ZN10POVMS_ListaSERS_", scope: !"_ZTS10POVMS_List", file: !639, line: 97, type: !941, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!941 = !DISubroutineType(types: !942)
!942 = !{!812, !930, !812}
!943 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !639, line: 99, type: !944, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !930, !808}
!946 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendERS_", scope: !"_ZTS10POVMS_List", file: !639, line: 100, type: !937, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!947 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !639, line: 101, type: !948, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !930, !729}
!950 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !639, line: 102, type: !951, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !930, !313, !808}
!953 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !639, line: 103, type: !954, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !930, !313, !812}
!956 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !639, line: 104, type: !957, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !930, !313, !729}
!959 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !639, line: 105, type: !951, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!960 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !639, line: 106, type: !954, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!961 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !639, line: 107, type: !957, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!962 = !DISubprogram(name: "RemoveNth", linkageName: "_ZN10POVMS_List9RemoveNthEi", scope: !"_ZTS10POVMS_List", file: !639, line: 108, type: !963, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !930, !313}
!965 = !DISubprogram(name: "Clear", linkageName: "_ZN10POVMS_List5ClearEv", scope: !"_ZTS10POVMS_List", file: !639, line: 109, type: !928, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!966 = !DICompositeType(tag: DW_TAG_class_type, name: "Handler", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 238, size: 64, align: 64, elements: !967, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver7HandlerE")
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Handler", scope: !639, file: !639, baseType: !396, size: 64, flags: DIFlagArtificial)
!969 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver7Handler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver7HandlerE", file: !639, line: 241, type: !970, isLocal: false, isDefinition: false, scopeLine: 241, containingType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !972, !667, !667, !313}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!973 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 302, size: 192, align: 64, elements: !974, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE")
!974 = !{!975, !976, !977, !978, !982, !985}
!975 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", flags: DIFlagPublic)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !639, line: 327, baseType: !655, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !639, line: 328, baseType: !339, size: 64, align: 64, offset: 128)
!978 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !639, line: 307, type: !979, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!982 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !639, line: 313, type: !983, isLocal: false, isDefinition: false, scopeLine: 313, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !981, !655, !339}
!985 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver17FunctionHandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !639, line: 319, type: !986, isLocal: false, isDefinition: false, scopeLine: 319, containingType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !981, !659, !659, !313}
!988 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandler", scope: !"_ZTS21POVMS_MessageReceiver", file: !639, line: 331, size: 192, align: 64, elements: !989, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver15FunctionHandlerE")
!989 = !{!990, !991, !992, !993, !997, !1000}
!990 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", flags: DIFlagPublic)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !639, line: 356, baseType: !663, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !639, line: 357, baseType: !339, size: 64, align: 64, offset: 128)
!993 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !639, line: 336, type: !994, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!997 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !639, line: 342, type: !998, isLocal: false, isDefinition: false, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !996, !663, !339}
!1000 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver15FunctionHandler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !639, line: 348, type: !1001, isLocal: false, isDefinition: false, scopeLine: 348, containingType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !996, !667, !667, !313}
!1003 = !DICompositeType(tag: DW_TAG_class_type, name: "RenderFrontend", scope: !613, file: !33, line: 41, size: 2240, align: 64, elements: !1004, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend14RenderFrontendE")
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1013, !1016, !1019, !1020, !1023, !1026}
!1005 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend14RenderFrontendE", baseType: !"_ZTSN12pov_frontend13MessageOutputE", flags: DIFlagPublic)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "backendaddress", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 64, baseType: !339, size: 64, align: 64, offset: 2048)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 65, baseType: !621, size: 64, align: 64, offset: 2112)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 66, baseType: !"_ZTSN12pov_frontend14RenderFrontend11EngineStateE", size: 32, align: 32, offset: 2176)
!1009 = !DISubprogram(name: "RenderFrontend", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 53, type: !1010, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !1012, !621, !339}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend14RenderFrontendE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1013 = !DISubprogram(name: "~RenderFrontend", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 54, type: !1014, isLocal: false, isDefinition: false, scopeLine: 54, containingType: !"_ZTSN12pov_frontend14RenderFrontendE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !1012}
!1016 = !DISubprogram(name: "StartRender", linkageName: "_ZN12pov_frontend14RenderFrontend11StartRenderER12POVMS_Object", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 56, type: !1017, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !1012, !729}
!1019 = !DISubprogram(name: "StopRender", linkageName: "_ZN12pov_frontend14RenderFrontend10StopRenderEv", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 57, type: !1014, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1020 = !DISubprogram(name: "GetState", linkageName: "_ZN12pov_frontend14RenderFrontend8GetStateEv", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 59, type: !1021, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!"_ZTSN12pov_frontend14RenderFrontend11EngineStateE", !1012}
!1023 = !DISubprogram(name: "RenderStarted", linkageName: "_ZN12pov_frontend14RenderFrontend13RenderStartedER13POVMS_MessageS2_i", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 61, type: !1024, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !1012, !659, !659, !313}
!1026 = !DISubprogram(name: "RenderDone", linkageName: "_ZN12pov_frontend14RenderFrontend10RenderDoneER13POVMS_MessageS2_i", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !33, line: 62, type: !1024, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!1027 = !DICompositeType(tag: DW_TAG_class_type, name: "MessageOutput", scope: !613, file: !614, line: 45, size: 2048, align: 64, elements: !1028, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend13MessageOutputE")
