; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/ppm.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"class.pov::PPM_Image" = type { %"class.pov::Image_File_Class.base", i8*, i32, i32, i32, i32, %"class.pov_base::IStream"*, %"class.pov_base::OStream"* }
%"class.pov::Image_File_Class.base" = type <{ i32 (...)**, i8 }>
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !61, subprograms: !442, globals: !575, imports: !576)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/ppm.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !29, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 51, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!8 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!9 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!10 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!11 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!12 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!13 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!14 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!15 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!16 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!17 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!18 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!19 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!20 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!21 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!22 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!23 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!24 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!25 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!26 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!27 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!28 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !31, file: !30, line: 54, size: 32, align: 32, elements: !33)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DINamespace(name: "pov", scope: null, file: !32, line: 36)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!34 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1)
!35 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2)
!36 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3)
!37 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4)
!38 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5)
!39 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6)
!40 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7)
!41 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8)
!42 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9)
!43 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10)
!44 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11)
!45 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12)
!46 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13)
!47 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14)
!48 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15)
!49 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16)
!50 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17)
!51 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18)
!52 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !31, file: !54, line: 701, size: 32, align: 32, elements: !55)
!54 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIEnumerator(name: "pRED", value: 0)
!57 = !DIEnumerator(name: "pGREEN", value: 1)
!58 = !DIEnumerator(name: "pBLUE", value: 2)
!59 = !DIEnumerator(name: "pFILTER", value: 3)
!60 = !DIEnumerator(name: "pTRANSM", value: 4)
!61 = !{!62, !68, !73, !78, !117, !145, !219, !277, !324, !328, !329, !83, !66, !106, !153, !380, !381, !410, !417, !430, !436, !420, !280, !423, !427}
!62 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 82, size: 64, align: 32, elements: !64, identifier: "_ZTS5div_t")
!63 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !63, line: 83, baseType: !66, size: 32, align: 32)
!66 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !63, line: 84, baseType: !66, size: 32, align: 32, offset: 32)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 87, size: 128, align: 64, elements: !69, identifier: "_ZTS6ldiv_t")
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !63, line: 88, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !63, line: 89, baseType: !71, size: 64, align: 64, offset: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 93, size: 128, align: 64, elements: !74, identifier: "_ZTS7lldiv_t")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !63, line: 94, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !63, line: 95, baseType: !76, size: 64, align: 64, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "PPM_Image", scope: !31, file: !79, line: 47, size: 448, align: 64, elements: !80, vtableHolder: !"_ZTSN3pov16Image_File_ClassE", identifier: "_ZTSN3pov9PPM_ImageE")
!79 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/ppm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !{!81, !82, !85, !86, !87, !88, !89, !91, !93, !97, !100, !109, !112, !115, !116}
!81 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN3pov9PPM_ImageE", baseType: !"_ZTSN3pov16Image_File_ClassE", flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 60, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 61, baseType: !66, size: 32, align: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 62, baseType: !66, size: 32, align: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 62, baseType: !66, size: 32, align: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 63, baseType: !66, size: 32, align: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 64, baseType: !90, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out_file", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 65, baseType: !92, size: 64, align: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!93 = !DISubprogram(name: "PPM_Image", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 50, type: !94, isLocal: false, isDefinition: false, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96, !83, !66, !66, !66, !66}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov9PPM_ImageE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~PPM_Image", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 51, type: !98, isLocal: false, isDefinition: false, scopeLine: 51, containingType: !"_ZTSN3pov9PPM_ImageE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !96}
!100 = !DISubprogram(name: "Write_Line", linkageName: "_ZN3pov9PPM_Image10Write_LineEPA5_f", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 53, type: !101, isLocal: false, isDefinition: false, scopeLine: 53, containingType: !"_ZTSN3pov9PPM_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !96, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !31, file: !54, line: 681, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, align: 32, elements: !107)
!106 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!107 = !{!108}
!108 = !DISubrange(count: 5)
!109 = !DISubprogram(name: "Read_Line", linkageName: "_ZN3pov9PPM_Image9Read_LineEPA5_f", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 54, type: !110, isLocal: false, isDefinition: false, scopeLine: 54, containingType: !"_ZTSN3pov9PPM_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!66, !96, !103}
!112 = !DISubprogram(name: "Line", linkageName: "_ZN3pov9PPM_Image4LineEv", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 56, type: !113, isLocal: false, isDefinition: false, scopeLine: 56, containingType: !"_ZTSN3pov9PPM_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!113 = !DISubroutineType(types: !114)
!114 = !{!66, !96}
!115 = !DISubprogram(name: "Width", linkageName: "_ZN3pov9PPM_Image5WidthEv", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 57, type: !113, isLocal: false, isDefinition: false, scopeLine: 57, containingType: !"_ZTSN3pov9PPM_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!116 = !DISubprogram(name: "Height", linkageName: "_ZN3pov9PPM_Image6HeightEv", scope: !"_ZTSN3pov9PPM_ImageE", file: !79, line: 58, type: !113, isLocal: false, isDefinition: false, scopeLine: 58, containingType: !"_ZTSN3pov9PPM_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DICompositeType(tag: DW_TAG_class_type, name: "Image_File_Class", scope: !31, file: !54, line: 1878, size: 128, align: 64, elements: !118, vtableHolder: !"_ZTSN3pov16Image_File_ClassE", identifier: "_ZTSN3pov16Image_File_ClassE")
!118 = !{!119, !124, !126, !130, !131, !134, !137, !140, !141, !142}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Image_File_Class", scope: !54, file: !54, baseType: !120, size: 64, flags: DIFlagArtificial)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!66}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1893, baseType: !125, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!125 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!126 = !DISubprogram(name: "Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1881, type: !127, isLocal: false, isDefinition: false, scopeLine: 1881, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov16Image_File_ClassE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!130 = !DISubprogram(name: "~Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1882, type: !127, isLocal: false, isDefinition: false, scopeLine: 1882, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!131 = !DISubprogram(name: "Write_Line", linkageName: "_ZN3pov16Image_File_Class10Write_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1884, type: !132, isLocal: false, isDefinition: false, scopeLine: 1884, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !129, !103}
!134 = !DISubprogram(name: "Read_Line", linkageName: "_ZN3pov16Image_File_Class9Read_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1885, type: !135, isLocal: false, isDefinition: false, scopeLine: 1885, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubroutineType(types: !136)
!136 = !{!66, !129, !103}
!137 = !DISubprogram(name: "Line", linkageName: "_ZN3pov16Image_File_Class4LineEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1887, type: !138, isLocal: false, isDefinition: false, scopeLine: 1887, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubroutineType(types: !139)
!139 = !{!66, !129}
!140 = !DISubprogram(name: "Width", linkageName: "_ZN3pov16Image_File_Class5WidthEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1888, type: !138, isLocal: false, isDefinition: false, scopeLine: 1888, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!141 = !DISubprogram(name: "Height", linkageName: "_ZN3pov16Image_File_Class6HeightEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1889, type: !138, isLocal: false, isDefinition: false, scopeLine: 1889, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubprogram(name: "Valid", linkageName: "_ZN3pov16Image_File_Class5ValidEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1891, type: !143, isLocal: false, isDefinition: false, scopeLine: 1891, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{!125, !129}
!145 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !4, line: 118, size: 320, align: 64, elements: !146, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!146 = !{!147, !148, !154, !157, !160, !161, !162, !165, !170, !175, !180, !185, !189, !193, !197, !202, !203, !204, !205, !206, !207, !208, !209, !210, !213, !216}
!147 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!148 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 121, type: !149, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151, !152}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 122, type: !155, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !151}
!157 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 124, type: !158, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubroutineType(types: !159)
!159 = !{!66, !151}
!160 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 125, type: !158, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!161 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 126, type: !158, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!162 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 127, type: !163, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{!71, !151}
!165 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 128, type: !166, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !151, !169}
!168 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!169 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !84)
!170 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 129, type: !171, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!168, !151, !173}
!173 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !174)
!174 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!175 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 130, type: !176, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!176 = !DISubroutineType(types: !177)
!177 = !{!168, !151, !178}
!178 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !179)
!179 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!180 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 131, type: !181, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!168, !151, !183}
!183 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!185 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 132, type: !186, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!168, !151, !188}
!188 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !66)
!189 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 133, type: !190, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{!168, !151, !192}
!192 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !153)
!193 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 134, type: !194, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{!168, !151, !196}
!196 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !71)
!197 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 135, type: !198, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{!168, !151, !200}
!200 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !201)
!201 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!202 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 137, type: !194, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 138, type: !186, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!204 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 139, type: !176, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!205 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 140, type: !166, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 141, type: !198, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 142, type: !190, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!208 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 143, type: !181, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 144, type: !171, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 145, type: !211, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubroutineType(types: !212)
!212 = !{!168, !151, !66}
!213 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 146, type: !214, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubroutineType(types: !215)
!215 = !{!168, !151, !83, !201}
!216 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 147, type: !217, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!217 = !DISubroutineType(types: !218)
!218 = !{!168, !151, !201}
!219 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !4, line: 84, size: 320, align: 64, elements: !220, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!220 = !{!221, !222, !223, !227, !228, !229, !230, !234, !237, !242, !245, !250, !251, !254, !257, !258, !259, !262, !265, !268, !273, !276}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !120, size: 64, flags: DIFlagArtificial)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !125, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !224, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !226, line: 153, baseType: !"_ZTS7__sFILE")
!226 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !153, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !153, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !83, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!230 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !231, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !233, !153, !153}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!234 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !235, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !233}
!237 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !238, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!125, !233, !240, !153}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!242 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !243, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !233}
!245 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !246, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !233, !249, !201}
!248 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!250 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !246, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!251 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !252, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!252 = !DISubroutineType(types: !253)
!253 = !{!248, !233, !201, !153}
!254 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !255, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!153, !233}
!257 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !255, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!258 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !243, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !260, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{!201, !233}
!262 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !263, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!248, !233}
!265 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !266, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!266 = !DISubroutineType(types: !267)
!267 = !{!240, !233}
!268 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !269, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!269 = !DISubroutineType(types: !270)
!270 = !{!249, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!273 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !274, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!125, !271}
!276 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !263, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !226, line: 122, size: 1216, align: 64, elements: !278, identifier: "_ZTS7__sFILE")
!278 = !{!279, !281, !282, !283, !284, !285, !286, !287, !288, !292, !296, !305, !309, !310, !312, !313, !317, !321, !322, !323}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !226, line: 123, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !226, line: 124, baseType: !66, size: 32, align: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !226, line: 125, baseType: !66, size: 32, align: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !226, line: 126, baseType: !179, size: 16, align: 16, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !226, line: 127, baseType: !179, size: 16, align: 16, offset: 144)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !226, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !226, line: 129, baseType: !66, size: 32, align: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !226, line: 132, baseType: !249, size: 64, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !226, line: 133, baseType: !289, size: 64, align: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!66, !249}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !226, line: 134, baseType: !293, size: 64, align: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!66, !249, !83, !66}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !226, line: 135, baseType: !297, size: 64, align: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !249, !300, !66}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !226, line: 77, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !302, line: 71, baseType: !303)
!302 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !304, line: 46, baseType: !76)
!304 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !226, line: 136, baseType: !306, size: 64, align: 64, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!66, !249, !240, !66}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !226, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !226, line: 140, baseType: !311, size: 64, align: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !226, line: 141, baseType: !66, size: 32, align: 32, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !226, line: 144, baseType: !314, size: 24, align: 8, offset: 928)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 24, align: 8, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !226, line: 145, baseType: !318, size: 8, align: 8, offset: 952)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 8, align: 8, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 1)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !226, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !226, line: 151, baseType: !66, size: 32, align: 32, offset: 1088)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !226, line: 152, baseType: !300, size: 64, align: 64, offset: 1152)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !226, line: 88, size: 128, align: 64, elements: !325, identifier: "_ZTS6__sbuf")
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !226, line: 89, baseType: !280, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !226, line: 90, baseType: !66, size: 32, align: 32, offset: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !226, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!329 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !4, line: 150, size: 320, align: 64, elements: !330, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!330 = !{!331, !332, !336, !339, !342, !346, !349, !352, !355, !358, !361, !364, !367, !368, !371, !372, !375, !376, !379}
!331 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!332 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 153, type: !333, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !335, !152}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!336 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 154, type: !337, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !335}
!339 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 156, type: !340, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !335, !240, null}
!342 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 158, type: !343, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !335, !174}
!345 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!346 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 159, type: !347, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!345, !335, !184}
!349 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 160, type: !350, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{!345, !335, !153}
!352 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 161, type: !353, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!345, !335, !201}
!355 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 162, type: !356, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!345, !335}
!358 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 164, type: !359, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!345, !335, !240}
!361 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 165, type: !362, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DISubroutineType(types: !363)
!363 = !{!345, !335, !280}
!364 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 166, type: !365, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{!345, !335, !84}
!367 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 167, type: !343, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!368 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 168, type: !369, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!345, !335, !179}
!371 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 169, type: !347, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 170, type: !373, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!345, !335, !66}
!375 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 171, type: !350, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 172, type: !377, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{!345, !335, !71}
!379 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 173, type: !353, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !31, file: !54, line: 1220, size: 960, align: 64, elements: !382, identifier: "_ZTSN3pov12Image_StructE")
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !396, !397, !398, !403, !404, !405, !408, !409}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1222, baseType: !66, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1223, baseType: !66, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1224, baseType: !66, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1225, baseType: !66, size: 32, align: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1226, baseType: !66, size: 32, align: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1227, baseType: !66, size: 32, align: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1227, baseType: !66, size: 32, align: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1228, baseType: !179, size: 16, align: 16, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1229, baseType: !84, size: 8, align: 8, offset: 240)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1230, baseType: !84, size: 8, align: 8, offset: 248)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1231, baseType: !394, size: 192, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !31, file: !54, line: 677, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 192, align: 64, elements: !315)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1232, baseType: !106, size: 32, align: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1232, baseType: !106, size: 32, align: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1233, baseType: !399, size: 128, align: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !31, file: !54, line: 676, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 128, align: 64, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 2)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1234, baseType: !380, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1234, baseType: !380, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1235, baseType: !406, size: 64, align: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !31, file: !54, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1236, baseType: !249, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !31, file: !54, line: 1161, size: 80, align: 16, elements: !411, identifier: "_ZTSN3pov19Image_Colour_StructE")
!411 = !{!412, !413, !414, !415, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !184, size: 16, align: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !184, size: 16, align: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !184, size: 16, align: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !184, size: 16, align: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !184, size: 16, align: 16, offset: 64)
!417 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1237, size: 64, align: 64, elements: !418, identifier: "_ZTSN3pov12Image_StructUt_E")
!418 = !{!419, !422, !425, !428}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1239, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !31, file: !54, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1240, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !31, file: !54, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1241, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1242, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !31, file: !54, line: 1166, size: 256, align: 64, elements: !431, identifier: "_ZTSN3pov18Image8_Line_StructE")
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !280, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !280, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !280, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !280, size: 64, align: 64, offset: 192)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !31, file: !54, line: 1171, size: 256, align: 64, elements: !437, identifier: "_ZTSN3pov19Image16_Line_StructE")
!437 = !{!438, !439, !440, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !427, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !427, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !427, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !427, size: 64, align: 64, offset: 192)
!442 = !{!443, !462, !470, !473, !476, !479, !490, !502, !524, !528, !531, !534, !538, !549, !552, !555, !559, !563, !566, !569, !572}
!443 = !DISubprogram(name: "PPM_Image", linkageName: "_ZN3pov9PPM_ImageC2EPciiii", scope: !"_ZTSN3pov9PPM_ImageE", file: !1, line: 94, type: !94, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::PPM_Image"*, i8*, i32, i32, i32, i32)* @_ZN3pov9PPM_ImageC2EPciiii, declaration: !93, variables: !444)
!444 = !{!445, !447, !448, !449, !450, !451, !452, !454, !456, !460, !461}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !443, type: !446, flags: DIFlagArtificial | DIFlagObjectPointer)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov9PPM_ImageE", size: 64, align: 64)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !443, file: !1, line: 94, type: !83)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !443, file: !1, line: 94, type: !66)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 4, scope: !443, file: !1, line: 94, type: !66)
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 5, scope: !443, file: !1, line: 94, type: !66)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 6, scope: !443, file: !1, line: 94, type: !66)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_type", scope: !453, file: !1, line: 96, type: !66)
!453 = distinct !DILexicalBlock(scope: !443, file: !1, line: 95, column: 1)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header", scope: !453, file: !1, line: 97, type: !455)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 16, align: 8, elements: !401)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !453, file: !1, line: 98, type: !457)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, align: 8, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 1024)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !453, file: !1, line: 99, type: !83)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !453, file: !1, line: 100, type: !66)
!462 = !DISubprogram(name: "PPM_Image", linkageName: "_ZN3pov9PPM_ImageC1EPciiii", scope: !"_ZTSN3pov9PPM_ImageE", file: !1, line: 94, type: !94, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::PPM_Image"*, i8*, i32, i32, i32, i32)* @_ZN3pov9PPM_ImageC1EPciiii, declaration: !93, variables: !463)
!463 = !{!464, !465, !466, !467, !468, !469}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !462, type: !446, flags: DIFlagArtificial | DIFlagObjectPointer)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !462, file: !1, line: 94, type: !83)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !462, file: !1, line: 94, type: !66)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 4, scope: !462, file: !1, line: 94, type: !66)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 5, scope: !462, file: !1, line: 94, type: !66)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 6, scope: !462, file: !1, line: 94, type: !66)
!470 = !DISubprogram(name: "~PPM_Image", linkageName: "_ZN3pov9PPM_ImageD2Ev", scope: !"_ZTSN3pov9PPM_ImageE", file: !1, line: 225, type: !98, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::PPM_Image"*)* @_ZN3pov9PPM_ImageD2Ev, declaration: !97, variables: !471)
!471 = !{!472}
