; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/prism.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!62 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47)
!63 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48)
!64 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49)
!65 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50)
!66 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51)
!67 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52)
!68 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53)
!69 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54)
!70 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!71 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!72 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!73 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!74 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!75 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!76 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!77 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!78 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!79 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!80 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!81 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!82 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!83 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!84 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!85 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!86 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!87 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!88 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!89 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!90 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!91 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!92 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!93 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!94 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!95 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!96 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!97 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!98 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!99 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!100 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!101 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!102 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!103 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!104 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!105 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!106 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!107 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!108 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!109 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!110 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!111 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!112 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!113 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!114 = !DIEnumerator(name: "Media_Samples", value: 99)
!115 = !DIEnumerator(name: "Media_Intervals", value: 100)
!116 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!117 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!118 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!119 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!120 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!121 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!122 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!123 = !DIEnumerator(name: "nChecked", value: 108)
!124 = !DIEnumerator(name: "nEnqueued", value: 109)
!125 = !DIEnumerator(name: "totalQueues", value: 110)
!126 = !DIEnumerator(name: "totalQueueResets", value: 111)
!127 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!128 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!129 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!130 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!131 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!132 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!133 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!134 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!135 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!136 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!137 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!138 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!139 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!140 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!141 = !DIEnumerator(name: "MaxStat", value: 126)
!142 = !{!143, !149, !154, !159, !211, !264, !280, !312, !317, !330, !341, !347, !362, !376, !402, !408, !418, !426, !449, !456, !468, !474, !480, !484, !488, !493, !504, !514, !523, !527, !542, !560, !564, !568, !573, !583, !593, !602, !606, !624, !628, !632, !637, !647, !657, !666, !670, !688, !692, !696, !701, !711, !721, !730, !734, !761, !776, !804, !859, !866, !874, !885, !892, !898, !908, !916, !937, !943, !956, !962, !202, !941, !205, !12, !242, !864, !964}
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 82, size: 64, align: 32, elements: !145, identifier: "_ZTS5div_t")
!144 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !144, line: 83, baseType: !147, size: 32, align: 32)
!147 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !144, line: 84, baseType: !147, size: 32, align: 32, offset: 32)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 87, size: 128, align: 64, elements: !150, identifier: "_ZTS6ldiv_t")
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !144, line: 88, baseType: !152, size: 64, align: 64)
!152 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !144, line: 89, baseType: !152, size: 64, align: 64, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 93, size: 128, align: 64, elements: !155, identifier: "_ZTS7lldiv_t")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !144, line: 94, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !144, line: 95, baseType: !157, size: 64, align: 64, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prism_Struct", scope: !5, file: !160, line: 88, size: 1856, align: 64, elements: !161, identifier: "_ZTSN3pov12Prism_StructE")
!160 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/prism.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !{!162, !165, !166, !169, !172, !173, !176, !177, !178, !181, !183, !186, !187, !189, !191, !192, !193, !194, !196, !197, !198, !199, !200, !201, !204, !207, !208, !209, !210}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !4, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !147, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !4, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !4, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !170, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !4, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !167, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !167, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !179, size: 64, align: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !4, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !182, size: 192, align: 32, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !184, size: 64, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !4, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !184, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !188, size: 32, align: 32, offset: 896)
!188 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 90, baseType: !190, size: 32, align: 32, offset: 928)
!190 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Number", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 91, baseType: !147, size: 32, align: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Spline_Type", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 92, baseType: !147, size: 32, align: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Sweep_Type", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 93, baseType: !147, size: 32, align: 32, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Height1", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 94, baseType: !195, size: 64, align: 64, offset: 1088)
!195 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Height2", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 94, baseType: !195, size: 64, align: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 95, baseType: !195, size: 64, align: 64, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 95, baseType: !195, size: 64, align: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 95, baseType: !195, size: 64, align: 64, offset: 1344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 95, baseType: !195, size: 64, align: 64, offset: 1408)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Spline", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 96, baseType: !202, size: 64, align: 64, offset: 1472)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRISM_SPLINE", scope: !5, file: !160, line: 63, baseType: !"_ZTSN3pov19Prism_Spline_StructE")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Intersections", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 97, baseType: !205, size: 64, align: 64, offset: 1536)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRISM_INT", scope: !5, file: !160, line: 65, baseType: !"_ZTSN3pov28Prism_Intersection_StructureE")
!207 = !DIDerivedType(tag: DW_TAG_member, name: "u1", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 98, baseType: !195, size: 64, align: 64, offset: 1600)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 98, baseType: !195, size: 64, align: 64, offset: 1664)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 98, baseType: !195, size: 64, align: 64, offset: 1728)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !"_ZTSN3pov12Prism_StructE", file: !160, line: 98, baseType: !195, size: 64, align: 64, offset: 1792)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !4, line: 1503, size: 704, align: 64, elements: !212, identifier: "_ZTSN3pov13Method_StructE")
!212 = !{!213, !222, !228, !235, !237, !243, !248, !250, !252, !257, !262}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1505, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !4, line: 1420, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!147, !167, !218, !220}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !4, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !4, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1506, baseType: !223, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !4, line: 1421, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!147, !227, !167}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1507, baseType: !229, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !4, line: 1422, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !227, !167, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !4, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1508, baseType: !236, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !4, line: 1423, baseType: !230)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1509, baseType: !238, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !4, line: 1424, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !167}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1510, baseType: !244, size: 64, align: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !4, line: 1425, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !167, !227, !184}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1511, baseType: !249, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !4, line: 1426, baseType: !245)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1512, baseType: !251, size: 64, align: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !4, line: 1427, baseType: !245)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1513, baseType: !253, size: 64, align: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !4, line: 1428, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !167, !184}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1514, baseType: !258, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !4, line: 1429, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !167}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1515, baseType: !263, size: 64, align: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !4, line: 1430, baseType: !259)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !4, line: 1521, size: 960, align: 64, elements: !265, identifier: "_ZTSN3pov13Object_StructE")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !163, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !147, size: 32, align: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !167, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !170, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !170, size: 64, align: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !174, size: 64, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !167, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !167, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !179, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !182, size: 192, align: 32, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !184, size: 64, align: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !184, size: 64, align: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !188, size: 32, align: 32, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !190, size: 32, align: 32, offset: 928)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !4, line: 1345, size: 1664, align: 64, elements: !281, identifier: "_ZTSN3pov14Texture_StructE")
!281 = !{!282, !284, !285, !286, !287, !288, !289, !290, !293, !296, !299, !300, !301, !304, !307, !310, !311}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !283, size: 16, align: 16)
!283 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !283, size: 16, align: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !283, size: 16, align: 16, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !147, size: 32, align: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !188, size: 32, align: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !188, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !188, size: 32, align: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !291, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !4, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !294, size: 64, align: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !4, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !297, size: 64, align: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !4, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !170, size: 64, align: 64, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1348, baseType: !302, size: 64, align: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !4, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1349, baseType: !305, size: 64, align: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !4, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1350, baseType: !308, size: 64, align: 64, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !4, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1351, baseType: !170, size: 64, align: 64, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1352, baseType: !147, size: 32, align: 32, offset: 1600)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !4, line: 1373, size: 192, align: 64, elements: !313, identifier: "_ZTSN3pov12Warps_StructE")
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !283, size: 16, align: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !291, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !291, size: 64, align: 64, offset: 128)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !4, line: 1323, size: 1280, align: 64, elements: !318, identifier: "_ZTSN3pov14Pattern_StructE")
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !283, size: 16, align: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !283, size: 16, align: 16, offset: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !283, size: 16, align: 16, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !147, size: 32, align: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !188, size: 32, align: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !188, size: 32, align: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !188, size: 32, align: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !291, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !294, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !297, size: 64, align: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !4, line: 1045, size: 128, align: 64, elements: !331, identifier: "_ZTSN3pov16Blend_Map_StructE")
!331 = !{!332, !333, !335, !337, !338}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1047, baseType: !147, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1048, baseType: !334, size: 16, align: 16, offset: 32)
!334 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !336, size: 8, align: 8, offset: 48)
!336 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !336, size: 8, align: 8, offset: 56)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1050, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !4, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !4, line: 1031, size: 256, align: 64, elements: !342, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!342 = !{!343, !344, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1033, baseType: !188, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1034, baseType: !345, size: 8, align: 8, offset: 32)
!345 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!347 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1035, size: 192, align: 64, elements: !348, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!348 = !{!349, !354, !355, !356, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1037, baseType: !350, size: 160, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !351)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 160, align: 32, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 5)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1038, baseType: !302, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1039, baseType: !305, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1040, baseType: !170, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1041, baseType: !358, size: 128, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !4, line: 676, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, align: 64, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 2)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !4, line: 1328, size: 1472, align: 64, elements: !363, identifier: "_ZTSN3pov14Pigment_StructE")
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !283, size: 16, align: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !283, size: 16, align: 16, offset: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !283, size: 16, align: 16, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !147, size: 32, align: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !188, size: 32, align: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !188, size: 32, align: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !188, size: 32, align: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !291, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !294, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !297, size: 64, align: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1331, baseType: !350, size: 160, align: 32, offset: 1280)
!376 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, size: 896, align: 64, elements: !377, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!377 = !{!378, !381, !384, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !4, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !4, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 192, align: 64, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 3)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !188, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !302, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, baseType: !167, size: 64, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !4, line: 1269, size: 128, align: 64, elements: !403, identifier: "_ZTSN3pov19Density_file_StructE")
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1271, baseType: !147, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1272, baseType: !406, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !4, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !4, line: 1275, size: 320, align: 64, elements: !409, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!409 = !{!410, !411, !413, !414, !415, !416, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1277, baseType: !147, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1278, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !147, size: 32, align: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !147, size: 32, align: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !147, size: 32, align: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1280, baseType: !147, size: 32, align: 32, offset: 224)
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!418 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, size: 64, align: 64, elements: !419, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!419 = !{!420, !422, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1283, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1284, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1285, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !4, line: 1220, size: 960, align: 64, elements: !427, identifier: "_ZTSN3pov12Image_StructE")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !447, !448}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1222, baseType: !147, size: 32, align: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1223, baseType: !147, size: 32, align: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1224, baseType: !147, size: 32, align: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1225, baseType: !147, size: 32, align: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1226, baseType: !147, size: 32, align: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !147, size: 32, align: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !147, size: 32, align: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1228, baseType: !334, size: 16, align: 16, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1229, baseType: !336, size: 8, align: 8, offset: 240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1230, baseType: !336, size: 8, align: 8, offset: 248)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1231, baseType: !385, size: 192, align: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !188, size: 32, align: 32, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !188, size: 32, align: 32, offset: 480)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1233, baseType: !358, size: 128, align: 64, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !195, size: 64, align: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !195, size: 64, align: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1235, baseType: !445, size: 64, align: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !4, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1236, baseType: !242, size: 64, align: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !4, line: 1161, size: 80, align: 16, elements: !450, identifier: "_ZTSN3pov19Image_Colour_StructE")
!450 = !{!451, !452, !453, !454, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !283, size: 16, align: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !283, size: 16, align: 16, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !283, size: 16, align: 16, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !283, size: 16, align: 16, offset: 48)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !283, size: 16, align: 16, offset: 64)
!456 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1237, size: 64, align: 64, elements: !457, identifier: "_ZTSN3pov12Image_StructUt_E")
!457 = !{!458, !461, !464, !466}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1239, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !4, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1240, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !4, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1241, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1242, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !4, line: 1166, size: 256, align: 64, elements: !469, identifier: "_ZTSN3pov18Image8_Line_StructE")
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !421, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !421, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !421, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !421, size: 64, align: 64, offset: 192)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !4, line: 1171, size: 256, align: 64, elements: !475, identifier: "_ZTSN3pov19Image16_Line_StructE")
!475 = !{!476, !477, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !423, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !423, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !423, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !423, size: 64, align: 64, offset: 192)
!480 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 256, align: 64, elements: !481, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !188, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64, offset: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 64, align: 32, elements: !485, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !188, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !4, line: 1330, baseType: !188, size: 32, align: 32, offset: 32)
!488 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 320, align: 64, elements: !489, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64, offset: 128)
!493 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 896, align: 64, elements: !494, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!494 = !{!495, !496, !497, !498, !499, !500, !502, !503}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !501, size: 64, align: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !147, size: 32, align: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64, offset: 704)
!504 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 832, align: 64, elements: !505, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !385, size: 192, align: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16, offset: 400)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !358, size: 128, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !4, line: 1330, baseType: !358, size: 128, align: 64, offset: 704)
!514 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 384, align: 64, elements: !515, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!515 = !{!516, !517, !518, !519, !520, !521, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !358, size: 128, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16, offset: 144)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !334, size: 16, align: 16, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !195, size: 64, align: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !4, line: 1330, baseType: !147, size: 32, align: 32, offset: 320)
!523 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !4, line: 1330, size: 128, align: 64, elements: !524, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !242, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !4, line: 1330, baseType: !242, size: 64, align: 64, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !4, line: 1334, size: 1344, align: 64, elements: !528, identifier: "_ZTSN3pov14Tnormal_StructE")
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !283, size: 16, align: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !283, size: 16, align: 16, offset: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !283, size: 16, align: 16, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !147, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !188, size: 32, align: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !188, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !188, size: 32, align: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !291, size: 64, align: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !294, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !297, size: 64, align: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1337, baseType: !188, size: 32, align: 32, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1338, baseType: !188, size: 32, align: 32, offset: 1312)
!542 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, size: 896, align: 64, elements: !543, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !379, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !382, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !188, size: 32, align: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !302, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !167, size: 64, align: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 256, align: 64, elements: !561, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !188, size: 32, align: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 64, align: 32, elements: !565, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !188, size: 32, align: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !188, size: 32, align: 32, offset: 32)
!568 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 320, align: 64, elements: !569, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64, offset: 128)
!573 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 896, align: 64, elements: !574, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !501, size: 64, align: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !147, size: 32, align: 32, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64, offset: 704)
!583 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 832, align: 64, elements: !584, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !385, size: 192, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16, offset: 400)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !358, size: 128, align: 64, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !358, size: 128, align: 64, offset: 704)
!593 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 384, align: 64, elements: !594, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!594 = !{!595, !596, !597, !598, !599, !600, !601}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !358, size: 128, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16, offset: 144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !334, size: 16, align: 16, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !195, size: 64, align: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !147, size: 32, align: 32, offset: 320)
!602 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 128, align: 64, elements: !603, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !242, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !242, size: 64, align: 64, offset: 64)
!606 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, size: 896, align: 64, elements: !607, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !379, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !382, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !188, size: 32, align: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !302, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, baseType: !167, size: 64, align: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 256, align: 64, elements: !625, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !188, size: 32, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64, offset: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 64, align: 32, elements: !629, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !188, size: 32, align: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !4, line: 1325, baseType: !188, size: 32, align: 32, offset: 32)
!632 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 320, align: 64, elements: !633, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64, offset: 128)
!637 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 896, align: 64, elements: !638, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !501, size: 64, align: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !147, size: 32, align: 32, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64, offset: 704)
!647 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 832, align: 64, elements: !648, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !385, size: 192, align: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16, offset: 400)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !358, size: 128, align: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !4, line: 1325, baseType: !358, size: 128, align: 64, offset: 704)
!657 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 384, align: 64, elements: !658, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!658 = !{!659, !660, !661, !662, !663, !664, !665}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !358, size: 128, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16, offset: 144)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !334, size: 16, align: 16, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !195, size: 64, align: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !4, line: 1325, baseType: !147, size: 32, align: 32, offset: 320)
!666 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !4, line: 1325, size: 128, align: 64, elements: !667, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !4, line: 1325, baseType: !242, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !4, line: 1325, baseType: !242, size: 64, align: 64, offset: 64)
!670 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, size: 896, align: 64, elements: !671, identifier: "_ZTSN3pov14Texture_StructUt_E")
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !379, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !382, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !188, size: 32, align: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !302, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !167, size: 64, align: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 256, align: 64, elements: !689, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !188, size: 32, align: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 64, align: 32, elements: !693, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !188, size: 32, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !188, size: 32, align: 32, offset: 32)
!696 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 320, align: 64, elements: !697, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64, offset: 128)
!701 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 896, align: 64, elements: !702, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !501, size: 64, align: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !147, size: 32, align: 32, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64, offset: 704)
!711 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 832, align: 64, elements: !712, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !385, size: 192, align: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16, offset: 400)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !358, size: 128, align: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !358, size: 128, align: 64, offset: 704)
!721 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 384, align: 64, elements: !722, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!722 = !{!723, !724, !725, !726, !727, !728, !729}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !358, size: 128, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16, offset: 144)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !334, size: 16, align: 16, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !195, size: 64, align: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !147, size: 32, align: 32, offset: 320)
!730 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 128, align: 64, elements: !731, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !242, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !242, size: 64, align: 64, offset: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !4, line: 1356, size: 928, align: 32, elements: !735, identifier: "_ZTSN3pov13Finish_StructE")
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !755, !756, !757, !758, !759, !760}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !188, size: 32, align: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !188, size: 32, align: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !188, size: 32, align: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !188, size: 32, align: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !188, size: 32, align: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !188, size: 32, align: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !188, size: 32, align: 32, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !188, size: 32, align: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !188, size: 32, align: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !188, size: 32, align: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !188, size: 32, align: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !188, size: 32, align: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !188, size: 32, align: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !188, size: 32, align: 32, offset: 416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !188, size: 32, align: 32, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !188, size: 32, align: 32, offset: 480)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !753, size: 96, align: 32, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !4, line: 682, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, align: 32, elements: !387)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !753, size: 96, align: 32, offset: 608)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !753, size: 96, align: 32, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1365, baseType: !188, size: 32, align: 32, offset: 800)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1366, baseType: !147, size: 32, align: 32, offset: 832)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1367, baseType: !188, size: 32, align: 32, offset: 864)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1368, baseType: !147, size: 32, align: 32, offset: 896)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !4, line: 1112, size: 512, align: 64, elements: !762, identifier: "_ZTSN3pov15Interior_StructE")
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1114, baseType: !147, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !147, size: 32, align: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !147, size: 32, align: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !188, size: 32, align: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !188, size: 32, align: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !188, size: 32, align: 32, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !188, size: 32, align: 32, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !188, size: 32, align: 32, offset: 224)
