; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/processoptions.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%"class.pov_base::ProcessOptions" = type { i32 (...)**, %"struct.pov_base::ProcessOptions::INI_Parser_Table"*, %"struct.pov_base::ProcessOptions::Cmd_Parser_Table"* }
%"struct.pov_base::ProcessOptions::INI_Parser_Table" = type { i8*, i32, i32 }
%"struct.pov_base::ProcessOptions::Cmd_Parser_Table" = type { i8*, i32, i32, i32 }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !57, subprograms: !535, globals: !878, imports: !879)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/processoptions.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !32, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 44, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_err.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !6, line: 37)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!8 = !DIEnumerator(name: "kNoError", value: 0)
!9 = !DIEnumerator(name: "kNoErr", value: 0)
!10 = !DIEnumerator(name: "kParamErr", value: -1)
!11 = !DIEnumerator(name: "kMemFullErr", value: -2)
!12 = !DIEnumerator(name: "kOutOfMemoryErr", value: -2)
!13 = !DIEnumerator(name: "kInvalidDataSizeErr", value: -3)
!14 = !DIEnumerator(name: "kCannotHandleDataErr", value: -4)
!15 = !DIEnumerator(name: "kNullPointerErr", value: -5)
!16 = !DIEnumerator(name: "kChecksumErr", value: -6)
!17 = !DIEnumerator(name: "kParseErr", value: -7)
!18 = !DIEnumerator(name: "kCannotOpenFileErr", value: -8)
!19 = !DIEnumerator(name: "kInvalidDestAddrErr", value: -9)
!20 = !DIEnumerator(name: "kCannotConnectErr", value: -10)
!21 = !DIEnumerator(name: "kDisconnectedErr", value: -11)
!22 = !DIEnumerator(name: "kHostDisconnectedErr", value: -12)
!23 = !DIEnumerator(name: "kNetworkDataErr", value: -13)
!24 = !DIEnumerator(name: "kNetworkConnectionErr", value: -14)
!25 = !DIEnumerator(name: "kObjectAccessErr", value: -15)
!26 = !DIEnumerator(name: "kVersionErr", value: -16)
!27 = !DIEnumerator(name: "kFileDataErr", value: -17)
!28 = !DIEnumerator(name: "kAuthorisationErr", value: -18)
!29 = !DIEnumerator(name: "kDataTypeErr", value: -19)
!30 = !DIEnumerator(name: "kTimeoutErr", value: -20)
!31 = !DIEnumerator(name: "kInvalidContextErr", value: -21)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 73, size: 32, align: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "kFalseErr", value: 1)
!35 = !DIEnumerator(name: "kOutOfSyncErr", value: 2)
!36 = !DIEnumerator(name: "kNotNowErr", value: 2)
!37 = !DIEnumerator(name: "kQueueFullErr", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 151, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!41 = !DIEnumerator(name: "kPOVMSType_Object", value: 1329744453)
!42 = !DIEnumerator(name: "kPOVMSType_LockedObject", value: 1280262987)
!43 = !DIEnumerator(name: "kPOVMSType_ResultObject", value: 1380275029)
!44 = !DIEnumerator(name: "kPOVMSType_Address", value: 1094992978)
!45 = !DIEnumerator(name: "kPOVMSType_Null", value: 1314212940)
!46 = !DIEnumerator(name: "kPOVMSType_WildCard", value: 707406378)
!47 = !DIEnumerator(name: "kPOVMSType_CString", value: 1129534546)
!48 = !DIEnumerator(name: "kPOVMSType_UnicodeText", value: 1431590996)
!49 = !DIEnumerator(name: "kPOVMSType_Int", value: 1229870132)
!50 = !DIEnumerator(name: "kPOVMSType_Long", value: 1229870136)
!51 = !DIEnumerator(name: "kPOVMSType_Float", value: 1179407412)
!52 = !DIEnumerator(name: "kPOVMSType_Double", value: 1179407416)
!53 = !DIEnumerator(name: "kPOVMSType_Bool", value: 1112493900)
!54 = !DIEnumerator(name: "kPOVMSType_Pixel", value: 1346983988)
!55 = !DIEnumerator(name: "kPOVMSType_Type", value: 1415139397)
!56 = !DIEnumerator(name: "kPOVMSType_List", value: 1279873876)
!57 = !{!58, !66, !72, !77, !82, !136, !140, !141, !254, !259, !265, !270, !276, !282, !308, !362, !416, !462, !530, !70, !534}
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !59, identifier: "_ZTS13__va_list_tag")
!59 = !{!60, !62, !63, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !61, size: 32, align: 32)
!61 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !61, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 82, size: 64, align: 32, elements: !68, identifier: "_ZTS5div_t")
!67 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !{!69, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !67, line: 83, baseType: !70, size: 32, align: 32)
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !67, line: 84, baseType: !70, size: 32, align: 32, offset: 32)
!72 = !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 87, size: 128, align: 64, elements: !73, identifier: "_ZTS6ldiv_t")
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !67, line: 88, baseType: !75, size: 64, align: 64)
!75 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !67, line: 89, baseType: !75, size: 64, align: 64, offset: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 93, size: 128, align: 64, elements: !78, identifier: "_ZTS7lldiv_t")
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !67, line: 94, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !67, line: 95, baseType: !80, size: 64, align: 64, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !83, line: 122, size: 1216, align: 64, elements: !84, identifier: "_ZTS7__sFILE")
!83 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !{!85, !88, !89, !90, !92, !93, !94, !95, !96, !100, !106, !115, !121, !122, !124, !125, !129, !133, !134, !135}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !83, line: 123, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !83, line: 124, baseType: !70, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !83, line: 125, baseType: !70, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !83, line: 126, baseType: !91, size: 16, align: 16, offset: 128)
!91 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !83, line: 127, baseType: !91, size: 16, align: 16, offset: 144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !83, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !83, line: 129, baseType: !70, size: 32, align: 32, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !83, line: 132, baseType: !64, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !83, line: 133, baseType: !97, size: 64, align: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!70, !64}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !83, line: 134, baseType: !101, size: 64, align: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!70, !64, !104, !70}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !83, line: 135, baseType: !107, size: 64, align: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !64, !110, !70}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !83, line: 77, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !112, line: 71, baseType: !113)
!112 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !114, line: 46, baseType: !80)
!114 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !83, line: 136, baseType: !116, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!70, !64, !119, !70}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !83, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !83, line: 140, baseType: !123, size: 64, align: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !83, line: 141, baseType: !70, size: 32, align: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !83, line: 144, baseType: !126, size: 24, align: 8, offset: 928)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 24, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !83, line: 145, baseType: !130, size: 8, align: 8, offset: 952)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !83, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !83, line: 151, baseType: !70, size: 32, align: 32, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !83, line: 152, baseType: !110, size: 64, align: 64, offset: 1152)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !83, line: 88, size: 128, align: 64, elements: !137, identifier: "_ZTS6__sbuf")
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !83, line: 89, baseType: !86, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !83, line: 90, baseType: !70, size: 32, align: 32, offset: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !83, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!141 = !DICompositeType(tag: DW_TAG_class_type, name: "ProcessOptions", scope: !5, file: !142, line: 43, size: 192, align: 64, elements: !143, vtableHolder: !"_ZTSN8pov_base14ProcessOptionsE", identifier: "_ZTSN8pov_base14ProcessOptionsE")
!142 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/processoptions.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !{!144, !149, !151, !153, !157, !160, !165, !169, !170, !174, !177, !180, !183, !186, !189, !192, !196, !199, !202, !205, !206, !207, !211, !214, !217, !220, !223, !226, !229, !232, !236, !239, !242, !245, !246, !247, !250, !253}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ProcessOptions", scope: !142, file: !142, baseType: !145, size: 64, flags: DIFlagArtificial)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!70}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ini_table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 84, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cmd_table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 85, baseType: !152, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", size: 64, align: 64)
!153 = !DISubprogram(name: "ProcessOptions", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 61, type: !154, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !156, !150, !152}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptionsE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!157 = !DISubprogram(name: "~ProcessOptions", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 62, type: !158, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !156}
!160 = !DISubprogram(name: "ParseFile", linkageName: "_ZN8pov_base14ProcessOptions9ParseFileEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 64, type: !161, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!161 = !DISubroutineType(types: !162)
!162 = !{!70, !156, !119, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !39, line: 173, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!165 = !DISubprogram(name: "ParseString", linkageName: "_ZN8pov_base14ProcessOptions11ParseStringEPKcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 65, type: !166, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubroutineType(types: !167)
!167 = !{!70, !156, !119, !163, !168}
!168 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!169 = !DISubprogram(name: "WriteFile", linkageName: "_ZN8pov_base14ProcessOptions9WriteFileEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 67, type: !161, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubprogram(name: "WriteFile", linkageName: "_ZN8pov_base14ProcessOptions9WriteFileEPNS_11OTextStreamEP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 68, type: !171, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!70, !156, !173, !163}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64)
!174 = !DISubprogram(name: "ReadSpecialOptionHandler", linkageName: "_ZN8pov_base14ProcessOptions24ReadSpecialOptionHandlerEPNS0_16INI_Parser_TableEPcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 70, type: !175, isLocal: false, isDefinition: false, scopeLine: 70, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!175 = !DISubroutineType(types: !176)
!176 = !{!70, !156, !150, !104, !163}
!177 = !DISubprogram(name: "ReadSpecialSwitchHandler", linkageName: "_ZN8pov_base14ProcessOptions24ReadSpecialSwitchHandlerEPNS0_16Cmd_Parser_TableEPcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 71, type: !178, isLocal: false, isDefinition: false, scopeLine: 71, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{!70, !156, !152, !104, !163, !168}
!180 = !DISubprogram(name: "WriteSpecialOptionHandler", linkageName: "_ZN8pov_base14ProcessOptions25WriteSpecialOptionHandlerEPNS0_16INI_Parser_TableEP9POVMSDataPNS_11OTextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 72, type: !181, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!181 = !DISubroutineType(types: !182)
!182 = !{!70, !156, !150, !163, !173}
!183 = !DISubprogram(name: "WriteOptionFilter", linkageName: "_ZN8pov_base14ProcessOptions17WriteOptionFilterEPNS0_16INI_Parser_TableE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 73, type: !184, isLocal: false, isDefinition: false, scopeLine: 73, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!184 = !DISubroutineType(types: !185)
!185 = !{!168, !156, !150}
!186 = !DISubprogram(name: "ProcessUnknownSwitch", linkageName: "_ZN8pov_base14ProcessOptions20ProcessUnknownSwitchEPcS1_P9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 74, type: !187, isLocal: false, isDefinition: false, scopeLine: 74, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!187 = !DISubroutineType(types: !188)
!188 = !{!168, !156, !104, !104, !163}
!189 = !DISubprogram(name: "ProcessUnknownString", linkageName: "_ZN8pov_base14ProcessOptions20ProcessUnknownStringEPcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 75, type: !190, isLocal: false, isDefinition: false, scopeLine: 75, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{!70, !156, !104, !163}
!192 = !DISubprogram(name: "OpenFileForRead", linkageName: "_ZN8pov_base14ProcessOptions15OpenFileForReadEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 77, type: !193, isLocal: false, isDefinition: false, scopeLine: 77, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !156, !119, !163}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64)
!196 = !DISubprogram(name: "OpenFileForWrite", linkageName: "_ZN8pov_base14ProcessOptions16OpenFileForWriteEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 78, type: !197, isLocal: false, isDefinition: false, scopeLine: 78, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 7, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!197 = !DISubroutineType(types: !198)
!198 = !{!173, !156, !119, !163}
!199 = !DISubprogram(name: "ParseError", linkageName: "_ZN8pov_base14ProcessOptions10ParseErrorEPKcz", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 80, type: !200, isLocal: false, isDefinition: false, scopeLine: 80, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 8, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !156, !119, null}
!202 = !DISubprogram(name: "ParseErrorAt", linkageName: "_ZN8pov_base14ProcessOptions12ParseErrorAtEPNS_11ITextStreamEPKcz", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 81, type: !203, isLocal: false, isDefinition: false, scopeLine: 81, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !156, !195, !119, null}
!205 = !DISubprogram(name: "WriteError", linkageName: "_ZN8pov_base14ProcessOptions10WriteErrorEPKcz", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 82, type: !200, isLocal: false, isDefinition: false, scopeLine: 82, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!206 = !DISubprogram(name: "Output_INI_Option", linkageName: "_ZN8pov_base14ProcessOptions17Output_INI_OptionEPNS0_16INI_Parser_TableEP9POVMSDataPNS_11OTextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 87, type: !181, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true)
!207 = !DISubprogram(name: "Parse_INI_Specification", linkageName: "_ZN8pov_base14ProcessOptions23Parse_INI_SpecificationEPKcRPcS4_", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 89, type: !208, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{!70, !156, !119, !210, !210}
!210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !104)
!211 = !DISubprogram(name: "Parse_INI_Skip_Space", linkageName: "_ZN8pov_base14ProcessOptions20Parse_INI_Skip_SpaceEPNS_11ITextStreamEb", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 90, type: !212, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!70, !156, !195, !168}
!214 = !DISubprogram(name: "Parse_INI_Skip_Line", linkageName: "_ZN8pov_base14ProcessOptions19Parse_INI_Skip_LineEPNS_11ITextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 91, type: !215, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{!70, !156, !195}
!217 = !DISubprogram(name: "Parse_INI_Option", linkageName: "_ZN8pov_base14ProcessOptions16Parse_INI_OptionEPNS_11ITextStreamEP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 92, type: !218, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{!70, !156, !195, !163}
!220 = !DISubprogram(name: "Parse_INI_Switch", linkageName: "_ZN8pov_base14ProcessOptions16Parse_INI_SwitchEPNS_11ITextStreamEiP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 93, type: !221, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!70, !156, !195, !70, !163}
!223 = !DISubprogram(name: "Parse_INI_String", linkageName: "_ZN8pov_base14ProcessOptions16Parse_INI_StringEPNS_11ITextStreamEib", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 94, type: !224, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!104, !156, !195, !70, !168}
!226 = !DISubprogram(name: "Parse_INI_String_Smartmode", linkageName: "_ZN8pov_base14ProcessOptions26Parse_INI_String_SmartmodeEPNS_11ITextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 95, type: !227, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true)
!227 = !DISubroutineType(types: !228)
!228 = !{!168, !156, !195}
!229 = !DISubprogram(name: "Parse_CL", linkageName: "_ZN8pov_base14ProcessOptions8Parse_CLEPcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 97, type: !230, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!70, !156, !104, !163, !168}
!232 = !DISubprogram(name: "Parse_CL_Skip_Space", linkageName: "_ZN8pov_base14ProcessOptions19Parse_CL_Skip_SpaceERPKc", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 98, type: !233, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !156, !235}
!235 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !119)
!236 = !DISubprogram(name: "Parse_CL_Switch", linkageName: "_ZN8pov_base14ProcessOptions15Parse_CL_SwitchERPKciP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 99, type: !237, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!70, !156, !235, !70, !163, !168}
!239 = !DISubprogram(name: "Parse_CL_Option", linkageName: "_ZN8pov_base14ProcessOptions15Parse_CL_OptionERPKcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 100, type: !240, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true)
!240 = !DISubroutineType(types: !241)
!241 = !{!70, !156, !235, !163, !168}
!242 = !DISubprogram(name: "Parse_CL_String", linkageName: "_ZN8pov_base14ProcessOptions15Parse_CL_StringERPKci", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 101, type: !243, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{!104, !156, !235, !70}
!245 = !DISubprogram(name: "Process_INI_Option", linkageName: "_ZN8pov_base14ProcessOptions18Process_INI_OptionEPNS0_16INI_Parser_TableEPcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 103, type: !175, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true)
!246 = !DISubprogram(name: "Process_Switch", linkageName: "_ZN8pov_base14ProcessOptions14Process_SwitchEPNS0_16Cmd_Parser_TableEPcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 104, type: !178, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "Matches", linkageName: "_ZN8pov_base14ProcessOptions7MatchesEPKcS2_", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 106, type: !248, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!168, !156, !119, !119}
!250 = !DISubprogram(name: "IsTrue", linkageName: "_ZN8pov_base14ProcessOptions6IsTrueEPKc", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 107, type: !251, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!168, !156, !119}
!253 = !DISubprogram(name: "IsFalse", linkageName: "_ZN8pov_base14ProcessOptions7IsFalseEPKc", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 108, type: !251, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "INI_Parser_Table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 46, size: 128, align: 64, elements: !255, identifier: "_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE")
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", file: !142, line: 48, baseType: !119, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", file: !142, line: 49, baseType: !61, size: 32, align: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", file: !142, line: 50, baseType: !61, size: 32, align: 32, offset: 96)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd_Parser_Table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !142, line: 53, size: 192, align: 64, elements: !260, identifier: "_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE")
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !142, line: 55, baseType: !119, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !142, line: 56, baseType: !61, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !142, line: 57, baseType: !61, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_switch", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !142, line: 58, baseType: !61, size: 32, align: 32, offset: 128)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !39, line: 178, size: 128, align: 64, elements: !266, identifier: "_ZTS9POVMSData")
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !39, line: 180, baseType: !61, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !39, line: 181, baseType: !70, size: 32, align: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !39, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !39, line: 182, size: 64, align: 64, elements: !271, identifier: "_ZTSN9POVMSDataUt_E")
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !39, line: 184, baseType: !64, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !39, line: 185, baseType: !164, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !39, line: 186, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !39, line: 190, size: 320, align: 64, elements: !277, identifier: "_ZTS9POVMSNode")
!277 = !{!278, !279, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !39, line: 192, baseType: !275, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !39, line: 193, baseType: !275, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !39, line: 194, baseType: !61, size: 32, align: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !39, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!282 = !DICompositeType(tag: DW_TAG_class_type, name: "OTextStream", scope: !5, file: !283, line: 91, size: 192, align: 64, elements: !284, vtableHolder: !"_ZTSN8pov_base11OTextStreamE", identifier: "_ZTSN8pov_base11OTextStreamE")
!283 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!284 = !{!285, !286, !288, !289, !293, !296, !299, !302, !305}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$OTextStream", scope: !283, file: !283, baseType: !145, size: 64, flags: DIFlagArtificial)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 103, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 104, baseType: !104, size: 64, align: 64, offset: 128)
!289 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 94, type: !290, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292, !119, !61, !168}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!293 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 95, type: !294, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !292, !119, !287}
!296 = !DISubprogram(name: "~OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 96, type: !297, isLocal: false, isDefinition: false, scopeLine: 96, containingType: !"_ZTSN8pov_base11OTextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !292}
!299 = !DISubprogram(name: "putchar", linkageName: "_ZN8pov_base11OTextStream7putcharEi", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 98, type: !300, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !292, !70}
!302 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base11OTextStream6printfEPKcz", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 99, type: !303, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !292, !119, null}
!305 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11OTextStream4nameEv", scope: !"_ZTSN8pov_base11OTextStreamE", file: !283, line: 101, type: !306, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{!119, !292}
!308 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !6, line: 150, size: 320, align: 64, elements: !309, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!309 = !{!310, !311, !316, !319, !322, !326, !330, !333, !337, !340, !343, !346, !349, !350, !353, !354, !357, !358, !361}
!310 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!311 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 153, type: !312, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314, !315}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!316 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 154, type: !317, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !314}
!319 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 156, type: !320, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !314, !119, null}
!322 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 158, type: !323, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !314, !87}
!325 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!326 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 159, type: !327, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!325, !314, !329}
!329 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!330 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 160, type: !331, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!325, !314, !61}
!333 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 161, type: !334, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{!325, !314, !336}
!336 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!337 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 162, type: !338, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{!325, !314}
!340 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 164, type: !341, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{!325, !314, !119}
!343 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 165, type: !344, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{!325, !314, !86}
!346 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 166, type: !347, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!325, !314, !105}
!349 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 167, type: !323, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!350 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 168, type: !351, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!325, !314, !91}
!353 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 169, type: !327, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 170, type: !355, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!325, !314, !70}
!357 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 171, type: !331, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!358 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 172, type: !359, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!325, !314, !75}
!361 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 173, type: !334, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!362 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !6, line: 84, size: 320, align: 64, elements: !363, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!363 = !{!364, !365, !366, !369, !370, !371, !372, !376, !379, !382, !385, !389, !390, !393, !396, !397, !398, !401, !404, !407, !412, !415}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !6, file: !6, baseType: !145, size: 64, flags: DIFlagArtificial)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 110, baseType: !168, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 111, baseType: !367, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !83, line: 153, baseType: !"_ZTS7__sFILE")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 113, baseType: !61, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 114, baseType: !61, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 115, baseType: !104, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!372 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 87, type: !373, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375, !61, !61}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!376 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 88, type: !377, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !375}
!379 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 94, type: !380, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DISubroutineType(types: !381)
!381 = !{!168, !375, !119, !61}
!382 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 95, type: !383, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!383 = !DISubroutineType(types: !384)
!384 = !{!168, !375}
!385 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 96, type: !386, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{!388, !375, !64, !336}
!388 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!389 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 97, type: !386, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 98, type: !391, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{!388, !375, !336, !61}
!393 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 100, type: !394, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{!61, !375}
!396 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 101, type: !394, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 102, type: !383, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!398 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 103, type: !399, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!336, !375}
!401 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 104, type: !402, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{!388, !375}
!404 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 105, type: !405, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{!119, !375}
!407 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 107, type: !408, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{!64, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!412 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 108, type: !413, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!168, !410}
!415 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 112, type: !402, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!416 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !5, file: !283, line: 54, size: 4608, align: 64, elements: !417, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!417 = !{!418, !419, !421, !425, !426, !427, !428, !429, !430, !431, !432, !436, !439, !442, !445, !448, !451, !454, !457, !458, !461}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !283, file: !283, baseType: !145, size: 64, flags: DIFlagArtificial)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 78, baseType: !420, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 79, baseType: !422, size: 4096, align: 8, offset: 128)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 4096, align: 8, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 80, baseType: !336, size: 64, align: 64, offset: 4224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 81, baseType: !336, size: 64, align: 64, offset: 4288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 82, baseType: !336, size: 64, align: 64, offset: 4352)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 83, baseType: !336, size: 64, align: 64, offset: 4416)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 84, baseType: !104, size: 64, align: 64, offset: 4480)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 85, baseType: !70, size: 32, align: 32, offset: 4544)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 86, baseType: !70, size: 32, align: 32, offset: 4576)
!432 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 63, type: !433, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !435, !119, !61}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!436 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 64, type: !437, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !435, !119, !420}
!439 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 65, type: !440, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !435}
!442 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 67, type: !443, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!70, !435}
!445 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 68, type: !446, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !435, !70}
!448 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 70, type: !449, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!168, !435}
!451 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 71, type: !452, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!168, !435, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!454 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 72, type: !455, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!455 = !DISubroutineType(types: !456)
!456 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !435}
!457 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 74, type: !443, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!458 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 76, type: !459, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!459 = !DISubroutineType(types: !460)
!460 = !{!119, !435}
!461 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 88, type: !440, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!462 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !6, line: 118, size: 320, align: 64, elements: !463, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!463 = !{!464, !465, !469, !472, !475, !476, !477, !480, !485, !489, !493, !497, !501, !505, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !524, !527}
!464 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!465 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 121, type: !466, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !468, !315}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!469 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 122, type: !470, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !468}
!472 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 124, type: !473, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!473 = !DISubroutineType(types: !474)
!474 = !{!70, !468}
!475 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 125, type: !473, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 126, type: !473, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!477 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 127, type: !478, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!478 = !DISubroutineType(types: !479)
!479 = !{!75, !468}
!480 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 128, type: !481, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !468, !484}
!483 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!484 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !105)
!485 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 129, type: !486, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{!483, !468, !488}
!488 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !87)
!489 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 130, type: !490, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!490 = !DISubroutineType(types: !491)
!491 = !{!483, !468, !492}
!492 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !91)
!493 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 131, type: !494, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{!483, !468, !496}
!496 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !329)
!497 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 132, type: !498, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{!483, !468, !500}
!500 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !70)
!501 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 133, type: !502, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{!483, !468, !504}
!504 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !61)
!505 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 134, type: !506, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{!483, !468, !508}
!508 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !75)
!509 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 135, type: !510, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{!483, !468, !512}
!512 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !336)
!513 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 137, type: !506, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!514 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 138, type: !498, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!515 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 139, type: !490, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 140, type: !481, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!517 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 141, type: !510, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 142, type: !502, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!519 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 143, type: !494, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 144, type: !486, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!521 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 145, type: !522, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!483, !468, !70}
!524 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 146, type: !525, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{!483, !468, !104, !336}
!527 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 147, type: !528, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubroutineType(types: !529)
!529 = !{!483, !468, !336}
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !283, line: 57, size: 128, align: 64, elements: !531, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !283, line: 59, baseType: !336, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !283, line: 60, baseType: !70, size: 32, align: 32, offset: 64)
!534 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!535 = !{!536, !542, !545, !548, !574, !590, !596, !604, !610, !617, !623, !627, !633, !638, !653, !660, !666, !680, !690, !704, !717, !727, !746, !756, !764, !768, !785, !796, !806, !817, !829, !836, !840, !844, !850, !857, !860, !863, !866, !869, !872, !875}
!536 = !DISubprogram(name: "ProcessOptions", linkageName: "_ZN8pov_base14ProcessOptionsC2EPNS0_16INI_Parser_TableEPNS0_16Cmd_Parser_TableE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !1, line: 43, type: !154, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov_base::ProcessOptions"*, %"struct.pov_base::ProcessOptions::INI_Parser_Table"*, %"struct.pov_base::ProcessOptions::Cmd_Parser_Table"*)* @_ZN8pov_base14ProcessOptionsC2EPNS0_16INI_Parser_TableEPNS0_16Cmd_Parser_TableE, declaration: !153, variables: !537)
!537 = !{!538, !540, !541}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !536, type: !539, flags: DIFlagArtificial | DIFlagObjectPointer)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptionsE", size: 64, align: 64)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pit", arg: 2, scope: !536, file: !1, line: 43, type: !150)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pct", arg: 3, scope: !536, file: !1, line: 43, type: !152)
!542 = !DISubprogram(name: "~ProcessOptions", linkageName: "_ZN8pov_base14ProcessOptionsD2Ev", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !1, line: 49, type: !158, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov_base::ProcessOptions"*)* @_ZN8pov_base14ProcessOptionsD2Ev, declaration: !157, variables: !543)
!543 = !{!544}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !542, type: !539, flags: DIFlagArtificial | DIFlagObjectPointer)
!545 = !DISubprogram(name: "~ProcessOptions", linkageName: "_ZN8pov_base14ProcessOptionsD1Ev", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !1, line: 49, type: !158, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov_base::ProcessOptions"*)* @_ZN8pov_base14ProcessOptionsD1Ev, declaration: !157, variables: !546)
!546 = !{!547}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !545, type: !539, flags: DIFlagArtificial | DIFlagObjectPointer)
!548 = !DISubprogram(name: "ParseFile", linkageName: "_ZN8pov_base14ProcessOptions9ParseFileEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !1, line: 53, type: !161, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%"class.pov_base::ProcessOptions"*, i8*, %struct.POVMSData*)* @_ZN8pov_base14ProcessOptions9ParseFileEPKcP9POVMSData, declaration: !160, variables: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !563, !571}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !548, type: !539, flags: DIFlagArtificial | DIFlagObjectPointer)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filespec", arg: 2, scope: !548, file: !1, line: 53, type: !119)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 3, scope: !548, file: !1, line: 53, type: !163)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !548, file: !1, line: 55, type: !195)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentsection", scope: !548, file: !1, line: 56, type: !119)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sectionname", scope: !548, file: !1, line: 57, type: !104)
