; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/processrenderoptions.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov_base::ProcessOptions::INI_Parser_Table" = type { i8*, i32, i32 }
%"struct.pov_base::ProcessOptions::Cmd_Parser_Table" = type { i8*, i32, i32, i32 }
%"struct.pov_base::POV_File_Extensions" = type { [4 x i8*] }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%"class.pov_frontend::ProcessRenderOptions" = type { %"class.pov_base::ProcessOptions" }
%"class.pov_base::ProcessOptions" = type { i32 (...)**, %"struct.pov_base::ProcessOptions::INI_Parser_Table"*, %"struct.pov_base::ProcessOptions::Cmd_Parser_Table"* }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"class.pov_base::OTextStream" = type { i32 (...)**, %"class.pov_base::OStream"*, i8* }
%"class.pov_base::OStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }

!187 = !DIEnumerator(name: "kPOVAttrib_FunctionVMInstrEst", value: 1180061001)
!188 = !DIEnumerator(name: "kPOVAttrib_State", value: 1400136052)
!189 = !DIEnumerator(name: "kPOVAttrib_Warning", value: 1466004078)
!190 = !DIEnumerator(name: "kPOVAttrib_Line", value: 1281977957)
!191 = !DIEnumerator(name: "kPOVAttrib_Column", value: 1131375733)
!192 = !DIEnumerator(name: "kPOVAttrib_FilePosition", value: 1179676531)
!193 = !DIEnumerator(name: "kPOVAttrib_TokenName", value: 1416588110)
!194 = !DIEnumerator(name: "kPOVAttrib_Error", value: 1165128303)
!195 = !DIEnumerator(name: "kPOVAttrib_ObjectName", value: 1330536813)
!196 = !DIEnumerator(name: "kPOVAttrib_ObjectID", value: 1330209893)
!197 = !DIEnumerator(name: "kPOVAttrib_ISectsTests", value: 1230271348)
!198 = !DIEnumerator(name: "kPOVAttrib_ISectsSucceeded", value: 1230206307)
!199 = !DIEnumerator(name: "kPOVAttrib_CommandString", value: 1131375955)
!200 = !DIEnumerator(name: "kPOVAttrib_ReturnAction", value: 1380017012)
!201 = !DIEnumerator(name: "kPOVAttrib_FrameTime", value: 1179937133)
!202 = !DIEnumerator(name: "kPOVAttrib_AnimationTime", value: 1096051053)
!203 = !DIEnumerator(name: "kPOVAttrib_IncludeHeader", value: 1231971144)
!204 = !DIEnumerator(name: "kPOVAttrib_IncludeIni", value: 1231971145)
!205 = !DIEnumerator(name: "kPOVAttrib_PreviewRefCon", value: 1347577190)
!206 = !DIEnumerator(name: "kPOVAttrib_INIFile", value: 1229351276)
!207 = !DIEnumerator(name: "kPOVAttrib_RenderOptions", value: 1380937844)
!208 = !DIEnumerator(name: "kPOVAttrib_Identifier", value: 1231316334)
!209 = !DIEnumerator(name: "kPOVAttrib_Value", value: 1449225333)
!210 = !DIEnumerator(name: "kPOVAttrib_StartColumn", value: 1281713780)
!211 = !DIEnumerator(name: "kPOVAttrib_EndColumn", value: 1382639464)
!212 = !DIEnumerator(name: "kPOVAttrib_StartRow", value: 1416589344)
!213 = !DIEnumerator(name: "kPOVAttrib_EndRow", value: 1114600564)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 73, size: 32, align: 32, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIEnumerator(name: "kFalseErr", value: 1)
!217 = !DIEnumerator(name: "kOutOfSyncErr", value: 2)
!218 = !DIEnumerator(name: "kNotNowErr", value: 2)
!219 = !DIEnumerator(name: "kQueueFullErr", value: 3)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 151, size: 32, align: 32, elements: !222)
!221 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!223 = !DIEnumerator(name: "kPOVMSType_Object", value: 1329744453)
!224 = !DIEnumerator(name: "kPOVMSType_LockedObject", value: 1280262987)
!225 = !DIEnumerator(name: "kPOVMSType_ResultObject", value: 1380275029)
!226 = !DIEnumerator(name: "kPOVMSType_Address", value: 1094992978)
!227 = !DIEnumerator(name: "kPOVMSType_Null", value: 1314212940)
!228 = !DIEnumerator(name: "kPOVMSType_WildCard", value: 707406378)
!229 = !DIEnumerator(name: "kPOVMSType_CString", value: 1129534546)
!230 = !DIEnumerator(name: "kPOVMSType_UnicodeText", value: 1431590996)
!231 = !DIEnumerator(name: "kPOVMSType_Int", value: 1229870132)
!232 = !DIEnumerator(name: "kPOVMSType_Long", value: 1229870136)
!233 = !DIEnumerator(name: "kPOVMSType_Float", value: 1179407412)
!234 = !DIEnumerator(name: "kPOVMSType_Double", value: 1179407416)
!235 = !DIEnumerator(name: "kPOVMSType_Bool", value: 1112493900)
!236 = !DIEnumerator(name: "kPOVMSType_Pixel", value: 1346983988)
!237 = !DIEnumerator(name: "kPOVMSType_Type", value: 1415139397)
!238 = !DIEnumerator(name: "kPOVMSType_List", value: 1279873876)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !6, line: 51, size: 32, align: 32, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!241 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!242 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!243 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!244 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!245 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!246 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!247 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!248 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!249 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!250 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!251 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!252 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!253 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!254 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!255 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!256 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!257 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!258 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!259 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!260 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!261 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!262 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!263 = !{!264, !270, !275, !280, !335, !339, !340, !347, !460, !465, !471, !476, !482, !488, !514, !568, !622, !668, !736, !740, !294, !268, !774}
!264 = !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 82, size: 64, align: 32, elements: !266, identifier: "_ZTS5div_t")
!265 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!266 = !{!267, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !265, line: 83, baseType: !268, size: 32, align: 32)
!268 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !265, line: 84, baseType: !268, size: 32, align: 32, offset: 32)
!270 = !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 87, size: 128, align: 64, elements: !271, identifier: "_ZTS6ldiv_t")
!271 = !{!272, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !265, line: 88, baseType: !273, size: 64, align: 64)
!273 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !265, line: 89, baseType: !273, size: 64, align: 64, offset: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 93, size: 128, align: 64, elements: !276, identifier: "_ZTS7lldiv_t")
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !265, line: 94, baseType: !278, size: 64, align: 64)
!278 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !265, line: 95, baseType: !278, size: 64, align: 64, offset: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !281, line: 122, size: 1216, align: 64, elements: !282, identifier: "_ZTS7__sFILE")
!281 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!282 = !{!283, !286, !287, !288, !290, !291, !292, !293, !295, !299, !305, !314, !320, !321, !323, !324, !328, !332, !333, !334}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !281, line: 123, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !281, line: 124, baseType: !268, size: 32, align: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !281, line: 125, baseType: !268, size: 32, align: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !281, line: 126, baseType: !289, size: 16, align: 16, offset: 128)
!289 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !281, line: 127, baseType: !289, size: 16, align: 16, offset: 144)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !281, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !281, line: 129, baseType: !268, size: 32, align: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !281, line: 132, baseType: !294, size: 64, align: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !281, line: 133, baseType: !296, size: 64, align: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!268, !294}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !281, line: 134, baseType: !300, size: 64, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!268, !294, !303, !268}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !281, line: 135, baseType: !306, size: 64, align: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !294, !309, !268}
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !281, line: 77, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !311, line: 71, baseType: !312)
!311 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !313, line: 46, baseType: !278)
!313 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !281, line: 136, baseType: !315, size: 64, align: 64, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!268, !294, !318, !268}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !281, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !281, line: 140, baseType: !322, size: 64, align: 64, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !281, line: 141, baseType: !268, size: 32, align: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !281, line: 144, baseType: !325, size: 24, align: 8, offset: 928)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 24, align: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 3)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !281, line: 145, baseType: !329, size: 8, align: 8, offset: 952)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 8, align: 8, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 1)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !281, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !281, line: 151, baseType: !268, size: 32, align: 32, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !281, line: 152, baseType: !309, size: 64, align: 64, offset: 1152)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !281, line: 88, size: 128, align: 64, elements: !336, identifier: "_ZTS6__sbuf")
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !281, line: 89, baseType: !284, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !281, line: 90, baseType: !268, size: 32, align: 32, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !281, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !341, identifier: "_ZTS13__va_list_tag")
!341 = !{!342, !344, !345, !346}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !343, size: 32, align: 32)
!343 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !343, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !294, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !294, size: 64, align: 64, offset: 128)
!347 = !DICompositeType(tag: DW_TAG_class_type, name: "ProcessOptions", scope: !5, file: !348, line: 43, size: 192, align: 64, elements: !349, vtableHolder: !"_ZTSN8pov_base14ProcessOptionsE", identifier: "_ZTSN8pov_base14ProcessOptionsE")
!348 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/processoptions.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!349 = !{!350, !355, !357, !359, !363, !366, !371, !375, !376, !380, !383, !386, !389, !392, !395, !398, !402, !405, !408, !411, !412, !413, !417, !420, !423, !426, !429, !432, !435, !438, !442, !445, !448, !451, !452, !453, !456, !459}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ProcessOptions", scope: !348, file: !348, baseType: !351, size: 64, flags: DIFlagArtificial)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!268}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ini_table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 84, baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "parse_cmd_table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 85, baseType: !358, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", size: 64, align: 64)
!359 = !DISubprogram(name: "ProcessOptions", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 61, type: !360, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362, !356, !358}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base14ProcessOptionsE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!363 = !DISubprogram(name: "~ProcessOptions", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 62, type: !364, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !362}
!366 = !DISubprogram(name: "ParseFile", linkageName: "_ZN8pov_base14ProcessOptions9ParseFileEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 64, type: !367, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!367 = !DISubroutineType(types: !368)
!368 = !{!268, !362, !318, !369}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !221, line: 173, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!371 = !DISubprogram(name: "ParseString", linkageName: "_ZN8pov_base14ProcessOptions11ParseStringEPKcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 65, type: !372, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!268, !362, !318, !369, !374}
!374 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!375 = !DISubprogram(name: "WriteFile", linkageName: "_ZN8pov_base14ProcessOptions9WriteFileEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 67, type: !367, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubprogram(name: "WriteFile", linkageName: "_ZN8pov_base14ProcessOptions9WriteFileEPNS_11OTextStreamEP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 68, type: !377, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{!268, !362, !379, !369}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64)
!380 = !DISubprogram(name: "ReadSpecialOptionHandler", linkageName: "_ZN8pov_base14ProcessOptions24ReadSpecialOptionHandlerEPNS0_16INI_Parser_TableEPcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 70, type: !381, isLocal: false, isDefinition: false, scopeLine: 70, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!268, !362, !356, !303, !369}
!383 = !DISubprogram(name: "ReadSpecialSwitchHandler", linkageName: "_ZN8pov_base14ProcessOptions24ReadSpecialSwitchHandlerEPNS0_16Cmd_Parser_TableEPcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 71, type: !384, isLocal: false, isDefinition: false, scopeLine: 71, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{!268, !362, !358, !303, !369, !374}
!386 = !DISubprogram(name: "WriteSpecialOptionHandler", linkageName: "_ZN8pov_base14ProcessOptions25WriteSpecialOptionHandlerEPNS0_16INI_Parser_TableEP9POVMSDataPNS_11OTextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 72, type: !387, isLocal: false, isDefinition: false, scopeLine: 72, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!387 = !DISubroutineType(types: !388)
!388 = !{!268, !362, !356, !369, !379}
!389 = !DISubprogram(name: "WriteOptionFilter", linkageName: "_ZN8pov_base14ProcessOptions17WriteOptionFilterEPNS0_16INI_Parser_TableE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 73, type: !390, isLocal: false, isDefinition: false, scopeLine: 73, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{!374, !362, !356}
!392 = !DISubprogram(name: "ProcessUnknownSwitch", linkageName: "_ZN8pov_base14ProcessOptions20ProcessUnknownSwitchEPcS1_P9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 74, type: !393, isLocal: false, isDefinition: false, scopeLine: 74, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{!374, !362, !303, !303, !369}
!395 = !DISubprogram(name: "ProcessUnknownString", linkageName: "_ZN8pov_base14ProcessOptions20ProcessUnknownStringEPcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 75, type: !396, isLocal: false, isDefinition: false, scopeLine: 75, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{!268, !362, !303, !369}
!398 = !DISubprogram(name: "OpenFileForRead", linkageName: "_ZN8pov_base14ProcessOptions15OpenFileForReadEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 77, type: !399, isLocal: false, isDefinition: false, scopeLine: 77, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!401, !362, !318, !369}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64)
!402 = !DISubprogram(name: "OpenFileForWrite", linkageName: "_ZN8pov_base14ProcessOptions16OpenFileForWriteEPKcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 78, type: !403, isLocal: false, isDefinition: false, scopeLine: 78, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 7, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{!379, !362, !318, !369}
!405 = !DISubprogram(name: "ParseError", linkageName: "_ZN8pov_base14ProcessOptions10ParseErrorEPKcz", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 80, type: !406, isLocal: false, isDefinition: false, scopeLine: 80, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 8, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !362, !318, null}
!408 = !DISubprogram(name: "ParseErrorAt", linkageName: "_ZN8pov_base14ProcessOptions12ParseErrorAtEPNS_11ITextStreamEPKcz", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 81, type: !409, isLocal: false, isDefinition: false, scopeLine: 81, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 9, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !362, !401, !318, null}
!411 = !DISubprogram(name: "WriteError", linkageName: "_ZN8pov_base14ProcessOptions10WriteErrorEPKcz", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 82, type: !406, isLocal: false, isDefinition: false, scopeLine: 82, containingType: !"_ZTSN8pov_base14ProcessOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 10, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!412 = !DISubprogram(name: "Output_INI_Option", linkageName: "_ZN8pov_base14ProcessOptions17Output_INI_OptionEPNS0_16INI_Parser_TableEP9POVMSDataPNS_11OTextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 87, type: !387, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true)
!413 = !DISubprogram(name: "Parse_INI_Specification", linkageName: "_ZN8pov_base14ProcessOptions23Parse_INI_SpecificationEPKcRPcS4_", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 89, type: !414, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{!268, !362, !318, !416, !416}
!416 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !303)
!417 = !DISubprogram(name: "Parse_INI_Skip_Space", linkageName: "_ZN8pov_base14ProcessOptions20Parse_INI_Skip_SpaceEPNS_11ITextStreamEb", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 90, type: !418, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{!268, !362, !401, !374}
!420 = !DISubprogram(name: "Parse_INI_Skip_Line", linkageName: "_ZN8pov_base14ProcessOptions19Parse_INI_Skip_LineEPNS_11ITextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 91, type: !421, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true)
!421 = !DISubroutineType(types: !422)
!422 = !{!268, !362, !401}
!423 = !DISubprogram(name: "Parse_INI_Option", linkageName: "_ZN8pov_base14ProcessOptions16Parse_INI_OptionEPNS_11ITextStreamEP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 92, type: !424, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{!268, !362, !401, !369}
!426 = !DISubprogram(name: "Parse_INI_Switch", linkageName: "_ZN8pov_base14ProcessOptions16Parse_INI_SwitchEPNS_11ITextStreamEiP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 93, type: !427, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true)
!427 = !DISubroutineType(types: !428)
!428 = !{!268, !362, !401, !268, !369}
!429 = !DISubprogram(name: "Parse_INI_String", linkageName: "_ZN8pov_base14ProcessOptions16Parse_INI_StringEPNS_11ITextStreamEib", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 94, type: !430, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{!303, !362, !401, !268, !374}
!432 = !DISubprogram(name: "Parse_INI_String_Smartmode", linkageName: "_ZN8pov_base14ProcessOptions26Parse_INI_String_SmartmodeEPNS_11ITextStreamE", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 95, type: !433, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{!374, !362, !401}
!435 = !DISubprogram(name: "Parse_CL", linkageName: "_ZN8pov_base14ProcessOptions8Parse_CLEPcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 97, type: !436, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!268, !362, !303, !369, !374}
!438 = !DISubprogram(name: "Parse_CL_Skip_Space", linkageName: "_ZN8pov_base14ProcessOptions19Parse_CL_Skip_SpaceERPKc", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 98, type: !439, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !362, !441}
!441 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !318)
!442 = !DISubprogram(name: "Parse_CL_Switch", linkageName: "_ZN8pov_base14ProcessOptions15Parse_CL_SwitchERPKciP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 99, type: !443, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!268, !362, !441, !268, !369, !374}
!445 = !DISubprogram(name: "Parse_CL_Option", linkageName: "_ZN8pov_base14ProcessOptions15Parse_CL_OptionERPKcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 100, type: !446, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{!268, !362, !441, !369, !374}
!448 = !DISubprogram(name: "Parse_CL_String", linkageName: "_ZN8pov_base14ProcessOptions15Parse_CL_StringERPKci", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 101, type: !449, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!303, !362, !441, !268}
!451 = !DISubprogram(name: "Process_INI_Option", linkageName: "_ZN8pov_base14ProcessOptions18Process_INI_OptionEPNS0_16INI_Parser_TableEPcP9POVMSData", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 103, type: !381, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true)
!452 = !DISubprogram(name: "Process_Switch", linkageName: "_ZN8pov_base14ProcessOptions14Process_SwitchEPNS0_16Cmd_Parser_TableEPcP9POVMSDatab", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 104, type: !384, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DISubprogram(name: "Matches", linkageName: "_ZN8pov_base14ProcessOptions7MatchesEPKcS2_", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 106, type: !454, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{!374, !362, !318, !318}
!456 = !DISubprogram(name: "IsTrue", linkageName: "_ZN8pov_base14ProcessOptions6IsTrueEPKc", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 107, type: !457, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!374, !362, !318}
!459 = !DISubprogram(name: "IsFalse", linkageName: "_ZN8pov_base14ProcessOptions7IsFalseEPKc", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 108, type: !457, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "INI_Parser_Table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 46, size: 128, align: 64, elements: !461, identifier: "_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE")
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", file: !348, line: 48, baseType: !318, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", file: !348, line: 49, baseType: !343, size: 32, align: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTSN8pov_base14ProcessOptions16INI_Parser_TableE", file: !348, line: 50, baseType: !343, size: 32, align: 32, offset: 96)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cmd_Parser_Table", scope: !"_ZTSN8pov_base14ProcessOptionsE", file: !348, line: 53, size: 192, align: 64, elements: !466, identifier: "_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE")
!466 = !{!467, !468, !469, !470}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !348, line: 55, baseType: !318, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !348, line: 56, baseType: !343, size: 32, align: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !348, line: 57, baseType: !343, size: 32, align: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "is_switch", scope: !"_ZTSN8pov_base14ProcessOptions16Cmd_Parser_TableE", file: !348, line: 58, baseType: !343, size: 32, align: 32, offset: 128)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !221, line: 178, size: 128, align: 64, elements: !472, identifier: "_ZTS9POVMSData")
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !221, line: 180, baseType: !343, size: 32, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !221, line: 181, baseType: !268, size: 32, align: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !221, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!476 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !221, line: 182, size: 64, align: 64, elements: !477, identifier: "_ZTSN9POVMSDataUt_E")
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !221, line: 184, baseType: !294, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !221, line: 185, baseType: !370, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !221, line: 186, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !221, line: 190, size: 320, align: 64, elements: !483, identifier: "_ZTS9POVMSNode")
!483 = !{!484, !485, !486, !487}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !221, line: 192, baseType: !481, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !221, line: 193, baseType: !481, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !221, line: 194, baseType: !343, size: 32, align: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !221, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!488 = !DICompositeType(tag: DW_TAG_class_type, name: "OTextStream", scope: !5, file: !489, line: 91, size: 192, align: 64, elements: !490, vtableHolder: !"_ZTSN8pov_base11OTextStreamE", identifier: "_ZTSN8pov_base11OTextStreamE")
!489 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!490 = !{!491, !492, !494, !495, !499, !502, !505, !508, !511}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$OTextStream", scope: !489, file: !489, baseType: !351, size: 64, flags: DIFlagArtificial)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 103, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 104, baseType: !303, size: 64, align: 64, offset: 128)
!495 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 94, type: !496, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !498, !318, !343, !374}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!499 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 95, type: !500, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !498, !318, !493}
!502 = !DISubprogram(name: "~OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 96, type: !503, isLocal: false, isDefinition: false, scopeLine: 96, containingType: !"_ZTSN8pov_base11OTextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !498}
!505 = !DISubprogram(name: "putchar", linkageName: "_ZN8pov_base11OTextStream7putcharEi", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 98, type: !506, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !498, !268}
!508 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base11OTextStream6printfEPKcz", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 99, type: !509, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !498, !318, null}
!511 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11OTextStream4nameEv", scope: !"_ZTSN8pov_base11OTextStreamE", file: !489, line: 101, type: !512, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!512 = !DISubroutineType(types: !513)
!513 = !{!318, !498}
!514 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !6, line: 150, size: 320, align: 64, elements: !515, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!515 = !{!516, !517, !522, !525, !528, !532, !536, !539, !543, !546, !549, !552, !555, !556, !559, !560, !563, !564, !567}
!516 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!517 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 153, type: !518, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !520, !521}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!522 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 154, type: !523, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !520}
!525 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 156, type: !526, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !520, !318, null}
!528 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 158, type: !529, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{!531, !520, !285}
!531 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!532 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 159, type: !533, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{!531, !520, !535}
!535 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!536 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 160, type: !537, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!537 = !DISubroutineType(types: !538)
!538 = !{!531, !520, !343}
!539 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 161, type: !540, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!540 = !DISubroutineType(types: !541)
!541 = !{!531, !520, !542}
!542 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!543 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 162, type: !544, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!544 = !DISubroutineType(types: !545)
!545 = !{!531, !520}
!546 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 164, type: !547, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!547 = !DISubroutineType(types: !548)
!548 = !{!531, !520, !318}
!549 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 165, type: !550, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubroutineType(types: !551)
!551 = !{!531, !520, !284}
!552 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 166, type: !553, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!553 = !DISubroutineType(types: !554)
!554 = !{!531, !520, !304}
!555 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 167, type: !529, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!556 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 168, type: !557, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!557 = !DISubroutineType(types: !558)
!558 = !{!531, !520, !289}
!559 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 169, type: !533, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!560 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 170, type: !561, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!561 = !DISubroutineType(types: !562)
!562 = !{!531, !520, !268}
!563 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 171, type: !537, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!564 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 172, type: !565, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!565 = !DISubroutineType(types: !566)
!566 = !{!531, !520, !273}
!567 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 173, type: !540, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!568 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !6, line: 84, size: 320, align: 64, elements: !569, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!569 = !{!570, !571, !572, !575, !576, !577, !578, !582, !585, !588, !591, !595, !596, !599, !602, !603, !604, !607, !610, !613, !618, !621}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !6, file: !6, baseType: !351, size: 64, flags: DIFlagArtificial)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 110, baseType: !374, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 111, baseType: !573, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !281, line: 153, baseType: !"_ZTS7__sFILE")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 113, baseType: !343, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 114, baseType: !343, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 115, baseType: !303, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!578 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 87, type: !579, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581, !343, !343}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!582 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 88, type: !583, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !581}
!585 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 94, type: !586, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{!374, !581, !318, !343}
!588 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 95, type: !589, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!374, !581}
!591 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 96, type: !592, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !581, !294, !542}
!594 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!595 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 97, type: !592, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!596 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 98, type: !597, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!597 = !DISubroutineType(types: !598)
!598 = !{!594, !581, !542, !343}
!599 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 100, type: !600, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!600 = !DISubroutineType(types: !601)
!601 = !{!343, !581}
!602 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 101, type: !600, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!603 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 102, type: !589, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!604 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 103, type: !605, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!605 = !DISubroutineType(types: !606)
!606 = !{!542, !581}
!607 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 104, type: !608, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!608 = !DISubroutineType(types: !609)
!609 = !{!594, !581}
!610 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 105, type: !611, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{!318, !581}
!613 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 107, type: !614, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!614 = !DISubroutineType(types: !615)
!615 = !{!294, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!618 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 108, type: !619, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!619 = !DISubroutineType(types: !620)
!620 = !{!374, !616}
!621 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 112, type: !608, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!622 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !5, file: !489, line: 54, size: 4608, align: 64, elements: !623, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!623 = !{!624, !625, !627, !631, !632, !633, !634, !635, !636, !637, !638, !642, !645, !648, !651, !654, !657, !660, !663, !664, !667}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !489, file: !489, baseType: !351, size: 64, flags: DIFlagArtificial)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 78, baseType: !626, size: 64, align: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 79, baseType: !628, size: 4096, align: 8, offset: 128)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 4096, align: 8, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 80, baseType: !542, size: 64, align: 64, offset: 4224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 81, baseType: !542, size: 64, align: 64, offset: 4288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 82, baseType: !542, size: 64, align: 64, offset: 4352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 83, baseType: !542, size: 64, align: 64, offset: 4416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 84, baseType: !303, size: 64, align: 64, offset: 4480)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 85, baseType: !268, size: 32, align: 32, offset: 4544)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 86, baseType: !268, size: 32, align: 32, offset: 4576)
!638 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 63, type: !639, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641, !318, !343}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!642 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 64, type: !643, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !641, !318, !626}
!645 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 65, type: !646, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !641}
!648 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 67, type: !649, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{!268, !641}
!651 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 68, type: !652, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !641, !268}
!654 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 70, type: !655, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{!374, !641}
!657 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 71, type: !658, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!658 = !DISubroutineType(types: !659)
!659 = !{!374, !641, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!660 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 72, type: !661, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !641}
!663 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 74, type: !649, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!664 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 76, type: !665, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!665 = !DISubroutineType(types: !666)
!666 = !{!318, !641}
!667 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 88, type: !646, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!668 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !6, line: 118, size: 320, align: 64, elements: !669, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!669 = !{!670, !671, !675, !678, !681, !682, !683, !686, !691, !695, !699, !703, !707, !711, !715, !719, !720, !721, !722, !723, !724, !725, !726, !727, !730, !733}
!670 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!671 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 121, type: !672, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !674, !521}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!675 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 122, type: !676, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !674}
!678 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 124, type: !679, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!268, !674}
!681 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 125, type: !679, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!682 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 126, type: !679, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!683 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 127, type: !684, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{!273, !674}
!686 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 128, type: !687, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{!689, !674, !690}
!689 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!690 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !304)
!691 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 129, type: !692, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubroutineType(types: !693)
!693 = !{!689, !674, !694}
!694 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !285)
!695 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 130, type: !696, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!696 = !DISubroutineType(types: !697)
!697 = !{!689, !674, !698}
!698 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !289)
!699 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 131, type: !700, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!700 = !DISubroutineType(types: !701)
!701 = !{!689, !674, !702}
!702 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !535)
!703 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 132, type: !704, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubroutineType(types: !705)
!705 = !{!689, !674, !706}
!706 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !268)
!707 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 133, type: !708, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubroutineType(types: !709)
!709 = !{!689, !674, !710}
!710 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !343)
!711 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 134, type: !712, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{!689, !674, !714}
!714 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !273)
!715 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 135, type: !716, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!716 = !DISubroutineType(types: !717)
!717 = !{!689, !674, !718}
!718 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !542)
!719 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 137, type: !712, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!720 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 138, type: !704, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!721 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 139, type: !696, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!722 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 140, type: !687, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!723 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 141, type: !716, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!724 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 142, type: !708, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!725 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 143, type: !700, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!726 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 144, type: !692, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!727 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 145, type: !728, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!728 = !DISubroutineType(types: !729)
!729 = !{!689, !674, !268}
!730 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 146, type: !731, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!731 = !DISubroutineType(types: !732)
!732 = !{!689, !674, !303, !542}
!733 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 147, type: !734, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!734 = !DISubroutineType(types: !735)
!735 = !{!689, !674, !542}
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !489, line: 57, size: 128, align: 64, elements: !737, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !489, line: 59, baseType: !542, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !489, line: 60, baseType: !268, size: 32, align: 32, offset: 64)
!740 = !DICompositeType(tag: DW_TAG_class_type, name: "ProcessRenderOptions", scope: !742, file: !741, line: 44, size: 192, align: 64, elements: !743, vtableHolder: !"_ZTSN8pov_base14ProcessOptionsE", identifier: "_ZTSN12pov_frontend20ProcessRenderOptionsE")
!741 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/processrenderoptions.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!742 = !DINamespace(name: "pov_frontend", scope: null, file: !741, line: 40)
!743 = !{!744, !745, !749, !750, !753, !756, !759, !762, !765, !768, !771}
!744 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", baseType: !"_ZTSN8pov_base14ProcessOptionsE", flags: DIFlagPublic)
!745 = !DISubprogram(name: "ProcessRenderOptions", scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", file: !741, line: 47, type: !746, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!749 = !DISubprogram(name: "~ProcessRenderOptions", scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", file: !741, line: 48, type: !746, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!750 = !DISubprogram(name: "ReadSpecialOptionHandler", linkageName: "_ZN12pov_frontend20ProcessRenderOptions24ReadSpecialOptionHandlerEPN8pov_base14ProcessOptions16INI_Parser_TableEPcP9POVMSData", scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", file: !741, line: 50, type: !751, isLocal: false, isDefinition: false, scopeLine: 50, containingType: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!751 = !DISubroutineType(types: !752)
!752 = !{!268, !748, !356, !303, !369}
!753 = !DISubprogram(name: "ReadSpecialSwitchHandler", linkageName: "_ZN12pov_frontend20ProcessRenderOptions24ReadSpecialSwitchHandlerEPN8pov_base14ProcessOptions16Cmd_Parser_TableEPcP9POVMSDatab", scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", file: !741, line: 51, type: !754, isLocal: false, isDefinition: false, scopeLine: 51, containingType: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 1, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!754 = !DISubroutineType(types: !755)
!755 = !{!268, !748, !358, !303, !369, !374}
!756 = !DISubprogram(name: "WriteSpecialOptionHandler", linkageName: "_ZN12pov_frontend20ProcessRenderOptions25WriteSpecialOptionHandlerEPN8pov_base14ProcessOptions16INI_Parser_TableEP9POVMSDataPNS1_11OTextStreamE", scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", file: !741, line: 52, type: !757, isLocal: false, isDefinition: false, scopeLine: 52, containingType: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!757 = !DISubroutineType(types: !758)
!758 = !{!268, !748, !356, !369, !379}
!759 = !DISubprogram(name: "WriteOptionFilter", linkageName: "_ZN12pov_frontend20ProcessRenderOptions17WriteOptionFilterEPN8pov_base14ProcessOptions16INI_Parser_TableE", scope: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", file: !741, line: 53, type: !760, isLocal: false, isDefinition: false, scopeLine: 53, containingType: !"_ZTSN12pov_frontend20ProcessRenderOptionsE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!760 = !DISubroutineType(types: !761)
!761 = !{!374, !748, !356}
