; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/ray.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Ray_Struct" = type { [3 x double], [3 x double], i32, i32, [100 x %"struct.pov::Interior_Struct"*] }
%"struct.pov::Interior_Struct" = type { i32, i32, i32, float, float, float, float, float, float, [5 x float], %"struct.pov::Media_Struct"* }
%"struct.pov::Media_Struct" = type { i32, i32, i32, i32, i32, double, i32, double, double, i32, i32, i32, i32, [5 x float], [5 x float], [5 x float], [5 x float], double, double, double, double*, double, i32, i32, %"struct.pov::Pigment_Struct"*, %"struct.pov::Media_Struct"* }
%"struct.pov::Pigment_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, [5 x float] }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }
%struct.anon.21 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !765, globals: !2, imports: !801)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/ray.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !15, !20, !41, !61, !92, !113, !118, !131, !142, !148, !163, !178, !202, !208, !218, !226, !250, !257, !269, !275, !281, !285, !289, !294, !305, !315, !324, !328, !351, !402, !410, !431, !439, !460, !478, !482, !486, !491, !501, !511, !520, !524, !551, !606, !613, !624, !631, !637, !655, !659, !663, !668, !678, !688, !697, !701, !719, !723, !727, !732, !742, !752, !761}
!4 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 82, size: 64, align: 32, elements: !6, identifier: "_ZTS5div_t")
!5 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !5, line: 83, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !5, line: 84, baseType: !8, size: 32, align: 32, offset: 32)
!10 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 87, size: 128, align: 64, elements: !11, identifier: "_ZTS6ldiv_t")
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !5, line: 88, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !5, line: 89, baseType: !13, size: 64, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 93, size: 128, align: 64, elements: !16, identifier: "_ZTS7lldiv_t")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !5, line: 94, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !5, line: 95, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !22, file: !21, line: 1783, size: 6848, align: 64, elements: !24, identifier: "_ZTSN3pov10Ray_StructE")
!21 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DINamespace(name: "pov", scope: null, file: !23, line: 36)
!23 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !{!25, !31, !32, !33, !35}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !21, line: 1785, baseType: !26, size: 192, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !22, file: !21, line: 677, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, align: 64, elements: !29)
!28 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!29 = !{!30}
!30 = !DISubrange(count: 3)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !21, line: 1786, baseType: !26, size: 192, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !21, line: 1787, baseType: !8, size: 32, align: 32, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !21, line: 1788, baseType: !34, size: 32, align: 32, offset: 416)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !21, line: 1789, baseType: !36, size: 6400, align: 64, offset: 448)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 6400, align: 64, elements: !39)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !22, file: !21, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!39 = !{!40}
!40 = !DISubrange(count: 100)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !22, file: !21, line: 1112, size: 512, align: 64, elements: !42, identifier: "_ZTSN3pov15Interior_StructE")
!42 = !{!43, !44, !45, !46, !48, !49, !50, !51, !52, !53, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1114, baseType: !8, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1115, baseType: !8, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1115, baseType: !8, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1116, baseType: !47, size: 32, align: 32, offset: 96)
!47 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1116, baseType: !47, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1117, baseType: !47, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1117, baseType: !47, size: 32, align: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1118, baseType: !47, size: 32, align: 32, offset: 224)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1118, baseType: !47, size: 32, align: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1119, baseType: !54, size: 160, align: 32, offset: 288)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !22, file: !21, line: 681, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 5)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !21, line: 1120, baseType: !59, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !22, file: !21, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !22, file: !21, line: 1069, size: 1728, align: 64, elements: !62, identifier: "_ZTSN3pov12Media_StructE")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !85, !86, !87, !88, !91}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1071, baseType: !8, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1072, baseType: !8, size: 32, align: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1073, baseType: !8, size: 32, align: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1074, baseType: !8, size: 32, align: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1075, baseType: !8, size: 32, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1076, baseType: !28, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1077, baseType: !8, size: 32, align: 32, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1078, baseType: !28, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1078, baseType: !28, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1079, baseType: !8, size: 32, align: 32, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1080, baseType: !8, size: 32, align: 32, offset: 480)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1081, baseType: !8, size: 32, align: 32, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1082, baseType: !8, size: 32, align: 32, offset: 544)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1083, baseType: !54, size: 160, align: 32, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1084, baseType: !54, size: 160, align: 32, offset: 736)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1085, baseType: !54, size: 160, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1086, baseType: !54, size: 160, align: 32, offset: 1056)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1088, baseType: !28, size: 64, align: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1089, baseType: !28, size: 64, align: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1090, baseType: !28, size: 64, align: 64, offset: 1344)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1091, baseType: !84, size: 64, align: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1093, baseType: !28, size: 64, align: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1094, baseType: !8, size: 32, align: 32, offset: 1536)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1095, baseType: !8, size: 32, align: 32, offset: 1568)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1097, baseType: !89, size: 64, align: 64, offset: 1600)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !22, file: !21, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !21, line: 1099, baseType: !59, size: 64, align: 64, offset: 1664)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !22, file: !21, line: 1328, size: 1472, align: 64, elements: !93, identifier: "_ZTSN3pov14Pigment_StructE")
!93 = !{!94, !96, !97, !98, !99, !100, !101, !102, !105, !108, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !95, size: 16, align: 16)
!95 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !95, size: 16, align: 16, offset: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !95, size: 16, align: 16, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !8, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !47, size: 32, align: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !47, size: 32, align: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !47, size: 32, align: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !103, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !22, file: !21, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !106, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !22, file: !21, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !109, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !22, file: !21, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !21, line: 1331, baseType: !54, size: 160, align: 32, offset: 1280)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !22, file: !21, line: 1373, size: 192, align: 64, elements: !114, identifier: "_ZTSN3pov12Warps_StructE")
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !21, line: 1375, baseType: !95, size: 16, align: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !21, line: 1375, baseType: !103, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !21, line: 1375, baseType: !103, size: 64, align: 64, offset: 128)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !22, file: !21, line: 1323, size: 1280, align: 64, elements: !119, identifier: "_ZTSN3pov14Pattern_StructE")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !95, size: 16, align: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !95, size: 16, align: 16, offset: 16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !95, size: 16, align: 16, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !8, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !47, size: 32, align: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !47, size: 32, align: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !47, size: 32, align: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !103, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !106, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !109, size: 64, align: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !22, file: !21, line: 1045, size: 128, align: 64, elements: !132, identifier: "_ZTSN3pov16Blend_Map_StructE")
!132 = !{!133, !134, !136, !138, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !21, line: 1047, baseType: !8, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !21, line: 1048, baseType: !135, size: 16, align: 16, offset: 32)
!135 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !21, line: 1049, baseType: !137, size: 8, align: 8, offset: 48)
!137 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !21, line: 1049, baseType: !137, size: 8, align: 8, offset: 56)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !21, line: 1050, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !22, file: !21, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !22, file: !21, line: 1031, size: 256, align: 64, elements: !143, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!143 = !{!144, !145, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !21, line: 1033, baseType: !47, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !21, line: 1034, baseType: !146, size: 8, align: 8, offset: 32)
!146 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !21, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !21, line: 1035, size: 192, align: 64, elements: !149, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!149 = !{!150, !151, !152, !155, !158}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !21, line: 1037, baseType: !54, size: 160, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !21, line: 1038, baseType: !89, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !21, line: 1039, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !22, file: !21, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !21, line: 1040, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !22, file: !21, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !21, line: 1041, baseType: !159, size: 128, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !22, file: !21, line: 676, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 2)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !22, file: !21, line: 1334, size: 1344, align: 64, elements: !164, identifier: "_ZTSN3pov14Tnormal_StructE")
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !95, size: 16, align: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !95, size: 16, align: 16, offset: 16)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !95, size: 16, align: 16, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !8, size: 32, align: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !47, size: 32, align: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !47, size: 32, align: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !47, size: 32, align: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !103, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !106, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !109, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1337, baseType: !47, size: 32, align: 32, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1338, baseType: !47, size: 32, align: 32, offset: 1312)
!178 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !21, line: 1336, size: 896, align: 64, elements: !179, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!179 = !{!180, !183, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !22, file: !21, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !22, file: !21, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !47, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !89, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !22, file: !21, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !22, file: !21, line: 1269, size: 128, align: 64, elements: !203, identifier: "_ZTSN3pov19Density_file_StructE")
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !21, line: 1271, baseType: !8, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !21, line: 1272, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !22, file: !21, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !22, file: !21, line: 1275, size: 320, align: 64, elements: !209, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!209 = !{!210, !211, !213, !214, !215, !216, !217}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1277, baseType: !8, size: 32, align: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1278, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1279, baseType: !8, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1279, baseType: !8, size: 32, align: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1279, baseType: !8, size: 32, align: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1280, baseType: !8, size: 32, align: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!218 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !21, line: 1281, size: 64, align: 64, elements: !219, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!219 = !{!220, !222, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !21, line: 1283, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !21, line: 1284, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !21, line: 1285, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !22, file: !21, line: 1220, size: 960, align: 64, elements: !227, identifier: "_ZTSN3pov12Image_StructE")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !249}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1222, baseType: !8, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1223, baseType: !8, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1224, baseType: !8, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1225, baseType: !8, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1226, baseType: !8, size: 32, align: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1227, baseType: !8, size: 32, align: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1227, baseType: !8, size: 32, align: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1228, baseType: !135, size: 16, align: 16, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1229, baseType: !137, size: 8, align: 8, offset: 240)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1230, baseType: !137, size: 8, align: 8, offset: 248)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1231, baseType: !26, size: 192, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1232, baseType: !47, size: 32, align: 32, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1232, baseType: !47, size: 32, align: 32, offset: 480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1233, baseType: !159, size: 128, align: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1234, baseType: !28, size: 64, align: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1234, baseType: !28, size: 64, align: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1235, baseType: !245, size: 64, align: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !22, file: !21, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1236, baseType: !248, size: 64, align: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !22, file: !21, line: 1161, size: 80, align: 16, elements: !251, identifier: "_ZTSN3pov19Image_Colour_StructE")
!251 = !{!252, !253, !254, !255, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !21, line: 1163, baseType: !95, size: 16, align: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !21, line: 1163, baseType: !95, size: 16, align: 16, offset: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !21, line: 1163, baseType: !95, size: 16, align: 16, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !21, line: 1163, baseType: !95, size: 16, align: 16, offset: 48)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !21, line: 1163, baseType: !95, size: 16, align: 16, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !21, line: 1237, size: 64, align: 64, elements: !258, identifier: "_ZTSN3pov12Image_StructUt_E")
!258 = !{!259, !262, !265, !267}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !21, line: 1239, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !22, file: !21, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !21, line: 1240, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !22, file: !21, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!265 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !21, line: 1241, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !21, line: 1242, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !22, file: !21, line: 1166, size: 256, align: 64, elements: !270, identifier: "_ZTSN3pov18Image8_Line_StructE")
!270 = !{!271, !272, !273, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !21, line: 1168, baseType: !221, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !21, line: 1168, baseType: !221, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !21, line: 1168, baseType: !221, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !21, line: 1168, baseType: !221, size: 64, align: 64, offset: 192)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !22, file: !21, line: 1171, size: 256, align: 64, elements: !276, identifier: "_ZTSN3pov19Image16_Line_StructE")
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !21, line: 1173, baseType: !223, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !21, line: 1173, baseType: !223, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !21, line: 1173, baseType: !223, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !21, line: 1173, baseType: !223, size: 64, align: 64, offset: 192)
!281 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 256, align: 64, elements: !282, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !21, line: 1336, baseType: !47, size: 32, align: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 64, align: 32, elements: !286, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !21, line: 1336, baseType: !47, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !21, line: 1336, baseType: !47, size: 32, align: 32, offset: 32)
!289 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 320, align: 64, elements: !290, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64, offset: 128)
!294 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 896, align: 64, elements: !295, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!295 = !{!296, !297, !298, !299, !300, !301, !303, !304}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !302, size: 64, align: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !8, size: 32, align: 32, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64, offset: 704)
!305 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 832, align: 64, elements: !306, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !26, size: 192, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16, offset: 400)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !159, size: 128, align: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !21, line: 1336, baseType: !159, size: 128, align: 64, offset: 704)
!315 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 384, align: 64, elements: !316, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!316 = !{!317, !318, !319, !320, !321, !322, !323}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !159, size: 128, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16, offset: 144)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !135, size: 16, align: 16, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !28, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !21, line: 1336, baseType: !8, size: 32, align: 32, offset: 320)
!324 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !21, line: 1336, size: 128, align: 64, elements: !325, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !21, line: 1336, baseType: !248, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !21, line: 1336, baseType: !248, size: 64, align: 64, offset: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !22, file: !21, line: 1521, size: 960, align: 64, elements: !329, identifier: "_ZTSN3pov13Object_StructE")
!329 = !{!330, !333, !334, !335, !336, !337, !338, !339, !340, !343, !345, !348, !349, !350}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !22, file: !21, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !8, size: 32, align: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !200, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !156, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !156, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !37, size: 64, align: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !200, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !200, size: 64, align: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !341, size: 64, align: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !22, file: !21, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !344, size: 192, align: 32, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !22, file: !21, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !346, size: 64, align: 64, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !22, file: !21, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !346, size: 64, align: 64, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !47, size: 32, align: 32, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !21, line: 1523, baseType: !34, size: 32, align: 32, offset: 928)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !22, file: !21, line: 1503, size: 704, align: 64, elements: !352, identifier: "_ZTSN3pov13Method_StructE")
!352 = !{!353, !362, !367, !374, !376, !381, !386, !388, !390, !395, !400}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1505, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !22, file: !21, line: 1420, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!8, !200, !358, !360}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !22, file: !21, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !22, file: !21, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1506, baseType: !363, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !22, file: !21, line: 1421, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!8, !84, !200}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1507, baseType: !368, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !22, file: !21, line: 1422, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !84, !200, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !22, file: !21, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1508, baseType: !375, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !22, file: !21, line: 1423, baseType: !369)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1509, baseType: !377, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !22, file: !21, line: 1424, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!248, !200}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1510, baseType: !382, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !22, file: !21, line: 1425, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !200, !84, !346}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1511, baseType: !387, size: 64, align: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !22, file: !21, line: 1426, baseType: !383)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1512, baseType: !389, size: 64, align: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !22, file: !21, line: 1427, baseType: !383)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1513, baseType: !391, size: 64, align: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !22, file: !21, line: 1428, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !200, !346}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1514, baseType: !396, size: 64, align: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !22, file: !21, line: 1429, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !200}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !21, line: 1515, baseType: !401, size: 64, align: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !22, file: !21, line: 1430, baseType: !397)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !22, file: !21, line: 1621, size: 192, align: 64, elements: !403, identifier: "_ZTSN3pov13istack_structE")
!403 = !{!404, !406, !408, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !21, line: 1623, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !21, line: 1624, baseType: !407, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !21, line: 1625, baseType: !34, size: 32, align: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !21, line: 1626, baseType: !34, size: 32, align: 32, offset: 160)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !22, file: !21, line: 1596, size: 1600, align: 64, elements: !411, identifier: "_ZTSN3pov10istk_entryE")
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1598, baseType: !28, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1599, baseType: !26, size: 192, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1600, baseType: !26, size: 192, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1601, baseType: !26, size: 192, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1602, baseType: !159, size: 128, align: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1603, baseType: !200, size: 64, align: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1610, baseType: !8, size: 32, align: 32, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1610, baseType: !8, size: 32, align: 32, offset: 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1611, baseType: !28, size: 64, align: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1611, baseType: !28, size: 64, align: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1612, baseType: !28, size: 64, align: 64, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1612, baseType: !28, size: 64, align: 64, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1613, baseType: !28, size: 64, align: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1613, baseType: !28, size: 64, align: 64, offset: 1216)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1614, baseType: !28, size: 64, align: 64, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1614, baseType: !28, size: 64, align: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1614, baseType: !28, size: 64, align: 64, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1616, baseType: !248, size: 64, align: 64, offset: 1472)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !21, line: 1618, baseType: !248, size: 64, align: 64, offset: 1536)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !22, file: !21, line: 1002, size: 2048, align: 64, elements: !432, identifier: "_ZTSN3pov16Transform_StructE")
!432 = !{!433, !438}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !21, line: 1004, baseType: !434, size: 1024, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !22, file: !21, line: 679, baseType: !435)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, align: 64, elements: !436)
!436 = !{!437, !437}
!437 = !DISubrange(count: 4)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !21, line: 1005, baseType: !434, size: 1024, align: 64, offset: 1024)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !22, file: !21, line: 1345, size: 1664, align: 64, elements: !440, identifier: "_ZTSN3pov14Texture_StructE")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !458, !459}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !95, size: 16, align: 16)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !95, size: 16, align: 16, offset: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !95, size: 16, align: 16, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !8, size: 32, align: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !47, size: 32, align: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !47, size: 32, align: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !47, size: 32, align: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !103, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !106, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !109, size: 64, align: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, baseType: !156, size: 64, align: 64, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1348, baseType: !89, size: 64, align: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1349, baseType: !153, size: 64, align: 64, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1350, baseType: !456, size: 64, align: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !22, file: !21, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1351, baseType: !156, size: 64, align: 64, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1352, baseType: !8, size: 32, align: 32, offset: 1600)
!460 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !21, line: 1347, size: 896, align: 64, elements: !461, identifier: "_ZTSN3pov14Texture_StructUt_E")
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !181, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !184, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !47, size: 32, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !89, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, baseType: !200, size: 64, align: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 256, align: 64, elements: !479, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !21, line: 1347, baseType: !47, size: 32, align: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64, offset: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 64, align: 32, elements: !483, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !21, line: 1347, baseType: !47, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !21, line: 1347, baseType: !47, size: 32, align: 32, offset: 32)
!486 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 320, align: 64, elements: !487, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64, offset: 128)
!491 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 896, align: 64, elements: !492, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !302, size: 64, align: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !8, size: 32, align: 32, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64, offset: 704)
!501 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 832, align: 64, elements: !502, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !26, size: 192, align: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16, offset: 400)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !159, size: 128, align: 64, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !21, line: 1347, baseType: !159, size: 128, align: 64, offset: 704)
!511 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 384, align: 64, elements: !512, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!512 = !{!513, !514, !515, !516, !517, !518, !519}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !159, size: 128, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16, offset: 144)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !135, size: 16, align: 16, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !28, size: 64, align: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !21, line: 1347, baseType: !8, size: 32, align: 32, offset: 320)
!520 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !21, line: 1347, size: 128, align: 64, elements: !521, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !21, line: 1347, baseType: !248, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !21, line: 1347, baseType: !248, size: 64, align: 64, offset: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !22, file: !21, line: 1356, size: 928, align: 32, elements: !525, identifier: "_ZTSN3pov13Finish_StructE")
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !545, !546, !547, !548, !549, !550}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1358, baseType: !47, size: 32, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1358, baseType: !47, size: 32, align: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1359, baseType: !47, size: 32, align: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1359, baseType: !47, size: 32, align: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1360, baseType: !47, size: 32, align: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1360, baseType: !47, size: 32, align: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1361, baseType: !47, size: 32, align: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1361, baseType: !47, size: 32, align: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1361, baseType: !47, size: 32, align: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1362, baseType: !47, size: 32, align: 32, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1362, baseType: !47, size: 32, align: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1362, baseType: !47, size: 32, align: 32, offset: 352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1362, baseType: !47, size: 32, align: 32, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1362, baseType: !47, size: 32, align: 32, offset: 416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1363, baseType: !47, size: 32, align: 32, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1363, baseType: !47, size: 32, align: 32, offset: 480)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1364, baseType: !543, size: 96, align: 32, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !22, file: !21, line: 682, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, align: 32, elements: !29)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1364, baseType: !543, size: 96, align: 32, offset: 608)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1364, baseType: !543, size: 96, align: 32, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1365, baseType: !47, size: 32, align: 32, offset: 800)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1366, baseType: !8, size: 32, align: 32, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1367, baseType: !47, size: 32, align: 32, offset: 864)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !21, line: 1368, baseType: !8, size: 32, align: 32, offset: 896)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !22, file: !21, line: 1566, size: 3456, align: 64, elements: !552, identifier: "_ZTSN3pov19Light_Source_StructE")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !598, !599, !600}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !331, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !8, size: 32, align: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !200, size: 64, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !156, size: 64, align: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !156, size: 64, align: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !37, size: 64, align: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !200, size: 64, align: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !200, size: 64, align: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !341, size: 64, align: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !344, size: 192, align: 32, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !346, size: 64, align: 64, offset: 768)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !346, size: 64, align: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !47, size: 32, align: 32, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !34, size: 32, align: 32, offset: 928)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1568, baseType: !200, size: 64, align: 64, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1569, baseType: !54, size: 160, align: 32, offset: 1024)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1570, baseType: !26, size: 192, align: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1570, baseType: !26, size: 192, align: 64, offset: 1408)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1570, baseType: !26, size: 192, align: 64, offset: 1600)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1570, baseType: !26, size: 192, align: 64, offset: 1792)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1570, baseType: !26, size: 192, align: 64, offset: 1984)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1571, baseType: !28, size: 64, align: 64, offset: 2176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1571, baseType: !28, size: 64, align: 64, offset: 2240)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1571, baseType: !28, size: 64, align: 64, offset: 2304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1572, baseType: !28, size: 64, align: 64, offset: 2368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1572, baseType: !28, size: 64, align: 64, offset: 2432)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1573, baseType: !341, size: 64, align: 64, offset: 2496)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1574, baseType: !146, size: 8, align: 8, offset: 2560)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1574, baseType: !146, size: 8, align: 8, offset: 2568)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1574, baseType: !146, size: 8, align: 8, offset: 2576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1575, baseType: !584, size: 8, align: 8, offset: 2584)
!584 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1576, baseType: !584, size: 8, align: 8, offset: 2592)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1577, baseType: !146, size: 8, align: 8, offset: 2600)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1577, baseType: !146, size: 8, align: 8, offset: 2608)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1578, baseType: !146, size: 8, align: 8, offset: 2616)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1579, baseType: !8, size: 32, align: 32, offset: 2624)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1579, baseType: !8, size: 32, align: 32, offset: 2656)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1580, baseType: !8, size: 32, align: 32, offset: 2688)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1581, baseType: !8, size: 32, align: 32, offset: 2720)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1582, baseType: !8, size: 32, align: 32, offset: 2752)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1583, baseType: !595, size: 64, align: 64, offset: 2816)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1584, baseType: !200, size: 64, align: 64, offset: 2880)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1584, baseType: !200, size: 64, align: 64, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1585, baseType: !109, size: 64, align: 64, offset: 3008)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !21, line: 1586, baseType: !601, size: 384, align: 64, offset: 3072)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 384, align: 64, elements: !604)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !22, file: !21, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!604 = !{!605}
!605 = !DISubrange(count: 6)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !22, file: !21, line: 876, size: 192, align: 32, elements: !607, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!607 = !{!608, !612}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !21, line: 878, baseType: !609, size: 96, align: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !22, file: !21, line: 872, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 96, align: 32, elements: !29)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !22, file: !21, line: 870, baseType: !47)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !21, line: 878, baseType: !609, size: 96, align: 32, offset: 96)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !22, file: !21, line: 1557, size: 384, align: 64, elements: !614, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!614 = !{!615, !616, !619, !621, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !21, line: 1559, baseType: !95, size: 16, align: 16)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !21, line: 1560, baseType: !617, size: 64, align: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !22, file: !21, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !21, line: 1561, baseType: !620, size: 128, align: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !22, file: !21, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !21, line: 1562, baseType: !95, size: 16, align: 16, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !21, line: 1563, baseType: !623, size: 64, align: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !22, file: !21, line: 1534, size: 320, align: 64, elements: !625, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !21, line: 1536, baseType: !135, size: 16, align: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !21, line: 1537, baseType: !135, size: 16, align: 16, offset: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !21, line: 1538, baseType: !344, size: 192, align: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !21, line: 1539, baseType: !630, size: 64, align: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !22, file: !21, line: 1545, size: 128, align: 32, elements: !632, identifier: "_ZTSN3pov14Project_StructE")
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !21, line: 1547, baseType: !8, size: 32, align: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !21, line: 1547, baseType: !8, size: 32, align: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !21, line: 1547, baseType: !8, size: 32, align: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !21, line: 1547, baseType: !8, size: 32, align: 32, offset: 96)
!637 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !21, line: 1325, size: 896, align: 64, elements: !638, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !181, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !184, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !26, size: 192, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !47, size: 32, align: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !135, size: 16, align: 16)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !135, size: 16, align: 16)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !135, size: 16, align: 16)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !89, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, baseType: !200, size: 64, align: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, size: 256, align: 64, elements: !656, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !21, line: 1325, baseType: !47, size: 32, align: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !21, line: 1325, baseType: !26, size: 192, align: 64, offset: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, size: 64, align: 32, elements: !660, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !21, line: 1325, baseType: !47, size: 32, align: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !21, line: 1325, baseType: !47, size: 32, align: 32, offset: 32)
!663 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, size: 320, align: 64, elements: !664, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !21, line: 1325, baseType: !28, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !21, line: 1325, baseType: !28, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !21, line: 1325, baseType: !26, size: 192, align: 64, offset: 128)
!668 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !21, line: 1325, size: 896, align: 64, elements: !669, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !21, line: 1325, baseType: !26, size: 192, align: 64)
