; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/render.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov::Image_File_Class" = type <{ i32 (...)**, i8, [7 x i8] }>
%"struct.pov::Frame_Struct" = type { %"struct.pov::Camera_Struct"*, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Object_Struct"*, double, double, double, [5 x float], [5 x float], [5 x float], %"struct.pov::Media_Struct"*, %"struct.pov::Fog_Struct"*, %"struct.pov::Rainbow_Struct"*, %"struct.pov::Skysphere_Struct"*, %"struct.pov::light_group_light_struct"* }
%"struct.pov::Camera_Struct" = type { [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], double, double, i32, double, double, i32, double, double, double, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Transform_Struct"* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25, float, float }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.17 }
%union.anon.17 = type { %struct.anon.21 }

!70 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54)
!71 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!72 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!73 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!74 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!75 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!76 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!77 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!78 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!79 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!80 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!81 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!82 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!83 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!84 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!85 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!86 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!87 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!88 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!89 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!90 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!91 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!92 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!93 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!94 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!95 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!96 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!97 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!98 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!99 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!100 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!101 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!102 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!103 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!104 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!105 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!106 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!107 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!108 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!109 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!110 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!111 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!112 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!113 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!114 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!115 = !DIEnumerator(name: "Media_Samples", value: 99)
!116 = !DIEnumerator(name: "Media_Intervals", value: 100)
!117 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!118 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!119 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!120 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!121 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!122 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!123 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!124 = !DIEnumerator(name: "nChecked", value: 108)
!125 = !DIEnumerator(name: "nEnqueued", value: 109)
!126 = !DIEnumerator(name: "totalQueues", value: 110)
!127 = !DIEnumerator(name: "totalQueueResets", value: 111)
!128 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!129 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!130 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!131 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!132 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!133 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!134 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!135 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!136 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!137 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!138 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!139 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!140 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!141 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!142 = !DIEnumerator(name: "MaxStat", value: 126)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 692, size: 32, align: 32, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "X", value: 0)
!146 = !DIEnumerator(name: "Y", value: 1)
!147 = !DIEnumerator(name: "Z", value: 2)
!148 = !DIEnumerator(name: "T", value: 3)
!149 = !{!150, !156, !161, !166, !221, !225, !226, !233, !267, !270, !250, !170, !189, !272, !273, !154, !275, !229, !180, !276, !280, !282, !13, !283, !297, !312, !342, !363, !368, !381, !390, !395, !410, !425, !449, !455, !464, !471, !494, !501, !513, !519, !525, !529, !533, !538, !549, !559, !568, !572, !595, !646, !654, !675, !683, !704, !722, !726, !730, !735, !745, !755, !764, !768, !795, !848, !855, !866, !873, !879, !897, !901, !905, !910, !920, !930, !939, !943, !961, !965, !969, !974, !984, !994, !1003, !1007, !1026, !447, !1028}
!150 = !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 82, size: 64, align: 32, elements: !152, identifier: "_ZTS5div_t")
!151 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !151, line: 83, baseType: !154, size: 32, align: 32)
!154 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !151, line: 84, baseType: !154, size: 32, align: 32, offset: 32)
!156 = !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 87, size: 128, align: 64, elements: !157, identifier: "_ZTS6ldiv_t")
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !151, line: 88, baseType: !159, size: 64, align: 64)
!159 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !151, line: 89, baseType: !159, size: 64, align: 64, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 93, size: 128, align: 64, elements: !162, identifier: "_ZTS7lldiv_t")
!162 = !{!163, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !151, line: 94, baseType: !164, size: 64, align: 64)
!164 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !151, line: 95, baseType: !164, size: 64, align: 64, offset: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !167, line: 122, size: 1216, align: 64, elements: !168, identifier: "_ZTS7__sFILE")
!167 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!168 = !{!169, !172, !173, !174, !176, !177, !178, !179, !181, !185, !191, !200, !206, !207, !209, !210, !214, !218, !219, !220}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !167, line: 123, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !167, line: 124, baseType: !154, size: 32, align: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !167, line: 125, baseType: !154, size: 32, align: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !167, line: 126, baseType: !175, size: 16, align: 16, offset: 128)
!175 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !167, line: 127, baseType: !175, size: 16, align: 16, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !167, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !167, line: 129, baseType: !154, size: 32, align: 32, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !167, line: 132, baseType: !180, size: 64, align: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !167, line: 133, baseType: !182, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!154, !180}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !167, line: 134, baseType: !186, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!154, !180, !189, !154}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !167, line: 135, baseType: !192, size: 64, align: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !180, !195, !154}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !167, line: 77, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !197, line: 71, baseType: !198)
!197 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !199, line: 46, baseType: !164)
!199 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !167, line: 136, baseType: !201, size: 64, align: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!154, !180, !204, !154}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !167, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !167, line: 140, baseType: !208, size: 64, align: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !167, line: 141, baseType: !154, size: 32, align: 32, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !167, line: 144, baseType: !211, size: 24, align: 8, offset: 928)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 24, align: 8, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !167, line: 145, baseType: !215, size: 8, align: 8, offset: 952)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 8, align: 8, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 1)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !167, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !167, line: 151, baseType: !154, size: 32, align: 32, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !167, line: 152, baseType: !195, size: 64, align: 64, offset: 1152)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !167, line: 88, size: 128, align: 64, elements: !222, identifier: "_ZTS6__sbuf")
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !167, line: 89, baseType: !170, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !167, line: 90, baseType: !154, size: 32, align: 32, offset: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !167, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !227, identifier: "_ZTS13__va_list_tag")
!227 = !{!228, !230, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !229, size: 32, align: 32)
!229 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !229, size: 32, align: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !180, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !180, size: 64, align: 64, offset: 128)
!233 = !DICompositeType(tag: DW_TAG_class_type, name: "Image_File_Class", scope: !5, file: !4, line: 1878, size: 128, align: 64, elements: !234, vtableHolder: !"_ZTSN3pov16Image_File_ClassE", identifier: "_ZTSN3pov16Image_File_ClassE")
!234 = !{!235, !240, !242, !246, !247, !256, !259, !262, !263, !264}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Image_File_Class", scope: !4, file: !4, baseType: !236, size: 64, flags: DIFlagArtificial)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!154}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1893, baseType: !241, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!241 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!242 = !DISubprogram(name: "Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1881, type: !243, isLocal: false, isDefinition: false, scopeLine: 1881, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov16Image_File_ClassE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!246 = !DISubprogram(name: "~Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1882, type: !243, isLocal: false, isDefinition: false, scopeLine: 1882, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubprogram(name: "Write_Line", linkageName: "_ZN3pov16Image_File_Class10Write_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1884, type: !248, isLocal: false, isDefinition: false, scopeLine: 1884, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !245, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 160, align: 32, elements: !254)
!253 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!254 = !{!255}
!255 = !DISubrange(count: 5)
!256 = !DISubprogram(name: "Read_Line", linkageName: "_ZN3pov16Image_File_Class9Read_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1885, type: !257, isLocal: false, isDefinition: false, scopeLine: 1885, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!154, !245, !250}
!259 = !DISubprogram(name: "Line", linkageName: "_ZN3pov16Image_File_Class4LineEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1887, type: !260, isLocal: false, isDefinition: false, scopeLine: 1887, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!260 = !DISubroutineType(types: !261)
!261 = !{!154, !245}
!262 = !DISubprogram(name: "Width", linkageName: "_ZN3pov16Image_File_Class5WidthEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1888, type: !260, isLocal: false, isDefinition: false, scopeLine: 1888, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubprogram(name: "Height", linkageName: "_ZN3pov16Image_File_Class6HeightEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1889, type: !260, isLocal: false, isDefinition: false, scopeLine: 1889, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubprogram(name: "Valid", linkageName: "_ZN3pov16Image_File_Class5ValidEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1891, type: !265, isLocal: false, isDefinition: false, scopeLine: 1891, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{!241, !245}
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec2_Struct", scope: !5, file: !1, line: 104, size: 128, align: 64, elements: !268, identifier: "_ZTSN3pov11Vec2_StructE")
!268 = !{!269, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !"_ZTSN3pov11Vec2_StructE", file: !1, line: 106, baseType: !270, size: 64, align: 64)
!270 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !"_ZTSN3pov11Vec2_StructE", file: !1, line: 106, baseType: !270, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC2", scope: !5, file: !1, line: 102, baseType: !"_ZTSN3pov11Vec2_StructE")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pixel_Struct", scope: !5, file: !1, line: 109, size: 192, align: 32, elements: !277, identifier: "_ZTSN3pov12Pixel_StructE")
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !"_ZTSN3pov12Pixel_StructE", file: !1, line: 111, baseType: !154, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov12Pixel_StructE", file: !1, line: 112, baseType: !251, size: 160, align: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIXEL", scope: !5, file: !1, line: 101, baseType: !"_ZTSN3pov12Pixel_StructE")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !4, line: 1783, size: 6848, align: 64, elements: !284, identifier: "_ZTSN3pov10Ray_StructE")
!284 = !{!285, !288, !289, !290, !291}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1785, baseType: !286, size: 192, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 192, align: 64, elements: !212)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1786, baseType: !286, size: 192, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1787, baseType: !154, size: 32, align: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1788, baseType: !229, size: 32, align: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !4, line: 1789, baseType: !292, size: 6400, align: 64, offset: 448)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 6400, align: 64, elements: !295)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !4, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!295 = !{!296}
!296 = !DISubrange(count: 100)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !4, line: 1112, size: 512, align: 64, elements: !298, identifier: "_ZTSN3pov15Interior_StructE")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1114, baseType: !154, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !154, size: 32, align: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1115, baseType: !154, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !253, size: 32, align: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1116, baseType: !253, size: 32, align: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !253, size: 32, align: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1117, baseType: !253, size: 32, align: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !253, size: 32, align: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1118, baseType: !253, size: 32, align: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1119, baseType: !251, size: 160, align: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !4, line: 1120, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !4, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !4, line: 1069, size: 1728, align: 64, elements: !313, identifier: "_ZTSN3pov12Media_StructE")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !341}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1071, baseType: !154, size: 32, align: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1072, baseType: !154, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1073, baseType: !154, size: 32, align: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1074, baseType: !154, size: 32, align: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1075, baseType: !154, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1076, baseType: !270, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1077, baseType: !154, size: 32, align: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1078, baseType: !270, size: 64, align: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1078, baseType: !270, size: 64, align: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1079, baseType: !154, size: 32, align: 32, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1080, baseType: !154, size: 32, align: 32, offset: 480)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1081, baseType: !154, size: 32, align: 32, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1082, baseType: !154, size: 32, align: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1083, baseType: !251, size: 160, align: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1084, baseType: !251, size: 160, align: 32, offset: 736)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1085, baseType: !251, size: 160, align: 32, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1086, baseType: !251, size: 160, align: 32, offset: 1056)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1088, baseType: !270, size: 64, align: 64, offset: 1216)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1089, baseType: !270, size: 64, align: 64, offset: 1280)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1090, baseType: !270, size: 64, align: 64, offset: 1344)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1091, baseType: !272, size: 64, align: 64, offset: 1408)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1093, baseType: !270, size: 64, align: 64, offset: 1472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1094, baseType: !154, size: 32, align: 32, offset: 1536)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1095, baseType: !154, size: 32, align: 32, offset: 1568)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1097, baseType: !339, size: 64, align: 64, offset: 1600)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !4, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !4, line: 1099, baseType: !310, size: 64, align: 64, offset: 1664)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !4, line: 1328, size: 1472, align: 64, elements: !343, identifier: "_ZTSN3pov14Pigment_StructE")
!343 = !{!344, !346, !347, !348, !349, !350, !351, !352, !355, !358, !361, !362}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !345, size: 16, align: 16)
!345 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !345, size: 16, align: 16, offset: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !345, size: 16, align: 16, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !154, size: 32, align: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !253, size: 32, align: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !253, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !253, size: 32, align: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !353, size: 64, align: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !4, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !356, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !4, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !359, size: 64, align: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !4, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !4, line: 1331, baseType: !251, size: 160, align: 32, offset: 1280)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !4, line: 1373, size: 192, align: 64, elements: !364, identifier: "_ZTSN3pov12Warps_StructE")
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !345, size: 16, align: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !353, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !4, line: 1375, baseType: !353, size: 64, align: 64, offset: 128)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !4, line: 1323, size: 1280, align: 64, elements: !369, identifier: "_ZTSN3pov14Pattern_StructE")
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !345, size: 16, align: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !345, size: 16, align: 16, offset: 16)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !345, size: 16, align: 16, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !154, size: 32, align: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !253, size: 32, align: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !253, size: 32, align: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !253, size: 32, align: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !353, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !356, size: 64, align: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !359, size: 64, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !4, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !4, line: 1045, size: 128, align: 64, elements: !382, identifier: "_ZTSN3pov16Blend_Map_StructE")
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1047, baseType: !154, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1048, baseType: !175, size: 16, align: 16, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !190, size: 8, align: 8, offset: 48)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1049, baseType: !190, size: 8, align: 8, offset: 56)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !4, line: 1050, baseType: !388, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !4, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !4, line: 1031, size: 256, align: 64, elements: !391, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1033, baseType: !253, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1034, baseType: !171, size: 8, align: 8, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!395 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !4, line: 1035, size: 192, align: 64, elements: !396, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!396 = !{!397, !398, !399, !402, !405}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1037, baseType: !251, size: 160, align: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1038, baseType: !339, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1039, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !4, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1040, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !4, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !4, line: 1041, baseType: !406, size: 128, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !4, line: 676, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 128, align: 64, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 2)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !4, line: 1334, size: 1344, align: 64, elements: !411, identifier: "_ZTSN3pov14Tnormal_StructE")
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !345, size: 16, align: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !345, size: 16, align: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !345, size: 16, align: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !154, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !253, size: 32, align: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !253, size: 32, align: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !253, size: 32, align: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !353, size: 64, align: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !356, size: 64, align: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !359, size: 64, align: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1337, baseType: !253, size: 32, align: 32, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1338, baseType: !253, size: 32, align: 32, offset: 1312)
!425 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !4, line: 1336, size: 896, align: 64, elements: !426, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!426 = !{!427, !430, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !4, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !4, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !253, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !339, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !4, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !4, line: 1269, size: 128, align: 64, elements: !450, identifier: "_ZTSN3pov19Density_file_StructE")
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1271, baseType: !154, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !4, line: 1272, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !4, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !4, line: 1275, size: 320, align: 64, elements: !456, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!456 = !{!457, !458, !459, !460, !461, !462, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1277, baseType: !154, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1278, baseType: !189, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !154, size: 32, align: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !154, size: 32, align: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1279, baseType: !154, size: 32, align: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1280, baseType: !154, size: 32, align: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!464 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !4, line: 1281, size: 64, align: 64, elements: !465, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!465 = !{!466, !467, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1283, baseType: !170, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1284, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !4, line: 1285, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !4, line: 1220, size: 960, align: 64, elements: !472, identifier: "_ZTSN3pov12Image_StructE")
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !492, !493}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1222, baseType: !154, size: 32, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1223, baseType: !154, size: 32, align: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1224, baseType: !154, size: 32, align: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1225, baseType: !154, size: 32, align: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1226, baseType: !154, size: 32, align: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !154, size: 32, align: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1227, baseType: !154, size: 32, align: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1228, baseType: !175, size: 16, align: 16, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1229, baseType: !190, size: 8, align: 8, offset: 240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1230, baseType: !190, size: 8, align: 8, offset: 248)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1231, baseType: !286, size: 192, align: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !253, size: 32, align: 32, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1232, baseType: !253, size: 32, align: 32, offset: 480)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1233, baseType: !406, size: 128, align: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !270, size: 64, align: 64, offset: 640)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1234, baseType: !270, size: 64, align: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1235, baseType: !490, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !4, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1236, baseType: !180, size: 64, align: 64, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !4, line: 1161, size: 80, align: 16, elements: !495, identifier: "_ZTSN3pov19Image_Colour_StructE")
!495 = !{!496, !497, !498, !499, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !345, size: 16, align: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !345, size: 16, align: 16, offset: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !345, size: 16, align: 16, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !345, size: 16, align: 16, offset: 48)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !4, line: 1163, baseType: !345, size: 16, align: 16, offset: 64)
!501 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !4, line: 1237, size: 64, align: 64, elements: !502, identifier: "_ZTSN3pov12Image_StructUt_E")
!502 = !{!503, !506, !509, !511}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1239, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !4, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1240, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !4, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1241, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !4, line: 1242, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !4, line: 1166, size: 256, align: 64, elements: !514, identifier: "_ZTSN3pov18Image8_Line_StructE")
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !170, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !170, size: 64, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !170, size: 64, align: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !4, line: 1168, baseType: !170, size: 64, align: 64, offset: 192)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !4, line: 1171, size: 256, align: 64, elements: !520, identifier: "_ZTSN3pov19Image16_Line_StructE")
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !468, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !468, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !468, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !4, line: 1173, baseType: !468, size: 64, align: 64, offset: 192)
!525 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 256, align: 64, elements: !526, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !253, size: 32, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64, offset: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 64, align: 32, elements: !530, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !253, size: 32, align: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !4, line: 1336, baseType: !253, size: 32, align: 32, offset: 32)
!533 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 320, align: 64, elements: !534, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64, offset: 128)
!538 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 896, align: 64, elements: !539, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!539 = !{!540, !541, !542, !543, !544, !545, !547, !548}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !546, size: 64, align: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !154, size: 32, align: 32, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64, offset: 704)
!549 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 832, align: 64, elements: !550, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !286, size: 192, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16, offset: 400)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !406, size: 128, align: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !4, line: 1336, baseType: !406, size: 128, align: 64, offset: 704)
!559 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 384, align: 64, elements: !560, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!560 = !{!561, !562, !563, !564, !565, !566, !567}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !406, size: 128, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16, offset: 144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !175, size: 16, align: 16, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !270, size: 64, align: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !4, line: 1336, baseType: !154, size: 32, align: 32, offset: 320)
!568 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !4, line: 1336, size: 128, align: 64, elements: !569, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !180, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !4, line: 1336, baseType: !180, size: 64, align: 64, offset: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !4, line: 1521, size: 960, align: 64, elements: !573, identifier: "_ZTSN3pov13Object_StructE")
!573 = !{!574, !577, !578, !579, !580, !581, !582, !583, !584, !587, !589, !592, !593, !594}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !4, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !154, size: 32, align: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !447, size: 64, align: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !403, size: 64, align: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !403, size: 64, align: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !293, size: 64, align: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !447, size: 64, align: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !447, size: 64, align: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !585, size: 64, align: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !4, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!587 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !588, size: 192, align: 32, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !590, size: 64, align: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !4, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!592 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !590, size: 64, align: 64, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !253, size: 32, align: 32, offset: 896)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !4, line: 1523, baseType: !229, size: 32, align: 32, offset: 928)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !4, line: 1503, size: 704, align: 64, elements: !596, identifier: "_ZTSN3pov13Method_StructE")
!596 = !{!597, !606, !611, !618, !620, !625, !630, !632, !634, !639, !644}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1505, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !4, line: 1420, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!154, !447, !602, !604}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !4, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !4, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1506, baseType: !607, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !4, line: 1421, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!154, !272, !447}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1507, baseType: !612, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !4, line: 1422, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !272, !447, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !4, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1508, baseType: !619, size: 64, align: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !4, line: 1423, baseType: !613)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1509, baseType: !621, size: 64, align: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !4, line: 1424, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!180, !447}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1510, baseType: !626, size: 64, align: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !4, line: 1425, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !447, !272, !590}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1511, baseType: !631, size: 64, align: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !4, line: 1426, baseType: !627)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1512, baseType: !633, size: 64, align: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !4, line: 1427, baseType: !627)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1513, baseType: !635, size: 64, align: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !4, line: 1428, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !447, !590}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1514, baseType: !640, size: 64, align: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !4, line: 1429, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !447}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !4, line: 1515, baseType: !645, size: 64, align: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !4, line: 1430, baseType: !641)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !4, line: 1621, size: 192, align: 64, elements: !647, identifier: "_ZTSN3pov13istack_structE")
!647 = !{!648, !650, !652, !653}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1623, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1624, baseType: !651, size: 64, align: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1625, baseType: !229, size: 32, align: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !4, line: 1626, baseType: !229, size: 32, align: 32, offset: 160)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !4, line: 1596, size: 1600, align: 64, elements: !655, identifier: "_ZTSN3pov10istk_entryE")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1598, baseType: !270, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1599, baseType: !286, size: 192, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1600, baseType: !286, size: 192, align: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1601, baseType: !286, size: 192, align: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1602, baseType: !406, size: 128, align: 64, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1603, baseType: !447, size: 64, align: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1610, baseType: !154, size: 32, align: 32, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1610, baseType: !154, size: 32, align: 32, offset: 864)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1611, baseType: !270, size: 64, align: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1611, baseType: !270, size: 64, align: 64, offset: 960)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1612, baseType: !270, size: 64, align: 64, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1612, baseType: !270, size: 64, align: 64, offset: 1088)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1613, baseType: !270, size: 64, align: 64, offset: 1152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1613, baseType: !270, size: 64, align: 64, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1614, baseType: !270, size: 64, align: 64, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1614, baseType: !270, size: 64, align: 64, offset: 1344)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1614, baseType: !270, size: 64, align: 64, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1616, baseType: !180, size: 64, align: 64, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !4, line: 1618, baseType: !180, size: 64, align: 64, offset: 1536)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !4, line: 1002, size: 2048, align: 64, elements: !676, identifier: "_ZTSN3pov16Transform_StructE")
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !4, line: 1004, baseType: !678, size: 1024, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !4, line: 679, baseType: !679)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 1024, align: 64, elements: !680)
!680 = !{!681, !681}
!681 = !DISubrange(count: 4)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !4, line: 1005, baseType: !678, size: 1024, align: 64, offset: 1024)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !4, line: 1345, size: 1664, align: 64, elements: !684, identifier: "_ZTSN3pov14Texture_StructE")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !702, !703}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !345, size: 16, align: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !345, size: 16, align: 16, offset: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !345, size: 16, align: 16, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !154, size: 32, align: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !253, size: 32, align: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !253, size: 32, align: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !253, size: 32, align: 32, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !353, size: 64, align: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !356, size: 64, align: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !359, size: 64, align: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, baseType: !403, size: 64, align: 64, offset: 1280)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1348, baseType: !339, size: 64, align: 64, offset: 1344)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1349, baseType: !400, size: 64, align: 64, offset: 1408)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1350, baseType: !700, size: 64, align: 64, offset: 1472)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !4, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1351, baseType: !403, size: 64, align: 64, offset: 1536)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1352, baseType: !154, size: 32, align: 32, offset: 1600)
!704 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !4, line: 1347, size: 896, align: 64, elements: !705, identifier: "_ZTSN3pov14Texture_StructUt_E")
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !428, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !431, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !253, size: 32, align: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !339, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, baseType: !447, size: 64, align: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 256, align: 64, elements: !723, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !253, size: 32, align: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64, offset: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 64, align: 32, elements: !727, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !253, size: 32, align: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !4, line: 1347, baseType: !253, size: 32, align: 32, offset: 32)
!730 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 320, align: 64, elements: !731, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!731 = !{!732, !733, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64, offset: 128)
!735 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 896, align: 64, elements: !736, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !546, size: 64, align: 64, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !154, size: 32, align: 32, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64, offset: 704)
!745 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 832, align: 64, elements: !746, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !286, size: 192, align: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16, offset: 400)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !406, size: 128, align: 64, offset: 576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !4, line: 1347, baseType: !406, size: 128, align: 64, offset: 704)
!755 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 384, align: 64, elements: !756, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!756 = !{!757, !758, !759, !760, !761, !762, !763}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !406, size: 128, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16, offset: 144)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !175, size: 16, align: 16, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !270, size: 64, align: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !4, line: 1347, baseType: !154, size: 32, align: 32, offset: 320)
!764 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !4, line: 1347, size: 128, align: 64, elements: !765, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !180, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !4, line: 1347, baseType: !180, size: 64, align: 64, offset: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !4, line: 1356, size: 928, align: 32, elements: !769, identifier: "_ZTSN3pov13Finish_StructE")
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !789, !790, !791, !792, !793, !794}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !253, size: 32, align: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1358, baseType: !253, size: 32, align: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !253, size: 32, align: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1359, baseType: !253, size: 32, align: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !253, size: 32, align: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1360, baseType: !253, size: 32, align: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !253, size: 32, align: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !253, size: 32, align: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1361, baseType: !253, size: 32, align: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !253, size: 32, align: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !253, size: 32, align: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !253, size: 32, align: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !253, size: 32, align: 32, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1362, baseType: !253, size: 32, align: 32, offset: 416)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !253, size: 32, align: 32, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1363, baseType: !253, size: 32, align: 32, offset: 480)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !787, size: 96, align: 32, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !4, line: 682, baseType: !788)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 96, align: 32, elements: !212)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !787, size: 96, align: 32, offset: 608)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1364, baseType: !787, size: 96, align: 32, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1365, baseType: !253, size: 32, align: 32, offset: 800)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1366, baseType: !154, size: 32, align: 32, offset: 832)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1367, baseType: !253, size: 32, align: 32, offset: 864)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !4, line: 1368, baseType: !154, size: 32, align: 32, offset: 896)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !4, line: 1566, size: 3456, align: 64, elements: !796, identifier: "_ZTSN3pov19Light_Source_StructE")
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841, !842}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !575, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !154, size: 32, align: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !447, size: 64, align: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !403, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !403, size: 64, align: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !293, size: 64, align: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !447, size: 64, align: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !447, size: 64, align: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !4, line: 1568, baseType: !585, size: 64, align: 64, offset: 512)
