; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/renderio.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov::Image_File_Class" = type <{ i32 (...)**, i8, [7 x i8] }>
%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !22, subprograms: !170, globals: !201, imports: !337)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/renderio.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 1870, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "READ_MODE", value: 0)
!9 = !DIEnumerator(name: "WRITE_MODE", value: 1)
!10 = !DIEnumerator(name: "APPEND_MODE", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 1799, size: 32, align: 32, elements: !12, identifier: "_ZTSN3pov9FRAMETYPEE")
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "FT_SINGLE_FRAME", value: 0)
!14 = !DIEnumerator(name: "FT_MULTIPLE_FRAME", value: 1)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 701, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "pRED", value: 0)
!18 = !DIEnumerator(name: "pGREEN", value: 1)
!19 = !DIEnumerator(name: "pBLUE", value: 2)
!20 = !DIEnumerator(name: "pFILTER", value: 3)
!21 = !DIEnumerator(name: "pTRANSM", value: 4)
!22 = !{!23, !29, !34, !39, !94, !98, !99, !106, !27, !11, !102, !107, !141, !158}
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 82, size: 64, align: 32, elements: !25, identifier: "_ZTS5div_t")
!24 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !24, line: 83, baseType: !27, size: 32, align: 32)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !24, line: 84, baseType: !27, size: 32, align: 32, offset: 32)
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 87, size: 128, align: 64, elements: !30, identifier: "_ZTS6ldiv_t")
!30 = !{!31, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !24, line: 88, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !24, line: 89, baseType: !32, size: 64, align: 64, offset: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 93, size: 128, align: 64, elements: !35, identifier: "_ZTS7lldiv_t")
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !24, line: 94, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !24, line: 95, baseType: !37, size: 64, align: 64, offset: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !40, line: 122, size: 1216, align: 64, elements: !41, identifier: "_ZTS7__sFILE")
!40 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !{!42, !45, !46, !47, !49, !50, !51, !52, !54, !58, !64, !73, !79, !80, !82, !83, !87, !91, !92, !93}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !40, line: 123, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !40, line: 124, baseType: !27, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !40, line: 125, baseType: !27, size: 32, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !40, line: 126, baseType: !48, size: 16, align: 16, offset: 128)
!48 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !40, line: 127, baseType: !48, size: 16, align: 16, offset: 144)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !40, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !40, line: 129, baseType: !27, size: 32, align: 32, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !40, line: 132, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !40, line: 133, baseType: !55, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!27, !53}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !40, line: 134, baseType: !59, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!27, !53, !62, !27}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !40, line: 135, baseType: !65, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !53, !68, !27}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !40, line: 77, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !70, line: 71, baseType: !71)
!70 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !72, line: 46, baseType: !37)
!72 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !40, line: 136, baseType: !74, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!27, !53, !77, !27}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !40, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !40, line: 140, baseType: !81, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !40, line: 141, baseType: !27, size: 32, align: 32, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !40, line: 144, baseType: !84, size: 24, align: 8, offset: 928)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 3)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !40, line: 145, baseType: !88, size: 8, align: 8, offset: 952)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !40, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !40, line: 151, baseType: !27, size: 32, align: 32, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !40, line: 152, baseType: !68, size: 64, align: 64, offset: 1152)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !40, line: 88, size: 128, align: 64, elements: !95, identifier: "_ZTS6__sbuf")
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !40, line: 89, baseType: !43, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !40, line: 90, baseType: !27, size: 32, align: 32, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !40, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !100, identifier: "_ZTS13__va_list_tag")
!100 = !{!101, !103, !104, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !102, size: 32, align: 32)
!102 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !102, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !53, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !53, size: 64, align: 64, offset: 128)
!106 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "Image_File_Class", scope: !5, file: !4, line: 1878, size: 128, align: 64, elements: !108, vtableHolder: !"_ZTSN3pov16Image_File_ClassE", identifier: "_ZTSN3pov16Image_File_ClassE")
!108 = !{!109, !114, !116, !120, !121, !130, !133, !136, !137, !138}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Image_File_Class", scope: !4, file: !4, baseType: !110, size: 64, flags: DIFlagArtificial)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!27}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1893, baseType: !115, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!115 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!116 = !DISubprogram(name: "Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1881, type: !117, isLocal: false, isDefinition: false, scopeLine: 1881, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov16Image_File_ClassE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!120 = !DISubprogram(name: "~Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1882, type: !117, isLocal: false, isDefinition: false, scopeLine: 1882, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!121 = !DISubprogram(name: "Write_Line", linkageName: "_ZN3pov16Image_File_Class10Write_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1884, type: !122, isLocal: false, isDefinition: false, scopeLine: 1884, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !119, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !4, line: 681, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 160, align: 32, elements: !128)
!127 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!128 = !{!129}
!129 = !DISubrange(count: 5)
!130 = !DISubprogram(name: "Read_Line", linkageName: "_ZN3pov16Image_File_Class9Read_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1885, type: !131, isLocal: false, isDefinition: false, scopeLine: 1885, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!131 = !DISubroutineType(types: !132)
!132 = !{!27, !119, !124}
!133 = !DISubprogram(name: "Line", linkageName: "_ZN3pov16Image_File_Class4LineEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1887, type: !134, isLocal: false, isDefinition: false, scopeLine: 1887, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!134 = !DISubroutineType(types: !135)
!135 = !{!27, !119}
!136 = !DISubprogram(name: "Width", linkageName: "_ZN3pov16Image_File_Class5WidthEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1888, type: !134, isLocal: false, isDefinition: false, scopeLine: 1888, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!137 = !DISubprogram(name: "Height", linkageName: "_ZN3pov16Image_File_Class6HeightEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1889, type: !134, isLocal: false, isDefinition: false, scopeLine: 1889, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubprogram(name: "Valid", linkageName: "_ZN3pov16Image_File_Class5ValidEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !4, line: 1891, type: !139, isLocal: false, isDefinition: false, scopeLine: 1891, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{!115, !119}
