; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/renderfrontend.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov_frontend::RenderFrontend" = type <{ %"class.pov_frontend::MessageOutput", i8*, i8*, i32, [4 x i8] }>
%"class.pov_frontend::MessageOutput" = type { %class.POVMS_MessageReceiver, [8 x %"class.pov_base::TextStreamBuffer"*], [8 x i8*], [8 x i8], i32, i8*, [80 x i8] }
%class.POVMS_MessageReceiver = type { i32 (...)**, i8*, %"struct.POVMS_MessageReceiver::HandlerNode"* }
%"struct.POVMS_MessageReceiver::HandlerNode" = type { %"struct.POVMS_MessageReceiver::HandlerNode"*, %"struct.POVMS_MessageReceiver::HandlerNode"*, i32, i32, %"class.POVMS_MessageReceiver::HandlerOO"*, %"class.POVMS_MessageReceiver::Handler"* }
%"class.POVMS_MessageReceiver::HandlerOO" = type { i32 (...)** }
%"class.POVMS_MessageReceiver::Handler" = type { i32 (...)** }
%"class.pov_base::TextStreamBuffer" = type { i32 (...)**, i8*, i32, i32, i32, i32 }
%class.POVMS_Message = type { %class.POVMS_Object }
%class.POVMS_Object = type { %class.POVMS_Container }
%class.POVMS_Container = type { i32 (...)**, %struct.POVMSData }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"class.POVMS_MessageReceiver::MemberHandlerOO" = type { %"class.POVMS_MessageReceiver::HandlerOO", { i64, i64 }, %"class.pov_frontend::RenderFrontend"* }


!37 = !DIEnumerator(name: "kTimeoutErr", value: -20)
!38 = !DIEnumerator(name: "kInvalidContextErr", value: -21)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 69, size: 32, align: 32, elements: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsgid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !{!42, !43, !44, !45}
!42 = !DIEnumerator(name: "kPOVMsgClass_RenderControl", value: 1131704940)
!43 = !DIEnumerator(name: "kPOVMsgClass_RenderOutput", value: 1333097584)
!44 = !DIEnumerator(name: "kPOVMsgClass_IniOptions", value: 1231972687)
!45 = !DIEnumerator(name: "kPOVMsgClass_Miscellaneous", value: 1298756451)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 78, size: 32, align: 32, elements: !47)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!48 = !DIEnumerator(name: "kPOVMsgIdent_InitInfo", value: 1231964526)
!49 = !DIEnumerator(name: "kPOVMsgIdent_RenderOptions", value: 1380937844)
!50 = !DIEnumerator(name: "kPOVMsgIdent_RenderAll", value: 1380019308)
!51 = !DIEnumerator(name: "kPOVMsgIdent_RenderArea", value: 1380020837)
!52 = !DIEnumerator(name: "kPOVMsgIdent_RenderPause", value: 1380999541)
!53 = !DIEnumerator(name: "kPOVMsgIdent_RenderStop", value: 1381201007)
!54 = !DIEnumerator(name: "kPOVMsgIdent_RenderStarted", value: 1381135726)
!55 = !DIEnumerator(name: "kPOVMsgIdent_RenderDone", value: 1380281956)
!56 = !DIEnumerator(name: "kPOVMsgIdent_FrameStatistics", value: 1179874401)
!57 = !DIEnumerator(name: "kPOVMsgIdent_ParseStatistics", value: 1347646561)
!58 = !DIEnumerator(name: "kPOVMsgIdent_RenderStatistics", value: 1381200993)
!59 = !DIEnumerator(name: "kPOVMsgIdent_Progress", value: 1349676903)
!60 = !DIEnumerator(name: "kPOVMsgIdent_Warning", value: 1466004078)
!61 = !DIEnumerator(name: "kPOVMsgIdent_Error", value: 1165128279)
!62 = !DIEnumerator(name: "kPOVMsgIdent_FatalError", value: 1165128262)
!63 = !DIEnumerator(name: "kPOVMsgIdent_Debug", value: 1147303271)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !13, file: !12, line: 73, size: 32, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "kFalseErr", value: 1)
!67 = !DIEnumerator(name: "kOutOfSyncErr", value: 2)
!68 = !DIEnumerator(name: "kNotNowErr", value: 2)
!69 = !DIEnumerator(name: "kQueueFullErr", value: 3)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 52, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!72 = !DIEnumerator(name: "kPOVObjectClass_Rect", value: 1382376308)
!73 = !DIEnumerator(name: "kPOVObjectClass_Path", value: 1348564072)
!74 = !DIEnumerator(name: "kPOVObjectClass_File", value: 1181314149)
!75 = !DIEnumerator(name: "kPOVObjectClass_FileLoc", value: 1179676531)
!76 = !DIEnumerator(name: "kPOVObjectClass_Command", value: 1131375981)
!77 = !DIEnumerator(name: "kPOVObjectClass_OIStat", value: 1330205556)
!78 = !DIEnumerator(name: "kPOVObjectClass_ROptions", value: 1380937844)
!79 = !DIEnumerator(name: "kPOVObjectClass_RTime", value: 1381263725)
!80 = !DIEnumerator(name: "kPOVObjectClass_FStats", value: 1179874401)
!81 = !DIEnumerator(name: "kPOVObjectClass_RStats", value: 1381200993)
!82 = !DIEnumerator(name: "kPOVObjectClass_PStats", value: 1347646561)
!83 = !DIEnumerator(name: "kPOVObjectClass_Progress", value: 1349676903)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 151, size: 32, align: 32, elements: !86)
!85 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!87 = !DIEnumerator(name: "kPOVMSType_Object", value: 1329744453)
!88 = !DIEnumerator(name: "kPOVMSType_LockedObject", value: 1280262987)
!89 = !DIEnumerator(name: "kPOVMSType_ResultObject", value: 1380275029)
!90 = !DIEnumerator(name: "kPOVMSType_Address", value: 1094992978)
!91 = !DIEnumerator(name: "kPOVMSType_Null", value: 1314212940)
!92 = !DIEnumerator(name: "kPOVMSType_WildCard", value: 707406378)
!93 = !DIEnumerator(name: "kPOVMSType_CString", value: 1129534546)
!94 = !DIEnumerator(name: "kPOVMSType_UnicodeText", value: 1431590996)
!95 = !DIEnumerator(name: "kPOVMSType_Int", value: 1229870132)
!96 = !DIEnumerator(name: "kPOVMSType_Long", value: 1229870136)
!97 = !DIEnumerator(name: "kPOVMSType_Float", value: 1179407412)
!98 = !DIEnumerator(name: "kPOVMSType_Double", value: 1179407416)
!99 = !DIEnumerator(name: "kPOVMSType_Bool", value: 1112493900)
!100 = !DIEnumerator(name: "kPOVMSType_Pixel", value: 1346983988)
!101 = !DIEnumerator(name: "kPOVMSType_Type", value: 1415139397)
!102 = !DIEnumerator(name: "kPOVMSType_List", value: 1279873876)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 198, size: 32, align: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "kPOVMSSendMode_Invalid", value: 0)
!106 = !DIEnumerator(name: "kPOVMSSendMode_NoReply", value: 1)
!107 = !DIEnumerator(name: "kPOVMSSendMode_WaitReply", value: 2)
!108 = !DIEnumerator(name: "kPOVMSSendMode_WantReceipt", value: 3)
!109 = !{!110, !116, !121, !126, !134, !188, !192, !193, !222, !283, !291, !298, !333, !353, !358, !364, !370, !468, !512, !554, !561, !576, !591, !651, !3, !114, !696}
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 82, size: 64, align: 32, elements: !112, identifier: "_ZTS5div_t")
!111 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !111, line: 83, baseType: !114, size: 32, align: 32)
!114 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !111, line: 84, baseType: !114, size: 32, align: 32, offset: 32)
!116 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 87, size: 128, align: 64, elements: !117, identifier: "_ZTS6ldiv_t")
!117 = !{!118, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !111, line: 88, baseType: !119, size: 64, align: 64)
!119 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !111, line: 89, baseType: !119, size: 64, align: 64, offset: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 93, size: 128, align: 64, elements: !122, identifier: "_ZTS7lldiv_t")
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !111, line: 94, baseType: !124, size: 64, align: 64)
!124 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !111, line: 95, baseType: !124, size: 64, align: 64, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !127, identifier: "_ZTS13__va_list_tag")
!127 = !{!128, !130, !131, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !129, size: 32, align: 32)
!129 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !129, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !132, size: 64, align: 64, offset: 128)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !135, line: 122, size: 1216, align: 64, elements: !136, identifier: "_ZTS7__sFILE")
!135 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!136 = !{!137, !140, !141, !142, !144, !145, !146, !147, !148, !152, !158, !167, !173, !174, !176, !177, !181, !185, !186, !187}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !135, line: 123, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !135, line: 124, baseType: !114, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !135, line: 125, baseType: !114, size: 32, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !135, line: 126, baseType: !143, size: 16, align: 16, offset: 128)
!143 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !135, line: 127, baseType: !143, size: 16, align: 16, offset: 144)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !135, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !135, line: 129, baseType: !114, size: 32, align: 32, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !135, line: 132, baseType: !132, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !135, line: 133, baseType: !149, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!114, !132}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !135, line: 134, baseType: !153, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!114, !132, !156, !114}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !135, line: 135, baseType: !159, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !132, !162, !114}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !135, line: 77, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !164, line: 71, baseType: !165)
!164 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !166, line: 46, baseType: !124)
!166 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !135, line: 136, baseType: !168, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!114, !132, !171, !114}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !135, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !135, line: 140, baseType: !175, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !135, line: 141, baseType: !114, size: 32, align: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !135, line: 144, baseType: !178, size: 24, align: 8, offset: 928)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 24, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !135, line: 145, baseType: !182, size: 8, align: 8, offset: 952)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !135, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !135, line: 151, baseType: !114, size: 32, align: 32, offset: 1088)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !135, line: 152, baseType: !162, size: 64, align: 64, offset: 1152)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !135, line: 88, size: 128, align: 64, elements: !189, identifier: "_ZTS6__sbuf")
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !135, line: 89, baseType: !138, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !135, line: 90, baseType: !114, size: 32, align: 32, offset: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !135, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!193 = !DICompositeType(tag: DW_TAG_class_type, name: "RenderFrontend", scope: !194, file: !4, line: 41, size: 2240, align: 64, elements: !196, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend14RenderFrontendE")
!194 = !DINamespace(name: "pov_frontend", scope: null, file: !195, line: 41)
!195 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/messageoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!196 = !{!197, !198, !199, !201, !202, !206, !209, !213, !214, !217, !221}
!197 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend14RenderFrontendE", baseType: !"_ZTSN12pov_frontend13MessageOutputE", flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "backendaddress", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 64, baseType: !132, size: 64, align: 64, offset: 2048)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 65, baseType: !200, size: 64, align: 64, offset: 2112)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSContext", file: !85, line: 171, baseType: !132)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 66, baseType: !"_ZTSN12pov_frontend14RenderFrontend11EngineStateE", size: 32, align: 32, offset: 2176)
!202 = !DISubprogram(name: "RenderFrontend", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 53, type: !203, isLocal: false, isDefinition: false, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !200, !132}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend14RenderFrontendE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!206 = !DISubprogram(name: "~RenderFrontend", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 54, type: !207, isLocal: false, isDefinition: false, scopeLine: 54, containingType: !"_ZTSN12pov_frontend14RenderFrontendE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !205}
!209 = !DISubprogram(name: "StartRender", linkageName: "_ZN12pov_frontend14RenderFrontend11StartRenderER12POVMS_Object", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 56, type: !210, isLocal: false, isDefinition: false, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !205, !212}
!212 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS12POVMS_Object")
!213 = !DISubprogram(name: "StopRender", linkageName: "_ZN12pov_frontend14RenderFrontend10StopRenderEv", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 57, type: !207, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubprogram(name: "GetState", linkageName: "_ZN12pov_frontend14RenderFrontend8GetStateEv", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 59, type: !215, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{!"_ZTSN12pov_frontend14RenderFrontend11EngineStateE", !205}
!217 = !DISubprogram(name: "RenderStarted", linkageName: "_ZN12pov_frontend14RenderFrontend13RenderStartedER13POVMS_MessageS2_i", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 61, type: !218, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !205, !220, !220, !114}
!220 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS13POVMS_Message")
!221 = !DISubprogram(name: "RenderDone", linkageName: "_ZN12pov_frontend14RenderFrontend10RenderDoneER13POVMS_MessageS2_i", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !4, line: 62, type: !218, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!222 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_MessageReceiver", file: !223, line: 226, size: 192, align: 64, elements: !224, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTS21POVMS_MessageReceiver")
!223 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmscpp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!224 = !{!225, !230, !231, !233, !237, !240, !247, !256, !257, !258, !261, !262, !267, !271, !274, !279, !280}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_MessageReceiver", scope: !223, file: !223, baseType: !226, size: 64, flags: DIFlagArtificial)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!114}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 415, baseType: !200, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "receivers", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 416, baseType: !232, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", size: 64, align: 64)
!233 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 360, type: !234, isLocal: false, isDefinition: false, scopeLine: 360, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !236, !200}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS21POVMS_MessageReceiver", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!237 = !DISubprogram(name: "~POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 361, type: !238, isLocal: false, isDefinition: false, scopeLine: 361, containingType: !"_ZTS21POVMS_MessageReceiver", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !236}
!240 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 373, type: !241, isLocal: false, isDefinition: false, scopeLine: 373, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !236, !129, !129, !243, !132}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !223, line: 305, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !220, !220, !114, !132}
!247 = !DISubprogram(name: "InstallFront", linkageName: "_ZN21POVMS_MessageReceiver12InstallFrontEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 378, type: !248, isLocal: false, isDefinition: false, scopeLine: 378, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !236, !129, !129, !250, !132}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !223, line: 334, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !254, !254, !114, !132}
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObjectPtr", file: !85, line: 173, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!256 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvR13POVMS_MessageS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 393, type: !241, isLocal: false, isDefinition: false, scopeLine: 393, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!257 = !DISubprogram(name: "InstallBack", linkageName: "_ZN21POVMS_MessageReceiver11InstallBackEjjPFvP9POVMSDataS1_iPvES2_", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 398, type: !248, isLocal: false, isDefinition: false, scopeLine: 398, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!258 = !DISubprogram(name: "Remove", linkageName: "_ZN21POVMS_MessageReceiver6RemoveEjj", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 403, type: !259, isLocal: false, isDefinition: false, scopeLine: 403, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !236, !129, !129}
!261 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 418, type: !238, isLocal: false, isDefinition: false, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: true)
!262 = !DISubprogram(name: "POVMS_MessageReceiver", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 419, type: !263, isLocal: false, isDefinition: false, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !236, !265}
!265 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!267 = !DISubprogram(name: "operator=", linkageName: "_ZN21POVMS_MessageReceiveraSERKS_", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 420, type: !268, isLocal: false, isDefinition: false, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !236, !265}
!270 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS21POVMS_MessageReceiver")
!271 = !DISubprogram(name: "ReceiveHandler", linkageName: "_ZN21POVMS_MessageReceiver14ReceiveHandlerEP9POVMSDataS1_iPv", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 422, type: !272, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{!114, !254, !254, !114, !132}
!274 = !DISubprogram(name: "AddNodeFront", linkageName: "_ZN21POVMS_MessageReceiver12AddNodeFrontEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 424, type: !275, isLocal: false, isDefinition: false, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !236, !129, !129, !277, !278}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64)
!279 = !DISubprogram(name: "AddNodeBack", linkageName: "_ZN21POVMS_MessageReceiver11AddNodeBackEjjPNS_9HandlerOOEPNS_7HandlerE", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 425, type: !275, isLocal: false, isDefinition: false, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true)
!280 = !DISubprogram(name: "RemoveNode", linkageName: "_ZN21POVMS_MessageReceiver10RemoveNodeEPNS_11HandlerNodeE", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 426, type: !281, isLocal: false, isDefinition: false, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !236, !232}
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "HandlerNode", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 405, size: 320, align: 64, elements: !284, identifier: "_ZTSN21POVMS_MessageReceiver11HandlerNodeE")
!284 = !{!285, !286, !287, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !223, line: 407, baseType: !232, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !223, line: 408, baseType: !232, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hclass", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !223, line: 409, baseType: !129, size: 32, align: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !223, line: 410, baseType: !129, size: 32, align: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "handleroo", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !223, line: 411, baseType: !277, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !"_ZTSN21POVMS_MessageReceiver11HandlerNodeE", file: !223, line: 412, baseType: !278, size: 64, align: 64, offset: 256)
!291 = !DICompositeType(tag: DW_TAG_class_type, name: "HandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 233, size: 64, align: 64, elements: !292, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver9HandlerOOE")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$HandlerOO", scope: !223, file: !223, baseType: !226, size: 64, flags: DIFlagArtificial)
!294 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver9HandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", file: !223, line: 236, type: !295, isLocal: false, isDefinition: false, scopeLine: 236, containingType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297, !220, !220, !114}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!298 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Message", file: !223, line: 207, size: 192, align: 64, elements: !299, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS13POVMS_Message")
!299 = !{!300, !301, !305, !310, !313, !316, !319, !322, !325, !326, !329, !330}
!300 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS13POVMS_Message", baseType: !"_ZTS12POVMS_Object", flags: DIFlagPublic)
!301 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !223, line: 210, type: !302, isLocal: false, isDefinition: false, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304, !129, !129, !129}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS13POVMS_Message", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!305 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !223, line: 211, type: !306, isLocal: false, isDefinition: false, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !304, !308}
!308 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSObject", file: !85, line: 173, baseType: !"_ZTS9POVMSData")
!310 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !223, line: 212, type: !311, isLocal: false, isDefinition: false, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !304, !254}
!313 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !223, line: 213, type: !314, isLocal: false, isDefinition: false, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !304, !212}
!316 = !DISubprogram(name: "POVMS_Message", scope: !"_ZTS13POVMS_Message", file: !223, line: 214, type: !317, isLocal: false, isDefinition: false, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !304, !220}
!319 = !DISubprogram(name: "operator=", linkageName: "_ZN13POVMS_MessageaSERS_", scope: !"_ZTS13POVMS_Message", file: !223, line: 216, type: !320, isLocal: false, isDefinition: false, scopeLine: 216, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!320 = !DISubroutineType(types: !321)
!321 = !{!220, !304, !220}
!322 = !DISubprogram(name: "GetClass", linkageName: "_ZN13POVMS_Message8GetClassEv", scope: !"_ZTS13POVMS_Message", file: !223, line: 218, type: !323, isLocal: false, isDefinition: false, scopeLine: 218, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{!129, !304}
!325 = !DISubprogram(name: "GetIdentifier", linkageName: "_ZN13POVMS_Message13GetIdentifierEv", scope: !"_ZTS13POVMS_Message", file: !223, line: 219, type: !323, isLocal: false, isDefinition: false, scopeLine: 219, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!326 = !DISubprogram(name: "GetSourceAddress", linkageName: "_ZN13POVMS_Message16GetSourceAddressEv", scope: !"_ZTS13POVMS_Message", file: !223, line: 221, type: !327, isLocal: false, isDefinition: false, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!132, !304}
!329 = !DISubprogram(name: "GetDestinationAddress", linkageName: "_ZN13POVMS_Message21GetDestinationAddressEv", scope: !"_ZTS13POVMS_Message", file: !223, line: 222, type: !327, isLocal: false, isDefinition: false, scopeLine: 222, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!330 = !DISubprogram(name: "SetDestinationAddress", linkageName: "_ZN13POVMS_Message21SetDestinationAddressEPv", scope: !"_ZTS13POVMS_Message", file: !223, line: 223, type: !331, isLocal: false, isDefinition: false, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !304, !132}
!333 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Container", file: !223, line: 50, size: 192, align: 64, elements: !334, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Container")
!334 = !{!335, !336, !337, !341, !342, !345, !348, !352}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$POVMS_Container", scope: !223, file: !223, baseType: !226, size: 64, flags: DIFlagArtificial)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS15POVMS_Container", file: !223, line: 64, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 64, flags: DIFlagProtected)
!337 = !DISubprogram(name: "POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !223, line: 57, type: !338, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Container", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!341 = !DISubprogram(name: "~POVMS_Container", scope: !"_ZTS15POVMS_Container", file: !223, line: 58, type: !338, isLocal: false, isDefinition: false, scopeLine: 58, containingType: !"_ZTS15POVMS_Container", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!342 = !DISubprogram(name: "Type", linkageName: "_ZN15POVMS_Container4TypeEv", scope: !"_ZTS15POVMS_Container", file: !223, line: 60, type: !343, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{!129, !340}
!345 = !DISubprogram(name: "Size", linkageName: "_ZN15POVMS_Container4SizeEv", scope: !"_ZTS15POVMS_Container", file: !223, line: 61, type: !346, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!119, !340}
!348 = !DISubprogram(name: "IsNull", linkageName: "_ZN15POVMS_Container6IsNullEv", scope: !"_ZTS15POVMS_Container", file: !223, line: 62, type: !349, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !340}
!351 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!352 = !DISubprogram(name: "DetachData", linkageName: "_ZN15POVMS_Container10DetachDataEv", scope: !"_ZTS15POVMS_Container", file: !223, line: 66, type: !338, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !85, line: 178, size: 128, align: 64, elements: !354, identifier: "_ZTS9POVMSData")
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !85, line: 180, baseType: !129, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !85, line: 181, baseType: !114, size: 32, align: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !85, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!358 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !85, line: 182, size: 64, align: 64, elements: !359, identifier: "_ZTSN9POVMSDataUt_E")
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !85, line: 184, baseType: !132, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !85, line: 185, baseType: !255, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !85, line: 186, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !85, line: 190, size: 320, align: 64, elements: !365, identifier: "_ZTS9POVMSNode")
!365 = !{!366, !367, !368, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !85, line: 192, baseType: !363, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !85, line: 193, baseType: !363, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !85, line: 194, baseType: !129, size: 32, align: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !85, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Object", file: !223, line: 112, size: 192, align: 64, elements: !371, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS12POVMS_Object")
!371 = !{!372, !373, !377, !380, !383, !386, !389, !392, !396, !400, !403, !404, !405, !406, !407, !410, !411, !418, !422, !425, !428, !431, !434, !438, !439, !442, !445, !448, !449, !452, !455, !456, !459, !463, !466, !467}
!372 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS12POVMS_Object", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!373 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !223, line: 117, type: !374, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !376, !129}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS12POVMS_Object", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!377 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !223, line: 118, type: !378, isLocal: false, isDefinition: false, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !376, !308}
!380 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !223, line: 119, type: !381, isLocal: false, isDefinition: false, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !376, !254}
!383 = !DISubprogram(name: "POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !223, line: 120, type: !384, isLocal: false, isDefinition: false, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !376, !212}
!386 = !DISubprogram(name: "~POVMS_Object", scope: !"_ZTS12POVMS_Object", file: !223, line: 121, type: !387, isLocal: false, isDefinition: false, scopeLine: 121, containingType: !"_ZTS12POVMS_Object", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !376}
!389 = !DISubprogram(name: "operator=", linkageName: "_ZN12POVMS_ObjectaSERS_", scope: !"_ZTS12POVMS_Object", file: !223, line: 123, type: !390, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{!212, !376, !212}
!392 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !223, line: 125, type: !393, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !376, !129, !395}
!395 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS15POVMS_Attribute")
!396 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !223, line: 126, type: !397, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !376, !129, !399}
!399 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTS10POVMS_List")
!400 = !DISubprogram(name: "Get", linkageName: "_ZN12POVMS_Object3GetEjRS_", scope: !"_ZTS12POVMS_Object", file: !223, line: 127, type: !401, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !376, !129, !212}
!403 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR15POVMS_Attribute", scope: !"_ZTS12POVMS_Object", file: !223, line: 128, type: !393, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!404 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjR10POVMS_List", scope: !"_ZTS12POVMS_Object", file: !223, line: 129, type: !397, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubprogram(name: "Set", linkageName: "_ZN12POVMS_Object3SetEjRS_", scope: !"_ZTS12POVMS_Object", file: !223, line: 130, type: !401, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!406 = !DISubprogram(name: "Remove", linkageName: "_ZN12POVMS_Object6RemoveEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 131, type: !374, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!407 = !DISubprogram(name: "Exist", linkageName: "_ZN12POVMS_Object5ExistEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 132, type: !408, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{!351, !376, !129}
!410 = !DISubprogram(name: "Merge", linkageName: "_ZN12POVMS_Object5MergeERS_", scope: !"_ZTS12POVMS_Object", file: !223, line: 133, type: !384, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!411 = !DISubprogram(name: "operator*", linkageName: "_ZNK12POVMS_ObjectdeEv", scope: !"_ZTS12POVMS_Object", file: !223, line: 135, type: !412, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !416}
!414 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTS12POVMS_Object")
!418 = !DISubprogram(name: "operator->", linkageName: "_ZNK12POVMS_ObjectptEv", scope: !"_ZTS12POVMS_Object", file: !223, line: 136, type: !419, isLocal: false, isDefinition: false, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{!421, !416}
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!422 = !DISubprogram(name: "operator()", linkageName: "_ZN12POVMS_ObjectclEv", scope: !"_ZTS12POVMS_Object", file: !223, line: 137, type: !423, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{!309, !376}
!425 = !DISubprogram(name: "SetString", linkageName: "_ZN12POVMS_Object9SetStringEjPKc", scope: !"_ZTS12POVMS_Object", file: !223, line: 139, type: !426, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !376, !129, !171}
!428 = !DISubprogram(name: "SetInt", linkageName: "_ZN12POVMS_Object6SetIntEji", scope: !"_ZTS12POVMS_Object", file: !223, line: 140, type: !429, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !376, !129, !114}
!431 = !DISubprogram(name: "SetLong", linkageName: "_ZN12POVMS_Object7SetLongEjx", scope: !"_ZTS12POVMS_Object", file: !223, line: 141, type: !432, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !376, !129, !124}
!434 = !DISubprogram(name: "SetFloat", linkageName: "_ZN12POVMS_Object8SetFloatEjf", scope: !"_ZTS12POVMS_Object", file: !223, line: 142, type: !435, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !376, !129, !437}
!437 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!438 = !DISubprogram(name: "SetBool", linkageName: "_ZN12POVMS_Object7SetBoolEji", scope: !"_ZTS12POVMS_Object", file: !223, line: 143, type: !429, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!439 = !DISubprogram(name: "SetType", linkageName: "_ZN12POVMS_Object7SetTypeEjj", scope: !"_ZTS12POVMS_Object", file: !223, line: 144, type: !440, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !376, !129, !129}
!442 = !DISubprogram(name: "GetStringLength", linkageName: "_ZN12POVMS_Object15GetStringLengthEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 145, type: !443, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!114, !376, !129}
!445 = !DISubprogram(name: "GetString", linkageName: "_ZN12POVMS_Object9GetStringEjPci", scope: !"_ZTS12POVMS_Object", file: !223, line: 146, type: !446, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{!114, !376, !129, !156, !114}
!448 = !DISubprogram(name: "GetInt", linkageName: "_ZN12POVMS_Object6GetIntEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 147, type: !443, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!449 = !DISubprogram(name: "GetLong", linkageName: "_ZN12POVMS_Object7GetLongEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 148, type: !450, isLocal: false, isDefinition: false, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{!124, !376, !129}
!452 = !DISubprogram(name: "GetFloat", linkageName: "_ZN12POVMS_Object8GetFloatEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 149, type: !453, isLocal: false, isDefinition: false, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{!437, !376, !129}
!455 = !DISubprogram(name: "GetBool", linkageName: "_ZN12POVMS_Object7GetBoolEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 150, type: !443, isLocal: false, isDefinition: false, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!456 = !DISubprogram(name: "GetType", linkageName: "_ZN12POVMS_Object7GetTypeEj", scope: !"_ZTS12POVMS_Object", file: !223, line: 151, type: !457, isLocal: false, isDefinition: false, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!129, !376, !129}
!459 = !DISubprogram(name: "ReadHeader", linkageName: "_ZN12POVMS_Object10ReadHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !223, line: 201, type: !460, isLocal: false, isDefinition: false, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true)
!460 = !DISubroutineType(types: !461)
!461 = !{!351, !376, !138, !462}
!462 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !114)
!463 = !DISubprogram(name: "ReadObject", linkageName: "_ZN12POVMS_Object10ReadObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !223, line: 202, type: !464, isLocal: false, isDefinition: false, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true)
!464 = !DISubroutineType(types: !465)
!465 = !{!351, !376, !138, !114}
!466 = !DISubprogram(name: "WriteHeader", linkageName: "_ZN12POVMS_Object11WriteHeaderEPhRi", scope: !"_ZTS12POVMS_Object", file: !223, line: 203, type: !460, isLocal: false, isDefinition: false, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true)
!467 = !DISubprogram(name: "WriteObject", linkageName: "_ZN12POVMS_Object11WriteObjectEPhi", scope: !"_ZTS12POVMS_Object", file: !223, line: 204, type: !464, isLocal: false, isDefinition: false, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true)
!468 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_Attribute", file: !223, line: 69, size: 192, align: 64, elements: !469, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS15POVMS_Attribute")
!469 = !{!470, !471, !475, !478, !481, !484, !487, !490, !493, !498, !501, !502, !505, !509}
!470 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS15POVMS_Attribute", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!471 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 72, type: !472, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS15POVMS_Attribute", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!475 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 73, type: !476, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !474, !171}
!478 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 74, type: !479, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !474, !114}
!481 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 75, type: !482, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !474, !124}
!484 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 76, type: !485, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !474, !437}
!487 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 77, type: !488, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !474, !351}
!490 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 78, type: !491, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !474, !129}
!493 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 79, type: !494, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !474, !496}
!496 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttribute", file: !85, line: 174, baseType: !"_ZTS9POVMSData")
!498 = !DISubprogram(name: "POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 80, type: !499, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !474, !395}
!501 = !DISubprogram(name: "~POVMS_Attribute", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 81, type: !472, isLocal: false, isDefinition: false, scopeLine: 81, containingType: !"_ZTS15POVMS_Attribute", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!502 = !DISubprogram(name: "operator=", linkageName: "_ZN15POVMS_AttributeaSERS_", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 83, type: !503, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{!395, !474, !395}
!505 = !DISubprogram(name: "Get", linkageName: "_ZN15POVMS_Attribute3GetEjPvPi", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 85, type: !506, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !474, !129, !132, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!509 = !DISubprogram(name: "Set", linkageName: "_ZN15POVMS_Attribute3SetEjPvi", scope: !"_ZTS15POVMS_Attribute", file: !223, line: 86, type: !510, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !474, !129, !132, !114}
!512 = !DICompositeType(tag: DW_TAG_class_type, name: "POVMS_List", file: !223, line: 89, size: 192, align: 64, elements: !513, vtableHolder: !"_ZTS15POVMS_Container", identifier: "_ZTS10POVMS_List")
!513 = !{!514, !515, !519, !524, !527, !528, !531, !534, !535, !538, !541, !544, !547, !548, !549, !550, !553}
!514 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTS10POVMS_List", baseType: !"_ZTS15POVMS_Container", flags: DIFlagPublic)
!515 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !223, line: 92, type: !516, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS10POVMS_List", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!519 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !223, line: 93, type: !520, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !518, !522}
!522 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "POVMSAttributeList", file: !85, line: 175, baseType: !"_ZTS9POVMSData")
!524 = !DISubprogram(name: "POVMS_List", scope: !"_ZTS10POVMS_List", file: !223, line: 94, type: !525, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !518, !399}
!527 = !DISubprogram(name: "~POVMS_List", scope: !"_ZTS10POVMS_List", file: !223, line: 95, type: !516, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTS10POVMS_List", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!528 = !DISubprogram(name: "operator=", linkageName: "_ZN10POVMS_ListaSERS_", scope: !"_ZTS10POVMS_List", file: !223, line: 97, type: !529, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{!399, !518, !399}
!531 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !223, line: 99, type: !532, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !518, !395}
!534 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendERS_", scope: !"_ZTS10POVMS_List", file: !223, line: 100, type: !525, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!535 = !DISubprogram(name: "Append", linkageName: "_ZN10POVMS_List6AppendER12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !223, line: 101, type: !536, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !518, !212}
!538 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !223, line: 102, type: !539, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !518, !114, !395}
!541 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !223, line: 103, type: !542, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !518, !114, !399}
!544 = !DISubprogram(name: "GetNth", linkageName: "_ZN10POVMS_List6GetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !223, line: 104, type: !545, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !518, !114, !212}
!547 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR15POVMS_Attribute", scope: !"_ZTS10POVMS_List", file: !223, line: 105, type: !539, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!548 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiRS_", scope: !"_ZTS10POVMS_List", file: !223, line: 106, type: !542, isLocal: false, isDefinition: false, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!549 = !DISubprogram(name: "SetNth", linkageName: "_ZN10POVMS_List6SetNthEiR12POVMS_Object", scope: !"_ZTS10POVMS_List", file: !223, line: 107, type: !545, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!550 = !DISubprogram(name: "RemoveNth", linkageName: "_ZN10POVMS_List9RemoveNthEi", scope: !"_ZTS10POVMS_List", file: !223, line: 108, type: !551, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !518, !114}
!553 = !DISubprogram(name: "Clear", linkageName: "_ZN10POVMS_List5ClearEv", scope: !"_ZTS10POVMS_List", file: !223, line: 109, type: !516, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!554 = !DICompositeType(tag: DW_TAG_class_type, name: "Handler", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 238, size: 64, align: 64, elements: !555, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver7HandlerE")
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Handler", scope: !223, file: !223, baseType: !226, size: 64, flags: DIFlagArtificial)
!557 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver7Handler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver7HandlerE", file: !223, line: 241, type: !558, isLocal: false, isDefinition: false, scopeLine: 241, containingType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", virtuality: DW_VIRTUALITY_pure_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !560, !254, !254, !114}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!561 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandlerOO", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 302, size: 192, align: 64, elements: !562, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", identifier: "_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE")
!562 = !{!563, !564, !565, !566, !570, !573}
!563 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", flags: DIFlagPublic)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !223, line: 327, baseType: !243, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !223, line: 328, baseType: !132, size: 64, align: 64, offset: 128)
!566 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !223, line: 307, type: !567, isLocal: false, isDefinition: false, scopeLine: 307, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!570 = !DISubprogram(name: "FunctionHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !223, line: 313, type: !571, isLocal: false, isDefinition: false, scopeLine: 313, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !569, !243, !132}
!573 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver17FunctionHandlerOO4CallER13POVMS_MessageS2_i", scope: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", file: !223, line: 319, type: !574, isLocal: false, isDefinition: false, scopeLine: 319, containingType: !"_ZTSN21POVMS_MessageReceiver17FunctionHandlerOOE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !569, !220, !220, !114}
!576 = !DICompositeType(tag: DW_TAG_class_type, name: "FunctionHandler", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 331, size: 192, align: 64, elements: !577, vtableHolder: !"_ZTSN21POVMS_MessageReceiver7HandlerE", identifier: "_ZTSN21POVMS_MessageReceiver15FunctionHandlerE")
!577 = !{!578, !579, !580, !581, !585, !588}
!578 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", baseType: !"_ZTSN21POVMS_MessageReceiver7HandlerE", flags: DIFlagPublic)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !223, line: 356, baseType: !250, size: 64, align: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "privatedata", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !223, line: 357, baseType: !132, size: 64, align: 64, offset: 128)
!581 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !223, line: 336, type: !582, isLocal: false, isDefinition: false, scopeLine: 336, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!585 = !DISubprogram(name: "FunctionHandler", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !223, line: 342, type: !586, isLocal: false, isDefinition: false, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !584, !250, !132}
!588 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver15FunctionHandler4CallEP9POVMSDataS2_i", scope: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", file: !223, line: 348, type: !589, isLocal: false, isDefinition: false, scopeLine: 348, containingType: !"_ZTSN21POVMS_MessageReceiver15FunctionHandlerE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !584, !254, !254, !114}
!591 = !DICompositeType(tag: DW_TAG_class_type, name: "MessageOutput", scope: !194, file: !195, line: 45, size: 2048, align: 64, elements: !592, vtableHolder: !"_ZTS21POVMS_MessageReceiver", identifier: "_ZTSN12pov_frontend13MessageOutputE")
!592 = !{!593, !594, !599, !601, !603, !605, !606, !610, !614, !617, !620, !621, !625, !628, !631, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !648}
!593 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN12pov_frontend13MessageOutputE", baseType: !"_ZTS21POVMS_MessageReceiver", flags: DIFlagPublic)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 64, baseType: !595, size: 512, align: 64, offset: 192, flags: DIFlagProtected)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 512, align: 64, elements: !597)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64)
!597 = !{!598}
!598 = !DISubrange(count: 8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "streamnames", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 65, baseType: !600, size: 512, align: 64, offset: 704, flags: DIFlagProtected)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 512, align: 64, elements: !597)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "consoleoutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 66, baseType: !602, size: 64, align: 8, offset: 1216, flags: DIFlagProtected)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 64, align: 8, elements: !597)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "output_string_buffer_size", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 92, baseType: !604, size: 32, align: 32, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "output_string_buffer", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 93, baseType: !156, size: 64, align: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "status_string_buffer", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 94, baseType: !607, size: 640, align: 8, offset: 1408)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 640, align: 8, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 80)
!610 = !DISubprogram(name: "MessageOutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 48, type: !611, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !613, !200}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend13MessageOutputE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!614 = !DISubprogram(name: "~MessageOutput", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 49, type: !615, isLocal: false, isDefinition: false, scopeLine: 49, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !613}
!617 = !DISubprogram(name: "OpenStreams", linkageName: "_ZN12pov_frontend13MessageOutput11OpenStreamsEb", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 68, type: !618, isLocal: false, isDefinition: false, scopeLine: 68, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !613, !351}
!620 = !DISubprogram(name: "CloseStreams", linkageName: "_ZN12pov_frontend13MessageOutput12CloseStreamsEv", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 69, type: !615, isLocal: false, isDefinition: false, scopeLine: 69, containingType: !"_ZTSN12pov_frontend13MessageOutputE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!621 = !DISubprogram(name: "Printfile", linkageName: "_ZN12pov_frontend13MessageOutput9PrintfileEiPKcmi", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 71, type: !622, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !613, !114, !171, !624, !114}
!624 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!625 = !DISubprogram(name: "Printf", linkageName: "_ZN12pov_frontend13MessageOutput6PrintfEiPKcz", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 72, type: !626, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !613, !114, !171, null}
!628 = !DISubprogram(name: "Flush", linkageName: "_ZN12pov_frontend13MessageOutput5FlushEi", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 73, type: !629, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !613, !114}
!631 = !DISubprogram(name: "InitInfo", linkageName: "_ZN12pov_frontend13MessageOutput8InitInfoEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 75, type: !632, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !613, !254, !254, !114}
!634 = !DISubprogram(name: "RenderOptions", linkageName: "_ZN12pov_frontend13MessageOutput13RenderOptionsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 76, type: !632, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!635 = !DISubprogram(name: "RenderStarted", linkageName: "_ZN12pov_frontend13MessageOutput13RenderStartedEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 77, type: !632, isLocal: false, isDefinition: false, scopeLine: 77, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!636 = !DISubprogram(name: "FrameStatistics", linkageName: "_ZN12pov_frontend13MessageOutput15FrameStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 78, type: !632, isLocal: false, isDefinition: false, scopeLine: 78, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!637 = !DISubprogram(name: "ParseStatistics", linkageName: "_ZN12pov_frontend13MessageOutput15ParseStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 79, type: !632, isLocal: false, isDefinition: false, scopeLine: 79, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!638 = !DISubprogram(name: "RenderStatistics", linkageName: "_ZN12pov_frontend13MessageOutput16RenderStatisticsEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 80, type: !632, isLocal: false, isDefinition: false, scopeLine: 80, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!639 = !DISubprogram(name: "RenderDone", linkageName: "_ZN12pov_frontend13MessageOutput10RenderDoneEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 81, type: !632, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!640 = !DISubprogram(name: "Progress", linkageName: "_ZN12pov_frontend13MessageOutput8ProgressEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 82, type: !632, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!641 = !DISubprogram(name: "Warning", linkageName: "_ZN12pov_frontend13MessageOutput7WarningEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 83, type: !632, isLocal: false, isDefinition: false, scopeLine: 83, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!642 = !DISubprogram(name: "Error", linkageName: "_ZN12pov_frontend13MessageOutput5ErrorEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 84, type: !632, isLocal: false, isDefinition: false, scopeLine: 84, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!643 = !DISubprogram(name: "FatalError", linkageName: "_ZN12pov_frontend13MessageOutput10FatalErrorEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 85, type: !632, isLocal: false, isDefinition: false, scopeLine: 85, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!644 = !DISubprogram(name: "DebugInfo", linkageName: "_ZN12pov_frontend13MessageOutput9DebugInfoEP9POVMSDataS2_i", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 86, type: !632, isLocal: false, isDefinition: false, scopeLine: 86, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!645 = !DISubprogram(name: "FileMessage", linkageName: "_ZN12pov_frontend13MessageOutput11FileMessageEiP9POVMSData", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 88, type: !646, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !613, !114, !254}
!648 = !DISubprogram(name: "GetOptionSwitchString", linkageName: "_ZN12pov_frontend13MessageOutput21GetOptionSwitchStringEP9POVMSDatajb", scope: !"_ZTSN12pov_frontend13MessageOutputE", file: !195, line: 90, type: !649, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{!171, !613, !254, !129, !351}
!651 = !DICompositeType(tag: DW_TAG_class_type, name: "TextStreamBuffer", scope: !13, file: !652, line: 51, size: 256, align: 64, elements: !653, vtableHolder: !"_ZTSN8pov_base16TextStreamBufferE", identifier: "_ZTSN8pov_base16TextStreamBufferE")
!652 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !667, !670, !673, !676, !677, !680, !683, !688, !689, !692, !693, !694, !695}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$TextStreamBuffer", scope: !652, file: !652, baseType: !226, size: 64, flags: DIFlagArtificial)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 69, baseType: !156, size: 64, align: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "boffset", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 70, baseType: !129, size: 32, align: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 71, baseType: !129, size: 32, align: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 72, baseType: !129, size: 32, align: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "curline", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 73, baseType: !129, size: 32, align: 32, offset: 224)
!660 = !DISubprogram(name: "TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 54, type: !661, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !663, !664, !129}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !665, line: 30, baseType: !666)
!665 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !166, line: 92, baseType: !624)
!667 = !DISubprogram(name: "~TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 55, type: !668, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !663}
!670 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base16TextStreamBuffer6printfEPKcz", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 57, type: !671, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !663, !171, null}
!673 = !DISubprogram(name: "print", linkageName: "_ZN8pov_base16TextStreamBuffer5printEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 58, type: !674, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !663, !171}
!676 = !DISubprogram(name: "puts", linkageName: "_ZN8pov_base16TextStreamBuffer4putsEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 59, type: !674, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!677 = !DISubprogram(name: "putc", linkageName: "_ZN8pov_base16TextStreamBuffer4putcEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 60, type: !678, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !663, !114}
!680 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEPKcmi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 61, type: !681, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !663, !171, !624, !114}
!683 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEP7__sFILEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 62, type: !684, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !663, !686, !114}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !135, line: 153, baseType: !"_ZTS7__sFILE")
!688 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base16TextStreamBuffer5flushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 63, type: !668, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubprogram(name: "lineoutput", linkageName: "_ZN8pov_base16TextStreamBuffer10lineoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 65, type: !690, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !663, !171, !129}
!692 = !DISubprogram(name: "directoutput", linkageName: "_ZN8pov_base16TextStreamBuffer12directoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 66, type: !690, isLocal: false, isDefinition: false, scopeLine: 66, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!693 = !DISubprogram(name: "rawoutput", linkageName: "_ZN8pov_base16TextStreamBuffer9rawoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 67, type: !690, isLocal: false, isDefinition: false, scopeLine: 67, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!694 = !DISubprogram(name: "lineflush", linkageName: "_ZN8pov_base16TextStreamBuffer9lineflushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 75, type: !668, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true)
!695 = !DISubprogram(name: "directflush", linkageName: "_ZN8pov_base16TextStreamBuffer11directflushEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !652, line: 76, type: !690, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true)
!696 = !DICompositeType(tag: DW_TAG_class_type, name: "MemberHandlerOO<pov_frontend::RenderFrontend>", scope: !"_ZTS21POVMS_MessageReceiver", file: !223, line: 244, size: 256, align: 64, elements: !697, vtableHolder: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", templateParams: !714, identifier: "_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE")
!697 = !{!698, !699, !702, !704, !708, !711}
!698 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", baseType: !"_ZTSN21POVMS_MessageReceiver9HandlerOOE", flags: DIFlagPublic)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handlerptr", scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", file: !223, line: 269, baseType: !700, size: 128, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemberHandlerPtr", scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", file: !223, line: 247, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !218, size: 128, extraData: !"_ZTSN12pov_frontend14RenderFrontendE")
!702 = !DIDerivedType(tag: DW_TAG_member, name: "classptr", scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", file: !223, line: 270, baseType: !703, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN12pov_frontend14RenderFrontendE", size: 64, align: 64)
!704 = !DISubprogram(name: "MemberHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", file: !223, line: 249, type: !705, isLocal: false, isDefinition: false, scopeLine: 249, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!708 = !DISubprogram(name: "MemberHandlerOO", scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", file: !223, line: 255, type: !709, isLocal: false, isDefinition: false, scopeLine: 255, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !707, !703, !700}
!711 = !DISubprogram(name: "Call", linkageName: "_ZN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEE4CallER13POVMS_MessageS5_i", scope: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", file: !223, line: 261, type: !712, isLocal: false, isDefinition: false, scopeLine: 261, containingType: !"_ZTSN21POVMS_MessageReceiver15MemberHandlerOOIN12pov_frontend14RenderFrontendEEE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !707, !220, !220, !114}
!714 = !{!715}
!715 = !DITemplateTypeParameter(name: "T", type: !"_ZTSN12pov_frontend14RenderFrontendE")
!716 = !{!717, !724, !727, !730, !733, !739, !743, !749, !755, !762, !765, !776, !782, !787, !793, !799}
!717 = !DISubprogram(name: "RenderFrontend", linkageName: "_ZN12pov_frontend14RenderFrontendC2EPvS1_", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !1, line: 40, type: !203, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov_frontend::RenderFrontend"*, i8*, i8*)* @_ZN12pov_frontend14RenderFrontendC2EPvS1_, declaration: !202, variables: !718)
!718 = !{!719, !720, !721, !722}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !717, type: !703, flags: DIFlagArtificial | DIFlagObjectPointer)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 2, scope: !717, file: !1, line: 40, type: !200)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "baddr", arg: 3, scope: !717, file: !1, line: 40, type: !132)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !723, file: !1, line: 42, type: !114)
!723 = distinct !DILexicalBlock(scope: !717, file: !1, line: 41, column: 1)
!724 = !DISubprogram(name: "~RenderFrontend", linkageName: "_ZN12pov_frontend14RenderFrontendD2Ev", scope: !"_ZTSN12pov_frontend14RenderFrontendE", file: !1, line: 54, type: !207, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov_frontend::RenderFrontend"*)* @_ZN12pov_frontend14RenderFrontendD2Ev, declaration: !206, variables: !725)
!725 = !{!726}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !724, type: !703, flags: DIFlagArtificial | DIFlagObjectPointer)
