; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/splines.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Spline_Struct" = type { i32, i32, i32, %"struct.pov::Spline_Entry"*, i32, i32, i8, i32, double, [5 x double] }
%"struct.pov::Spline_Entry" = type { double, [5 x double], [5 x double] }

@.str = private unnamed_addr constant [68 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/splines.cpp\00", align 1
@.str1 = private unnamed_addr constant [27 x i8] c"Spline coefficient storage\00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"spline\00", align 1
@.str3 = private unnamed_addr constant [13 x i8] c"spline entry\00", align 1
@.str4 = private unnamed_addr constant [25 x i8] c"Temporary Spline Entries\00", align 1
@.str5 = private unnamed_addr constant [31 x i8] c"Unknown spline type %d found.\0A\00", align 1

; Function Attrs: optsize ssp uwtable
define void @_ZN3pov23Precompute_Cubic_CoeffsEPNS_13Spline_StructE(%"struct.pov::Spline_Struct"* nocapture %sp) #0 {
  tail call void @llvm.dbg.value(metadata %"struct.pov::Spline_Struct"* %sp, i64 0, metadata !66, metadata !473), !dbg !474
  %1 = getelementptr inbounds %"struct.pov::Spline_Struct"* %sp, i64 0, i32 0, !dbg !475
  %2 = load i32* %1, align 4, !dbg !475, !tbaa !476
  %3 = sext i32 %2 to i64, !dbg !475
  %4 = shl nsw i64 %3, 3, !dbg !475

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !13, subprograms: !61, globals: !180, imports: !181)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/splines.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 701, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "pRED", value: 0)
!9 = !DIEnumerator(name: "pGREEN", value: 1)
!10 = !DIEnumerator(name: "pBLUE", value: 2)
!11 = !DIEnumerator(name: "pFILTER", value: 3)
!12 = !DIEnumerator(name: "pTRANSM", value: 4)
!13 = !{!14, !20, !25, !30, !50, !55, !56, !57, !59}
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 82, size: 64, align: 32, elements: !16, identifier: "_ZTS5div_t")
!15 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !15, line: 83, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !15, line: 84, baseType: !18, size: 32, align: 32, offset: 32)
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 87, size: 128, align: 64, elements: !21, identifier: "_ZTS6ldiv_t")
!21 = !{!22, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !15, line: 88, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !15, line: 89, baseType: !23, size: 64, align: 64, offset: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 93, size: 128, align: 64, elements: !26, identifier: "_ZTS7lldiv_t")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !15, line: 94, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !15, line: 95, baseType: !28, size: 64, align: 64, offset: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spline_Struct", scope: !5, file: !4, line: 1130, size: 704, align: 64, elements: !31, identifier: "_ZTSN3pov13Spline_StructE")
!31 = !{!32, !33, !34, !35, !38, !39, !40, !42, !43, !45}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1132, baseType: !18, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1132, baseType: !18, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Entries", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1133, baseType: !18, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "SplineEntries", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1134, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE_ENTRY", scope: !5, file: !4, line: 1028, baseType: !"_ZTSN3pov12Spline_EntryE")
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Coeffs_Computed", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1135, baseType: !18, size: 32, align: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Terms", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1136, baseType: !18, size: 32, align: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Valid", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1137, baseType: !41, size: 8, align: 8, offset: 256)
!41 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Type", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1138, baseType: !18, size: 32, align: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Point", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1139, baseType: !44, size: 64, align: 64, offset: 320)
!44 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Data", scope: !"_ZTSN3pov13Spline_StructE", file: !4, line: 1140, baseType: !46, size: 320, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXPRESS", scope: !5, file: !4, line: 680, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 320, align: 64, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 5)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spline_Entry", scope: !5, file: !4, line: 1123, size: 704, align: 64, elements: !51, identifier: "_ZTSN3pov12Spline_EntryE")
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !"_ZTSN3pov12Spline_EntryE", file: !4, line: 1125, baseType: !44, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !"_ZTSN3pov12Spline_EntryE", file: !4, line: 1126, baseType: !47, size: 320, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !"_ZTSN3pov12Spline_EntryE", file: !4, line: 1127, baseType: !47, size: 320, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE", scope: !5, file: !4, line: 1029, baseType: !"_ZTSN3pov13Spline_StructE")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE_ENTRY", scope: !5, file: !4, line: 1143, baseType: !"_ZTSN3pov12Spline_EntryE")
!61 = !{!62, !73, !85, !101, !109, !119, !128, !136, !143, !149, !152, !161, !174}
!62 = !DISubprogram(name: "Precompute_Cubic_Coeffs", linkageName: "_ZN3pov23Precompute_Cubic_CoeffsEPNS_13Spline_StructE", scope: !5, file: !1, line: 98, type: !63, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: void (%"struct.pov::Spline_Struct"*)* @_ZN3pov23Precompute_Cubic_CoeffsEPNS_13Spline_StructE, variables: !65)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !57}
!65 = !{!66, !67, !68, !69, !70, !71, !72}
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sp", arg: 1, scope: !62, file: !1, line: 98, type: !57)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !62, file: !1, line: 100, type: !18)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !62, file: !1, line: 100, type: !18)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !62, file: !1, line: 101, type: !55)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !62, file: !1, line: 102, type: !55)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !62, file: !1, line: 103, type: !55)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !62, file: !1, line: 104, type: !55)
!73 = !DISubprogram(name: "linear_interpolate", linkageName: "_ZN3pov18linear_interpolateEPNS_12Spline_EntryEiid", scope: !5, file: !1, line: 170, type: !74, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, function: double (%"struct.pov::Spline_Entry"*, i32, i32, double)* @_ZN3pov18linear_interpolateEPNS_12Spline_EntryEiid, variables: !76)
!74 = !DISubroutineType(types: !75)
!75 = !{!44, !59, !18, !18, !44}
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !73, file: !1, line: 170, type: !59)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !73, file: !1, line: 170, type: !18)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 3, scope: !73, file: !1, line: 170, type: !18)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 4, scope: !73, file: !1, line: 170, type: !44)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p1", scope: !73, file: !1, line: 172, type: !44)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p2", scope: !73, file: !1, line: 172, type: !44)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v1", scope: !73, file: !1, line: 172, type: !44)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v2", scope: !73, file: !1, line: 172, type: !44)
!85 = !DISubprogram(name: "quadratic_interpolate", linkageName: "_ZN3pov21quadratic_interpolateEPNS_12Spline_EntryEiid", scope: !5, file: !1, line: 211, type: !74, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: double (%"struct.pov::Spline_Entry"*, i32, i32, double)* @_ZN3pov21quadratic_interpolateEPNS_12Spline_EntryEiid, variables: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
