; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/stringutilities.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@_ZZN8pov_base12pov_tsprintfEPKczE19pov_tsprintf_buffer = internal global [1024 x i8] zeroinitializer, align 16

; Function Attrs: optsize ssp uwtable
define i32 @_ZN8pov_base11pov_stricmpEPKcS1_(i8* nocapture readonly %s1, i8* nocapture readonly %s2) #0 {
  tail call void @llvm.dbg.value(metadata i8* %s1, i64 0, metadata !94, metadata !555), !dbg !556
  tail call void @llvm.dbg.value(metadata i8* %s2, i64 0, metadata !95, metadata !555), !dbg !557
  br label %1, !dbg !558

; <label>:1                                       ; preds = %15, %0
  %.01 = phi i8* [ %s1, %0 ], [ %17, %15 ]
  %.0 = phi i8* [ %s2, %0 ], [ %16, %15 ]
  %2 = load i8* %.01, align 1, !dbg !559, !tbaa !560
  %3 = icmp eq i8 %2, 0, !dbg !563
  %4 = load i8* %.0, align 1, !dbg !564, !tbaa !560
  br i1 %3, label %19, label %5, !dbg !568

; <label>:5                                       ; preds = %1
  %6 = icmp eq i8 %4, 0, !dbg !569
  br i1 %6, label %.thread, label %7, !dbg !558

; <label>:7                                       ; preds = %5
  tail call void @llvm.dbg.value(metadata i8* %17, i64 0, metadata !94, metadata !555), !dbg !556
  tail call void @llvm.dbg.value(metadata i8 %2, i64 0, metadata !96, metadata !555), !dbg !570

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !87, globals: !116, imports: !121)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/stringutilities.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !12, !18, !23, !28, !82, !86, !51}
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !5, identifier: "_ZTS13__va_list_tag")
!5 = !{!6, !8, !9, !11}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !7, size: 32, align: 32)
!7 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !7, size: 32, align: 32, offset: 32)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !10, size: 64, align: 64, offset: 128)
!12 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 82, size: 64, align: 32, elements: !14, identifier: "_ZTS5div_t")
!13 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !{!15, !17}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !13, line: 83, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !13, line: 84, baseType: !16, size: 32, align: 32, offset: 32)
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 87, size: 128, align: 64, elements: !19, identifier: "_ZTS6ldiv_t")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !13, line: 88, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !13, line: 89, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 93, size: 128, align: 64, elements: !24, identifier: "_ZTS7lldiv_t")
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !13, line: 94, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !13, line: 95, baseType: !26, size: 64, align: 64, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !29, line: 122, size: 1216, align: 64, elements: !30, identifier: "_ZTS7__sFILE")
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !{!31, !34, !35, !36, !38, !39, !40, !41, !42, !46, !52, !61, !67, !68, !70, !71, !75, !79, !80, !81}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !29, line: 123, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !29, line: 124, baseType: !16, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !29, line: 125, baseType: !16, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !29, line: 126, baseType: !37, size: 16, align: 16, offset: 128)
!37 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !29, line: 127, baseType: !37, size: 16, align: 16, offset: 144)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !29, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !29, line: 129, baseType: !16, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !29, line: 132, baseType: !10, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !29, line: 133, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!16, !10}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !29, line: 134, baseType: !47, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!16, !10, !50, !16}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !29, line: 135, baseType: !53, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !10, !56, !16}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !29, line: 77, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !58, line: 71, baseType: !59)
!58 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !60, line: 46, baseType: !26)
!60 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !29, line: 136, baseType: !62, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!16, !10, !65, !16}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !29, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !29, line: 140, baseType: !69, size: 64, align: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !29, line: 141, baseType: !16, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !29, line: 144, baseType: !72, size: 24, align: 8, offset: 928)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !29, line: 145, baseType: !76, size: 8, align: 8, offset: 952)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !29, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !29, line: 151, baseType: !16, size: 32, align: 32, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !29, line: 152, baseType: !56, size: 64, align: 64, offset: 1152)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !29, line: 88, size: 128, align: 64, elements: !83, identifier: "_ZTS6__sbuf")
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !29, line: 89, baseType: !32, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !29, line: 90, baseType: !16, size: 32, align: 32, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !29, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!87 = !{!88, !98, !110}
!88 = !DISubprogram(name: "pov_stricmp", linkageName: "_ZN8pov_base11pov_stricmpEPKcS1_", scope: !89, file: !1, line: 71, type: !91, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @_ZN8pov_base11pov_stricmpEPKcS1_, variables: !93)
!89 = !DINamespace(name: "pov_base", scope: null, file: !90, line: 37)
!90 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/stringutilities.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DISubroutineType(types: !92)
!92 = !{!16, !65, !65}
!93 = !{!94, !95, !96, !97}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s1", arg: 1, scope: !88, file: !1, line: 71, type: !65)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s2", arg: 2, scope: !88, file: !1, line: 71, type: !65)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !88, file: !1, line: 73, type: !51)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !88, file: !1, line: 73, type: !51)
!98 = !DISubprogram(name: "pov_tsprintf", linkageName: "_ZN8pov_base12pov_tsprintfEPKcz", scope: !89, file: !1, line: 127, type: !99, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, ...)* @_ZN8pov_base12pov_tsprintfEPKcz, variables: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{!65, !65, null}
!101 = !{!102, !103}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !98, file: !1, line: 127, type: !65)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "marker", scope: !98, file: !1, line: 129, type: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !105, line: 31, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/_types/_va_list.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !60, line: 98, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 192, align: 64, elements: !77)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, baseType: !"_ZTS13__va_list_tag")
!110 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !111, file: !111, line: 298, type: !112, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, variables: !114)
!111 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!112 = !DISubroutineType(types: !113)
!113 = !{!16, !16}
!114 = !{!115}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !110, file: !111, line: 298, type: !16)
!116 = !{!117}
!117 = !DIGlobalVariable(name: "pov_tsprintf_buffer", scope: !98, file: !1, line: 131, type: !118, isLocal: true, isDefinition: true, variable: [1024 x i8]* @_ZZN8pov_base12pov_tsprintfEPKczE19pov_tsprintf_buffer)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8192, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1024)
