; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/super.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!63 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55)
!64 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56)
!65 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57)
!66 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58)
!67 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59)
!68 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60)
!69 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61)
!70 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62)
!71 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63)
!72 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64)
!73 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65)
!74 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66)
!75 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67)
!76 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68)
!77 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69)
!78 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70)
!79 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71)
!80 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72)
!81 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73)
!82 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74)
!83 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75)
!84 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76)
!85 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77)
!86 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78)
!87 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79)
!88 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80)
!89 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81)
!90 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82)
!91 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83)
!92 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84)
!93 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85)
!94 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86)
!95 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87)
!96 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88)
!97 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89)
!98 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!99 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!100 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!101 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!102 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!103 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!104 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!105 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!106 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!107 = !DIEnumerator(name: "Media_Samples", value: 99)
!108 = !DIEnumerator(name: "Media_Intervals", value: 100)
!109 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!110 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!111 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!112 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!113 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!114 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!115 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!116 = !DIEnumerator(name: "nChecked", value: 108)
!117 = !DIEnumerator(name: "nEnqueued", value: 109)
!118 = !DIEnumerator(name: "totalQueues", value: 110)
!119 = !DIEnumerator(name: "totalQueueResets", value: 111)
!120 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!121 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!122 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!123 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!124 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!125 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 692, size: 32, align: 32, elements: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !{!138, !139, !140, !141}
!138 = !DIEnumerator(name: "X", value: 0)
!139 = !DIEnumerator(name: "Y", value: 1)
!140 = !DIEnumerator(name: "Z", value: 2)
!141 = !DIEnumerator(name: "T", value: 3)
!142 = !{!143, !149, !154, !159, !197, !250, !266, !298, !303, !316, !327, !333, !348, !362, !384, !390, !400, !408, !431, !438, !450, !456, !462, !466, !470, !475, !486, !496, !505, !509, !524, !542, !546, !550, !555, !565, !575, !584, !588, !606, !610, !614, !619, !629, !639, !648, !652, !670, !674, !678, !683, !693, !703, !712, !716, !743, !758, !786, !841, !848, !856, !867, !874, !880, !890, !898, !919, !3, !167, !228, !213, !147, !194, !846}
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 82, size: 64, align: 32, elements: !145, identifier: "_ZTS5div_t")
!144 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !144, line: 83, baseType: !147, size: 32, align: 32)
!147 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !144, line: 84, baseType: !147, size: 32, align: 32, offset: 32)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 87, size: 128, align: 64, elements: !150, identifier: "_ZTS6ldiv_t")
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !144, line: 88, baseType: !152, size: 64, align: 64)
!152 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !144, line: 89, baseType: !152, size: 64, align: 64, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 93, size: 128, align: 64, elements: !155, identifier: "_ZTS7lldiv_t")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !144, line: 94, baseType: !157, size: 64, align: 64)
!157 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !144, line: 95, baseType: !157, size: 64, align: 64, offset: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Superellipsoid_Struct", scope: !5, file: !160, line: 51, size: 1152, align: 64, elements: !161, identifier: "_ZTSN3pov21Superellipsoid_StructE")
!160 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/super.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !{!162, !165, !166, !169, !172, !173, !176, !177, !178, !181, !183, !186, !187, !189, !191}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !136, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !147, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !136, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !136, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !170, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !136, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !167, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !167, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !179, size: 64, align: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !136, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !182, size: 192, align: 32, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !136, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !184, size: 64, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !136, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !184, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !188, size: 32, align: 32, offset: 896)
!188 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 53, baseType: !190, size: 32, align: 32, offset: 928)
!190 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Power", scope: !"_ZTSN3pov21Superellipsoid_StructE", file: !160, line: 54, baseType: !192, size: 192, align: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !136, line: 677, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 192, align: 64, elements: !195)
!194 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!195 = !{!196}
!196 = !DISubrange(count: 3)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !136, line: 1503, size: 704, align: 64, elements: !198, identifier: "_ZTSN3pov13Method_StructE")
!198 = !{!199, !208, !214, !221, !223, !229, !234, !236, !238, !243, !248}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1505, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !136, line: 1420, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!147, !167, !204, !206}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !136, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !136, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1506, baseType: !209, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !136, line: 1421, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!147, !213, !167}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1507, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !136, line: 1422, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !213, !167, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !136, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!221 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1508, baseType: !222, size: 64, align: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !136, line: 1423, baseType: !216)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1509, baseType: !224, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !136, line: 1424, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !167}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1510, baseType: !230, size: 64, align: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !136, line: 1425, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !167, !213, !184}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1511, baseType: !235, size: 64, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !136, line: 1426, baseType: !231)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1512, baseType: !237, size: 64, align: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !136, line: 1427, baseType: !231)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1513, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !136, line: 1428, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !167, !184}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1514, baseType: !244, size: 64, align: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !136, line: 1429, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !167}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1515, baseType: !249, size: 64, align: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !136, line: 1430, baseType: !245)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !136, line: 1521, size: 960, align: 64, elements: !251, identifier: "_ZTSN3pov13Object_StructE")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !163, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !147, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !167, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !170, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !170, size: 64, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !174, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !167, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !167, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !179, size: 64, align: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !182, size: 192, align: 32, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !184, size: 64, align: 64, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !184, size: 64, align: 64, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !188, size: 32, align: 32, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !190, size: 32, align: 32, offset: 928)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !136, line: 1345, size: 1664, align: 64, elements: !267, identifier: "_ZTSN3pov14Texture_StructE")
!267 = !{!268, !270, !271, !272, !273, !274, !275, !276, !279, !282, !285, !286, !287, !290, !293, !296, !297}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !269, size: 16, align: 16)
!269 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !269, size: 16, align: 16, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !269, size: 16, align: 16, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !147, size: 32, align: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !277, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !136, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !280, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !136, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !283, size: 64, align: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !136, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !170, size: 64, align: 64, offset: 1280)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1348, baseType: !288, size: 64, align: 64, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !136, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1349, baseType: !291, size: 64, align: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !136, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1350, baseType: !294, size: 64, align: 64, offset: 1472)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !136, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1351, baseType: !170, size: 64, align: 64, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1352, baseType: !147, size: 32, align: 32, offset: 1600)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !136, line: 1373, size: 192, align: 64, elements: !299, identifier: "_ZTSN3pov12Warps_StructE")
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !269, size: 16, align: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !277, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !277, size: 64, align: 64, offset: 128)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !136, line: 1323, size: 1280, align: 64, elements: !304, identifier: "_ZTSN3pov14Pattern_StructE")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !269, size: 16, align: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !269, size: 16, align: 16, offset: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !269, size: 16, align: 16, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !147, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !277, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !280, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !283, size: 64, align: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !136, line: 1045, size: 128, align: 64, elements: !317, identifier: "_ZTSN3pov16Blend_Map_StructE")
!317 = !{!318, !319, !321, !323, !324}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1047, baseType: !147, size: 32, align: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1048, baseType: !320, size: 16, align: 16, offset: 32)
!320 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !322, size: 8, align: 8, offset: 48)
!322 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !322, size: 8, align: 8, offset: 56)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1050, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !136, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !136, line: 1031, size: 256, align: 64, elements: !328, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!328 = !{!329, !330, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1033, baseType: !188, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1034, baseType: !331, size: 8, align: 8, offset: 32)
!331 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!333 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1035, size: 192, align: 64, elements: !334, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!334 = !{!335, !340, !341, !342, !343}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1037, baseType: !336, size: 160, align: 32)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !136, line: 681, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 160, align: 32, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 5)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1038, baseType: !288, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1039, baseType: !291, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1040, baseType: !170, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1041, baseType: !344, size: 128, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !136, line: 676, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 128, align: 64, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 2)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !136, line: 1328, size: 1472, align: 64, elements: !349, identifier: "_ZTSN3pov14Pigment_StructE")
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !269, size: 16, align: 16)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !269, size: 16, align: 16, offset: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !269, size: 16, align: 16, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !147, size: 32, align: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !277, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !280, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !283, size: 64, align: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1331, baseType: !336, size: 160, align: 32, offset: 1280)
!362 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, size: 896, align: 64, elements: !363, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!363 = !{!364, !367, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !136, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !136, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !288, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !167, size: 64, align: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !136, line: 1269, size: 128, align: 64, elements: !385, identifier: "_ZTSN3pov19Density_file_StructE")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1271, baseType: !147, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1272, baseType: !388, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !136, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !136, line: 1275, size: 320, align: 64, elements: !391, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!391 = !{!392, !393, !395, !396, !397, !398, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1277, baseType: !147, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1278, baseType: !394, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !147, size: 32, align: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !147, size: 32, align: 32, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !147, size: 32, align: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1280, baseType: !147, size: 32, align: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!400 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, size: 64, align: 64, elements: !401, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!401 = !{!402, !404, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1283, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1284, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1285, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !136, line: 1220, size: 960, align: 64, elements: !409, identifier: "_ZTSN3pov12Image_StructE")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !429, !430}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1222, baseType: !147, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1223, baseType: !147, size: 32, align: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1224, baseType: !147, size: 32, align: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1225, baseType: !147, size: 32, align: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1226, baseType: !147, size: 32, align: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !147, size: 32, align: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !147, size: 32, align: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1228, baseType: !320, size: 16, align: 16, offset: 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1229, baseType: !322, size: 8, align: 8, offset: 240)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1230, baseType: !322, size: 8, align: 8, offset: 248)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1231, baseType: !192, size: 192, align: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !188, size: 32, align: 32, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !188, size: 32, align: 32, offset: 480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1233, baseType: !344, size: 128, align: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !194, size: 64, align: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !194, size: 64, align: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1235, baseType: !427, size: 64, align: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !136, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1236, baseType: !228, size: 64, align: 64, offset: 832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !136, line: 1161, size: 80, align: 16, elements: !432, identifier: "_ZTSN3pov19Image_Colour_StructE")
!432 = !{!433, !434, !435, !436, !437}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !269, size: 16, align: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !269, size: 16, align: 16, offset: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !269, size: 16, align: 16, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !269, size: 16, align: 16, offset: 48)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !269, size: 16, align: 16, offset: 64)
!438 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1237, size: 64, align: 64, elements: !439, identifier: "_ZTSN3pov12Image_StructUt_E")
!439 = !{!440, !443, !446, !448}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1239, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !136, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1240, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !136, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1241, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1242, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !136, line: 1166, size: 256, align: 64, elements: !451, identifier: "_ZTSN3pov18Image8_Line_StructE")
!451 = !{!452, !453, !454, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !403, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !403, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !403, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !403, size: 64, align: 64, offset: 192)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !136, line: 1171, size: 256, align: 64, elements: !457, identifier: "_ZTSN3pov19Image16_Line_StructE")
!457 = !{!458, !459, !460, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !405, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !405, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !405, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !405, size: 64, align: 64, offset: 192)
!462 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 256, align: 64, elements: !463, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 64, align: 32, elements: !467, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !188, size: 32, align: 32, offset: 32)
!470 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 320, align: 64, elements: !471, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 128)
!475 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 896, align: 64, elements: !476, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!476 = !{!477, !478, !479, !480, !481, !482, !484, !485}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !483, size: 64, align: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !147, size: 32, align: 32, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 704)
!486 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 832, align: 64, elements: !487, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !192, size: 192, align: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16, offset: 400)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !344, size: 128, align: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !344, size: 128, align: 64, offset: 704)
!496 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 384, align: 64, elements: !497, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!497 = !{!498, !499, !500, !501, !502, !503, !504}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !344, size: 128, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16, offset: 144)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !320, size: 16, align: 16, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !194, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !147, size: 32, align: 32, offset: 320)
!505 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 128, align: 64, elements: !506, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !136, line: 1330, baseType: !228, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !136, line: 1330, baseType: !228, size: 64, align: 64, offset: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !136, line: 1334, size: 1344, align: 64, elements: !510, identifier: "_ZTSN3pov14Tnormal_StructE")
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !269, size: 16, align: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !269, size: 16, align: 16, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !269, size: 16, align: 16, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !147, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !277, size: 64, align: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !280, size: 64, align: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !283, size: 64, align: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1337, baseType: !188, size: 32, align: 32, offset: 1280)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1338, baseType: !188, size: 32, align: 32, offset: 1312)
!524 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, size: 896, align: 64, elements: !525, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !365, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !368, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !288, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !167, size: 64, align: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 256, align: 64, elements: !543, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 64, align: 32, elements: !547, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !188, size: 32, align: 32, offset: 32)
!550 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 320, align: 64, elements: !551, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 128)
!555 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 896, align: 64, elements: !556, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !483, size: 64, align: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !147, size: 32, align: 32, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 704)
!565 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 832, align: 64, elements: !566, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !192, size: 192, align: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16, offset: 400)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !344, size: 128, align: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !344, size: 128, align: 64, offset: 704)
!575 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 384, align: 64, elements: !576, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!576 = !{!577, !578, !579, !580, !581, !582, !583}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !344, size: 128, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16, offset: 144)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !320, size: 16, align: 16, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !194, size: 64, align: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !147, size: 32, align: 32, offset: 320)
!584 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 128, align: 64, elements: !585, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !228, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !228, size: 64, align: 64, offset: 64)
!588 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, size: 896, align: 64, elements: !589, identifier: "_ZTSN3pov14Pattern_StructUt_E")
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !365, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !368, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut_E", size: 256, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", size: 64, align: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", size: 320, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", size: 896, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", size: 832, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", size: 384, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", size: 128, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !288, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, baseType: !167, size: 64, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 256, align: 64, elements: !607, identifier: "_ZTSN3pov14Pattern_StructUt_Ut_E")
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 64, align: 32, elements: !611, identifier: "_ZTSN3pov14Pattern_StructUt_Ut0_E")
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pattern_StructUt_Ut0_E", file: !136, line: 1325, baseType: !188, size: 32, align: 32, offset: 32)
!614 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 320, align: 64, elements: !615, identifier: "_ZTSN3pov14Pattern_StructUt_Ut1_E")
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut1_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 128)
!619 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 896, align: 64, elements: !620, identifier: "_ZTSN3pov14Pattern_StructUt_Ut2_E")
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !483, size: 64, align: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !147, size: 32, align: 32, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pattern_StructUt_Ut2_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 704)
!629 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 832, align: 64, elements: !630, identifier: "_ZTSN3pov14Pattern_StructUt_Ut3_E")
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !192, size: 192, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16, offset: 400)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !344, size: 128, align: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pattern_StructUt_Ut3_E", file: !136, line: 1325, baseType: !344, size: 128, align: 64, offset: 704)
!639 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 384, align: 64, elements: !640, identifier: "_ZTSN3pov14Pattern_StructUt_Ut4_E")
!640 = !{!641, !642, !643, !644, !645, !646, !647}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !344, size: 128, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16, offset: 144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !320, size: 16, align: 16, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !194, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructUt_Ut4_E", file: !136, line: 1325, baseType: !147, size: 32, align: 32, offset: 320)
!648 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pattern_StructUt_E", file: !136, line: 1325, size: 128, align: 64, elements: !649, identifier: "_ZTSN3pov14Pattern_StructUt_Ut5_E")
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !136, line: 1325, baseType: !228, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pattern_StructUt_Ut5_E", file: !136, line: 1325, baseType: !228, size: 64, align: 64, offset: 64)
!652 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, size: 896, align: 64, elements: !653, identifier: "_ZTSN3pov14Texture_StructUt_E")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !365, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !368, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !288, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !167, size: 64, align: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 256, align: 64, elements: !671, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 64, align: 32, elements: !675, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !188, size: 32, align: 32, offset: 32)
!678 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 320, align: 64, elements: !679, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!679 = !{!680, !681, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 128)
!683 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 896, align: 64, elements: !684, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !483, size: 64, align: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !147, size: 32, align: 32, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 704)
!693 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 832, align: 64, elements: !694, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !192, size: 192, align: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16, offset: 400)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !344, size: 128, align: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !344, size: 128, align: 64, offset: 704)
!703 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 384, align: 64, elements: !704, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!704 = !{!705, !706, !707, !708, !709, !710, !711}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !344, size: 128, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16, offset: 144)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !320, size: 16, align: 16, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !194, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !147, size: 32, align: 32, offset: 320)
!712 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 128, align: 64, elements: !713, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !228, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !228, size: 64, align: 64, offset: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !136, line: 1356, size: 928, align: 32, elements: !717, identifier: "_ZTSN3pov13Finish_StructE")
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !737, !738, !739, !740, !741, !742}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !188, size: 32, align: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !188, size: 32, align: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !188, size: 32, align: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !188, size: 32, align: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !188, size: 32, align: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !188, size: 32, align: 32, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !188, size: 32, align: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !188, size: 32, align: 32, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !188, size: 32, align: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 352)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !188, size: 32, align: 32, offset: 416)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !188, size: 32, align: 32, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !188, size: 32, align: 32, offset: 480)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !735, size: 96, align: 32, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !136, line: 682, baseType: !736)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, align: 32, elements: !195)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !735, size: 96, align: 32, offset: 608)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !735, size: 96, align: 32, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1365, baseType: !188, size: 32, align: 32, offset: 800)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1366, baseType: !147, size: 32, align: 32, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1367, baseType: !188, size: 32, align: 32, offset: 864)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1368, baseType: !147, size: 32, align: 32, offset: 896)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !136, line: 1112, size: 512, align: 64, elements: !744, identifier: "_ZTSN3pov15Interior_StructE")
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1114, baseType: !147, size: 32, align: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !147, size: 32, align: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !147, size: 32, align: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !188, size: 32, align: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !188, size: 32, align: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !188, size: 32, align: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !188, size: 32, align: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !188, size: 32, align: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !188, size: 32, align: 32, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1119, baseType: !336, size: 160, align: 32, offset: 288)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1120, baseType: !756, size: 64, align: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !136, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !136, line: 1069, size: 1728, align: 64, elements: !759, identifier: "_ZTSN3pov12Media_StructE")
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1071, baseType: !147, size: 32, align: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1072, baseType: !147, size: 32, align: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1073, baseType: !147, size: 32, align: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1074, baseType: !147, size: 32, align: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1075, baseType: !147, size: 32, align: 32, offset: 128)
