; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/targa.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%"class.pov::Targa_Image" = type { %"class.pov::Image_File_Class.base", i8*, i32, i32, i32, i32, %"class.pov_base::IStream"*, %"class.pov_base::OStream"* }
%"class.pov::Image_File_Class.base" = type <{ i32 (...)**, i8 }>
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !61, subprograms: !451, globals: !594, imports: !595)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/targa.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !29, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 51, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !4, line: 37)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "POV_File_Unknown", value: 0)
!8 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1)
!9 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2)
!10 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3)
!11 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4)
!12 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5)
!13 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6)
!14 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7)
!15 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8)
!16 = !DIEnumerator(name: "POV_File_Image_System", value: 9)
!17 = !DIEnumerator(name: "POV_File_Text_POV", value: 10)
!18 = !DIEnumerator(name: "POV_File_Text_INC", value: 11)
!19 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11)
!20 = !DIEnumerator(name: "POV_File_Text_INI", value: 12)
!21 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13)
!22 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14)
!23 = !DIEnumerator(name: "POV_File_Text_User", value: 15)
!24 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16)
!25 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17)
!26 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18)
!27 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19)
!28 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !31, file: !30, line: 54, size: 32, align: 32, elements: !33)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DINamespace(name: "pov", scope: null, file: !32, line: 36)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!34 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1)
!35 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2)
!36 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3)
!37 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4)
!38 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5)
!39 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6)
!40 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7)
!41 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8)
!42 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9)
!43 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10)
!44 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11)
!45 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12)
!46 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13)
!47 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14)
!48 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15)
!49 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16)
!50 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17)
!51 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18)
!52 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !31, file: !54, line: 701, size: 32, align: 32, elements: !55)
!54 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIEnumerator(name: "pRED", value: 0)
!57 = !DIEnumerator(name: "pGREEN", value: 1)
!58 = !DIEnumerator(name: "pBLUE", value: 2)
!59 = !DIEnumerator(name: "pFILTER", value: 3)
!60 = !DIEnumerator(name: "pTRANSM", value: 4)
!61 = !{!62, !68, !73, !78, !121, !149, !223, !281, !328, !332, !333, !83, !66, !384, !120, !390, !419, !426, !439, !445, !415, !178, !438, !429, !284}
!62 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 82, size: 64, align: 32, elements: !64, identifier: "_ZTS5div_t")
!63 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !63, line: 83, baseType: !66, size: 32, align: 32)
!66 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !63, line: 84, baseType: !66, size: 32, align: 32, offset: 32)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 87, size: 128, align: 64, elements: !69, identifier: "_ZTS6ldiv_t")
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !63, line: 88, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !63, line: 89, baseType: !71, size: 64, align: 64, offset: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 93, size: 128, align: 64, elements: !74, identifier: "_ZTS7lldiv_t")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !63, line: 94, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !63, line: 95, baseType: !76, size: 64, align: 64, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "Targa_Image", scope: !31, file: !79, line: 48, size: 448, align: 64, elements: !80, vtableHolder: !"_ZTSN3pov16Image_File_ClassE", identifier: "_ZTSN3pov11Targa_ImageE")
!79 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/targa.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !{!81, !82, !85, !86, !87, !88, !89, !91, !93, !97, !100, !109, !112, !115, !116, !117}
!81 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN3pov11Targa_ImageE", baseType: !"_ZTSN3pov16Image_File_ClassE", flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 61, baseType: !83, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 62, baseType: !66, size: 32, align: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 63, baseType: !66, size: 32, align: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 63, baseType: !66, size: 32, align: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 64, baseType: !66, size: 32, align: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 65, baseType: !90, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out_file", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 66, baseType: !92, size: 64, align: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!93 = !DISubprogram(name: "Targa_Image", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 51, type: !94, isLocal: false, isDefinition: false, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96, !83, !66, !66, !66, !66}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov11Targa_ImageE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~Targa_Image", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 52, type: !98, isLocal: false, isDefinition: false, scopeLine: 52, containingType: !"_ZTSN3pov11Targa_ImageE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !96}
!100 = !DISubprogram(name: "Write_Line", linkageName: "_ZN3pov11Targa_Image10Write_LineEPA5_f", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 54, type: !101, isLocal: false, isDefinition: false, scopeLine: 54, containingType: !"_ZTSN3pov11Targa_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !96, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !31, file: !54, line: 681, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, align: 32, elements: !107)
!106 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!107 = !{!108}
!108 = !DISubrange(count: 5)
!109 = !DISubprogram(name: "Read_Line", linkageName: "_ZN3pov11Targa_Image9Read_LineEPA5_f", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 55, type: !110, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN3pov11Targa_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!110 = !DISubroutineType(types: !111)
!111 = !{!66, !96, !103}
!112 = !DISubprogram(name: "Line", linkageName: "_ZN3pov11Targa_Image4LineEv", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 57, type: !113, isLocal: false, isDefinition: false, scopeLine: 57, containingType: !"_ZTSN3pov11Targa_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!113 = !DISubroutineType(types: !114)
!114 = !{!66, !96}
!115 = !DISubprogram(name: "Width", linkageName: "_ZN3pov11Targa_Image5WidthEv", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 58, type: !113, isLocal: false, isDefinition: false, scopeLine: 58, containingType: !"_ZTSN3pov11Targa_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!116 = !DISubprogram(name: "Height", linkageName: "_ZN3pov11Targa_Image6HeightEv", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 59, type: !113, isLocal: false, isDefinition: false, scopeLine: 59, containingType: !"_ZTSN3pov11Targa_ImageE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!117 = !DISubprogram(name: "Write_Pixel", linkageName: "_ZN3pov11Targa_Image11Write_PixelEdddd", scope: !"_ZTSN3pov11Targa_ImageE", file: !79, line: 68, type: !118, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !96, !120, !120, !120, !120}
!120 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "Image_File_Class", scope: !31, file: !54, line: 1878, size: 128, align: 64, elements: !122, vtableHolder: !"_ZTSN3pov16Image_File_ClassE", identifier: "_ZTSN3pov16Image_File_ClassE")
!122 = !{!123, !128, !130, !134, !135, !138, !141, !144, !145, !146}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Image_File_Class", scope: !54, file: !54, baseType: !124, size: 64, flags: DIFlagArtificial)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!66}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1893, baseType: !129, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!129 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!130 = !DISubprogram(name: "Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1881, type: !131, isLocal: false, isDefinition: false, scopeLine: 1881, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov16Image_File_ClassE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!134 = !DISubprogram(name: "~Image_File_Class", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1882, type: !131, isLocal: false, isDefinition: false, scopeLine: 1882, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!135 = !DISubprogram(name: "Write_Line", linkageName: "_ZN3pov16Image_File_Class10Write_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1884, type: !136, isLocal: false, isDefinition: false, scopeLine: 1884, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !133, !103}
!138 = !DISubprogram(name: "Read_Line", linkageName: "_ZN3pov16Image_File_Class9Read_LineEPA5_f", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1885, type: !139, isLocal: false, isDefinition: false, scopeLine: 1885, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!139 = !DISubroutineType(types: !140)
!140 = !{!66, !133, !103}
!141 = !DISubprogram(name: "Line", linkageName: "_ZN3pov16Image_File_Class4LineEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1887, type: !142, isLocal: false, isDefinition: false, scopeLine: 1887, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = !DISubroutineType(types: !143)
!143 = !{!66, !133}
!144 = !DISubprogram(name: "Width", linkageName: "_ZN3pov16Image_File_Class5WidthEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1888, type: !142, isLocal: false, isDefinition: false, scopeLine: 1888, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!145 = !DISubprogram(name: "Height", linkageName: "_ZN3pov16Image_File_Class6HeightEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1889, type: !142, isLocal: false, isDefinition: false, scopeLine: 1889, containingType: !"_ZTSN3pov16Image_File_ClassE", virtuality: DW_VIRTUALITY_pure_virtual, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubprogram(name: "Valid", linkageName: "_ZN3pov16Image_File_Class5ValidEv", scope: !"_ZTSN3pov16Image_File_ClassE", file: !54, line: 1891, type: !147, isLocal: false, isDefinition: false, scopeLine: 1891, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubroutineType(types: !148)
!148 = !{!129, !133}
!149 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !4, line: 118, size: 320, align: 64, elements: !150, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!150 = !{!151, !152, !158, !161, !164, !165, !166, !169, !174, !179, !184, !189, !193, !197, !201, !206, !207, !208, !209, !210, !211, !212, !213, !214, !217, !220}
!151 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!152 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 121, type: !153, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !156}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!158 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 122, type: !159, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !155}
!161 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 124, type: !162, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!162 = !DISubroutineType(types: !163)
!163 = !{!66, !155}
!164 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 125, type: !162, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!165 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 126, type: !162, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!166 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 127, type: !167, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubroutineType(types: !168)
!168 = !{!71, !155}
!169 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 128, type: !170, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !155, !173}
!172 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!173 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !84)
!174 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 129, type: !175, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!175 = !DISubroutineType(types: !176)
!176 = !{!172, !155, !177}
!177 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !178)
!178 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!179 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 130, type: !180, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!180 = !DISubroutineType(types: !181)
!181 = !{!172, !155, !182}
!182 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !183)
!183 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!184 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 131, type: !185, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!185 = !DISubroutineType(types: !186)
!186 = !{!172, !155, !187}
!187 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !188)
!188 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!189 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 132, type: !190, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{!172, !155, !192}
!192 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !66)
!193 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 133, type: !194, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{!172, !155, !196}
!196 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !157)
!197 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 134, type: !198, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{!172, !155, !200}
!200 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !71)
!201 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 135, type: !202, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{!172, !155, !204}
!204 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !205)
!205 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!206 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 137, type: !198, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 138, type: !190, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!208 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 139, type: !180, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!209 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 140, type: !170, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!210 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 141, type: !202, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!211 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 142, type: !194, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 143, type: !185, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!213 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 144, type: !175, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!214 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 145, type: !215, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!215 = !DISubroutineType(types: !216)
!216 = !{!172, !155, !66}
!217 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 146, type: !218, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{!172, !155, !83, !205}
!220 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !4, line: 147, type: !221, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!172, !155, !205}
!223 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !4, line: 84, size: 320, align: 64, elements: !224, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!224 = !{!225, !226, !227, !231, !232, !233, !234, !238, !241, !246, !249, !254, !255, !258, !261, !262, !263, !266, !269, !272, !277, !280}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !4, file: !4, baseType: !124, size: 64, flags: DIFlagArtificial)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 110, baseType: !129, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 111, baseType: !228, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !230, line: 153, baseType: !"_ZTS7__sFILE")
!230 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!231 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 113, baseType: !157, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 114, baseType: !157, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 115, baseType: !83, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!234 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 87, type: !235, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !157, !157}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!238 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 88, type: !239, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !237}
!241 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 94, type: !242, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!129, !237, !244, !157}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!246 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 95, type: !247, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!247 = !DISubroutineType(types: !248)
!248 = !{!129, !237}
!249 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 96, type: !250, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !237, !253, !205}
!252 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!254 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 97, type: !250, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 98, type: !256, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!256 = !DISubroutineType(types: !257)
!257 = !{!252, !237, !205, !157}
!258 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 100, type: !259, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{!157, !237}
!261 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 101, type: !259, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 102, type: !247, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!263 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 103, type: !264, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{!205, !237}
!266 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 104, type: !267, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{!252, !237}
!269 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 105, type: !270, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{!244, !237}
!272 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 107, type: !273, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubroutineType(types: !274)
!274 = !{!253, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!277 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 108, type: !278, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!129, !275}
!280 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !4, line: 112, type: !267, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !230, line: 122, size: 1216, align: 64, elements: !282, identifier: "_ZTS7__sFILE")
!282 = !{!283, !285, !286, !287, !288, !289, !290, !291, !292, !296, !300, !309, !313, !314, !316, !317, !321, !325, !326, !327}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !230, line: 123, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !230, line: 124, baseType: !66, size: 32, align: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !230, line: 125, baseType: !66, size: 32, align: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !230, line: 126, baseType: !183, size: 16, align: 16, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !230, line: 127, baseType: !183, size: 16, align: 16, offset: 144)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !230, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !230, line: 129, baseType: !66, size: 32, align: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !230, line: 132, baseType: !253, size: 64, align: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !230, line: 133, baseType: !293, size: 64, align: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!66, !253}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !230, line: 134, baseType: !297, size: 64, align: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!66, !253, !83, !66}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !230, line: 135, baseType: !301, size: 64, align: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !253, !304, !66}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !230, line: 77, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !306, line: 71, baseType: !307)
!306 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !308, line: 46, baseType: !76)
!308 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !230, line: 136, baseType: !310, size: 64, align: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!66, !253, !244, !66}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !230, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !230, line: 140, baseType: !315, size: 64, align: 64, offset: 832)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !230, line: 141, baseType: !66, size: 32, align: 32, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !230, line: 144, baseType: !318, size: 24, align: 8, offset: 928)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 24, align: 8, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 3)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !230, line: 145, baseType: !322, size: 8, align: 8, offset: 952)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 8, align: 8, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 1)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !230, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !230, line: 151, baseType: !66, size: 32, align: 32, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !230, line: 152, baseType: !304, size: 64, align: 64, offset: 1152)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !230, line: 88, size: 128, align: 64, elements: !329, identifier: "_ZTS6__sbuf")
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !230, line: 89, baseType: !284, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !230, line: 90, baseType: !66, size: 32, align: 32, offset: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !230, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!333 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !4, line: 150, size: 320, align: 64, elements: !334, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!334 = !{!335, !336, !340, !343, !346, !350, !353, !356, !359, !362, !365, !368, !371, !372, !375, !376, !379, !380, !383}
!335 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!336 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 153, type: !337, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !156}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!340 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 154, type: !341, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !339}
!343 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 156, type: !344, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !339, !244, null}
!346 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 158, type: !347, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !339, !178}
!349 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!350 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 159, type: !351, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!349, !339, !188}
!353 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 160, type: !354, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{!349, !339, !157}
!356 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 161, type: !357, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!349, !339, !205}
!359 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 162, type: !360, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{!349, !339}
!362 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 164, type: !363, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{!349, !339, !244}
!365 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 165, type: !366, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!366 = !DISubroutineType(types: !367)
!367 = !{!349, !339, !284}
!368 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 166, type: !369, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!349, !339, !84}
!371 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 167, type: !347, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!372 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 168, type: !373, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!349, !339, !183}
!375 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 169, type: !351, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!376 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 170, type: !377, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{!349, !339, !66}
!379 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 171, type: !354, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!380 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 172, type: !381, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!349, !339, !71}
!383 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !4, line: 173, type: !357, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix", scope: !31, file: !1, line: 74, size: 256, align: 64, elements: !385, identifier: "_ZTSN3pov3pixE")
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov3pixE", file: !1, line: 76, baseType: !120, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov3pixE", file: !1, line: 76, baseType: !120, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov3pixE", file: !1, line: 76, baseType: !120, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov3pixE", file: !1, line: 76, baseType: !120, size: 64, align: 64, offset: 192)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !31, file: !54, line: 1220, size: 960, align: 64, elements: !391, identifier: "_ZTSN3pov12Image_StructE")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !405, !406, !407, !412, !413, !414, !417, !418}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1222, baseType: !66, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1223, baseType: !66, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1224, baseType: !66, size: 32, align: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1225, baseType: !66, size: 32, align: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1226, baseType: !66, size: 32, align: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1227, baseType: !66, size: 32, align: 32, offset: 160)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1227, baseType: !66, size: 32, align: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1228, baseType: !183, size: 16, align: 16, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1229, baseType: !84, size: 8, align: 8, offset: 240)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1230, baseType: !84, size: 8, align: 8, offset: 248)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1231, baseType: !403, size: 192, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !31, file: !54, line: 677, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 192, align: 64, elements: !319)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1232, baseType: !106, size: 32, align: 32, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1232, baseType: !106, size: 32, align: 32, offset: 480)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1233, baseType: !408, size: 128, align: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !31, file: !54, line: 676, baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, align: 64, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 2)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1234, baseType: !120, size: 64, align: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1234, baseType: !120, size: 64, align: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1235, baseType: !415, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !31, file: !54, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1236, baseType: !253, size: 64, align: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !31, file: !54, line: 1161, size: 80, align: 16, elements: !420, identifier: "_ZTSN3pov19Image_Colour_StructE")
!420 = !{!421, !422, !423, !424, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !188, size: 16, align: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !188, size: 16, align: 16, offset: 16)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !188, size: 16, align: 16, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !188, size: 16, align: 16, offset: 48)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !54, line: 1163, baseType: !188, size: 16, align: 16, offset: 64)
!426 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !54, line: 1237, size: 64, align: 64, elements: !427, identifier: "_ZTSN3pov12Image_StructUt_E")
!427 = !{!428, !431, !434, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1239, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !31, file: !54, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1240, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !31, file: !54, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1241, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !54, line: 1242, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !31, file: !54, line: 1166, size: 256, align: 64, elements: !440, identifier: "_ZTSN3pov18Image8_Line_StructE")
!440 = !{!441, !442, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !284, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !284, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !284, size: 64, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !54, line: 1168, baseType: !284, size: 64, align: 64, offset: 192)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !31, file: !54, line: 1171, size: 256, align: 64, elements: !446, identifier: "_ZTSN3pov19Image16_Line_StructE")
!446 = !{!447, !448, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !436, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !436, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !436, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !54, line: 1173, baseType: !436, size: 64, align: 64, offset: 192)
!451 = !{!452, !466, !474, !477, !480, !483, !491, !504, !515, !551, !555, !558, !561, !565, !569, !572, !575, !578, !585, !588, !591}
!452 = !DISubprogram(name: "Targa_Image", linkageName: "_ZN3pov11Targa_ImageC2EPciiii", scope: !"_ZTSN3pov11Targa_ImageE", file: !1, line: 122, type: !94, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::Targa_Image"*, i8*, i32, i32, i32, i32)* @_ZN3pov11Targa_ImageC2EPciiii, declaration: !93, variables: !453)
!453 = !{!454, !456, !457, !458, !459, !460, !461}
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !452, type: !455, flags: DIFlagArtificial | DIFlagObjectPointer)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov11Targa_ImageE", size: 64, align: 64)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !452, file: !1, line: 122, type: !83)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !452, file: !1, line: 122, type: !66)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 4, scope: !452, file: !1, line: 122, type: !66)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 5, scope: !452, file: !1, line: 122, type: !66)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 6, scope: !452, file: !1, line: 122, type: !66)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tgaheader", scope: !462, file: !1, line: 124, type: !463)
!462 = distinct !DILexicalBlock(scope: !452, file: !1, line: 123, column: 1)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 144, align: 8, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 18)
!466 = !DISubprogram(name: "Targa_Image", linkageName: "_ZN3pov11Targa_ImageC1EPciiii", scope: !"_ZTSN3pov11Targa_ImageE", file: !1, line: 122, type: !94, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::Targa_Image"*, i8*, i32, i32, i32, i32)* @_ZN3pov11Targa_ImageC1EPciiii, declaration: !93, variables: !467)
!467 = !{!468, !469, !470, !471, !472, !473}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !466, type: !455, flags: DIFlagArtificial | DIFlagObjectPointer)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !466, file: !1, line: 122, type: !83)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !466, file: !1, line: 122, type: !66)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 4, scope: !466, file: !1, line: 122, type: !66)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 5, scope: !466, file: !1, line: 122, type: !66)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 6, scope: !466, file: !1, line: 122, type: !66)
!474 = !DISubprogram(name: "~Targa_Image", linkageName: "_ZN3pov11Targa_ImageD2Ev", scope: !"_ZTSN3pov11Targa_ImageE", file: !1, line: 297, type: !98, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::Targa_Image"*)* @_ZN3pov11Targa_ImageD2Ev, declaration: !97, variables: !475)
!475 = !{!476}
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !474, type: !455, flags: DIFlagArtificial | DIFlagObjectPointer)
!477 = !DISubprogram(name: "~Targa_Image", linkageName: "_ZN3pov11Targa_ImageD1Ev", scope: !"_ZTSN3pov11Targa_ImageE", file: !1, line: 297, type: !98, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::Targa_Image"*)* @_ZN3pov11Targa_ImageD1Ev, declaration: !97, variables: !478)
!478 = !{!479}
