; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%"class.pov_base::TextStreamBuffer" = type { i32 (...)**, i8*, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !32, subprograms: !183, globals: !319, imports: !320)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 44, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_err.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !6, line: 49)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!8 = !DIEnumerator(name: "kNoError", value: 0)
!9 = !DIEnumerator(name: "kNoErr", value: 0)
!10 = !DIEnumerator(name: "kParamErr", value: -1)
!11 = !DIEnumerator(name: "kMemFullErr", value: -2)
!12 = !DIEnumerator(name: "kOutOfMemoryErr", value: -2)
!13 = !DIEnumerator(name: "kInvalidDataSizeErr", value: -3)
!14 = !DIEnumerator(name: "kCannotHandleDataErr", value: -4)
!15 = !DIEnumerator(name: "kNullPointerErr", value: -5)
!16 = !DIEnumerator(name: "kChecksumErr", value: -6)
!17 = !DIEnumerator(name: "kParseErr", value: -7)
!18 = !DIEnumerator(name: "kCannotOpenFileErr", value: -8)
!19 = !DIEnumerator(name: "kInvalidDestAddrErr", value: -9)
!20 = !DIEnumerator(name: "kCannotConnectErr", value: -10)
!21 = !DIEnumerator(name: "kDisconnectedErr", value: -11)
!22 = !DIEnumerator(name: "kHostDisconnectedErr", value: -12)
!23 = !DIEnumerator(name: "kNetworkDataErr", value: -13)
!24 = !DIEnumerator(name: "kNetworkConnectionErr", value: -14)
!25 = !DIEnumerator(name: "kObjectAccessErr", value: -15)
!26 = !DIEnumerator(name: "kVersionErr", value: -16)
!27 = !DIEnumerator(name: "kFileDataErr", value: -17)
!28 = !DIEnumerator(name: "kAuthorisationErr", value: -18)
!29 = !DIEnumerator(name: "kDataTypeErr", value: -19)
!30 = !DIEnumerator(name: "kTimeoutErr", value: -20)
!31 = !DIEnumerator(name: "kInvalidContextErr", value: -21)
!32 = !{!33, !39, !44, !49, !57, !111, !115, !116, !165, !37, !55, !42, !166}
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 82, size: 64, align: 32, elements: !35, identifier: "_ZTS5div_t")
!34 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !34, line: 83, baseType: !37, size: 32, align: 32)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !34, line: 84, baseType: !37, size: 32, align: 32, offset: 32)
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 87, size: 128, align: 64, elements: !40, identifier: "_ZTS6ldiv_t")
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !34, line: 88, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !34, line: 89, baseType: !42, size: 64, align: 64, offset: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 93, size: 128, align: 64, elements: !45, identifier: "_ZTS7lldiv_t")
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !34, line: 94, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !34, line: 95, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !50, identifier: "_ZTS13__va_list_tag")
!50 = !{!51, !53, !54, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !52, size: 32, align: 32)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !52, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !55, size: 64, align: 64, offset: 128)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !58, line: 122, size: 1216, align: 64, elements: !59, identifier: "_ZTS7__sFILE")
!58 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!59 = !{!60, !63, !64, !65, !67, !68, !69, !70, !71, !75, !81, !90, !96, !97, !99, !100, !104, !108, !109, !110}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !58, line: 123, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !58, line: 124, baseType: !37, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !58, line: 125, baseType: !37, size: 32, align: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !58, line: 126, baseType: !66, size: 16, align: 16, offset: 128)
!66 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !58, line: 127, baseType: !66, size: 16, align: 16, offset: 144)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !58, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !58, line: 129, baseType: !37, size: 32, align: 32, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !58, line: 132, baseType: !55, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !58, line: 133, baseType: !72, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!37, !55}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !58, line: 134, baseType: !76, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!37, !55, !79, !37}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !58, line: 135, baseType: !82, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !55, !85, !37}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !58, line: 77, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !87, line: 71, baseType: !88)
!87 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !89, line: 46, baseType: !47)
!89 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !58, line: 136, baseType: !91, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!37, !55, !94, !37}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !58, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !58, line: 140, baseType: !98, size: 64, align: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !58, line: 141, baseType: !37, size: 32, align: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !58, line: 144, baseType: !101, size: 24, align: 8, offset: 928)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 3)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !58, line: 145, baseType: !105, size: 8, align: 8, offset: 952)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !58, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !58, line: 151, baseType: !37, size: 32, align: 32, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !58, line: 152, baseType: !85, size: 64, align: 64, offset: 1152)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !58, line: 88, size: 128, align: 64, elements: !112, identifier: "_ZTS6__sbuf")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !58, line: 89, baseType: !61, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !58, line: 90, baseType: !37, size: 32, align: 32, offset: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !58, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!116 = !DICompositeType(tag: DW_TAG_class_type, name: "TextStreamBuffer", scope: !5, file: !6, line: 51, size: 256, align: 64, elements: !117, vtableHolder: !"_ZTSN8pov_base16TextStreamBufferE", identifier: "_ZTSN8pov_base16TextStreamBufferE")
!117 = !{!118, !123, !124, !125, !126, !127, !128, !136, !139, !142, !145, !146, !149, !152, !157, !158, !161, !162, !163, !164}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$TextStreamBuffer", scope: !6, file: !6, baseType: !119, size: 64, flags: DIFlagArtificial)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!37}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 69, baseType: !79, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "boffset", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 70, baseType: !52, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 71, baseType: !52, size: 32, align: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 72, baseType: !52, size: 32, align: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "curline", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 73, baseType: !52, size: 32, align: 32, offset: 224)
!128 = !DISubprogram(name: "TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 54, type: !129, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131, !132, !52}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 30, baseType: !134)
!133 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !89, line: 92, baseType: !135)
!135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DISubprogram(name: "~TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 55, type: !137, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !131}
!139 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base16TextStreamBuffer6printfEPKcz", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 57, type: !140, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !131, !94, null}
!142 = !DISubprogram(name: "print", linkageName: "_ZN8pov_base16TextStreamBuffer5printEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 58, type: !143, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !131, !94}
!145 = !DISubprogram(name: "puts", linkageName: "_ZN8pov_base16TextStreamBuffer4putsEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 59, type: !143, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!146 = !DISubprogram(name: "putc", linkageName: "_ZN8pov_base16TextStreamBuffer4putcEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 60, type: !147, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !131, !37}
!149 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEPKcmi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 61, type: !150, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !131, !94, !135, !37}
!152 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEP7__sFILEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 62, type: !153, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !131, !155, !37}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 153, baseType: !"_ZTS7__sFILE")
!157 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base16TextStreamBuffer5flushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !6, line: 63, type: !137, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
