; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::OTextStream" = type { i32 (...)**, %"class.pov_base::OStream"*, i8* }
%"class.pov_base::OStream" = type { %"class.pov_base::IOBase" }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@_ZTVN8pov_base11ITextStreamE = unnamed_addr constant [4 x i8*] [i8* null, i8* bitcast ({ i8*, i8* }* @_ZTIN8pov_base11ITextStreamE to i8*), i8* bitcast (void (%"class.pov_base::ITextStream"*)* @_ZN8pov_base11ITextStreamD1Ev to i8*), i8* bitcast (void (%"class.pov_base::ITextStream"*)* @_ZN8pov_base11ITextStreamD0Ev to i8*)], align 8
@_ZTIi = external constant i8*

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !37, subprograms: !394, globals: !537, imports: !540)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 44, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_err.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov_base", scope: null, file: !6, line: 37)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!8 = !DIEnumerator(name: "kNoError", value: 0)
!9 = !DIEnumerator(name: "kNoErr", value: 0)
!10 = !DIEnumerator(name: "kParamErr", value: -1)
!11 = !DIEnumerator(name: "kMemFullErr", value: -2)
!12 = !DIEnumerator(name: "kOutOfMemoryErr", value: -2)
!13 = !DIEnumerator(name: "kInvalidDataSizeErr", value: -3)
!14 = !DIEnumerator(name: "kCannotHandleDataErr", value: -4)
!15 = !DIEnumerator(name: "kNullPointerErr", value: -5)
!16 = !DIEnumerator(name: "kChecksumErr", value: -6)
!17 = !DIEnumerator(name: "kParseErr", value: -7)
!18 = !DIEnumerator(name: "kCannotOpenFileErr", value: -8)
!19 = !DIEnumerator(name: "kInvalidDestAddrErr", value: -9)
!20 = !DIEnumerator(name: "kCannotConnectErr", value: -10)
!21 = !DIEnumerator(name: "kDisconnectedErr", value: -11)
!22 = !DIEnumerator(name: "kHostDisconnectedErr", value: -12)
!23 = !DIEnumerator(name: "kNetworkDataErr", value: -13)
!24 = !DIEnumerator(name: "kNetworkConnectionErr", value: -14)
!25 = !DIEnumerator(name: "kObjectAccessErr", value: -15)
!26 = !DIEnumerator(name: "kVersionErr", value: -16)
!27 = !DIEnumerator(name: "kFileDataErr", value: -17)
!28 = !DIEnumerator(name: "kAuthorisationErr", value: -18)
!29 = !DIEnumerator(name: "kDataTypeErr", value: -19)
!30 = !DIEnumerator(name: "kTimeoutErr", value: -20)
!31 = !DIEnumerator(name: "kInvalidContextErr", value: -21)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 92, size: 32, align: 32, elements: !33, identifier: "_ZTSN8pov_base6IOBaseUt1_E")
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "seek_set", value: 0)
!35 = !DIEnumerator(name: "seek_cur", value: 1)
!36 = !DIEnumerator(name: "seek_end", value: 2)
!37 = !{!38, !44, !49, !54, !62, !116, !120, !121, !174, !244, !298, !42, !32, !302, !327, !67, !60, !378}
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 82, size: 64, align: 32, elements: !40, identifier: "_ZTS5div_t")
!39 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !39, line: 83, baseType: !42, size: 32, align: 32)
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !39, line: 84, baseType: !42, size: 32, align: 32, offset: 32)
!44 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 87, size: 128, align: 64, elements: !45, identifier: "_ZTS6ldiv_t")
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !39, line: 88, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !39, line: 89, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 93, size: 128, align: 64, elements: !50, identifier: "_ZTS7lldiv_t")
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !39, line: 94, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !39, line: 95, baseType: !52, size: 64, align: 64, offset: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !55, identifier: "_ZTS13__va_list_tag")
!55 = !{!56, !58, !59, !61}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !57, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !60, size: 64, align: 64, offset: 128)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !63, line: 122, size: 1216, align: 64, elements: !64, identifier: "_ZTS7__sFILE")
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !{!65, !68, !69, !70, !72, !73, !74, !75, !76, !80, !86, !95, !101, !102, !104, !105, !109, !113, !114, !115}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !63, line: 123, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !63, line: 124, baseType: !42, size: 32, align: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !63, line: 125, baseType: !42, size: 32, align: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !63, line: 126, baseType: !71, size: 16, align: 16, offset: 128)
!71 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !63, line: 127, baseType: !71, size: 16, align: 16, offset: 144)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !63, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !63, line: 129, baseType: !42, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !63, line: 132, baseType: !60, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !63, line: 133, baseType: !77, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!42, !60}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !63, line: 134, baseType: !81, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!42, !60, !84, !42}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !63, line: 135, baseType: !87, size: 64, align: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !60, !90, !42}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !63, line: 77, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !92, line: 71, baseType: !93)
!92 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !94, line: 46, baseType: !52)
!94 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !63, line: 136, baseType: !96, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!42, !60, !99, !42}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !63, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !63, line: 140, baseType: !103, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !63, line: 141, baseType: !42, size: 32, align: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !63, line: 144, baseType: !106, size: 24, align: 8, offset: 928)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 24, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 3)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !63, line: 145, baseType: !110, size: 8, align: 8, offset: 952)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !63, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !63, line: 151, baseType: !42, size: 32, align: 32, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !63, line: 152, baseType: !90, size: 64, align: 64, offset: 1152)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !63, line: 88, size: 128, align: 64, elements: !117, identifier: "_ZTS6__sbuf")
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !63, line: 89, baseType: !66, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !63, line: 90, baseType: !42, size: 32, align: 32, offset: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !63, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !5, file: !122, line: 54, size: 4608, align: 64, elements: !123, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!122 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!123 = !{!124, !129, !131, !135, !137, !138, !139, !140, !141, !142, !143, !147, !150, !153, !156, !159, !163, !166, !169, !170, !173}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !122, file: !122, baseType: !125, size: 64, flags: DIFlagArtificial)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!42}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 78, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 79, baseType: !132, size: 4096, align: 8, offset: 128)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 4096, align: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 80, baseType: !136, size: 64, align: 64, offset: 4224)
!136 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 81, baseType: !136, size: 64, align: 64, offset: 4288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 82, baseType: !136, size: 64, align: 64, offset: 4352)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 83, baseType: !136, size: 64, align: 64, offset: 4416)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 84, baseType: !84, size: 64, align: 64, offset: 4480)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 85, baseType: !42, size: 32, align: 32, offset: 4544)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 86, baseType: !42, size: 32, align: 32, offset: 4576)
!143 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 63, type: !144, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146, !99, !57}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!147 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 64, type: !148, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !146, !99, !130}
!150 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 65, type: !151, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !146}
!153 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 67, type: !154, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{!42, !146}
!156 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 68, type: !157, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !146, !42}
!159 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 70, type: !160, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !146}
!162 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!163 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 71, type: !164, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!164 = !DISubroutineType(types: !165)
!165 = !{!162, !146, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!166 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 72, type: !167, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!167 = !DISubroutineType(types: !168)
!168 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !146}
!169 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 74, type: !154, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!170 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 76, type: !171, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!99, !146}
!173 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 88, type: !151, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!174 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !5, file: !6, line: 118, size: 320, align: 64, elements: !175, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!175 = !{!176, !177, !182, !185, !188, !189, !190, !193, !198, !202, !206, !211, !215, !219, !223, !227, !228, !229, !230, !231, !232, !233, !234, !235, !238, !241}
!176 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!177 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 121, type: !178, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !180, !181}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!182 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 122, type: !183, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !180}
!185 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 124, type: !186, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!186 = !DISubroutineType(types: !187)
!187 = !{!42, !180}
!188 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 125, type: !186, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!189 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 126, type: !186, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!190 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 127, type: !191, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!191 = !DISubroutineType(types: !192)
!192 = !{!47, !180}
!193 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 128, type: !194, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !180, !197}
!196 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!197 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !85)
!198 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 129, type: !199, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{!196, !180, !201}
!201 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !67)
!202 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 130, type: !203, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!203 = !DISubroutineType(types: !204)
!204 = !{!196, !180, !205}
!205 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !71)
!206 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 131, type: !207, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!207 = !DISubroutineType(types: !208)
!208 = !{!196, !180, !209}
!209 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !210)
!210 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!211 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 132, type: !212, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!196, !180, !214}
!214 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !42)
!215 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 133, type: !216, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!196, !180, !218}
!218 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !57)
!219 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 134, type: !220, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!220 = !DISubroutineType(types: !221)
!221 = !{!196, !180, !222}
!222 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !47)
!223 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 135, type: !224, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!224 = !DISubroutineType(types: !225)
!225 = !{!196, !180, !226}
!226 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !136)
!227 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 137, type: !220, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!228 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 138, type: !212, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!229 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 139, type: !203, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!230 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 140, type: !194, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!231 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 141, type: !224, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!232 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 142, type: !216, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!233 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 143, type: !207, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!234 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 144, type: !199, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!235 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 145, type: !236, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!236 = !DISubroutineType(types: !237)
!237 = !{!196, !180, !42}
!238 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 146, type: !239, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!239 = !DISubroutineType(types: !240)
!240 = !{!196, !180, !84, !136}
!241 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !6, line: 147, type: !242, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!196, !180, !136}
!244 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !5, file: !6, line: 84, size: 320, align: 64, elements: !245, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!245 = !{!246, !247, !248, !251, !252, !253, !254, !258, !261, !264, !267, !271, !272, !275, !278, !279, !280, !283, !286, !289, !294, !297}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !6, file: !6, baseType: !125, size: 64, flags: DIFlagArtificial)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 110, baseType: !162, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 111, baseType: !249, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 153, baseType: !"_ZTS7__sFILE")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 113, baseType: !57, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 114, baseType: !57, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 115, baseType: !84, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!254 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 87, type: !255, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !257, !57, !57}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!258 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 88, type: !259, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !257}
!261 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 94, type: !262, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!162, !257, !99, !57}
!264 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 95, type: !265, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!265 = !DISubroutineType(types: !266)
!266 = !{!162, !257}
!267 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 96, type: !268, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !257, !60, !136}
!270 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!271 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 97, type: !268, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 98, type: !273, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!273 = !DISubroutineType(types: !274)
!274 = !{!270, !257, !136, !57}
!275 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 100, type: !276, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !DISubroutineType(types: !277)
!277 = !{!57, !257}
!278 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 101, type: !276, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!279 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 102, type: !265, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!280 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 103, type: !281, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!281 = !DISubroutineType(types: !282)
!282 = !{!136, !257}
!283 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 104, type: !284, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!270, !257}
!286 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 105, type: !287, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!99, !257}
!289 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 107, type: !290, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{!60, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!294 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 108, type: !295, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!295 = !DISubroutineType(types: !296)
!296 = !{!162, !292}
!297 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !6, line: 112, type: !284, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !122, line: 57, size: 128, align: 64, elements: !299, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !122, line: 59, baseType: !136, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !122, line: 60, baseType: !42, size: 32, align: 32, offset: 64)
!302 = !DICompositeType(tag: DW_TAG_class_type, name: "OTextStream", scope: !5, file: !122, line: 91, size: 192, align: 64, elements: !303, vtableHolder: !"_ZTSN8pov_base11OTextStreamE", identifier: "_ZTSN8pov_base11OTextStreamE")
!303 = !{!304, !305, !307, !308, !312, !315, !318, !321, !324}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$OTextStream", scope: !122, file: !122, baseType: !125, size: 64, flags: DIFlagArtificial)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 103, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 104, baseType: !84, size: 64, align: 64, offset: 128)
!308 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 94, type: !309, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311, !99, !57, !162}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!312 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 95, type: !313, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !311, !99, !306}
!315 = !DISubprogram(name: "~OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 96, type: !316, isLocal: false, isDefinition: false, scopeLine: 96, containingType: !"_ZTSN8pov_base11OTextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !311}
!318 = !DISubprogram(name: "putchar", linkageName: "_ZN8pov_base11OTextStream7putcharEi", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 98, type: !319, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !311, !42}
!321 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base11OTextStream6printfEPKcz", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 99, type: !322, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !311, !99, null}
!324 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11OTextStream4nameEv", scope: !"_ZTSN8pov_base11OTextStreamE", file: !122, line: 101, type: !325, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!325 = !DISubroutineType(types: !326)
!326 = !{!99, !311}
!327 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !5, file: !6, line: 150, size: 320, align: 64, elements: !328, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!328 = !{!329, !330, !334, !337, !340, !344, !347, !350, !353, !356, !359, !362, !365, !366, !369, !370, !373, !374, !377}
!329 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!330 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 153, type: !331, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !181}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!334 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 154, type: !335, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !333}
!337 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !6, line: 156, type: !338, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !333, !99, null}
