; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/texture.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon.33 }
%union.anon.33 = type { i8* }
%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }

!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 692, size: 32, align: 32, elements: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !{!138, !139, !140, !141}
!138 = !DIEnumerator(name: "X", value: 0)
!139 = !DIEnumerator(name: "Y", value: 1)
!140 = !DIEnumerator(name: "Z", value: 2)
!141 = !DIEnumerator(name: "T", value: 3)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !143, line: 47, size: 32, align: 32, elements: !144, identifier: "_ZTSN3pov11PATTERN_IDSE")
!143 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!145 = !DIEnumerator(name: "NO_PATTERN", value: 0)
!146 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!147 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!148 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!149 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!150 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!151 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!152 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!153 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!154 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!155 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!156 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!157 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!158 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!159 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!160 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!161 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!162 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!163 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!164 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!165 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!166 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!167 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!168 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!169 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!170 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!171 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!172 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!173 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!174 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!175 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!176 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!177 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!178 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!179 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!180 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!181 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!182 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!183 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!184 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!185 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!186 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!187 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!188 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!189 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!190 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!191 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!192 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!193 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!194 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!195 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 701, size: 32, align: 32, elements: !197)
!197 = !{!198, !199, !200, !201, !202}
!198 = !DIEnumerator(name: "pRED", value: 0)
!199 = !DIEnumerator(name: "pGREEN", value: 1)
!200 = !DIEnumerator(name: "pBLUE", value: 2)
!201 = !DIEnumerator(name: "pFILTER", value: 3)
!202 = !DIEnumerator(name: "pTRANSM", value: 4)
!203 = !{!204, !210, !215, !220, !222, !221, !227, !228, !249, !254, !265, !271, !292, !306, !330, !336, !346, !355, !378, !385, !397, !403, !409, !413, !417, !422, !432, !442, !451, !455, !480, !531, !541, !556, !584, !592, !613, !621, !642, !660, !664, !668, !673, !683, !693, !702, !706, !721, !739, !743, !747, !752, !762, !772, !781, !785, !812, !867, !874, !885, !892, !898, !916, !920, !924, !929, !939, !949, !958, !3, !208, !962, !142, !243, !285, !638, !971}
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 82, size: 64, align: 32, elements: !206, identifier: "_ZTS5div_t")
!205 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !205, line: 83, baseType: !208, size: 32, align: 32)
!208 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !205, line: 84, baseType: !208, size: 32, align: 32, offset: 32)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 87, size: 128, align: 64, elements: !211, identifier: "_ZTS6ldiv_t")
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !205, line: 88, baseType: !213, size: 64, align: 64)
!213 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !205, line: 89, baseType: !213, size: 64, align: 64, offset: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 93, size: 128, align: 64, elements: !216, identifier: "_ZTS7lldiv_t")
!216 = !{!217, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !205, line: 94, baseType: !218, size: 64, align: 64)
!218 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !205, line: 95, baseType: !218, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !136, line: 677, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 192, align: 64, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 3)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !136, line: 1323, size: 1280, align: 64, elements: !229, identifier: "_ZTSN3pov14Pattern_StructE")
!229 = !{!230, !232, !233, !234, !235, !237, !238, !239, !242, !245, !248}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !231, size: 16, align: 16)
!231 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !231, size: 16, align: 16, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !231, size: 16, align: 16, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !208, size: 32, align: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !236, size: 32, align: 32, offset: 96)
!236 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !236, size: 32, align: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !236, size: 32, align: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !240, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !136, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !243, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !136, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !246, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !136, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !136, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !136, line: 1373, size: 192, align: 64, elements: !250, identifier: "_ZTSN3pov12Warps_StructE")
!250 = !{!251, !252, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !231, size: 16, align: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !240, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !136, line: 1375, baseType: !240, size: 64, align: 64, offset: 128)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !136, line: 1045, size: 128, align: 64, elements: !255, identifier: "_ZTSN3pov16Blend_Map_StructE")
!255 = !{!256, !257, !259, !261, !262}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1047, baseType: !208, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1048, baseType: !258, size: 16, align: 16, offset: 32)
!258 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !260, size: 8, align: 8, offset: 48)
!260 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1049, baseType: !260, size: 8, align: 8, offset: 56)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !136, line: 1050, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !136, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !136, line: 1031, size: 256, align: 64, elements: !266, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!266 = !{!267, !268, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1033, baseType: !236, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1034, baseType: !269, size: 8, align: 8, offset: 32)
!269 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!271 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !136, line: 1035, size: 192, align: 64, elements: !272, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!272 = !{!273, !278, !281, !284, !287}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1037, baseType: !274, size: 160, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !136, line: 681, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 160, align: 32, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 5)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1038, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !136, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1039, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !136, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1040, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !136, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !136, line: 1041, baseType: !288, size: 128, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !136, line: 676, baseType: !289)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, align: 64, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !136, line: 1328, size: 1472, align: 64, elements: !293, identifier: "_ZTSN3pov14Pigment_StructE")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !231, size: 16, align: 16)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !231, size: 16, align: 16, offset: 16)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !231, size: 16, align: 16, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !208, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !236, size: 32, align: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !236, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !236, size: 32, align: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !240, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !243, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !246, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1331, baseType: !274, size: 160, align: 32, offset: 1280)
!306 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !136, line: 1330, size: 896, align: 64, elements: !307, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!307 = !{!308, !311, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !136, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !136, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !236, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !279, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !136, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !136, line: 1269, size: 128, align: 64, elements: !331, identifier: "_ZTSN3pov19Density_file_StructE")
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1271, baseType: !208, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !136, line: 1272, baseType: !334, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !136, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !136, line: 1275, size: 320, align: 64, elements: !337, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!337 = !{!338, !339, !341, !342, !343, !344, !345}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1277, baseType: !208, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1278, baseType: !340, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !208, size: 32, align: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !208, size: 32, align: 32, offset: 160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1279, baseType: !208, size: 32, align: 32, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1280, baseType: !208, size: 32, align: 32, offset: 224)
!345 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!346 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !136, line: 1281, size: 64, align: 64, elements: !347, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!347 = !{!348, !350, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1283, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1284, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !136, line: 1285, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !136, line: 1220, size: 960, align: 64, elements: !356, identifier: "_ZTSN3pov12Image_StructE")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !376, !377}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1222, baseType: !208, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1223, baseType: !208, size: 32, align: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1224, baseType: !208, size: 32, align: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1225, baseType: !208, size: 32, align: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1226, baseType: !208, size: 32, align: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !208, size: 32, align: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1227, baseType: !208, size: 32, align: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1228, baseType: !258, size: 16, align: 16, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1229, baseType: !260, size: 8, align: 8, offset: 240)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1230, baseType: !260, size: 8, align: 8, offset: 248)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1231, baseType: !223, size: 192, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !236, size: 32, align: 32, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1232, baseType: !236, size: 32, align: 32, offset: 480)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1233, baseType: !288, size: 128, align: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !221, size: 64, align: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1234, baseType: !221, size: 64, align: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1235, baseType: !374, size: 64, align: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !136, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1236, baseType: !227, size: 64, align: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !136, line: 1161, size: 80, align: 16, elements: !379, identifier: "_ZTSN3pov19Image_Colour_StructE")
!379 = !{!380, !381, !382, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !231, size: 16, align: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !231, size: 16, align: 16, offset: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !231, size: 16, align: 16, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !231, size: 16, align: 16, offset: 48)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !136, line: 1163, baseType: !231, size: 16, align: 16, offset: 64)
!385 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !136, line: 1237, size: 64, align: 64, elements: !386, identifier: "_ZTSN3pov12Image_StructUt_E")
!386 = !{!387, !390, !393, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1239, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !136, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1240, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !136, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1241, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !136, line: 1242, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !136, line: 1166, size: 256, align: 64, elements: !398, identifier: "_ZTSN3pov18Image8_Line_StructE")
!398 = !{!399, !400, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !349, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !349, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !349, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !136, line: 1168, baseType: !349, size: 64, align: 64, offset: 192)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !136, line: 1171, size: 256, align: 64, elements: !404, identifier: "_ZTSN3pov19Image16_Line_StructE")
!404 = !{!405, !406, !407, !408}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !351, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !351, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !351, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !136, line: 1173, baseType: !351, size: 64, align: 64, offset: 192)
!409 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 256, align: 64, elements: !410, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !236, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 64, align: 32, elements: !414, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !236, size: 32, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !136, line: 1330, baseType: !236, size: 32, align: 32, offset: 32)
!417 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 320, align: 64, elements: !418, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64, offset: 128)
!422 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 896, align: 64, elements: !423, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !222, size: 64, align: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !208, size: 32, align: 32, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64, offset: 704)
!432 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 832, align: 64, elements: !433, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !223, size: 192, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16, offset: 400)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !288, size: 128, align: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !136, line: 1330, baseType: !288, size: 128, align: 64, offset: 704)
!442 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 384, align: 64, elements: !443, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!443 = !{!444, !445, !446, !447, !448, !449, !450}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !288, size: 128, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16, offset: 144)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !258, size: 16, align: 16, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !221, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !136, line: 1330, baseType: !208, size: 32, align: 32, offset: 320)
!451 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !136, line: 1330, size: 128, align: 64, elements: !452, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !136, line: 1330, baseType: !227, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !136, line: 1330, baseType: !227, size: 64, align: 64, offset: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !136, line: 1521, size: 960, align: 64, elements: !456, identifier: "_ZTSN3pov13Object_StructE")
!456 = !{!457, !460, !461, !462, !463, !464, !467, !468, !469, !472, !474, !477, !478, !479}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !136, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !208, size: 32, align: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !328, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !285, size: 64, align: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !285, size: 64, align: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !465, size: 64, align: 64, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !136, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !328, size: 64, align: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !328, size: 64, align: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !470, size: 64, align: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !136, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!472 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !473, size: 192, align: 32, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !136, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !475, size: 64, align: 64, offset: 768)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !136, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!477 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !475, size: 64, align: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !236, size: 32, align: 32, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !136, line: 1523, baseType: !354, size: 32, align: 32, offset: 928)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !136, line: 1503, size: 704, align: 64, elements: !481, identifier: "_ZTSN3pov13Method_StructE")
!481 = !{!482, !491, !496, !503, !505, !510, !515, !517, !519, !524, !529}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1505, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !136, line: 1420, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!208, !328, !487, !489}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !136, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !136, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1506, baseType: !492, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !136, line: 1421, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!208, !220, !328}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1507, baseType: !497, size: 64, align: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !136, line: 1422, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !220, !328, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !136, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1508, baseType: !504, size: 64, align: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !136, line: 1423, baseType: !498)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1509, baseType: !506, size: 64, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !136, line: 1424, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!227, !328}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1510, baseType: !511, size: 64, align: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !136, line: 1425, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !328, !220, !475}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1511, baseType: !516, size: 64, align: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !136, line: 1426, baseType: !512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1512, baseType: !518, size: 64, align: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !136, line: 1427, baseType: !512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1513, baseType: !520, size: 64, align: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !136, line: 1428, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !328, !475}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1514, baseType: !525, size: 64, align: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !136, line: 1429, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !328}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !136, line: 1515, baseType: !530, size: 64, align: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !136, line: 1430, baseType: !526)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !136, line: 1783, size: 6848, align: 64, elements: !532, identifier: "_ZTSN3pov10Ray_StructE")
!532 = !{!533, !534, !535, !536, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1785, baseType: !223, size: 192, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1786, baseType: !223, size: 192, align: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1787, baseType: !208, size: 32, align: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1788, baseType: !354, size: 32, align: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !136, line: 1789, baseType: !538, size: 6400, align: 64, offset: 448)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 6400, align: 64, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 100)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !136, line: 1112, size: 512, align: 64, elements: !542, identifier: "_ZTSN3pov15Interior_StructE")
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1114, baseType: !208, size: 32, align: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !208, size: 32, align: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1115, baseType: !208, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !236, size: 32, align: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1116, baseType: !236, size: 32, align: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !236, size: 32, align: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1117, baseType: !236, size: 32, align: 32, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !236, size: 32, align: 32, offset: 224)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1118, baseType: !236, size: 32, align: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1119, baseType: !274, size: 160, align: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !136, line: 1120, baseType: !554, size: 64, align: 64, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !136, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !136, line: 1069, size: 1728, align: 64, elements: !557, identifier: "_ZTSN3pov12Media_StructE")
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1071, baseType: !208, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1072, baseType: !208, size: 32, align: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1073, baseType: !208, size: 32, align: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1074, baseType: !208, size: 32, align: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1075, baseType: !208, size: 32, align: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1076, baseType: !221, size: 64, align: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1077, baseType: !208, size: 32, align: 32, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1078, baseType: !221, size: 64, align: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1078, baseType: !221, size: 64, align: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1079, baseType: !208, size: 32, align: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1080, baseType: !208, size: 32, align: 32, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1081, baseType: !208, size: 32, align: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1082, baseType: !208, size: 32, align: 32, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1083, baseType: !274, size: 160, align: 32, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1084, baseType: !274, size: 160, align: 32, offset: 736)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1085, baseType: !274, size: 160, align: 32, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1086, baseType: !274, size: 160, align: 32, offset: 1056)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1088, baseType: !221, size: 64, align: 64, offset: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1089, baseType: !221, size: 64, align: 64, offset: 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1090, baseType: !221, size: 64, align: 64, offset: 1344)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1091, baseType: !220, size: 64, align: 64, offset: 1408)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1093, baseType: !221, size: 64, align: 64, offset: 1472)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1094, baseType: !208, size: 32, align: 32, offset: 1536)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1095, baseType: !208, size: 32, align: 32, offset: 1568)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1097, baseType: !279, size: 64, align: 64, offset: 1600)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !136, line: 1099, baseType: !554, size: 64, align: 64, offset: 1664)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !136, line: 1621, size: 192, align: 64, elements: !585, identifier: "_ZTSN3pov13istack_structE")
!585 = !{!586, !588, !590, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1623, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1624, baseType: !589, size: 64, align: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1625, baseType: !354, size: 32, align: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !136, line: 1626, baseType: !354, size: 32, align: 32, offset: 160)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !136, line: 1596, size: 1600, align: 64, elements: !593, identifier: "_ZTSN3pov10istk_entryE")
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1598, baseType: !221, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1599, baseType: !223, size: 192, align: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1600, baseType: !223, size: 192, align: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1601, baseType: !223, size: 192, align: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1602, baseType: !288, size: 128, align: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1603, baseType: !328, size: 64, align: 64, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1610, baseType: !208, size: 32, align: 32, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1610, baseType: !208, size: 32, align: 32, offset: 864)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1611, baseType: !221, size: 64, align: 64, offset: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1611, baseType: !221, size: 64, align: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1612, baseType: !221, size: 64, align: 64, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1612, baseType: !221, size: 64, align: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1613, baseType: !221, size: 64, align: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1613, baseType: !221, size: 64, align: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1614, baseType: !221, size: 64, align: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1614, baseType: !221, size: 64, align: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1614, baseType: !221, size: 64, align: 64, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1616, baseType: !227, size: 64, align: 64, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !136, line: 1618, baseType: !227, size: 64, align: 64, offset: 1536)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !136, line: 1002, size: 2048, align: 64, elements: !614, identifier: "_ZTSN3pov16Transform_StructE")
!614 = !{!615, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !136, line: 1004, baseType: !616, size: 1024, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !136, line: 679, baseType: !617)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 1024, align: 64, elements: !618)
!618 = !{!619, !619}
!619 = !DISubrange(count: 4)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !136, line: 1005, baseType: !616, size: 1024, align: 64, offset: 1024)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !136, line: 1345, size: 1664, align: 64, elements: !622, identifier: "_ZTSN3pov14Texture_StructE")
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !640, !641}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !231, size: 16, align: 16)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !231, size: 16, align: 16, offset: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !231, size: 16, align: 16, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !208, size: 32, align: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !236, size: 32, align: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !236, size: 32, align: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !236, size: 32, align: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !240, size: 64, align: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !243, size: 64, align: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !246, size: 64, align: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, baseType: !285, size: 64, align: 64, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1348, baseType: !279, size: 64, align: 64, offset: 1344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1349, baseType: !282, size: 64, align: 64, offset: 1408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1350, baseType: !638, size: 64, align: 64, offset: 1472)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !136, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1351, baseType: !285, size: 64, align: 64, offset: 1536)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1352, baseType: !208, size: 32, align: 32, offset: 1600)
!642 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !136, line: 1347, size: 896, align: 64, elements: !643, identifier: "_ZTSN3pov14Texture_StructUt_E")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !309, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !312, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !236, size: 32, align: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !279, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, baseType: !328, size: 64, align: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 256, align: 64, elements: !661, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !236, size: 32, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 64, align: 32, elements: !665, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !236, size: 32, align: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !136, line: 1347, baseType: !236, size: 32, align: 32, offset: 32)
!668 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 320, align: 64, elements: !669, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64, offset: 128)
!673 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 896, align: 64, elements: !674, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !222, size: 64, align: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !208, size: 32, align: 32, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64, offset: 704)
!683 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 832, align: 64, elements: !684, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !223, size: 192, align: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16, offset: 400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !288, size: 128, align: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !136, line: 1347, baseType: !288, size: 128, align: 64, offset: 704)
!693 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 384, align: 64, elements: !694, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!694 = !{!695, !696, !697, !698, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !288, size: 128, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16, offset: 144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !258, size: 16, align: 16, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !221, size: 64, align: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !136, line: 1347, baseType: !208, size: 32, align: 32, offset: 320)
!702 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !136, line: 1347, size: 128, align: 64, elements: !703, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !227, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !136, line: 1347, baseType: !227, size: 64, align: 64, offset: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !136, line: 1334, size: 1344, align: 64, elements: !707, identifier: "_ZTSN3pov14Tnormal_StructE")
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !231, size: 16, align: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !231, size: 16, align: 16, offset: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !231, size: 16, align: 16, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !208, size: 32, align: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !236, size: 32, align: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !236, size: 32, align: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !236, size: 32, align: 32, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !240, size: 64, align: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !243, size: 64, align: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !246, size: 64, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1337, baseType: !236, size: 32, align: 32, offset: 1280)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1338, baseType: !236, size: 32, align: 32, offset: 1312)
!721 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !136, line: 1336, size: 896, align: 64, elements: !722, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !309, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !312, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !236, size: 32, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !279, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, baseType: !328, size: 64, align: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 256, align: 64, elements: !740, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !236, size: 32, align: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64, offset: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 64, align: 32, elements: !744, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !236, size: 32, align: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !136, line: 1336, baseType: !236, size: 32, align: 32, offset: 32)
!747 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 320, align: 64, elements: !748, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64, offset: 128)
!752 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 896, align: 64, elements: !753, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !222, size: 64, align: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !208, size: 32, align: 32, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64, offset: 704)
!762 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 832, align: 64, elements: !763, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !223, size: 192, align: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16, offset: 400)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !288, size: 128, align: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !136, line: 1336, baseType: !288, size: 128, align: 64, offset: 704)
!772 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 384, align: 64, elements: !773, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !288, size: 128, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16, offset: 144)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !258, size: 16, align: 16, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !221, size: 64, align: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !136, line: 1336, baseType: !208, size: 32, align: 32, offset: 320)
!781 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !136, line: 1336, size: 128, align: 64, elements: !782, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !227, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !136, line: 1336, baseType: !227, size: 64, align: 64, offset: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !136, line: 1356, size: 928, align: 32, elements: !786, identifier: "_ZTSN3pov13Finish_StructE")
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !806, !807, !808, !809, !810, !811}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !236, size: 32, align: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1358, baseType: !236, size: 32, align: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !236, size: 32, align: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1359, baseType: !236, size: 32, align: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !236, size: 32, align: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1360, baseType: !236, size: 32, align: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !236, size: 32, align: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !236, size: 32, align: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1361, baseType: !236, size: 32, align: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !236, size: 32, align: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !236, size: 32, align: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !236, size: 32, align: 32, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !236, size: 32, align: 32, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1362, baseType: !236, size: 32, align: 32, offset: 416)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !236, size: 32, align: 32, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1363, baseType: !236, size: 32, align: 32, offset: 480)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !804, size: 96, align: 32, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !136, line: 682, baseType: !805)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 96, align: 32, elements: !225)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !804, size: 96, align: 32, offset: 608)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1364, baseType: !804, size: 96, align: 32, offset: 704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1365, baseType: !236, size: 32, align: 32, offset: 800)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1366, baseType: !208, size: 32, align: 32, offset: 832)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1367, baseType: !236, size: 32, align: 32, offset: 864)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !136, line: 1368, baseType: !208, size: 32, align: 32, offset: 896)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !136, line: 1566, size: 3456, align: 64, elements: !813, identifier: "_ZTSN3pov19Light_Source_StructE")
!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !858, !859, !860, !861}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !458, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !208, size: 32, align: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !328, size: 64, align: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !285, size: 64, align: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !285, size: 64, align: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !465, size: 64, align: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !328, size: 64, align: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !328, size: 64, align: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !470, size: 64, align: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !473, size: 192, align: 32, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !475, size: 64, align: 64, offset: 768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !475, size: 64, align: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !236, size: 32, align: 32, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !354, size: 32, align: 32, offset: 928)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1568, baseType: !328, size: 64, align: 64, offset: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !136, line: 1569, baseType: !274, size: 160, align: 32, offset: 1024)
