; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/tokenize.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Sym_Table_Struct" = type { i8*, [257 x %"struct.pov::Sym_Table_Entry"*] }
%"struct.pov::Sym_Table_Entry" = type { %"struct.pov::Sym_Table_Entry"*, i8*, i8*, i32 }
%"struct.pov::InputFileData" = type { %"class.pov_base::ITextStream"*, i8 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct.__sFILE*, i32, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"struct.pov::Cond_Stack_Entry" = type { i32, double, %"class.pov_base::ITextStream"*, %"class.pov_base::ITextStream"*, i8*, i32, %"struct.pov::Pov_Macro_Struct"*, %"struct.pov_base::ITextStream::FilePos" }

!731 = !DIEnumerator(name: "kPOVAttrib_BoundingQueueResizes", value: 1112625786)
!732 = !DIEnumerator(name: "kPOVAttrib_PolynomTest", value: 1349414228)
!733 = !DIEnumerator(name: "kPOVAttrib_RootsEliminated", value: 1380281449)
!734 = !DIEnumerator(name: "kPOVAttrib_CallsToNoise", value: 1129598575)
!735 = !DIEnumerator(name: "kPOVAttrib_CallsToDNoise", value: 1129595982)
!736 = !DIEnumerator(name: "kPOVAttrib_MediaSamples", value: 1298486113)
!737 = !DIEnumerator(name: "kPOVAttrib_MediaIntervals", value: 1298483566)
!738 = !DIEnumerator(name: "kPOVAttrib_ReflectedRays", value: 1382444114)
!739 = !DIEnumerator(name: "kPOVAttrib_InnerReflectedRays", value: 1230136658)
!740 = !DIEnumerator(name: "kPOVAttrib_RefractedRays", value: 1382445652)
!741 = !DIEnumerator(name: "kPOVAttrib_TransmittedRays", value: 1416782162)
!742 = !DIEnumerator(name: "kPOVAttrib_IStackOverflow", value: 1230206031)
!743 = !DIEnumerator(name: "kPOVAttrib_RadGatherCount", value: 1380402036)
!744 = !DIEnumerator(name: "kPOVAttrib_RadReuseCount", value: 1381122932)
!745 = !DIEnumerator(name: "kPOVAttrib_MinAlloc", value: 1298755137)
!746 = !DIEnumerator(name: "kPOVAttrib_MaxAlloc", value: 1298233409)
!747 = !DIEnumerator(name: "kPOVAttrib_CallsToAlloc", value: 1129595244)
!748 = !DIEnumerator(name: "kPOVAttrib_CallsToFree", value: 1129596530)
!749 = !DIEnumerator(name: "kPOVAttrib_PeakMemoryUsage", value: 1347245427)
!750 = !DIEnumerator(name: "kPOVAttrib_PhotonsShot", value: 1347643503)
!751 = !DIEnumerator(name: "kPOVAttrib_PhotonsStored", value: 1347646575)
!752 = !DIEnumerator(name: "kPOVAttrib_GlobalPhotonsStored", value: 1196446580)
!753 = !DIEnumerator(name: "kPOVAttrib_MediaPhotonsStored", value: 1297109876)
!754 = !DIEnumerator(name: "kPOVAttrib_PhotonsPriQInsert", value: 1347440969)
!755 = !DIEnumerator(name: "kPOVAttrib_PhotonsPriQRemove", value: 1347440978)
!756 = !DIEnumerator(name: "kPOVAttrib_GatherPerformedCnt", value: 1196442478)
!757 = !DIEnumerator(name: "kPOVAttrib_GatherExpandedCnt", value: 1195721582)
!758 = !DIEnumerator(name: "kPOVAttrib_IsoFindRoot", value: 1229345391)
!759 = !DIEnumerator(name: "kPOVAttrib_FunctionVMCalls", value: 1180060995)
!760 = !DIEnumerator(name: "kPOVAttrib_FunctionVMInstrEst", value: 1180061001)
!761 = !DIEnumerator(name: "kPOVAttrib_State", value: 1400136052)
!762 = !DIEnumerator(name: "kPOVAttrib_Warning", value: 1466004078)
!763 = !DIEnumerator(name: "kPOVAttrib_Line", value: 1281977957)
!764 = !DIEnumerator(name: "kPOVAttrib_Column", value: 1131375733)
!765 = !DIEnumerator(name: "kPOVAttrib_FilePosition", value: 1179676531)
!766 = !DIEnumerator(name: "kPOVAttrib_TokenName", value: 1416588110)
!767 = !DIEnumerator(name: "kPOVAttrib_Error", value: 1165128303)
!768 = !DIEnumerator(name: "kPOVAttrib_ObjectName", value: 1330536813)
!769 = !DIEnumerator(name: "kPOVAttrib_ObjectID", value: 1330209893)
!770 = !DIEnumerator(name: "kPOVAttrib_ISectsTests", value: 1230271348)
!771 = !DIEnumerator(name: "kPOVAttrib_ISectsSucceeded", value: 1230206307)
!772 = !DIEnumerator(name: "kPOVAttrib_CommandString", value: 1131375955)
!773 = !DIEnumerator(name: "kPOVAttrib_ReturnAction", value: 1380017012)
!774 = !DIEnumerator(name: "kPOVAttrib_FrameTime", value: 1179937133)
!775 = !DIEnumerator(name: "kPOVAttrib_AnimationTime", value: 1096051053)
!776 = !DIEnumerator(name: "kPOVAttrib_IncludeHeader", value: 1231971144)
!777 = !DIEnumerator(name: "kPOVAttrib_IncludeIni", value: 1231971145)
!778 = !DIEnumerator(name: "kPOVAttrib_PreviewRefCon", value: 1347577190)
!779 = !DIEnumerator(name: "kPOVAttrib_INIFile", value: 1229351276)
!780 = !DIEnumerator(name: "kPOVAttrib_RenderOptions", value: 1380937844)
!781 = !DIEnumerator(name: "kPOVAttrib_Identifier", value: 1231316334)
!782 = !DIEnumerator(name: "kPOVAttrib_Value", value: 1449225333)
!783 = !DIEnumerator(name: "kPOVAttrib_StartColumn", value: 1281713780)
!784 = !DIEnumerator(name: "kPOVAttrib_EndColumn", value: 1382639464)
!785 = !DIEnumerator(name: "kPOVAttrib_StartRow", value: 1416589344)
!786 = !DIEnumerator(name: "kPOVAttrib_EndRow", value: 1114600564)
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !788, line: 692, size: 32, align: 32, elements: !789)
!788 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!789 = !{!790, !791, !792, !793}
!790 = !DIEnumerator(name: "X", value: 0)
!791 = !DIEnumerator(name: "Y", value: 1)
!792 = !DIEnumerator(name: "Z", value: 2)
!793 = !DIEnumerator(name: "T", value: 3)
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !788, line: 701, size: 32, align: 32, elements: !795)
!795 = !{!796, !797, !798, !799, !800}
!796 = !DIEnumerator(name: "pRED", value: 0)
!797 = !DIEnumerator(name: "pGREEN", value: 1)
!798 = !DIEnumerator(name: "pBLUE", value: 2)
!799 = !DIEnumerator(name: "pFILTER", value: 3)
!800 = !DIEnumerator(name: "pTRANSM", value: 4)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !788, line: 686, size: 32, align: 32, elements: !802)
!802 = !{!803, !804}
!803 = !DIEnumerator(name: "U", value: 0)
!804 = !DIEnumerator(name: "V", value: 1)
!805 = !{!806, !812, !817, !822, !877, !881, !882, !889, !898, !905, !911, !963, !1033, !1087, !1091, !1111, !3, !1124, !1135, !1139, !44, !836, !810, !1141, !1147, !1154, !1101, !894, !1160, !1171, !1109, !1173, !1178, !845, !1180, !1121, !1182, !1183, !1234, !1240, !1265, !1267, !1268}
!806 = !DICompositeType(tag: DW_TAG_structure_type, file: !807, line: 82, size: 64, align: 32, elements: !808, identifier: "_ZTS5div_t")
!807 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!808 = !{!809, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !807, line: 83, baseType: !810, size: 32, align: 32)
!810 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !807, line: 84, baseType: !810, size: 32, align: 32, offset: 32)
!812 = !DICompositeType(tag: DW_TAG_structure_type, file: !807, line: 87, size: 128, align: 64, elements: !813, identifier: "_ZTS6ldiv_t")
!813 = !{!814, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !807, line: 88, baseType: !815, size: 64, align: 64)
!815 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !807, line: 89, baseType: !815, size: 64, align: 64, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, file: !807, line: 93, size: 128, align: 64, elements: !818, identifier: "_ZTS7lldiv_t")
!818 = !{!819, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !807, line: 94, baseType: !820, size: 64, align: 64)
!820 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !807, line: 95, baseType: !820, size: 64, align: 64, offset: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !823, line: 122, size: 1216, align: 64, elements: !824, identifier: "_ZTS7__sFILE")
!823 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!824 = !{!825, !828, !829, !830, !832, !833, !834, !835, !837, !841, !847, !856, !862, !863, !865, !866, !870, !874, !875, !876}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !823, line: 123, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !823, line: 124, baseType: !810, size: 32, align: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !823, line: 125, baseType: !810, size: 32, align: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !823, line: 126, baseType: !831, size: 16, align: 16, offset: 128)
!831 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !823, line: 127, baseType: !831, size: 16, align: 16, offset: 144)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !823, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !823, line: 129, baseType: !810, size: 32, align: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !823, line: 132, baseType: !836, size: 64, align: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !823, line: 133, baseType: !838, size: 64, align: 64, offset: 448)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, align: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!810, !836}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !823, line: 134, baseType: !842, size: 64, align: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!810, !836, !845, !810}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, align: 64)
!846 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !823, line: 135, baseType: !848, size: 64, align: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!851, !836, !851, !810}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !823, line: 77, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !853, line: 71, baseType: !854)
!853 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !855, line: 46, baseType: !820)
!855 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !823, line: 136, baseType: !857, size: 64, align: 64, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64, align: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!810, !836, !860, !810}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !823, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !823, line: 140, baseType: !864, size: 64, align: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !823, line: 141, baseType: !810, size: 32, align: 32, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !823, line: 144, baseType: !867, size: 24, align: 8, offset: 928)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 24, align: 8, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 3)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !823, line: 145, baseType: !871, size: 8, align: 8, offset: 952)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 8, align: 8, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 1)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !823, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !823, line: 151, baseType: !810, size: 32, align: 32, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !823, line: 152, baseType: !851, size: 64, align: 64, offset: 1152)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !823, line: 88, size: 128, align: 64, elements: !878, identifier: "_ZTS6__sbuf")
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !823, line: 89, baseType: !826, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !823, line: 90, baseType: !810, size: 32, align: 32, offset: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !823, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !883, identifier: "_ZTS13__va_list_tag")
!883 = !{!884, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !885, size: 32, align: 32)
!885 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !885, size: 32, align: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !836, size: 64, align: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !836, size: 64, align: 64, offset: 128)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sym_Table_Struct", scope: !4, file: !1, line: 108, size: 16512, align: 64, elements: !890, identifier: "_ZTSN3pov16Sym_Table_StructE")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Table_Name", scope: !"_ZTSN3pov16Sym_Table_StructE", file: !1, line: 110, baseType: !845, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "Table", scope: !"_ZTSN3pov16Sym_Table_StructE", file: !1, line: 111, baseType: !893, size: 16448, align: 64, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 16448, align: 64, elements: !896)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYM_ENTRY", scope: !4, file: !788, line: 1849, baseType: !"_ZTSN3pov15Sym_Table_EntryE")
!896 = !{!897}
!897 = !DISubrange(count: 257)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sym_Table_Entry", scope: !4, file: !788, line: 1851, size: 256, align: 64, elements: !899, identifier: "_ZTSN3pov15Sym_Table_EntryE")
!899 = !{!900, !901, !902, !903}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov15Sym_Table_EntryE", file: !788, line: 1853, baseType: !894, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Name", scope: !"_ZTSN3pov15Sym_Table_EntryE", file: !788, line: 1854, baseType: !845, size: 64, align: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov15Sym_Table_EntryE", file: !788, line: 1855, baseType: !836, size: 64, align: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Number", scope: !"_ZTSN3pov15Sym_Table_EntryE", file: !788, line: 1856, baseType: !904, size: 32, align: 32, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "TOKEN", scope: !4, file: !788, line: 1841, baseType: !810)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "InputFileData", scope: !4, file: !1, line: 134, size: 128, align: 64, elements: !906, identifier: "_ZTSN3pov13InputFileDataE")
!906 = !{!907, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "In_File", scope: !"_ZTSN3pov13InputFileDataE", file: !1, line: 136, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "R_Flag", scope: !"_ZTSN3pov13InputFileDataE", file: !1, line: 137, baseType: !910, size: 8, align: 8, offset: 64)
!910 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!911 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !20, file: !912, line: 54, size: 4608, align: 64, elements: !913, vtableHolder: !"_ZTSN8pov_base11ITextStreamE", identifier: "_ZTSN8pov_base11ITextStreamE")
!912 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstream.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!913 = !{!914, !919, !921, !925, !927, !928, !929, !930, !931, !932, !933, !937, !940, !943, !946, !949, !952, !955, !958, !959, !962}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$ITextStream", scope: !912, file: !912, baseType: !915, size: 64, flags: DIFlagArtificial)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!810}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 78, baseType: !920, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 79, baseType: !922, size: 4096, align: 8, offset: 128)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 4096, align: 8, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 80, baseType: !926, size: 64, align: 64, offset: 4224)
!926 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "maxbufferoffset", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 81, baseType: !926, size: 64, align: 64, offset: 4288)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "filelength", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 82, baseType: !926, size: 64, align: 64, offset: 4352)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "curpos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 83, baseType: !926, size: 64, align: 64, offset: 4416)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 84, baseType: !845, size: 64, align: 64, offset: 4480)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 85, baseType: !810, size: 32, align: 32, offset: 4544)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ungetbuffer", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 86, baseType: !810, size: 32, align: 32, offset: 4576)
!933 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 63, type: !934, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !936, !860, !885}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11ITextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!937 = !DISubprogram(name: "ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 64, type: !938, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !936, !860, !920}
!940 = !DISubprogram(name: "~ITextStream", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 65, type: !941, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base11ITextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !936}
!943 = !DISubprogram(name: "getchar", linkageName: "_ZN8pov_base11ITextStream7getcharEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 67, type: !944, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!944 = !DISubroutineType(types: !945)
!945 = !{!810, !936}
!946 = !DISubprogram(name: "ungetchar", linkageName: "_ZN8pov_base11ITextStream9ungetcharEi", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 68, type: !947, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !936, !810}
!949 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base11ITextStream3eofEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 70, type: !950, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!950 = !DISubroutineType(types: !951)
!951 = !{!910, !936}
!952 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base11ITextStream5seekgENS0_7FilePosE", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 71, type: !953, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!953 = !DISubroutineType(types: !954)
!954 = !{!910, !936, !"_ZTSN8pov_base11ITextStream7FilePosE"}
!955 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base11ITextStream5tellgEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 72, type: !956, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!956 = !DISubroutineType(types: !957)
!957 = !{!"_ZTSN8pov_base11ITextStream7FilePosE", !936}
!958 = !DISubprogram(name: "line", linkageName: "_ZN8pov_base11ITextStream4lineEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 74, type: !944, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!959 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11ITextStream4nameEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 76, type: !960, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!960 = !DISubroutineType(types: !961)
!961 = !{!860, !936}
!962 = !DISubprogram(name: "RefillBuffer", linkageName: "_ZN8pov_base11ITextStream12RefillBufferEv", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 88, type: !941, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true)
!963 = !DICompositeType(tag: DW_TAG_class_type, name: "IStream", scope: !20, file: !19, line: 118, size: 320, align: 64, elements: !964, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7IStreamE")
!964 = !{!965, !966, !971, !974, !977, !978, !979, !982, !987, !991, !995, !1000, !1004, !1008, !1012, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1027, !1030}
!965 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7IStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!966 = !DISubprogram(name: "IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 121, type: !967, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !969, !970}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7IStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!971 = !DISubprogram(name: "~IStream", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 122, type: !972, isLocal: false, isDefinition: false, scopeLine: 122, containingType: !"_ZTSN8pov_base7IStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !969}
!974 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteEv", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 124, type: !975, isLocal: false, isDefinition: false, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!975 = !DISubroutineType(types: !976)
!976 = !{!810, !969}
!977 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortEv", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 125, type: !975, isLocal: false, isDefinition: false, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!978 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntEv", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 126, type: !975, isLocal: false, isDefinition: false, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!979 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongEv", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 127, type: !980, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!980 = !DISubroutineType(types: !981)
!981 = !{!815, !969}
!982 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERc", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 128, type: !983, isLocal: false, isDefinition: false, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!983 = !DISubroutineType(types: !984)
!984 = !{!985, !969, !986}
!985 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7IStreamE")
!986 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !846)
!987 = !DISubprogram(name: "Read_Byte", linkageName: "_ZN8pov_base7IStream9Read_ByteERh", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 129, type: !988, isLocal: false, isDefinition: false, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!988 = !DISubroutineType(types: !989)
!989 = !{!985, !969, !990}
!990 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !827)
!991 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERs", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 130, type: !992, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!992 = !DISubroutineType(types: !993)
!993 = !{!985, !969, !994}
!994 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !831)
!995 = !DISubprogram(name: "Read_Short", linkageName: "_ZN8pov_base7IStream10Read_ShortERt", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 131, type: !996, isLocal: false, isDefinition: false, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!996 = !DISubroutineType(types: !997)
!997 = !{!985, !969, !998}
!998 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !999)
!999 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1000 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERi", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 132, type: !1001, isLocal: false, isDefinition: false, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!985, !969, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !810)
!1004 = !DISubprogram(name: "Read_Int", linkageName: "_ZN8pov_base7IStream8Read_IntERj", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 133, type: !1005, isLocal: false, isDefinition: false, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!985, !969, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !885)
!1008 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERl", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 134, type: !1009, isLocal: false, isDefinition: false, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!985, !969, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !815)
!1012 = !DISubprogram(name: "Read_Long", linkageName: "_ZN8pov_base7IStream9Read_LongERm", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 135, type: !1013, isLocal: false, isDefinition: false, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!985, !969, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !926)
!1016 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERl", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 137, type: !1009, isLocal: false, isDefinition: false, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1017 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERi", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 138, type: !1001, isLocal: false, isDefinition: false, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1018 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERs", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 139, type: !992, isLocal: false, isDefinition: false, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1019 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERc", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 140, type: !983, isLocal: false, isDefinition: false, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1020 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERm", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 141, type: !1013, isLocal: false, isDefinition: false, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1021 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERj", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 142, type: !1005, isLocal: false, isDefinition: false, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1022 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERt", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 143, type: !996, isLocal: false, isDefinition: false, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1023 = !DISubprogram(name: "operator>>", linkageName: "_ZN8pov_base7IStreamrsERh", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 144, type: !988, isLocal: false, isDefinition: false, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1024 = !DISubprogram(name: "UnRead_Byte", linkageName: "_ZN8pov_base7IStream11UnRead_ByteEi", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 145, type: !1025, isLocal: false, isDefinition: false, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!985, !969, !810}
!1027 = !DISubprogram(name: "getline", linkageName: "_ZN8pov_base7IStream7getlineEPcm", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 146, type: !1028, isLocal: false, isDefinition: false, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!985, !969, !845, !926}
!1030 = !DISubprogram(name: "ignore", linkageName: "_ZN8pov_base7IStream6ignoreEm", scope: !"_ZTSN8pov_base7IStreamE", file: !19, line: 147, type: !1031, isLocal: false, isDefinition: false, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!985, !969, !926}
!1033 = !DICompositeType(tag: DW_TAG_class_type, name: "IOBase", scope: !20, file: !19, line: 84, size: 320, align: 64, elements: !1034, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base6IOBaseE")
!1034 = !{!1035, !1036, !1037, !1040, !1041, !1042, !1043, !1047, !1050, !1053, !1056, !1060, !1061, !1064, !1067, !1068, !1069, !1072, !1075, !1078, !1083, !1086}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$IOBase", scope: !19, file: !19, baseType: !915, size: 64, flags: DIFlagArtificial)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 110, baseType: !910, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 111, baseType: !1038, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !823, line: 153, baseType: !"_ZTS7__sFILE")
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 113, baseType: !885, size: 32, align: 32, offset: 192, flags: DIFlagProtected)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 114, baseType: !885, size: 32, align: 32, offset: 224, flags: DIFlagProtected)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 115, baseType: !845, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!1043 = !DISubprogram(name: "IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 87, type: !1044, isLocal: false, isDefinition: false, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{null, !1046, !885, !885}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base6IOBaseE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1047 = !DISubprogram(name: "~IOBase", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 88, type: !1048, isLocal: false, isDefinition: false, scopeLine: 88, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !1046}
!1050 = !DISubprogram(name: "open", linkageName: "_ZN8pov_base6IOBase4openEPKcj", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 94, type: !1051, isLocal: false, isDefinition: false, scopeLine: 94, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!910, !1046, !860, !885}
!1053 = !DISubprogram(name: "close", linkageName: "_ZN8pov_base6IOBase5closeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 95, type: !1054, isLocal: false, isDefinition: false, scopeLine: 95, containingType: !"_ZTSN8pov_base6IOBaseE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!910, !1046}
!1056 = !DISubprogram(name: "read", linkageName: "_ZN8pov_base6IOBase4readEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 96, type: !1057, isLocal: false, isDefinition: false, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!1059, !1046, !836, !926}
!1059 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!1060 = !DISubprogram(name: "write", linkageName: "_ZN8pov_base6IOBase5writeEPvm", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 97, type: !1057, isLocal: false, isDefinition: false, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1061 = !DISubprogram(name: "seekg", linkageName: "_ZN8pov_base6IOBase5seekgEmj", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 98, type: !1062, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1059, !1046, !926, !885}
!1064 = !DISubprogram(name: "gettype", linkageName: "_ZN8pov_base6IOBase7gettypeEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 100, type: !1065, isLocal: false, isDefinition: false, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!885, !1046}
!1067 = !DISubprogram(name: "getdirection", linkageName: "_ZN8pov_base6IOBase12getdirectionEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 101, type: !1065, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1068 = !DISubprogram(name: "eof", linkageName: "_ZN8pov_base6IOBase3eofEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 102, type: !1054, isLocal: false, isDefinition: false, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1069 = !DISubprogram(name: "tellg", linkageName: "_ZN8pov_base6IOBase5tellgEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 103, type: !1070, isLocal: false, isDefinition: false, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!926, !1046}
!1072 = !DISubprogram(name: "clearstate", linkageName: "_ZN8pov_base6IOBase10clearstateEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 104, type: !1073, isLocal: false, isDefinition: false, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!1059, !1046}
!1075 = !DISubprogram(name: "Name", linkageName: "_ZN8pov_base6IOBase4NameEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 105, type: !1076, isLocal: false, isDefinition: false, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!860, !1046}
!1078 = !DISubprogram(name: "operator void *", linkageName: "_ZNK8pov_base6IOBasecvPvEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 107, type: !1079, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!836, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSN8pov_base6IOBaseE")
!1083 = !DISubprogram(name: "operator!", linkageName: "_ZNK8pov_base6IOBasentEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 108, type: !1084, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!910, !1081}
!1086 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base6IOBase5flushEv", scope: !"_ZTSN8pov_base6IOBaseE", file: !19, line: 112, type: !1073, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !"_ZTSN8pov_base11ITextStreamE", file: !912, line: 57, size: 128, align: 64, elements: !1088, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !912, line: 59, baseType: !926, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !"_ZTSN8pov_base11ITextStream7FilePosE", file: !912, line: 60, baseType: !810, size: 32, align: 32, offset: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token_Struct", scope: !4, file: !1092, line: 57, size: 768, align: 64, elements: !1093, identifier: "_ZTSN3pov12Token_StructE")
!1092 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/tokenize.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100, !1102, !1103, !1104, !1105, !1106, !1108, !1110}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Id", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 59, baseType: !904, size: 32, align: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "Function_Id", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 60, baseType: !904, size: 32, align: 32, offset: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "Token_File_Pos", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 61, baseType: !"_ZTSN8pov_base11ITextStream7FilePosE", size: 128, align: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Col_No", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 62, baseType: !810, size: 32, align: 32, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "Table_Index", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 62, baseType: !810, size: 32, align: 32, offset: 224)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "Token_String", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 63, baseType: !845, size: 64, align: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Float", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 64, baseType: !1101, size: 64, align: 64, offset: 320)
!1101 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "Unget_Token", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 65, baseType: !810, size: 32, align: 32, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "End_Of_File", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 65, baseType: !810, size: 32, align: 32, offset: 416)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "FileHandle", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 66, baseType: !908, size: 64, align: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 67, baseType: !836, size: 64, align: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "NumberPtr", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 68, baseType: !1107, size: 64, align: 64, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "DataPtr", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 69, baseType: !1109, size: 64, align: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "is_array_elem", scope: !"_ZTSN3pov12Token_StructE", file: !1092, line: 70, baseType: !910, size: 8, align: 8, offset: 704)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cond_Stack_Entry", scope: !4, file: !1, line: 150, size: 576, align: 64, elements: !1112, identifier: "_ZTSN3pov16Cond_Stack_EntryE")
!1112 = !{!1113, !1115, !1116, !1117, !1118, !1119, !1120, !1123}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "Cond_Type", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 152, baseType: !1114, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "COND_TYPE", scope: !4, file: !1, line: 96, baseType: !"_ZTSN3pov9cond_typeE")
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "Switch_Value", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 153, baseType: !1101, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "While_File", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 154, baseType: !908, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_File", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 155, baseType: !908, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_Return_Name", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 156, baseType: !860, size: 64, align: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_Same_Flag", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 157, baseType: !810, size: 32, align: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "PMac", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 158, baseType: !1121, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "POV_MACRO", scope: !4, file: !1092, line: 75, baseType: !"_ZTSN3pov16Pov_Macro_StructE")
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "File_Pos", scope: !"_ZTSN3pov16Cond_Stack_EntryE", file: !1, line: 159, baseType: !"_ZTSN8pov_base11ITextStream7FilePosE", size: 128, align: 64, offset: 448)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pov_Macro_Struct", scope: !4, file: !1092, line: 77, size: 3968, align: 64, elements: !1125, identifier: "_ZTSN3pov16Pov_Macro_StructE")
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_Name", scope: !"_ZTSN3pov16Pov_Macro_StructE", file: !1092, line: 79, baseType: !845, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_Filename", scope: !"_ZTSN3pov16Pov_Macro_StructE", file: !1092, line: 80, baseType: !845, size: 64, align: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_File_Pos", scope: !"_ZTSN3pov16Pov_Macro_StructE", file: !1092, line: 81, baseType: !"_ZTSN8pov_base11ITextStream7FilePosE", size: 128, align: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "Macro_End", scope: !"_ZTSN3pov16Pov_Macro_StructE", file: !1092, line: 82, baseType: !815, size: 64, align: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Pars", scope: !"_ZTSN3pov16Pov_Macro_StructE", file: !1092, line: 83, baseType: !810, size: 32, align: 32, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "Par_Name", scope: !"_ZTSN3pov16Pov_Macro_StructE", file: !1092, line: 84, baseType: !1132, size: 3584, align: 64, offset: 384)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 3584, align: 64, elements: !1133)
!1133 = !{!1134}
!1134 = !DISubrange(count: 56)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Reserved_Word_Struct", scope: !4, file: !788, line: 1843, size: 128, align: 64, elements: !1136, identifier: "_ZTSN3pov20Reserved_Word_StructE")
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Number", scope: !"_ZTSN3pov20Reserved_Word_StructE", file: !788, line: 1845, baseType: !904, size: 32, align: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "Token_Name", scope: !"_ZTSN3pov20Reserved_Word_StructE", file: !788, line: 1846, baseType: !845, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "CS_ENTRY", scope: !4, file: !1, line: 148, baseType: !"_ZTSN3pov16Cond_Stack_EntryE")
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !1142, line: 178, size: 128, align: 64, elements: !1143, identifier: "_ZTS9POVMSData")
!1142 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !1142, line: 180, baseType: !885, size: 32, align: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !1142, line: 181, baseType: !810, size: 32, align: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !1142, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!1147 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !1142, line: 182, size: 64, align: 64, elements: !1148, identifier: "_ZTSN9POVMSDataUt_E")
!1148 = !{!1149, !1150, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !1142, line: 184, baseType: !836, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !1142, line: 185, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !1142, line: 186, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !1142, line: 190, size: 320, align: 64, elements: !1155, identifier: "_ZTS9POVMSNode")
!1155 = !{!1156, !1157, !1158, !1159}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !1142, line: 192, baseType: !1153, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !1142, line: 193, baseType: !1153, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !1142, line: 194, baseType: !885, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !1142, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pov_Array_Struct", scope: !4, file: !1092, line: 89, size: 512, align: 64, elements: !1161, identifier: "_ZTSN3pov16Pov_Array_StructE")
!1161 = !{!1162, !1163, !1164, !1165, !1169, !1170}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "Dims", scope: !"_ZTSN3pov16Pov_Array_StructE", file: !1092, line: 91, baseType: !810, size: 32, align: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Pov_Array_StructE", file: !1092, line: 91, baseType: !810, size: 32, align: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "Total", scope: !"_ZTSN3pov16Pov_Array_StructE", file: !1092, line: 91, baseType: !810, size: 32, align: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "Sizes", scope: !"_ZTSN3pov16Pov_Array_StructE", file: !1092, line: 92, baseType: !1166, size: 160, align: 32, offset: 96)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 160, align: 32, elements: !1167)
!1167 = !{!1168}
!1168 = !DISubrange(count: 5)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "Mags", scope: !"_ZTSN3pov16Pov_Array_StructE", file: !1092, line: 93, baseType: !1166, size: 160, align: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "DataPtrs", scope: !"_ZTSN3pov16Pov_Array_StructE", file: !1092, line: 94, baseType: !1109, size: 64, align: 64, offset: 448)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "POV_ARRAY", scope: !4, file: !1092, line: 87, baseType: !"_ZTSN3pov16Pov_Array_StructE")
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pov_Param_Struct", scope: !4, file: !1092, line: 99, size: 192, align: 64, elements: !1174, identifier: "_ZTSN3pov16Pov_Param_StructE")
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "NumberPtr", scope: !"_ZTSN3pov16Pov_Param_StructE", file: !1092, line: 101, baseType: !1107, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "DataPtr", scope: !"_ZTSN3pov16Pov_Param_StructE", file: !1092, line: 102, baseType: !1109, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "Table_Index", scope: !"_ZTSN3pov16Pov_Param_StructE", file: !1092, line: 103, baseType: !810, size: 32, align: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "POV_PARAM", scope: !4, file: !1092, line: 97, baseType: !"_ZTSN3pov16Pov_Param_StructE")
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYM_TABLE", scope: !4, file: !1, line: 106, baseType: !"_ZTSN3pov16Sym_Table_StructE")
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!1183 = !DICompositeType(tag: DW_TAG_class_type, name: "OStream", scope: !20, file: !19, line: 150, size: 320, align: 64, elements: !1184, vtableHolder: !"_ZTSN8pov_base6IOBaseE", identifier: "_ZTSN8pov_base7OStreamE")
!1184 = !{!1185, !1186, !1190, !1193, !1196, !1200, !1203, !1206, !1209, !1212, !1215, !1218, !1221, !1222, !1225, !1226, !1229, !1230, !1233}
!1185 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN8pov_base7OStreamE", baseType: !"_ZTSN8pov_base6IOBaseE", flags: DIFlagPublic)
!1186 = !DISubprogram(name: "OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 153, type: !1187, isLocal: false, isDefinition: false, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !1189, !970}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1190 = !DISubprogram(name: "~OStream", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 154, type: !1191, isLocal: false, isDefinition: false, scopeLine: 154, containingType: !"_ZTSN8pov_base7OStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{null, !1189}
!1193 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base7OStream6printfEPKcz", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 156, type: !1194, isLocal: false, isDefinition: false, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !1189, !860, null}
!1196 = !DISubprogram(name: "Write_Byte", linkageName: "_ZN8pov_base7OStream10Write_ByteEh", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 158, type: !1197, isLocal: false, isDefinition: false, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1199, !1189, !827}
!1199 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !"_ZTSN8pov_base7OStreamE")
!1200 = !DISubprogram(name: "Write_Short", linkageName: "_ZN8pov_base7OStream11Write_ShortEt", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 159, type: !1201, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1199, !1189, !999}
!1203 = !DISubprogram(name: "Write_Int", linkageName: "_ZN8pov_base7OStream9Write_IntEj", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 160, type: !1204, isLocal: false, isDefinition: false, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!1199, !1189, !885}
!1206 = !DISubprogram(name: "Write_Long", linkageName: "_ZN8pov_base7OStream10Write_LongEm", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 161, type: !1207, isLocal: false, isDefinition: false, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!1199, !1189, !926}
!1209 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base7OStream5flushEv", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 162, type: !1210, isLocal: false, isDefinition: false, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1199, !1189}
!1212 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPKc", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 164, type: !1213, isLocal: false, isDefinition: false, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!1199, !1189, !860}
!1215 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEPh", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 165, type: !1216, isLocal: false, isDefinition: false, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!1199, !1189, !826}
!1218 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEc", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 166, type: !1219, isLocal: false, isDefinition: false, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!1199, !1189, !846}
!1221 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEh", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 167, type: !1197, isLocal: false, isDefinition: false, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1222 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEs", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 168, type: !1223, isLocal: false, isDefinition: false, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!1199, !1189, !831}
!1225 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEt", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 169, type: !1201, isLocal: false, isDefinition: false, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1226 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEi", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 170, type: !1227, isLocal: false, isDefinition: false, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!1199, !1189, !810}
!1229 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEj", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 171, type: !1204, isLocal: false, isDefinition: false, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1230 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEl", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 172, type: !1231, isLocal: false, isDefinition: false, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1199, !1189, !815}
!1233 = !DISubprogram(name: "operator<<", linkageName: "_ZN8pov_base7OStreamlsEm", scope: !"_ZTSN8pov_base7OStreamE", file: !19, line: 173, type: !1207, isLocal: false, isDefinition: false, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "Data_File_Struct", scope: !4, file: !1092, line: 108, size: 192, align: 64, elements: !1235, identifier: "_ZTSN3pov16Data_File_StructE")
!1235 = !{!1236, !1237, !1239}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "In_File", scope: !"_ZTSN3pov16Data_File_StructE", file: !1092, line: 110, baseType: !908, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "Out_File", scope: !"_ZTSN3pov16Data_File_StructE", file: !1092, line: 111, baseType: !1238, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "R_Flag", scope: !"_ZTSN3pov16Data_File_StructE", file: !1092, line: 112, baseType: !910, size: 8, align: 8, offset: 128)
!1240 = !DICompositeType(tag: DW_TAG_class_type, name: "OTextStream", scope: !20, file: !912, line: 91, size: 192, align: 64, elements: !1241, vtableHolder: !"_ZTSN8pov_base11OTextStreamE", identifier: "_ZTSN8pov_base11OTextStreamE")
!1241 = !{!1242, !1243, !1245, !1246, !1250, !1253, !1256, !1259, !1262}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$OTextStream", scope: !912, file: !912, baseType: !915, size: 64, flags: DIFlagArtificial)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 103, baseType: !1244, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base7OStreamE", size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 104, baseType: !845, size: 64, align: 64, offset: 128)
!1246 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 94, type: !1247, isLocal: false, isDefinition: false, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !1249, !860, !885, !910}
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base11OTextStreamE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1250 = !DISubprogram(name: "OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 95, type: !1251, isLocal: false, isDefinition: false, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !1249, !860, !1244}
!1253 = !DISubprogram(name: "~OTextStream", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 96, type: !1254, isLocal: false, isDefinition: false, scopeLine: 96, containingType: !"_ZTSN8pov_base11OTextStreamE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !1249}
!1256 = !DISubprogram(name: "putchar", linkageName: "_ZN8pov_base11OTextStream7putcharEi", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 98, type: !1257, isLocal: false, isDefinition: false, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !1249, !810}
!1259 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base11OTextStream6printfEPKcz", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 99, type: !1260, isLocal: false, isDefinition: false, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !1249, !860, null}
!1262 = !DISubprogram(name: "name", linkageName: "_ZN8pov_base11OTextStream4nameEv", scope: !"_ZTSN8pov_base11OTextStreamE", file: !912, line: 101, type: !1263, isLocal: false, isDefinition: false, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!860, !1249}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATA_FILE", scope: !4, file: !1092, line: 106, baseType: !"_ZTSN3pov16Data_File_StructE")
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1270 = !{!1271, !1281, !1284, !1290, !1295, !1297, !1301, !1307, !1310, !1334, !1339, !1347, !1354, !1360, !1366, !1377, !1388, !1395, !1400, !1406, !1413, !1416, !1421, !1422, !1423, !1426, !1427, !1433, !1436, !1442, !1445, !1446, !1457, !1460, !1466, !1469, !1472, !1475, !1482, !1485, !1492, !1498, !1505, !1511, !1525, !1538, !1539, !1548, !1549, !1557, !1566, !1571, !1579, !1582, !1604, !1610, !1614, !1618, !1624, !1638, !1645, !1651, !1652}
!1271 = !DISubprogram(name: "Initialize_Tokenizer", linkageName: "_ZN3pov20Initialize_TokenizerEv", scope: !4, file: !1, line: 782, type: !1272, isLocal: false, isDefinition: true, scopeLine: 783, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov20Initialize_TokenizerEv, variables: !1274)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null}
!1274 = !{!1275, !1276, !1280}
!1275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rfile", scope: !1271, file: !1, line: 784, type: !920)
!1276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !1271, file: !1, line: 785, type: !1277)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 8192, align: 8, elements: !1278)
