; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/userio.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"class.pov::DebugTextStreamBuffer" = type { %"class.pov_base::TextStreamBuffer" }
%"class.pov_base::TextStreamBuffer" = type { i32 (...)**, i8*, i32, i32, i32, i32 }
%"struct.pov::StageName_Struct" = type { i32, i8* }
%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }

!204 = !DIEnumerator(name: "kPOVMsgClass_Miscellaneous", value: 1298756451)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 78, size: 32, align: 32, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!207 = !DIEnumerator(name: "kPOVMsgIdent_InitInfo", value: 1231964526)
!208 = !DIEnumerator(name: "kPOVMsgIdent_RenderOptions", value: 1380937844)
!209 = !DIEnumerator(name: "kPOVMsgIdent_RenderAll", value: 1380019308)
!210 = !DIEnumerator(name: "kPOVMsgIdent_RenderArea", value: 1380020837)
!211 = !DIEnumerator(name: "kPOVMsgIdent_RenderPause", value: 1380999541)
!212 = !DIEnumerator(name: "kPOVMsgIdent_RenderStop", value: 1381201007)
!213 = !DIEnumerator(name: "kPOVMsgIdent_RenderStarted", value: 1381135726)
!214 = !DIEnumerator(name: "kPOVMsgIdent_RenderDone", value: 1380281956)
!215 = !DIEnumerator(name: "kPOVMsgIdent_FrameStatistics", value: 1179874401)
!216 = !DIEnumerator(name: "kPOVMsgIdent_ParseStatistics", value: 1347646561)
!217 = !DIEnumerator(name: "kPOVMsgIdent_RenderStatistics", value: 1381200993)
!218 = !DIEnumerator(name: "kPOVMsgIdent_Progress", value: 1349676903)
!219 = !DIEnumerator(name: "kPOVMsgIdent_Warning", value: 1466004078)
!220 = !DIEnumerator(name: "kPOVMsgIdent_Error", value: 1165128279)
!221 = !DIEnumerator(name: "kPOVMsgIdent_FatalError", value: 1165128262)
!222 = !DIEnumerator(name: "kPOVMsgIdent_Debug", value: 1147303271)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !224, line: 198, size: 32, align: 32, elements: !225)
!224 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!225 = !{!226, !227, !228, !229}
!226 = !DIEnumerator(name: "kPOVMSSendMode_Invalid", value: 0)
!227 = !DIEnumerator(name: "kPOVMSSendMode_NoReply", value: 1)
!228 = !DIEnumerator(name: "kPOVMSSendMode_WaitReply", value: 2)
!229 = !DIEnumerator(name: "kPOVMSSendMode_WantReceipt", value: 3)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "shelltype", scope: !232, file: !231, line: 63, size: 32, align: 32, elements: !234, identifier: "_ZTSN3pov9shelltypeE")
!231 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/userio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!232 = !DINamespace(name: "pov", scope: null, file: !233, line: 36)
!233 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!234 = !{!235, !236, !237, !238, !239, !240, !241}
!235 = !DIEnumerator(name: "PRE_SCENE_SHL", value: 0)
!236 = !DIEnumerator(name: "PRE_FRAME_SHL", value: 1)
!237 = !DIEnumerator(name: "POST_FRAME_SHL", value: 2)
!238 = !DIEnumerator(name: "POST_SCENE_SHL", value: 3)
!239 = !DIEnumerator(name: "USER_ABORT_SHL", value: 4)
!240 = !DIEnumerator(name: "FATAL_SHL", value: 5)
!241 = !DIEnumerator(name: "MAX_SHL", value: 6)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "shellret", scope: !232, file: !231, line: 74, size: 32, align: 32, elements: !243, identifier: "_ZTSN3pov8shellretE")
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DIEnumerator(name: "IGNORE_RET", value: 0)
!245 = !DIEnumerator(name: "QUIT_RET", value: 1)
!246 = !DIEnumerator(name: "USER_RET", value: 2)
!247 = !DIEnumerator(name: "FATAL_RET", value: 3)
!248 = !DIEnumerator(name: "SKIP_ONCE_RET", value: 4)
!249 = !DIEnumerator(name: "ALL_SKIP_RET", value: 5)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !232, file: !251, line: 54, size: 32, align: 32, elements: !252)
!251 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!253 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1)
!254 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2)
!255 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3)
!256 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4)
!257 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5)
!258 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6)
!259 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7)
!260 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8)
!261 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9)
!262 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10)
!263 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11)
!264 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12)
!265 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13)
!266 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14)
!267 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15)
!268 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16)
!269 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17)
!270 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18)
!271 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19)
!272 = !{!273, !279, !284, !289, !344, !348, !349, !356, !368, !420, !425, !432, !230, !242, !352, !438, !277, !439, !443}
!273 = !DICompositeType(tag: DW_TAG_structure_type, file: !274, line: 82, size: 64, align: 32, elements: !275, identifier: "_ZTS5div_t")
!274 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!275 = !{!276, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !274, line: 83, baseType: !277, size: 32, align: 32)
!277 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !274, line: 84, baseType: !277, size: 32, align: 32, offset: 32)
!279 = !DICompositeType(tag: DW_TAG_structure_type, file: !274, line: 87, size: 128, align: 64, elements: !280, identifier: "_ZTS6ldiv_t")
!280 = !{!281, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !274, line: 88, baseType: !282, size: 64, align: 64)
!282 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !274, line: 89, baseType: !282, size: 64, align: 64, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, file: !274, line: 93, size: 128, align: 64, elements: !285, identifier: "_ZTS7lldiv_t")
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !274, line: 94, baseType: !287, size: 64, align: 64)
!287 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !274, line: 95, baseType: !287, size: 64, align: 64, offset: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !290, line: 122, size: 1216, align: 64, elements: !291, identifier: "_ZTS7__sFILE")
!290 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!291 = !{!292, !295, !296, !297, !299, !300, !301, !302, !304, !308, !314, !323, !329, !330, !332, !333, !337, !341, !342, !343}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !290, line: 123, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !290, line: 124, baseType: !277, size: 32, align: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !290, line: 125, baseType: !277, size: 32, align: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !290, line: 126, baseType: !298, size: 16, align: 16, offset: 128)
!298 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !290, line: 127, baseType: !298, size: 16, align: 16, offset: 144)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !290, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !290, line: 129, baseType: !277, size: 32, align: 32, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !290, line: 132, baseType: !303, size: 64, align: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !290, line: 133, baseType: !305, size: 64, align: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!277, !303}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !290, line: 134, baseType: !309, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!277, !303, !312, !277}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !290, line: 135, baseType: !315, size: 64, align: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!318, !303, !318, !277}
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !290, line: 77, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !320, line: 71, baseType: !321)
!320 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !322, line: 46, baseType: !287)
!322 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !290, line: 136, baseType: !324, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!277, !303, !327, !277}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !290, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !290, line: 140, baseType: !331, size: 64, align: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !290, line: 141, baseType: !277, size: 32, align: 32, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !290, line: 144, baseType: !334, size: 24, align: 8, offset: 928)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 24, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 3)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !290, line: 145, baseType: !338, size: 8, align: 8, offset: 952)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 8, align: 8, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 1)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !290, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !290, line: 151, baseType: !277, size: 32, align: 32, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !290, line: 152, baseType: !318, size: 64, align: 64, offset: 1152)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !290, line: 88, size: 128, align: 64, elements: !345, identifier: "_ZTS6__sbuf")
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !290, line: 89, baseType: !293, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !290, line: 90, baseType: !277, size: 32, align: 32, offset: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !290, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !350, identifier: "_ZTS13__va_list_tag")
!350 = !{!351, !353, !354, !355}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !352, size: 32, align: 32)
!352 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !352, size: 32, align: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !303, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !303, size: 64, align: 64, offset: 128)
!356 = !DICompositeType(tag: DW_TAG_class_type, name: "DebugTextStreamBuffer", scope: !232, file: !1, line: 57, size: 256, align: 64, elements: !357, vtableHolder: !"_ZTSN8pov_base16TextStreamBufferE", identifier: "_ZTSN3pov21DebugTextStreamBufferE")
!357 = !{!358, !359, !363, !364, !367}
!358 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !"_ZTSN3pov21DebugTextStreamBufferE", baseType: !"_ZTSN8pov_base16TextStreamBufferE", flags: DIFlagPublic)
!359 = !DISubprogram(name: "DebugTextStreamBuffer", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 60, type: !360, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov21DebugTextStreamBufferE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!363 = !DISubprogram(name: "~DebugTextStreamBuffer", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 61, type: !360, isLocal: false, isDefinition: false, scopeLine: 61, containingType: !"_ZTSN3pov21DebugTextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!364 = !DISubprogram(name: "lineoutput", linkageName: "_ZN3pov21DebugTextStreamBuffer10lineoutputEPKcj", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 63, type: !365, isLocal: false, isDefinition: false, scopeLine: 63, containingType: !"_ZTSN3pov21DebugTextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !362, !327, !352}
!367 = !DISubprogram(name: "directoutput", linkageName: "_ZN3pov21DebugTextStreamBuffer12directoutputEPKcj", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 64, type: !365, isLocal: false, isDefinition: false, scopeLine: 64, containingType: !"_ZTSN3pov21DebugTextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!368 = !DICompositeType(tag: DW_TAG_class_type, name: "TextStreamBuffer", scope: !370, file: !369, line: 51, size: 256, align: 64, elements: !372, vtableHolder: !"_ZTSN8pov_base16TextStreamBufferE", identifier: "_ZTSN8pov_base16TextStreamBufferE")
!369 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/textstreambuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!370 = !DINamespace(name: "pov_base", scope: null, file: !371, line: 37)
!371 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/fileinputoutput.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!372 = !{!373, !378, !379, !380, !381, !382, !383, !391, !394, !397, !400, !401, !404, !407, !412, !413, !416, !417, !418, !419}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$TextStreamBuffer", scope: !369, file: !369, baseType: !374, size: 64, flags: DIFlagArtificial)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!277}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 69, baseType: !312, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "boffset", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 70, baseType: !352, size: 32, align: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 71, baseType: !352, size: 32, align: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 72, baseType: !352, size: 32, align: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "curline", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 73, baseType: !352, size: 32, align: 32, offset: 224)
!383 = !DISubprogram(name: "TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 54, type: !384, isLocal: false, isDefinition: false, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386, !387, !352}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN8pov_base16TextStreamBufferE", size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !388, line: 30, baseType: !389)
!388 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !322, line: 92, baseType: !390)
!390 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!391 = !DISubprogram(name: "~TextStreamBuffer", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 55, type: !392, isLocal: false, isDefinition: false, scopeLine: 55, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !386}
!394 = !DISubprogram(name: "printf", linkageName: "_ZN8pov_base16TextStreamBuffer6printfEPKcz", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 57, type: !395, isLocal: false, isDefinition: false, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !386, !327, null}
!397 = !DISubprogram(name: "print", linkageName: "_ZN8pov_base16TextStreamBuffer5printEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 58, type: !398, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !386, !327}
!400 = !DISubprogram(name: "puts", linkageName: "_ZN8pov_base16TextStreamBuffer4putsEPKc", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 59, type: !398, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!401 = !DISubprogram(name: "putc", linkageName: "_ZN8pov_base16TextStreamBuffer4putcEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 60, type: !402, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !386, !277}
!404 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEPKcmi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 61, type: !405, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !386, !327, !390, !277}
!407 = !DISubprogram(name: "printfile", linkageName: "_ZN8pov_base16TextStreamBuffer9printfileEP7__sFILEi", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 62, type: !408, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !386, !410, !277}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !290, line: 153, baseType: !"_ZTS7__sFILE")
!412 = !DISubprogram(name: "flush", linkageName: "_ZN8pov_base16TextStreamBuffer5flushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 63, type: !392, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!413 = !DISubprogram(name: "lineoutput", linkageName: "_ZN8pov_base16TextStreamBuffer10lineoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 65, type: !414, isLocal: false, isDefinition: false, scopeLine: 65, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !386, !327, !352}
!416 = !DISubprogram(name: "directoutput", linkageName: "_ZN8pov_base16TextStreamBuffer12directoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 66, type: !414, isLocal: false, isDefinition: false, scopeLine: 66, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!417 = !DISubprogram(name: "rawoutput", linkageName: "_ZN8pov_base16TextStreamBuffer9rawoutputEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 67, type: !414, isLocal: false, isDefinition: false, scopeLine: 67, containingType: !"_ZTSN8pov_base16TextStreamBufferE", virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagProtected | DIFlagPrototyped, isOptimized: true)
!418 = !DISubprogram(name: "lineflush", linkageName: "_ZN8pov_base16TextStreamBuffer9lineflushEv", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 75, type: !392, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true)
!419 = !DISubprogram(name: "directflush", linkageName: "_ZN8pov_base16TextStreamBuffer11directflushEPKcj", scope: !"_ZTSN8pov_base16TextStreamBufferE", file: !369, line: 76, type: !414, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSData", file: !224, line: 178, size: 128, align: 64, elements: !421, identifier: "_ZTS9POVMSData")
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !"_ZTS9POVMSData", file: !224, line: 180, baseType: !352, size: 32, align: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !"_ZTS9POVMSData", file: !224, line: 181, baseType: !277, size: 32, align: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTS9POVMSData", file: !224, line: 182, baseType: !"_ZTSN9POVMSDataUt_E", size: 64, align: 64, offset: 64)
!425 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTS9POVMSData", file: !224, line: 182, size: 64, align: 64, elements: !426, identifier: "_ZTSN9POVMSDataUt_E")
!426 = !{!427, !428, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !"_ZTSN9POVMSDataUt_E", file: !224, line: 184, baseType: !303, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !"_ZTSN9POVMSDataUt_E", file: !224, line: 185, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSData", size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !"_ZTSN9POVMSDataUt_E", file: !224, line: 186, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS9POVMSNode", size: 64, align: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "POVMSNode", file: !224, line: 190, size: 320, align: 64, elements: !433, identifier: "_ZTS9POVMSNode")
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !"_ZTS9POVMSNode", file: !224, line: 192, baseType: !431, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTS9POVMSNode", file: !224, line: 193, baseType: !431, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !"_ZTS9POVMSNode", file: !224, line: 194, baseType: !352, size: 32, align: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTS9POVMSNode", file: !224, line: 195, baseType: !"_ZTS9POVMSData", size: 128, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHELLRET", scope: !232, file: !231, line: 82, baseType: !"_ZTSN3pov8shellretE")
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "StageName_Struct", scope: !232, file: !231, line: 55, size: 128, align: 64, elements: !440, identifier: "_ZTSN3pov16StageName_StructE")
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "stage_id", scope: !"_ZTSN3pov16StageName_StructE", file: !231, line: 57, baseType: !277, size: 32, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "stage_name", scope: !"_ZTSN3pov16StageName_StructE", file: !231, line: 58, baseType: !312, size: 64, align: 64, offset: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "__less<unsigned int, unsigned int>", scope: !445, file: !444, line: 699, size: 8, align: 8, elements: !448, templateParams: !457, identifier: "_ZTSNSt3__16__lessIjjEE")
!444 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/algorithm", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!445 = !DINamespace(name: "__1", scope: !447, file: !446, line: 369)
!446 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../include/c++/v1/__config", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!447 = !DINamespace(name: "std", scope: null, file: !446, line: 368)
!448 = !{!449}
!449 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt3__16__lessIjjEclERKjS3_", scope: !"_ZTSNSt3__16__lessIjjEE", file: !444, line: 702, type: !450, isLocal: false, isDefinition: false, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !453, !455, !455}
!452 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !"_ZTSNSt3__16__lessIjjEE")
!455 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!457 = !{!458, !459}
!458 = !DITemplateTypeParameter(name: "_T1", type: !352)
!459 = !DITemplateTypeParameter(name: "_T2", type: !352)
!460 = !{!461, !465, !469, !472, !475, !478, !481, !492, !497, !498, !514, !523, !535, !541, !547, !558, !563, !566, !583, !589, !597, !606, !612}
!461 = !DISubprogram(name: "__cxx_global_var_init", scope: !1, file: !1, line: 101, type: !462, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, variables: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{null}
!464 = !{}
!465 = !DISubprogram(name: "DebugTextStreamBuffer", linkageName: "_ZN3pov21DebugTextStreamBufferC2Ev", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 113, type: !360, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::DebugTextStreamBuffer"*)* @_ZN3pov21DebugTextStreamBufferC2Ev, declaration: !359, variables: !466)
!466 = !{!467}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !465, type: !468, flags: DIFlagArtificial | DIFlagObjectPointer)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov21DebugTextStreamBufferE", size: 64, align: 64)
!469 = !DISubprogram(name: "DebugTextStreamBuffer", linkageName: "_ZN3pov21DebugTextStreamBufferC1Ev", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 113, type: !360, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::DebugTextStreamBuffer"*)* @_ZN3pov21DebugTextStreamBufferC1Ev, declaration: !359, variables: !470)
!470 = !{!471}
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 1, scope: !469, type: !468, flags: DIFlagArtificial | DIFlagObjectPointer)
!472 = !DISubprogram(name: "~DebugTextStreamBuffer", linkageName: "_ZN3pov21DebugTextStreamBufferD2Ev", scope: !"_ZTSN3pov21DebugTextStreamBufferE", file: !1, line: 118, type: !360, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void (%"class.pov::DebugTextStreamBuffer"*)* @_ZN3pov21DebugTextStreamBufferD2Ev, declaration: !363, variables: !473)
!473 = !{!474}
