; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/userdisp.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }
%struct.POVMSData = type { i32, i32, %union.anon }
%union.anon = type { i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@_ZN3povL19Display_Width_ScaleE = internal unnamed_addr global double 0.000000e+00, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !88, globals: !147, imports: !152)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/userdisp.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !15, !20, !75, !79, !80, !87, !8}
!4 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 82, size: 64, align: 32, elements: !6, identifier: "_ZTS5div_t")
!5 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !5, line: 83, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !5, line: 84, baseType: !8, size: 32, align: 32, offset: 32)
!10 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 87, size: 128, align: 64, elements: !11, identifier: "_ZTS6ldiv_t")
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !5, line: 88, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !5, line: 89, baseType: !13, size: 64, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !5, line: 93, size: 128, align: 64, elements: !16, identifier: "_ZTS7lldiv_t")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !5, line: 94, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !5, line: 95, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !21, line: 122, size: 1216, align: 64, elements: !22, identifier: "_ZTS7__sFILE")
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !{!23, !26, !27, !28, !30, !31, !32, !33, !35, !39, !45, !54, !60, !61, !63, !64, !68, !72, !73, !74}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !"_ZTS7__sFILE", file: !21, line: 123, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !"_ZTS7__sFILE", file: !21, line: 124, baseType: !8, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !"_ZTS7__sFILE", file: !21, line: 125, baseType: !8, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !"_ZTS7__sFILE", file: !21, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !"_ZTS7__sFILE", file: !21, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !"_ZTS7__sFILE", file: !21, line: 128, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !"_ZTS7__sFILE", file: !21, line: 129, baseType: !8, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !"_ZTS7__sFILE", file: !21, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !"_ZTS7__sFILE", file: !21, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!8, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !"_ZTS7__sFILE", file: !21, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!8, !34, !43, !8}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !"_ZTS7__sFILE", file: !21, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !8}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !21, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !18)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !"_ZTS7__sFILE", file: !21, line: 136, baseType: !55, size: 64, align: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!8, !34, !58, !8}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !"_ZTS7__sFILE", file: !21, line: 139, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !"_ZTS7__sFILE", file: !21, line: 140, baseType: !62, size: 64, align: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTS8__sFILEX", size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !"_ZTS7__sFILE", file: !21, line: 141, baseType: !8, size: 32, align: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !"_ZTS7__sFILE", file: !21, line: 144, baseType: !65, size: 24, align: 8, offset: 928)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 24, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !"_ZTS7__sFILE", file: !21, line: 145, baseType: !69, size: 8, align: 8, offset: 952)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !"_ZTS7__sFILE", file: !21, line: 148, baseType: !"_ZTS6__sbuf", size: 128, align: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !"_ZTS7__sFILE", file: !21, line: 151, baseType: !8, size: 32, align: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !"_ZTS7__sFILE", file: !21, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !21, line: 88, size: 128, align: 64, elements: !76, identifier: "_ZTS6__sbuf")
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !"_ZTS6__sbuf", file: !21, line: 89, baseType: !24, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !"_ZTS6__sbuf", file: !21, line: 90, baseType: !8, size: 32, align: 32, offset: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !21, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !81, identifier: "_ZTS13__va_list_tag")
!81 = !{!82, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !83, size: 32, align: 32)
!83 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !83, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !"_ZTS13__va_list_tag", file: !1, baseType: !34, size: 64, align: 64, offset: 128)
!87 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!88 = !{!89, !97, !103, !104, !121, !135}
!89 = !DISubprogram(name: "POV_Std_Display_Init", linkageName: "_ZN3pov20POV_Std_Display_InitEii", scope: !90, file: !1, line: 53, type: !92, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @_ZN3pov20POV_Std_Display_InitEii, variables: !94)
!90 = !DINamespace(name: "pov", scope: null, file: !91, line: 36)
!91 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!92 = !DISubroutineType(types: !93)
!93 = !{!8, !8, !8}
!94 = !{!95, !96}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 1, scope: !89, file: !1, line: 53, type: !8)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !89, file: !1, line: 53, type: !8)
!97 = !DISubprogram(name: "POV_Std_Display_Finished", linkageName: "_ZN3pov24POV_Std_Display_FinishedEv", scope: !90, file: !1, line: 67, type: !98, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov24POV_Std_Display_FinishedEv, variables: !100)
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !{!101}
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !97, file: !1, line: 69, type: !102)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24, align: 8, elements: !66)
!103 = !DISubprogram(name: "POV_Std_Display_Close", linkageName: "_ZN3pov21POV_Std_Display_CloseEv", scope: !90, file: !1, line: 81, type: !98, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov21POV_Std_Display_CloseEv, variables: !2)
!104 = !DISubprogram(name: "POV_Std_Display_Plot", linkageName: "_ZN3pov20POV_Std_Display_PlotEiijjjj", scope: !90, file: !1, line: 89, type: !105, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32)* @_ZN3pov20POV_Std_Display_PlotEiijjjj, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !8, !8, !83, !83, !83, !83}
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !104, file: !1, line: 89, type: !8)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !104, file: !1, line: 89, type: !8)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 3, scope: !104, file: !1, line: 89, type: !83)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 4, scope: !104, file: !1, line: 89, type: !83)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 5, scope: !104, file: !1, line: 89, type: !83)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, arg: 6, scope: !104, file: !1, line: 89, type: !83)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sx", scope: !104, file: !1, line: 91, type: !8)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sy", scope: !104, file: !1, line: 92, type: !8)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "I", scope: !104, file: !1, line: 93, type: !44)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "G", scope: !104, file: !1, line: 94, type: !118)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 48, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 6)
