; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/vbuffer.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Project_Tree_Node_Struct" = type { i16, %"struct.pov::BBox_Tree_Struct"*, %"struct.pov::Project_Struct", i16, %"struct.pov::Project_Tree_Node_Struct"** }
%"struct.pov::BBox_Tree_Struct" = type { i16, i16, %"struct.pov::Bounding_Box_Struct", %"struct.pov::BBox_Tree_Struct"** }
%"struct.pov::Bounding_Box_Struct" = type { [3 x float], [3 x float] }
%"struct.pov::Project_Struct" = type { i32, i32, i32, i32 }
%"struct.pov::Project_Queue_Struct" = type { i32, i32, %"struct.pov::Project_Tree_Node_Struct"** }
%"struct.pov::OPTIONS_STRUCT" = type { i32, i8, i8, i8, i32, i32, [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], [1024 x i8], float, float, i32, i32, double, double, i32, [25 x i8*], i32, i32, i32, double, double, i32, i32, double, double, i32, i8, i64, i32, i32, i32, %"struct.pov::FRAMESEQ", double, i64, double, double, double, double, double, i64, i32, i64, i32, i32, i32, i32, i32, i32, double, double, double, i32, i32, i8*, i8*, i32, i8, double, double, i32, i32, i8, i32, i32, [1024 x i8], [6 x %"struct.pov::shelldata"], [1024 x i8], [1024 x i8], i32, i32, i64, i32, i32, i32, %struct.POVMSData }
%"struct.pov::FRAMESEQ" = type { i32, double, i32, i32, double, i32, i32, double, i32, double, i32, double, i8, i8 }
%"struct.pov::shelldata" = type { i32, i32, [250 x i8] }

!98 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90)
!99 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91)
!100 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92)
!101 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93)
!102 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94)
!103 = !DIEnumerator(name: "VBuffer_Tests", value: 95)
!104 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96)
!105 = !DIEnumerator(name: "LBuffer_Tests", value: 97)
!106 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98)
!107 = !DIEnumerator(name: "Media_Samples", value: 99)
!108 = !DIEnumerator(name: "Media_Intervals", value: 100)
!109 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101)
!110 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102)
!111 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103)
!112 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104)
!113 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105)
!114 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106)
!115 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107)
!116 = !DIEnumerator(name: "nChecked", value: 108)
!117 = !DIEnumerator(name: "nEnqueued", value: 109)
!118 = !DIEnumerator(name: "totalQueues", value: 110)
!119 = !DIEnumerator(name: "totalQueueResets", value: 111)
!120 = !DIEnumerator(name: "totalQueueResizes", value: 112)
!121 = !DIEnumerator(name: "Polynomials_Tested", value: 113)
!122 = !DIEnumerator(name: "Roots_Eliminated", value: 114)
!123 = !DIEnumerator(name: "MemStat_Smallest_Alloc", value: 115)
!124 = !DIEnumerator(name: "MemStat_Largest_Alloc", value: 116)
!125 = !DIEnumerator(name: "MemStat_Largest_Mem_Usage", value: 117)
!126 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 118)
!127 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 119)
!128 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 120)
!129 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 121)
!130 = !DIEnumerator(name: "Priority_Queue_Add", value: 122)
!131 = !DIEnumerator(name: "Priority_Queue_Remove", value: 123)
!132 = !DIEnumerator(name: "Gather_Performed_Count", value: 124)
!133 = !DIEnumerator(name: "Gather_Expanded_Count", value: 125)
!134 = !DIEnumerator(name: "MaxStat", value: 126)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !136, line: 54, size: 32, align: 32, elements: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/povmsend.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!138 = !DIEnumerator(name: "PROGRESS_CREATING_BOUNDING_SLABS", value: 1)
!139 = !DIEnumerator(name: "PROGRESS_CREATING_VISTA_BUFFER", value: 2)
!140 = !DIEnumerator(name: "PROGRESS_CREATE_LIGHT_BUFFERS", value: 3)
!141 = !DIEnumerator(name: "PROGRESS_BUILDING_PHOTON_MAPS", value: 4)
!142 = !DIEnumerator(name: "PROGRESS_LOADING_PHOTON_MAPS", value: 5)
!143 = !DIEnumerator(name: "PROGRESS_SAVING_PHOTON_MAPS", value: 6)
!144 = !DIEnumerator(name: "PROGRESS_SORTING_PHOTONS", value: 7)
!145 = !DIEnumerator(name: "PROGRESS_RECLAIMING_MEMORY", value: 8)
!146 = !DIEnumerator(name: "PROGRESS_WRITE_INI_FILE", value: 9)
!147 = !DIEnumerator(name: "PROGRESS_WRITE_HISTOGRAM_FILE", value: 10)
!148 = !DIEnumerator(name: "PROGRESS_PERFORMING_SHELLOUT_COMMAND", value: 11)
!149 = !DIEnumerator(name: "PROGRESS_RESUMING_INTERRUPTED_TRACE", value: 12)
!150 = !DIEnumerator(name: "PROGRESS_PROCESSING_FRAME", value: 13)
!151 = !DIEnumerator(name: "PROGRESS_PARSING", value: 14)
!152 = !DIEnumerator(name: "PROGRESS_DISPLAYING", value: 15)
!153 = !DIEnumerator(name: "PROGRESS_RENDERING", value: 16)
!154 = !DIEnumerator(name: "PROGRESS_DONE_TRACING", value: 17)
!155 = !DIEnumerator(name: "PROGRESS_ABORTING_RENDER", value: 18)
!156 = !DIEnumerator(name: "PROGRESS_USER_ABORT", value: 19)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !158, line: 701, size: 32, align: 32, elements: !159)
!158 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIEnumerator(name: "pRED", value: 0)
!161 = !DIEnumerator(name: "pGREEN", value: 1)
!162 = !DIEnumerator(name: "pBLUE", value: 2)
!163 = !DIEnumerator(name: "pFILTER", value: 3)
!164 = !DIEnumerator(name: "pTRANSM", value: 4)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !158, line: 692, size: 32, align: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIEnumerator(name: "X", value: 0)
!168 = !DIEnumerator(name: "Y", value: 1)
!169 = !DIEnumerator(name: "Z", value: 2)
!170 = !DIEnumerator(name: "T", value: 3)
!171 = !{!172, !178, !183, !188, !202, !211, !221, !3, !227, !243, !262, !293, !313, !318, !331, !341, !347, !362, !377, !401, !407, !417, !425, !449, !456, !468, !474, !480, !484, !488, !493, !504, !514, !523, !527, !549, !600, !608, !629, !637, !658, !676, !680, !684, !689, !699, !709, !718, !722, !749, !802, !820, !824, !828, !833, !843, !853, !862, !866, !884, !888, !892, !897, !907, !917, !926, !930, !939, !945, !399, !199, !200, !447, !947, !964, !983, !176, !985, !1007, !1038, !1043, !1051, !1053, !1081, !1083, !1106}
!172 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 82, size: 64, align: 32, elements: !174, identifier: "_ZTS5div_t")
!173 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !173, line: 83, baseType: !176, size: 32, align: 32)
!176 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !173, line: 84, baseType: !176, size: 32, align: 32, offset: 32)
!178 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 87, size: 128, align: 64, elements: !179, identifier: "_ZTS6ldiv_t")
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !173, line: 88, baseType: !181, size: 64, align: 64)
!181 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !173, line: 89, baseType: !181, size: 64, align: 64, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 93, size: 128, align: 64, elements: !184, identifier: "_ZTS7lldiv_t")
!184 = !{!185, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !173, line: 94, baseType: !186, size: 64, align: 64)
!186 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !173, line: 95, baseType: !186, size: 64, align: 64, offset: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !5, file: !158, line: 1557, size: 384, align: 64, elements: !189, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!189 = !{!190, !192, !195, !197, !198}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !158, line: 1559, baseType: !191, size: 16, align: 16)
!191 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !158, line: 1560, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !5, file: !158, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !158, line: 1561, baseType: !196, size: 128, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !5, file: !158, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !158, line: 1562, baseType: !191, size: 16, align: 16, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !158, line: 1563, baseType: !199, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !158, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !5, file: !158, line: 1534, size: 320, align: 64, elements: !203, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!203 = !{!204, !206, !207, !209}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !158, line: 1536, baseType: !205, size: 16, align: 16)
!205 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !158, line: 1537, baseType: !205, size: 16, align: 16, offset: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !158, line: 1538, baseType: !208, size: 192, align: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !158, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !158, line: 1539, baseType: !210, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !158, line: 876, size: 192, align: 32, elements: !212, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!212 = !{!213, !220}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !158, line: 878, baseType: !214, size: 96, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !158, line: 872, baseType: !215)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 96, align: 32, elements: !218)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !158, line: 870, baseType: !217)
!217 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!218 = !{!219}
!219 = !DISubrange(count: 3)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !158, line: 878, baseType: !214, size: 96, align: 32, offset: 96)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !158, line: 1545, size: 128, align: 32, elements: !222, identifier: "_ZTSN3pov14Project_StructE")
!222 = !{!223, !224, !225, !226}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !176, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !176, size: 32, align: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !176, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !158, line: 1547, baseType: !176, size: 32, align: 32, offset: 96)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !158, line: 1783, size: 6848, align: 64, elements: !228, identifier: "_ZTSN3pov10Ray_StructE")
!228 = !{!229, !233, !234, !235, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1785, baseType: !230, size: 192, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !158, line: 677, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 192, align: 64, elements: !218)
!232 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1786, baseType: !230, size: 192, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1787, baseType: !176, size: 32, align: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1788, baseType: !236, size: 32, align: 32, offset: 416)
!236 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !158, line: 1789, baseType: !238, size: 6400, align: 64, offset: 448)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 6400, align: 64, elements: !241)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !158, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!241 = !{!242}
!242 = !DISubrange(count: 100)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !158, line: 1112, size: 512, align: 64, elements: !244, identifier: "_ZTSN3pov15Interior_StructE")
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !259}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1114, baseType: !176, size: 32, align: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1115, baseType: !176, size: 32, align: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1115, baseType: !176, size: 32, align: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1116, baseType: !217, size: 32, align: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1116, baseType: !217, size: 32, align: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1117, baseType: !217, size: 32, align: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1117, baseType: !217, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1118, baseType: !217, size: 32, align: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1118, baseType: !217, size: 32, align: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1119, baseType: !255, size: 160, align: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !158, line: 681, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 160, align: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 5)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !158, line: 1120, baseType: !260, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !158, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !158, line: 1069, size: 1728, align: 64, elements: !263, identifier: "_ZTSN3pov12Media_StructE")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !286, !287, !288, !289, !292}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1071, baseType: !176, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1072, baseType: !176, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1073, baseType: !176, size: 32, align: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1074, baseType: !176, size: 32, align: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1075, baseType: !176, size: 32, align: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1076, baseType: !232, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1077, baseType: !176, size: 32, align: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1078, baseType: !232, size: 64, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1078, baseType: !232, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1079, baseType: !176, size: 32, align: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1080, baseType: !176, size: 32, align: 32, offset: 480)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1081, baseType: !176, size: 32, align: 32, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1082, baseType: !176, size: 32, align: 32, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1083, baseType: !255, size: 160, align: 32, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1084, baseType: !255, size: 160, align: 32, offset: 736)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1085, baseType: !255, size: 160, align: 32, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1086, baseType: !255, size: 160, align: 32, offset: 1056)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1088, baseType: !232, size: 64, align: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1089, baseType: !232, size: 64, align: 64, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1090, baseType: !232, size: 64, align: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1091, baseType: !285, size: 64, align: 64, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1093, baseType: !232, size: 64, align: 64, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1094, baseType: !176, size: 32, align: 32, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1095, baseType: !176, size: 32, align: 32, offset: 1568)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1097, baseType: !290, size: 64, align: 64, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !158, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !158, line: 1099, baseType: !260, size: 64, align: 64, offset: 1664)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !158, line: 1328, size: 1472, align: 64, elements: !294, identifier: "_ZTSN3pov14Pigment_StructE")
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !305, !308, !311, !312}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !191, size: 16, align: 16)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !191, size: 16, align: 16, offset: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !191, size: 16, align: 16, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !176, size: 32, align: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !217, size: 32, align: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !217, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !217, size: 32, align: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !303, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !158, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !306, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !158, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !309, size: 64, align: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !158, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !158, line: 1331, baseType: !255, size: 160, align: 32, offset: 1280)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !158, line: 1373, size: 192, align: 64, elements: !314, identifier: "_ZTSN3pov12Warps_StructE")
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !191, size: 16, align: 16)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !303, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !158, line: 1375, baseType: !303, size: 64, align: 64, offset: 128)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !158, line: 1323, size: 1280, align: 64, elements: !319, identifier: "_ZTSN3pov14Pattern_StructE")
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !191, size: 16, align: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !191, size: 16, align: 16, offset: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !191, size: 16, align: 16, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !176, size: 32, align: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !217, size: 32, align: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !217, size: 32, align: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !217, size: 32, align: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !303, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !306, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !309, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !158, line: 1045, size: 128, align: 64, elements: !332, identifier: "_ZTSN3pov16Blend_Map_StructE")
!332 = !{!333, !334, !335, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1047, baseType: !176, size: 32, align: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1048, baseType: !205, size: 16, align: 16, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1049, baseType: !336, size: 8, align: 8, offset: 48)
!336 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1049, baseType: !336, size: 8, align: 8, offset: 56)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !158, line: 1050, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !158, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !158, line: 1031, size: 256, align: 64, elements: !342, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!342 = !{!343, !344, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1033, baseType: !217, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1034, baseType: !345, size: 8, align: 8, offset: 32)
!345 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!347 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !158, line: 1035, size: 192, align: 64, elements: !348, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!348 = !{!349, !350, !351, !354, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1037, baseType: !255, size: 160, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1038, baseType: !290, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1039, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !158, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1040, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !158, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !158, line: 1041, baseType: !358, size: 128, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !158, line: 676, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, align: 64, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 2)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !158, line: 1334, size: 1344, align: 64, elements: !363, identifier: "_ZTSN3pov14Tnormal_StructE")
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !191, size: 16, align: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !191, size: 16, align: 16, offset: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !191, size: 16, align: 16, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !176, size: 32, align: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !217, size: 32, align: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !217, size: 32, align: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !217, size: 32, align: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !303, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !306, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !309, size: 64, align: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1337, baseType: !217, size: 32, align: 32, offset: 1280)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1338, baseType: !217, size: 32, align: 32, offset: 1312)
!377 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !158, line: 1336, size: 896, align: 64, elements: !378, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!378 = !{!379, !382, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !158, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !158, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !217, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !290, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !158, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !158, line: 1269, size: 128, align: 64, elements: !402, identifier: "_ZTSN3pov19Density_file_StructE")
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !158, line: 1271, baseType: !176, size: 32, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !158, line: 1272, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !158, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !158, line: 1275, size: 320, align: 64, elements: !408, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!408 = !{!409, !410, !412, !413, !414, !415, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1277, baseType: !176, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1278, baseType: !411, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !176, size: 32, align: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !176, size: 32, align: 32, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1279, baseType: !176, size: 32, align: 32, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1280, baseType: !176, size: 32, align: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!417 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !158, line: 1281, size: 64, align: 64, elements: !418, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!418 = !{!419, !421, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1283, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1284, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !158, line: 1285, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !158, line: 1220, size: 960, align: 64, elements: !426, identifier: "_ZTSN3pov12Image_StructE")
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !446, !448}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1222, baseType: !176, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1223, baseType: !176, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1224, baseType: !176, size: 32, align: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1225, baseType: !176, size: 32, align: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1226, baseType: !176, size: 32, align: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1227, baseType: !176, size: 32, align: 32, offset: 160)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1227, baseType: !176, size: 32, align: 32, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1228, baseType: !205, size: 16, align: 16, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1229, baseType: !336, size: 8, align: 8, offset: 240)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1230, baseType: !336, size: 8, align: 8, offset: 248)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1231, baseType: !230, size: 192, align: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1232, baseType: !217, size: 32, align: 32, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1232, baseType: !217, size: 32, align: 32, offset: 480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1233, baseType: !358, size: 128, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1234, baseType: !232, size: 64, align: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1234, baseType: !232, size: 64, align: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1235, baseType: !444, size: 64, align: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !158, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1236, baseType: !447, size: 64, align: 64, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !158, line: 1161, size: 80, align: 16, elements: !450, identifier: "_ZTSN3pov19Image_Colour_StructE")
!450 = !{!451, !452, !453, !454, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !191, size: 16, align: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !191, size: 16, align: 16, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !191, size: 16, align: 16, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !191, size: 16, align: 16, offset: 48)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !158, line: 1163, baseType: !191, size: 16, align: 16, offset: 64)
!456 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !158, line: 1237, size: 64, align: 64, elements: !457, identifier: "_ZTSN3pov12Image_StructUt_E")
!457 = !{!458, !461, !464, !466}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1239, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !158, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1240, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !158, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1241, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !158, line: 1242, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !158, line: 1166, size: 256, align: 64, elements: !469, identifier: "_ZTSN3pov18Image8_Line_StructE")
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !420, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !420, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !420, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !158, line: 1168, baseType: !420, size: 64, align: 64, offset: 192)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !158, line: 1171, size: 256, align: 64, elements: !475, identifier: "_ZTSN3pov19Image16_Line_StructE")
!475 = !{!476, !477, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !422, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !422, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !422, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !158, line: 1173, baseType: !422, size: 64, align: 64, offset: 192)
!480 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 256, align: 64, elements: !481, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !158, line: 1336, baseType: !217, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64, offset: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 64, align: 32, elements: !485, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !158, line: 1336, baseType: !217, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !158, line: 1336, baseType: !217, size: 32, align: 32, offset: 32)
!488 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 320, align: 64, elements: !489, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64, offset: 128)
!493 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 896, align: 64, elements: !494, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!494 = !{!495, !496, !497, !498, !499, !500, !502, !503}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !501, size: 64, align: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !176, size: 32, align: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64, offset: 704)
!504 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 832, align: 64, elements: !505, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !230, size: 192, align: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16, offset: 400)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !358, size: 128, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !158, line: 1336, baseType: !358, size: 128, align: 64, offset: 704)
!514 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 384, align: 64, elements: !515, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!515 = !{!516, !517, !518, !519, !520, !521, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !358, size: 128, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16, offset: 144)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !205, size: 16, align: 16, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !232, size: 64, align: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !158, line: 1336, baseType: !176, size: 32, align: 32, offset: 320)
!523 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !158, line: 1336, size: 128, align: 64, elements: !524, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !158, line: 1336, baseType: !447, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !158, line: 1336, baseType: !447, size: 64, align: 64, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !158, line: 1521, size: 960, align: 64, elements: !528, identifier: "_ZTSN3pov13Object_StructE")
!528 = !{!529, !532, !533, !534, !535, !536, !537, !538, !539, !542, !543, !546, !547, !548}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !158, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !176, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !399, size: 64, align: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !355, size: 64, align: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !355, size: 64, align: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !239, size: 64, align: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !399, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !399, size: 64, align: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !540, size: 64, align: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !158, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!542 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !208, size: 192, align: 32, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !544, size: 64, align: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !158, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!546 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !544, size: 64, align: 64, offset: 832)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !217, size: 32, align: 32, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !158, line: 1523, baseType: !236, size: 32, align: 32, offset: 928)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !158, line: 1503, size: 704, align: 64, elements: !550, identifier: "_ZTSN3pov13Method_StructE")
!550 = !{!551, !560, !565, !572, !574, !579, !584, !586, !588, !593, !598}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1505, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !158, line: 1420, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!176, !399, !556, !558}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !158, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !158, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1506, baseType: !561, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !158, line: 1421, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!176, !285, !399}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1507, baseType: !566, size: 64, align: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !158, line: 1422, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !285, !399, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !158, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!572 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1508, baseType: !573, size: 64, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !158, line: 1423, baseType: !567)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1509, baseType: !575, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !158, line: 1424, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!447, !399}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1510, baseType: !580, size: 64, align: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !158, line: 1425, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !399, !285, !544}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1511, baseType: !585, size: 64, align: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !158, line: 1426, baseType: !581)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1512, baseType: !587, size: 64, align: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !158, line: 1427, baseType: !581)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1513, baseType: !589, size: 64, align: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !158, line: 1428, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !399, !544}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1514, baseType: !594, size: 64, align: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !158, line: 1429, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !399}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !158, line: 1515, baseType: !599, size: 64, align: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !158, line: 1430, baseType: !595)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !158, line: 1621, size: 192, align: 64, elements: !601, identifier: "_ZTSN3pov13istack_structE")
!601 = !{!602, !604, !606, !607}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !158, line: 1623, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !158, line: 1624, baseType: !605, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !158, line: 1625, baseType: !236, size: 32, align: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !158, line: 1626, baseType: !236, size: 32, align: 32, offset: 160)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !158, line: 1596, size: 1600, align: 64, elements: !609, identifier: "_ZTSN3pov10istk_entryE")
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1598, baseType: !232, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1599, baseType: !230, size: 192, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1600, baseType: !230, size: 192, align: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1601, baseType: !230, size: 192, align: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1602, baseType: !358, size: 128, align: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1603, baseType: !399, size: 64, align: 64, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1610, baseType: !176, size: 32, align: 32, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1610, baseType: !176, size: 32, align: 32, offset: 864)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1611, baseType: !232, size: 64, align: 64, offset: 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1611, baseType: !232, size: 64, align: 64, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1612, baseType: !232, size: 64, align: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1612, baseType: !232, size: 64, align: 64, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1613, baseType: !232, size: 64, align: 64, offset: 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1613, baseType: !232, size: 64, align: 64, offset: 1216)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1614, baseType: !232, size: 64, align: 64, offset: 1280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1614, baseType: !232, size: 64, align: 64, offset: 1344)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1614, baseType: !232, size: 64, align: 64, offset: 1408)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1616, baseType: !447, size: 64, align: 64, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !158, line: 1618, baseType: !447, size: 64, align: 64, offset: 1536)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !158, line: 1002, size: 2048, align: 64, elements: !630, identifier: "_ZTSN3pov16Transform_StructE")
!630 = !{!631, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !158, line: 1004, baseType: !632, size: 1024, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !158, line: 679, baseType: !633)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 1024, align: 64, elements: !634)
!634 = !{!635, !635}
!635 = !DISubrange(count: 4)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !158, line: 1005, baseType: !632, size: 1024, align: 64, offset: 1024)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !158, line: 1345, size: 1664, align: 64, elements: !638, identifier: "_ZTSN3pov14Texture_StructE")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !656, !657}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !191, size: 16, align: 16)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !191, size: 16, align: 16, offset: 16)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !191, size: 16, align: 16, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !176, size: 32, align: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !217, size: 32, align: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !217, size: 32, align: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !217, size: 32, align: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !303, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !306, size: 64, align: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !309, size: 64, align: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, baseType: !355, size: 64, align: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1348, baseType: !290, size: 64, align: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1349, baseType: !352, size: 64, align: 64, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1350, baseType: !654, size: 64, align: 64, offset: 1472)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !158, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1351, baseType: !355, size: 64, align: 64, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1352, baseType: !176, size: 32, align: 32, offset: 1600)
!658 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !158, line: 1347, size: 896, align: 64, elements: !659, identifier: "_ZTSN3pov14Texture_StructUt_E")
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !380, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !383, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !217, size: 32, align: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !290, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, baseType: !399, size: 64, align: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 256, align: 64, elements: !677, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !158, line: 1347, baseType: !217, size: 32, align: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64, offset: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 64, align: 32, elements: !681, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !158, line: 1347, baseType: !217, size: 32, align: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !158, line: 1347, baseType: !217, size: 32, align: 32, offset: 32)
!684 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 320, align: 64, elements: !685, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!685 = !{!686, !687, !688}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64, offset: 128)
!689 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 896, align: 64, elements: !690, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !501, size: 64, align: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !176, size: 32, align: 32, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64, offset: 704)
!699 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 832, align: 64, elements: !700, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !230, size: 192, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16, offset: 400)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !358, size: 128, align: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !158, line: 1347, baseType: !358, size: 128, align: 64, offset: 704)
!709 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 384, align: 64, elements: !710, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!710 = !{!711, !712, !713, !714, !715, !716, !717}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !358, size: 128, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16, offset: 144)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !205, size: 16, align: 16, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !232, size: 64, align: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !158, line: 1347, baseType: !176, size: 32, align: 32, offset: 320)
!718 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !158, line: 1347, size: 128, align: 64, elements: !719, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !158, line: 1347, baseType: !447, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !158, line: 1347, baseType: !447, size: 64, align: 64, offset: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !158, line: 1356, size: 928, align: 32, elements: !723, identifier: "_ZTSN3pov13Finish_StructE")
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !743, !744, !745, !746, !747, !748}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1358, baseType: !217, size: 32, align: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1358, baseType: !217, size: 32, align: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1359, baseType: !217, size: 32, align: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1359, baseType: !217, size: 32, align: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1360, baseType: !217, size: 32, align: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1360, baseType: !217, size: 32, align: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1361, baseType: !217, size: 32, align: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1361, baseType: !217, size: 32, align: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1361, baseType: !217, size: 32, align: 32, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !217, size: 32, align: 32, offset: 288)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !217, size: 32, align: 32, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !217, size: 32, align: 32, offset: 352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !217, size: 32, align: 32, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1362, baseType: !217, size: 32, align: 32, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1363, baseType: !217, size: 32, align: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1363, baseType: !217, size: 32, align: 32, offset: 480)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1364, baseType: !741, size: 96, align: 32, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !158, line: 682, baseType: !742)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 96, align: 32, elements: !218)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1364, baseType: !741, size: 96, align: 32, offset: 608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1364, baseType: !741, size: 96, align: 32, offset: 704)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1365, baseType: !217, size: 32, align: 32, offset: 800)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1366, baseType: !176, size: 32, align: 32, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1367, baseType: !217, size: 32, align: 32, offset: 864)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !158, line: 1368, baseType: !176, size: 32, align: 32, offset: 896)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !158, line: 1566, size: 3456, align: 64, elements: !750, identifier: "_ZTSN3pov19Light_Source_StructE")
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !795, !796, !797, !798}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !530, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !176, size: 32, align: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !399, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !355, size: 64, align: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !355, size: 64, align: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !239, size: 64, align: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !399, size: 64, align: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !399, size: 64, align: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !540, size: 64, align: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !208, size: 192, align: 32, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !544, size: 64, align: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !544, size: 64, align: 64, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !217, size: 32, align: 32, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !236, size: 32, align: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1568, baseType: !399, size: 64, align: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1569, baseType: !255, size: 160, align: 32, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !230, size: 192, align: 64, offset: 1216)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !230, size: 192, align: 64, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !230, size: 192, align: 64, offset: 1600)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !230, size: 192, align: 64, offset: 1792)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1570, baseType: !230, size: 192, align: 64, offset: 1984)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1571, baseType: !232, size: 64, align: 64, offset: 2176)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1571, baseType: !232, size: 64, align: 64, offset: 2240)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1571, baseType: !232, size: 64, align: 64, offset: 2304)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1572, baseType: !232, size: 64, align: 64, offset: 2368)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1572, baseType: !232, size: 64, align: 64, offset: 2432)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1573, baseType: !540, size: 64, align: 64, offset: 2496)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1574, baseType: !345, size: 8, align: 8, offset: 2560)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1574, baseType: !345, size: 8, align: 8, offset: 2568)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1574, baseType: !345, size: 8, align: 8, offset: 2576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1575, baseType: !782, size: 8, align: 8, offset: 2584)
!782 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1576, baseType: !782, size: 8, align: 8, offset: 2592)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1577, baseType: !345, size: 8, align: 8, offset: 2600)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1577, baseType: !345, size: 8, align: 8, offset: 2608)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1578, baseType: !345, size: 8, align: 8, offset: 2616)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1579, baseType: !176, size: 32, align: 32, offset: 2624)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1579, baseType: !176, size: 32, align: 32, offset: 2656)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1580, baseType: !176, size: 32, align: 32, offset: 2688)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1581, baseType: !176, size: 32, align: 32, offset: 2720)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1582, baseType: !176, size: 32, align: 32, offset: 2752)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1583, baseType: !793, size: 64, align: 64, offset: 2816)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1584, baseType: !399, size: 64, align: 64, offset: 2880)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1584, baseType: !399, size: 64, align: 64, offset: 2944)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1585, baseType: !309, size: 64, align: 64, offset: 3008)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !"_ZTSN3pov19Light_Source_StructE", file: !158, line: 1586, baseType: !799, size: 384, align: 64, offset: 3072)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 384, align: 64, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 6)
!802 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pattern_StructE", file: !158, line: 1325, size: 896, align: 64, elements: !803, identifier: "_ZTSN3pov14Pattern_StructUt_E")
