; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/vlbuffer.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Project_Queue_Struct" = type { i32, i32, %"struct.pov::Project_Tree_Node_Struct"** }
%"struct.pov::Project_Tree_Node_Struct" = type { i16, %"struct.pov::BBox_Tree_Struct"*, %"struct.pov::Project_Struct", i16, %"struct.pov::Project_Tree_Node_Struct"** }
%"struct.pov::BBox_Tree_Struct" = type { i16, i16, %"struct.pov::Bounding_Box_Struct", %"struct.pov::BBox_Tree_Struct"** }
%"struct.pov::Bounding_Box_Struct" = type { [3 x float], [3 x float] }
%"struct.pov::Project_Struct" = type { i32, i32, i32, i32 }
%"struct.pov::Priority_Queue_Struct" = type { i32, i32, %"struct.pov::Qelem_Struct"* }
%"struct.pov::Qelem_Struct" = type { double, %"struct.pov::BBox_Tree_Struct"* }

@_ZN3pov10Node_QueueE = global %"struct.pov::Project_Queue_Struct"* null, align 8
@_ZN3pov14VLBuffer_QueueE = global %"struct.pov::Priority_Queue_Struct"* null, align 8
@.str = private unnamed_addr constant [69 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/vlbuffer.cpp\00", align 1
@.str1 = private unnamed_addr constant [30 x i8] c"vista/light buffer node queue\00", align 1
@.str2 = private unnamed_addr constant [21 x i8] c"Node queue overflow.\00", align 1

; Function Attrs: optsize ssp uwtable
define void @_ZN3pov24Initialize_VLBuffer_CodeEv() #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !12, subprograms: !91, globals: !146, imports: !153)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/vlbuffer.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 692, size: 32, align: 32, elements: !7)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "X", value: 0)
!9 = !DIEnumerator(name: "Y", value: 1)
!10 = !DIEnumerator(name: "Z", value: 2)
!11 = !DIEnumerator(name: "T", value: 3)
!12 = !{!13, !19, !24, !29, !39, !50, !59, !69, !75, !83, !88, !36, !90}
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 82, size: 64, align: 32, elements: !15, identifier: "_ZTS5div_t")
!14 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !14, line: 83, baseType: !17, size: 32, align: 32)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !14, line: 84, baseType: !17, size: 32, align: 32, offset: 32)
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 87, size: 128, align: 64, elements: !20, identifier: "_ZTS6ldiv_t")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !14, line: 88, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !14, line: 89, baseType: !22, size: 64, align: 64, offset: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 93, size: 128, align: 64, elements: !25, identifier: "_ZTS7lldiv_t")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !14, line: 94, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !14, line: 95, baseType: !27, size: 64, align: 64, offset: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Queue_Struct", scope: !5, file: !30, line: 90, size: 128, align: 64, elements: !31, identifier: "_ZTSN3pov20Project_Queue_StructE")
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/vlbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !{!32, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "QSize", scope: !"_ZTSN3pov20Project_Queue_StructE", file: !30, line: 92, baseType: !33, size: 32, align: 32)
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Max_QSize", scope: !"_ZTSN3pov20Project_Queue_StructE", file: !30, line: 93, baseType: !33, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Queue", scope: !"_ZTSN3pov20Project_Queue_StructE", file: !30, line: 94, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !5, file: !4, line: 1543, baseType: !"_ZTSN3pov24Project_Tree_Node_StructE")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !5, file: !4, line: 1557, size: 384, align: 64, elements: !40, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!40 = !{!41, !43, !46, !48, !49}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "is_leaf", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1559, baseType: !42, size: 16, align: 16)
!42 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1560, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !5, file: !4, line: 1532, baseType: !"_ZTSN3pov16BBox_Tree_StructE")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Project", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1561, baseType: !47, size: 128, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT", scope: !5, file: !4, line: 1542, baseType: !"_ZTSN3pov14Project_StructE")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1562, baseType: !42, size: 16, align: 16, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !"_ZTSN3pov24Project_Tree_Node_StructE", file: !4, line: 1563, baseType: !36, size: 64, align: 64, offset: 320)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !5, file: !4, line: 1534, size: 320, align: 64, elements: !51, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!51 = !{!52, !54, !55, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1536, baseType: !53, size: 16, align: 16)
!53 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1537, baseType: !53, size: 16, align: 16, offset: 16)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1538, baseType: !56, size: 192, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov16BBox_Tree_StructE", file: !4, line: 1539, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !4, line: 876, size: 192, align: 32, elements: !60, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!60 = !{!61, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !4, line: 878, baseType: !62, size: 96, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !4, line: 872, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 96, align: 32, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !4, line: 870, baseType: !65)
!65 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !"_ZTSN3pov19Bounding_Box_StructE", file: !4, line: 878, baseType: !62, size: 96, align: 32, offset: 96)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Struct", scope: !5, file: !4, line: 1545, size: 128, align: 32, elements: !70, identifier: "_ZTSN3pov14Project_StructE")
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !17, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !17, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !17, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !"_ZTSN3pov14Project_StructE", file: !4, line: 1547, baseType: !17, size: 32, align: 32, offset: 96)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Priority_Queue_Struct", scope: !5, file: !76, line: 71, size: 128, align: 64, elements: !77, identifier: "_ZTSN3pov21Priority_Queue_StructE")
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/bbox.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "QSize", scope: !"_ZTSN3pov21Priority_Queue_StructE", file: !76, line: 73, baseType: !33, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Max_QSize", scope: !"_ZTSN3pov21Priority_Queue_StructE", file: !76, line: 74, baseType: !33, size: 32, align: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Queue", scope: !"_ZTSN3pov21Priority_Queue_StructE", file: !76, line: 75, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "QELEM", scope: !5, file: !76, line: 54, baseType: !"_ZTSN3pov12Qelem_StructE")
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Qelem_Struct", scope: !5, file: !76, line: 65, size: 128, align: 64, elements: !84, identifier: "_ZTSN3pov12Qelem_StructE")
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov12Qelem_StructE", file: !76, line: 67, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !"_ZTSN3pov12Qelem_StructE", file: !76, line: 68, baseType: !44, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_QUEUE", scope: !5, file: !30, line: 81, baseType: !"_ZTSN3pov20Project_Queue_StructE")
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!91 = !{!92, !96, !97, !98, !133, !139}
!92 = !DISubprogram(name: "Initialize_VLBuffer_Code", linkageName: "_ZN3pov24Initialize_VLBuffer_CodeEv", scope: !5, file: !1, line: 101, type: !93, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov24Initialize_VLBuffer_CodeEv, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{null}
!95 = !{}
!96 = !DISubprogram(name: "Reinitialize_VLBuffer_Code", linkageName: "_ZN3pov26Reinitialize_VLBuffer_CodeEv", scope: !5, file: !1, line: 146, type: !93, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov26Reinitialize_VLBuffer_CodeEv, variables: !95)
!97 = !DISubprogram(name: "Deinitialize_VLBuffer_Code", linkageName: "_ZN3pov26Deinitialize_VLBuffer_CodeEv", scope: !5, file: !1, line: 191, type: !93, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_ZN3pov26Deinitialize_VLBuffer_CodeEv, variables: !95)
!98 = !DISubprogram(name: "Clip_Polygon", linkageName: "_ZN3pov12Clip_PolygonEPA3_dPiPKdS4_S4_S4_dddd", scope: !5, file: !1, line: 246, type: !99, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x double]*, i32*, double*, double*, double*, double*, double, double, double, double)* @_ZN3pov12Clip_PolygonEPA3_dPiPKdS4_S4_S4_dddd, variables: !107)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !104, !105, !105, !105, !105, !106, !106, !106, !106}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 677, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192, align: 64, elements: !66)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Points", arg: 1, scope: !98, file: !1, line: 246, type: !101)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "PointCnt", arg: 2, scope: !98, file: !1, line: 246, type: !104)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "VX1", arg: 3, scope: !98, file: !1, line: 246, type: !105)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "VX2", arg: 4, scope: !98, file: !1, line: 246, type: !105)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "VY1", arg: 5, scope: !98, file: !1, line: 246, type: !105)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "VY2", arg: 6, scope: !98, file: !1, line: 246, type: !105)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DX1", arg: 7, scope: !98, file: !1, line: 246, type: !106)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DX2", arg: 8, scope: !98, file: !1, line: 246, type: !106)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DY1", arg: 9, scope: !98, file: !1, line: 246, type: !106)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DY2", arg: 10, scope: !98, file: !1, line: 246, type: !106)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aktd", scope: !98, file: !1, line: 248, type: !86)
