; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/warps.cpp'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.pov::Pattern_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.25 }
%"struct.pov::Warps_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"* }
%"struct.pov::Blend_Map_Struct" = type { i32, i16, i8, i8, %"struct.pov::Blend_Map_Entry"* }
%"struct.pov::Blend_Map_Entry" = type { float, i8, %union.anon }
%union.anon = type { [2 x double], [8 x i8] }
%union.anon.25 = type { %struct.anon.29 }
%struct.anon.29 = type { [3 x double], [3 x double], double, double, i16, [3 x double]*, i32, [3 x double] }
%"struct.pov::Turb_Struct" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"*, [3 x double], i32, float, float }
%"struct.pov::Transform_Struct" = type { [4 x [4 x double]], [4 x [4 x double]] }
%"struct.pov::Repeat_Warp" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"*, i32, float, [3 x double], [3 x double] }
%"struct.pov::Black_Hole_Warp" = type { i16, %"struct.pov::Warps_Struct"*, %"struct.pov::Warps_Struct"*, [3 x double], [3 x double], [3 x double], double, double, double, double, double, i16, i16, i16, i16 }

@_ZN3pov9hashTableE = external global [8192 x i16]

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !66, subprograms: !912, globals: !1106, imports: !1108)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/warps.cpp", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !59}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PATTERN_IDS", scope: !5, file: !4, line: 47, size: 32, align: 32, elements: !7, identifier: "_ZTSN3pov11PATTERN_IDSE")
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pattern.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DINamespace(name: "pov", scope: null, file: !6, line: 36)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/pov_mem.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!8 = !DIEnumerator(name: "NO_PATTERN", value: 0)
!9 = !DIEnumerator(name: "PLAIN_PATTERN", value: 1)
!10 = !DIEnumerator(name: "AVERAGE_PATTERN", value: 2)
!11 = !DIEnumerator(name: "UV_MAP_PATTERN", value: 3)
!12 = !DIEnumerator(name: "BITMAP_PATTERN", value: 4)
!13 = !DIEnumerator(name: "WAVES_PATTERN", value: 5)
!14 = !DIEnumerator(name: "RIPPLES_PATTERN", value: 6)
!15 = !DIEnumerator(name: "WRINKLES_PATTERN", value: 7)
!16 = !DIEnumerator(name: "BUMPS_PATTERN", value: 8)
!17 = !DIEnumerator(name: "QUILTED_PATTERN", value: 9)
!18 = !DIEnumerator(name: "FACETS_PATTERN", value: 10)
!19 = !DIEnumerator(name: "DENTS_PATTERN", value: 11)
!20 = !DIEnumerator(name: "CHECKER_PATTERN", value: 12)
!21 = !DIEnumerator(name: "OBJECT_PATTERN", value: 13)
!22 = !DIEnumerator(name: "BRICK_PATTERN", value: 14)
!23 = !DIEnumerator(name: "HEXAGON_PATTERN", value: 15)
!24 = !DIEnumerator(name: "BOZO_PATTERN", value: 16)
!25 = !DIEnumerator(name: "CELLS_PATTERN", value: 17)
!26 = !DIEnumerator(name: "MARBLE_PATTERN", value: 18)
!27 = !DIEnumerator(name: "WOOD_PATTERN", value: 19)
!28 = !DIEnumerator(name: "SPOTTED_PATTERN", value: 20)
!29 = !DIEnumerator(name: "AGATE_PATTERN", value: 21)
!30 = !DIEnumerator(name: "GRANITE_PATTERN", value: 22)
!31 = !DIEnumerator(name: "GRADIENT_PATTERN", value: 23)
!32 = !DIEnumerator(name: "ONION_PATTERN", value: 24)
!33 = !DIEnumerator(name: "LEOPARD_PATTERN", value: 25)
!34 = !DIEnumerator(name: "JULIA_PATTERN", value: 26)
!35 = !DIEnumerator(name: "JULIA3_PATTERN", value: 27)
!36 = !DIEnumerator(name: "JULIA4_PATTERN", value: 28)
!37 = !DIEnumerator(name: "JULIAX_PATTERN", value: 29)
!38 = !DIEnumerator(name: "MANDEL_PATTERN", value: 30)
!39 = !DIEnumerator(name: "MANDEL3_PATTERN", value: 31)
!40 = !DIEnumerator(name: "MANDEL4_PATTERN", value: 32)
!41 = !DIEnumerator(name: "MANDELX_PATTERN", value: 33)
!42 = !DIEnumerator(name: "MAGNET1M_PATTERN", value: 34)
!43 = !DIEnumerator(name: "MAGNET1J_PATTERN", value: 35)
!44 = !DIEnumerator(name: "MAGNET2M_PATTERN", value: 36)
!45 = !DIEnumerator(name: "MAGNET2J_PATTERN", value: 37)
!46 = !DIEnumerator(name: "RADIAL_PATTERN", value: 38)
!47 = !DIEnumerator(name: "CRACKLE_PATTERN", value: 39)
!48 = !DIEnumerator(name: "SPIRAL1_PATTERN", value: 40)
!49 = !DIEnumerator(name: "SPIRAL2_PATTERN", value: 41)
!50 = !DIEnumerator(name: "PLANAR_PATTERN", value: 42)
!51 = !DIEnumerator(name: "SPHERICAL_PATTERN", value: 43)
!52 = !DIEnumerator(name: "BOXED_PATTERN", value: 44)
!53 = !DIEnumerator(name: "CYLINDRICAL_PATTERN", value: 45)
!54 = !DIEnumerator(name: "DENSITY_FILE_PATTERN", value: 46)
!55 = !DIEnumerator(name: "FUNCTION_PATTERN", value: 47)
!56 = !DIEnumerator(name: "SLOPE_PATTERN", value: 48)
!57 = !DIEnumerator(name: "PIGMENT_PATTERN", value: 49)
!58 = !DIEnumerator(name: "IMAGE_PATTERN", value: 50)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !60, line: 692, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/453.povray/src/frame.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "X", value: 0)
!63 = !DIEnumerator(name: "Y", value: 1)
!64 = !DIEnumerator(name: "Z", value: 2)
!65 = !DIEnumerator(name: "T", value: 3)
!66 = !{!67, !73, !78, !83, !104, !109, !120, !126, !148, !162, !190, !196, !206, !215, !239, !246, !258, !264, !270, !274, !278, !283, !294, !304, !313, !317, !342, !394, !404, !419, !447, !455, !476, !484, !505, !523, !527, !531, !536, !546, !556, !565, !569, !584, !602, !606, !610, !615, !625, !635, !644, !648, !675, !730, !737, !748, !755, !761, !779, !783, !787, !792, !802, !812, !821, !825, !834, !841, !850, !3, !867, !869, !871, !91, !71, !873, !145, !875, !882, !884, !891, !893, !900, !902, !910, !95, !237}
!67 = !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 82, size: 64, align: 32, elements: !69, identifier: "_ZTS5div_t")
!68 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS5div_t", file: !68, line: 83, baseType: !71, size: 32, align: 32)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS5div_t", file: !68, line: 84, baseType: !71, size: 32, align: 32, offset: 32)
!73 = !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 87, size: 128, align: 64, elements: !74, identifier: "_ZTS6ldiv_t")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS6ldiv_t", file: !68, line: 88, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS6ldiv_t", file: !68, line: 89, baseType: !76, size: 64, align: 64, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 93, size: 128, align: 64, elements: !79, identifier: "_ZTS7lldiv_t")
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !"_ZTS7lldiv_t", file: !68, line: 94, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !"_ZTS7lldiv_t", file: !68, line: 95, baseType: !81, size: 64, align: 64, offset: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !5, file: !60, line: 1323, size: 1280, align: 64, elements: !84, identifier: "_ZTSN3pov14Pattern_StructE")
!84 = !{!85, !87, !88, !89, !90, !92, !93, !94, !97, !100, !103}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !86, size: 16, align: 16)
!86 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !86, size: 16, align: 16, offset: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !86, size: 16, align: 16, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !71, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !91, size: 32, align: 32, offset: 96)
!91 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !91, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !91, size: 32, align: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !95, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !5, file: !60, line: 1026, baseType: !"_ZTSN3pov12Warps_StructE")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !5, file: !60, line: 1020, baseType: !"_ZTSN3pov14Pattern_StructE")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !101, size: 64, align: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !5, file: !60, line: 1019, baseType: !"_ZTSN3pov16Blend_Map_StructE")
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pattern_StructE", file: !60, line: 1325, baseType: !"_ZTSN3pov14Pattern_StructUt_E", size: 896, align: 64, offset: 384)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !5, file: !60, line: 1373, size: 192, align: 64, elements: !105, identifier: "_ZTSN3pov12Warps_StructE")
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Warp_Type", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !86, size: 16, align: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Prev_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !95, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Warp", scope: !"_ZTSN3pov12Warps_StructE", file: !60, line: 1375, baseType: !95, size: 64, align: 64, offset: 128)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !5, file: !60, line: 1045, size: 128, align: 64, elements: !110, identifier: "_ZTSN3pov16Blend_Map_StructE")
!110 = !{!111, !112, !114, !116, !117}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1047, baseType: !71, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1048, baseType: !113, size: 16, align: 16, offset: 32)
!113 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !115, size: 8, align: 8, offset: 48)
!115 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1049, baseType: !115, size: 8, align: 8, offset: 56)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !"_ZTSN3pov16Blend_Map_StructE", file: !60, line: 1050, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !5, file: !60, line: 1018, baseType: !"_ZTSN3pov15Blend_Map_EntryE")
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !5, file: !60, line: 1031, size: 256, align: 64, elements: !121, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!121 = !{!122, !123, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1033, baseType: !91, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1034, baseType: !124, size: 8, align: 8, offset: 32)
!124 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1042, baseType: !"_ZTSN3pov15Blend_Map_EntryUt_E", size: 192, align: 64, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov15Blend_Map_EntryE", file: !60, line: 1035, size: 192, align: 64, elements: !127, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!127 = !{!128, !133, !136, !139, !142}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1037, baseType: !129, size: 160, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !5, file: !60, line: 681, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 160, align: 32, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 5)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1038, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !5, file: !60, line: 1022, baseType: !"_ZTSN3pov14Pigment_StructE")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1039, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !5, file: !60, line: 1023, baseType: !"_ZTSN3pov14Tnormal_StructE")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1040, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !60, line: 1021, baseType: !"_ZTSN3pov14Texture_StructE")
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !"_ZTSN3pov15Blend_Map_EntryUt_E", file: !60, line: 1041, baseType: !143, size: 128, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !5, file: !60, line: 676, baseType: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 128, align: 64, elements: !146)
!145 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!146 = !{!147}
!147 = !DISubrange(count: 2)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !5, file: !60, line: 1328, size: 1472, align: 64, elements: !149, identifier: "_ZTSN3pov14Pigment_StructE")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !86, size: 16, align: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !86, size: 16, align: 16, offset: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !86, size: 16, align: 16, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !71, size: 32, align: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !91, size: 32, align: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !91, size: 32, align: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !91, size: 32, align: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !95, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !98, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !101, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_E", size: 896, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1331, baseType: !129, size: 160, align: 32, offset: 1280)
!162 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Pigment_StructE", file: !60, line: 1330, size: 896, align: 64, elements: !163, identifier: "_ZTSN3pov14Pigment_StructUt_E")
!163 = !{!164, !167, !170, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !5, file: !60, line: 1266, baseType: !"_ZTSN3pov19Density_file_StructE")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !5, file: !60, line: 1218, baseType: !"_ZTSN3pov12Image_StructE")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !60, line: 677, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, align: 64, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 3)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !91, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut_E", size: 256, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", size: 64, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", size: 320, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", size: 896, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", size: 832, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", size: 384, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", size: 128, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !134, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !60, line: 664, baseType: !"_ZTSN3pov13Object_StructE")
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !5, file: !60, line: 1269, size: 128, align: 64, elements: !191, identifier: "_ZTSN3pov19Density_file_StructE")
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1271, baseType: !71, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov19Density_file_StructE", file: !60, line: 1272, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE_DATA", scope: !5, file: !60, line: 1267, baseType: !"_ZTSN3pov24Density_file_Data_StructE")
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Data_Struct", scope: !5, file: !60, line: 1275, size: 320, align: 64, elements: !197, identifier: "_ZTSN3pov24Density_file_Data_StructE")
!197 = !{!198, !199, !201, !202, !203, !204, !205}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1277, baseType: !71, size: 32, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1278, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Sx", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !71, size: 32, align: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Sy", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !71, size: 32, align: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Sz", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1279, baseType: !71, size: 32, align: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1280, baseType: !71, size: 32, align: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, baseType: !"_ZTSN3pov24Density_file_Data_StructUt_E", size: 64, align: 64, offset: 256)
!206 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov24Density_file_Data_StructE", file: !60, line: 1281, size: 64, align: 64, elements: !207, identifier: "_ZTSN3pov24Density_file_Data_StructUt_E")
!207 = !{!208, !210, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Density8", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1283, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Density16", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1284, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Density32", scope: !"_ZTSN3pov24Density_file_Data_StructUt_E", file: !60, line: 1285, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !5, file: !60, line: 1220, size: 960, align: 64, elements: !216, identifier: "_ZTSN3pov12Image_StructE")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !236, !238}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1222, baseType: !71, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Map_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1223, baseType: !71, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "File_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1224, baseType: !71, size: 32, align: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Image_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1225, baseType: !71, size: 32, align: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Interpolation_Type", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1226, baseType: !71, size: 32, align: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !71, size: 32, align: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "iheight", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1227, baseType: !71, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map_Size", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1228, baseType: !113, size: 16, align: 16, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Once_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1229, baseType: !115, size: 8, align: 8, offset: 240)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Use_Colour_Flag", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1230, baseType: !115, size: 8, align: 8, offset: 248)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1231, baseType: !171, size: 192, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !91, size: 32, align: 32, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1232, baseType: !91, size: 32, align: 32, offset: 480)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1233, baseType: !143, size: 128, align: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "AllFilter", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !145, size: 64, align: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "AllTransmit", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1234, baseType: !145, size: 64, align: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Colour_Map", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1235, baseType: !234, size: 64, align: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE_COLOUR", scope: !5, file: !60, line: 1155, baseType: !"_ZTSN3pov19Image_Colour_StructE")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1236, baseType: !237, size: 64, align: 64, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1243, baseType: !"_ZTSN3pov12Image_StructUt_E", size: 64, align: 64, offset: 896)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Colour_Struct", scope: !5, file: !60, line: 1161, size: 80, align: 16, elements: !240, identifier: "_ZTSN3pov19Image_Colour_StructE")
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Red", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !86, size: 16, align: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Green", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !86, size: 16, align: 16, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Blue", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !86, size: 16, align: 16, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Filter", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !86, size: 16, align: 16, offset: 48)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Transmit", scope: !"_ZTSN3pov19Image_Colour_StructE", file: !60, line: 1163, baseType: !86, size: 16, align: 16, offset: 64)
!246 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov12Image_StructE", file: !60, line: 1237, size: 64, align: 64, elements: !247, identifier: "_ZTSN3pov12Image_StructUt_E")
!247 = !{!248, !251, !254, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rgb8_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1239, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE8_LINE", scope: !5, file: !60, line: 1157, baseType: !"_ZTSN3pov18Image8_Line_StructE")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rgb16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1240, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE16_LINE", scope: !5, file: !60, line: 1159, baseType: !"_ZTSN3pov19Image16_Line_StructE")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "gray16_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1241, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "map_lines", scope: !"_ZTSN3pov12Image_StructUt_E", file: !60, line: 1242, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image8_Line_Struct", scope: !5, file: !60, line: 1166, size: 256, align: 64, elements: !259, identifier: "_ZTSN3pov18Image8_Line_StructE")
!259 = !{!260, !261, !262, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !209, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !209, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !209, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov18Image8_Line_StructE", file: !60, line: 1168, baseType: !209, size: 64, align: 64, offset: 192)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image16_Line_Struct", scope: !5, file: !60, line: 1171, size: 256, align: 64, elements: !265, identifier: "_ZTSN3pov19Image16_Line_StructE")
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !211, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !211, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !211, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "transm", scope: !"_ZTSN3pov19Image16_Line_StructE", file: !60, line: 1173, baseType: !211, size: 64, align: 64, offset: 192)
!270 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 256, align: 64, elements: !271, identifier: "_ZTSN3pov14Pigment_StructUt_Ut_E")
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !60, line: 1330, baseType: !91, size: 32, align: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 64, align: 32, elements: !275, identifier: "_ZTSN3pov14Pigment_StructUt_Ut0_E")
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !60, line: 1330, baseType: !91, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Pigment_StructUt_Ut0_E", file: !60, line: 1330, baseType: !91, size: 32, align: 32, offset: 32)
!278 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 320, align: 64, elements: !279, identifier: "_ZTSN3pov14Pigment_StructUt_Ut1_E")
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut1_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64, offset: 128)
!283 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 896, align: 64, elements: !284, identifier: "_ZTSN3pov14Pigment_StructUt_Ut2_E")
!284 = !{!285, !286, !287, !288, !289, !290, !292, !293}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !291, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !71, size: 32, align: 32, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Pigment_StructUt_Ut2_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64, offset: 704)
!294 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 832, align: 64, elements: !295, identifier: "_ZTSN3pov14Pigment_StructUt_Ut3_E")
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !171, size: 192, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16, offset: 400)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !143, size: 128, align: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Pigment_StructUt_Ut3_E", file: !60, line: 1330, baseType: !143, size: 128, align: 64, offset: 704)
!304 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 384, align: 64, elements: !305, identifier: "_ZTSN3pov14Pigment_StructUt_Ut4_E")
!305 = !{!306, !307, !308, !309, !310, !311, !312}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !143, size: 128, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16, offset: 144)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !113, size: 16, align: 16, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !145, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Pigment_StructUt_Ut4_E", file: !60, line: 1330, baseType: !71, size: 32, align: 32, offset: 320)
!313 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Pigment_StructUt_E", file: !60, line: 1330, size: 128, align: 64, elements: !314, identifier: "_ZTSN3pov14Pigment_StructUt_Ut5_E")
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !60, line: 1330, baseType: !237, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Pigment_StructUt_Ut5_E", file: !60, line: 1330, baseType: !237, size: 64, align: 64, offset: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !60, line: 1521, size: 960, align: 64, elements: !318, identifier: "_ZTSN3pov13Object_StructE")
!318 = !{!319, !322, !323, !324, !325, !326, !329, !330, !331, !334, !336, !339, !340, !341}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !60, line: 1418, baseType: !"_ZTSN3pov13Method_StructE")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !71, size: 32, align: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !188, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !140, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !140, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !327, size: 64, align: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !60, line: 1110, baseType: !"_ZTSN3pov15Interior_StructE")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !188, size: 64, align: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !188, size: 64, align: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !332, size: 64, align: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !60, line: 1027, baseType: !"_ZTSN3pov19Light_Source_StructE")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !335, size: 192, align: 32, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !60, line: 874, baseType: !"_ZTSN3pov19Bounding_Box_StructE")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !337, size: 64, align: 64, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !60, line: 1000, baseType: !"_ZTSN3pov16Transform_StructE")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !337, size: 64, align: 64, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !91, size: 32, align: 32, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov13Object_StructE", file: !60, line: 1523, baseType: !214, size: 32, align: 32, offset: 928)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !60, line: 1503, size: 704, align: 64, elements: !343, identifier: "_ZTSN3pov13Method_StructE")
!343 = !{!344, !353, !359, !366, !368, !373, !378, !380, !382, !387, !392}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1505, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !5, file: !60, line: 1420, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!71, !188, !349, !351}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !60, line: 666, baseType: !"_ZTSN3pov10Ray_StructE")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !5, file: !60, line: 667, baseType: !"_ZTSN3pov13istack_structE")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1506, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !5, file: !60, line: 1421, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!71, !358, !188}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1507, baseType: !360, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !5, file: !60, line: 1422, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !358, !188, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !5, file: !60, line: 668, baseType: !"_ZTSN3pov10istk_entryE")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1508, baseType: !367, size: 64, align: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !5, file: !60, line: 1423, baseType: !361)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1509, baseType: !369, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !5, file: !60, line: 1424, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!237, !188}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1510, baseType: !374, size: 64, align: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !5, file: !60, line: 1425, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !188, !358, !337}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1511, baseType: !379, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !5, file: !60, line: 1426, baseType: !375)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1512, baseType: !381, size: 64, align: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !5, file: !60, line: 1427, baseType: !375)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1513, baseType: !383, size: 64, align: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !5, file: !60, line: 1428, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !188, !337}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1514, baseType: !388, size: 64, align: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !5, file: !60, line: 1429, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !188}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !"_ZTSN3pov13Method_StructE", file: !60, line: 1515, baseType: !393, size: 64, align: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !5, file: !60, line: 1430, baseType: !389)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !60, line: 1783, size: 6848, align: 64, elements: !395, identifier: "_ZTSN3pov10Ray_StructE")
!395 = !{!396, !397, !398, !399, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1785, baseType: !171, size: 192, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1786, baseType: !171, size: 192, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1787, baseType: !71, size: 32, align: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1788, baseType: !214, size: 32, align: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !"_ZTSN3pov10Ray_StructE", file: !60, line: 1789, baseType: !401, size: 6400, align: 64, offset: 448)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 6400, align: 64, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 100)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !60, line: 1112, size: 512, align: 64, elements: !405, identifier: "_ZTSN3pov15Interior_StructE")
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1114, baseType: !71, size: 32, align: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "hollow", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !71, size: 32, align: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Disp_NElems", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1115, baseType: !71, size: 32, align: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "IOR", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !91, size: 32, align: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Dispersion", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1116, baseType: !91, size: 32, align: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Caustics", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !91, size: 32, align: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Old_Refract", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1117, baseType: !91, size: 32, align: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !91, size: 32, align: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1118, baseType: !91, size: 32, align: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Colour", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1119, baseType: !129, size: 160, align: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "IMedia", scope: !"_ZTSN3pov15Interior_StructE", file: !60, line: 1120, baseType: !417, size: 64, align: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMEDIA", scope: !5, file: !60, line: 1067, baseType: !"_ZTSN3pov12Media_StructE")
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Media_Struct", scope: !5, file: !60, line: 1069, size: 1728, align: 64, elements: !420, identifier: "_ZTSN3pov12Media_StructE")
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1071, baseType: !71, size: 32, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Intervals", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1072, baseType: !71, size: 32, align: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Min_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1073, baseType: !71, size: 32, align: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Samples", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1074, baseType: !71, size: 32, align: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Method", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1075, baseType: !71, size: 32, align: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1076, baseType: !145, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "is_constant", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1077, baseType: !71, size: 32, align: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "Eccentricity", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !145, size: 64, align: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sc_ext", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1078, baseType: !145, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "use_absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1079, baseType: !71, size: 32, align: 32, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "use_emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1080, baseType: !71, size: 32, align: 32, offset: 480)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "use_extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1081, baseType: !71, size: 32, align: 32, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "use_scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1082, baseType: !71, size: 32, align: 32, offset: 544)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Absorption", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1083, baseType: !129, size: 160, align: 32, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1084, baseType: !129, size: 160, align: 32, offset: 736)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Extinction", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1085, baseType: !129, size: 160, align: 32, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Scattering", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1086, baseType: !129, size: 160, align: 32, offset: 1056)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "Ratio", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1088, baseType: !145, size: 64, align: 64, offset: 1216)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "Confidence", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1089, baseType: !145, size: 64, align: 64, offset: 1280)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Variance", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1090, baseType: !145, size: 64, align: 64, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Sample_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1091, baseType: !358, size: 64, align: 64, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Threshold", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1093, baseType: !145, size: 64, align: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "AA_Level", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1094, baseType: !71, size: 32, align: 32, offset: 1536)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_photons", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1095, baseType: !71, size: 32, align: 32, offset: 1568)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Density", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1097, baseType: !134, size: 64, align: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Media", scope: !"_ZTSN3pov12Media_StructE", file: !60, line: 1099, baseType: !417, size: 64, align: 64, offset: 1664)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !5, file: !60, line: 1621, size: 192, align: 64, elements: !448, identifier: "_ZTSN3pov13istack_structE")
!448 = !{!449, !451, !453, !454}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1623, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov13istack_structE", size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1624, baseType: !452, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !"_ZTSN3pov10istk_entryE", size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1625, baseType: !214, size: 32, align: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !"_ZTSN3pov13istack_structE", file: !60, line: 1626, baseType: !214, size: 32, align: 32, offset: 160)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !5, file: !60, line: 1596, size: 1600, align: 64, elements: !456, identifier: "_ZTSN3pov10istk_entryE")
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1598, baseType: !145, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1599, baseType: !171, size: 192, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1600, baseType: !171, size: 192, align: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1601, baseType: !171, size: 192, align: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1602, baseType: !143, size: 128, align: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1603, baseType: !188, size: 64, align: 64, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !71, size: 32, align: 32, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1610, baseType: !71, size: 32, align: 32, offset: 864)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !145, size: 64, align: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1611, baseType: !145, size: 64, align: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !145, size: 64, align: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1612, baseType: !145, size: 64, align: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !145, size: 64, align: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1613, baseType: !145, size: 64, align: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !145, size: 64, align: 64, offset: 1280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !145, size: 64, align: 64, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1614, baseType: !145, size: 64, align: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1616, baseType: !237, size: 64, align: 64, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !"_ZTSN3pov10istk_entryE", file: !60, line: 1618, baseType: !237, size: 64, align: 64, offset: 1536)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !60, line: 1002, size: 2048, align: 64, elements: !477, identifier: "_ZTSN3pov16Transform_StructE")
!477 = !{!478, !483}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1004, baseType: !479, size: 1024, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !5, file: !60, line: 679, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1024, align: 64, elements: !481)
!481 = !{!482, !482}
!482 = !DISubrange(count: 4)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !"_ZTSN3pov16Transform_StructE", file: !60, line: 1005, baseType: !479, size: 1024, align: 64, offset: 1024)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !60, line: 1345, size: 1664, align: 64, elements: !485, identifier: "_ZTSN3pov14Texture_StructE")
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !503, !504}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !86, size: 16, align: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !86, size: 16, align: 16, offset: 16)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !86, size: 16, align: 16, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !71, size: 32, align: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !91, size: 32, align: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !91, size: 32, align: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !91, size: 32, align: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !95, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !98, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !101, size: 64, align: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_E", size: 896, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, baseType: !140, size: 64, align: 64, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1348, baseType: !134, size: 64, align: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1349, baseType: !137, size: 64, align: 64, offset: 1408)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1350, baseType: !501, size: 64, align: 64, offset: 1472)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !5, file: !60, line: 1024, baseType: !"_ZTSN3pov13Finish_StructE")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1351, baseType: !140, size: 64, align: 64, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1352, baseType: !71, size: 32, align: 32, offset: 1600)
!505 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Texture_StructE", file: !60, line: 1347, size: 896, align: 64, elements: !506, identifier: "_ZTSN3pov14Texture_StructUt_E")
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !165, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !168, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !91, size: 32, align: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut_E", size: 256, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut0_E", size: 64, align: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut1_E", size: 320, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut2_E", size: 896, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut3_E", size: 832, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut4_E", size: 384, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !"_ZTSN3pov14Texture_StructUt_Ut5_E", size: 128, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !134, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, baseType: !188, size: 64, align: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 256, align: 64, elements: !524, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !91, size: 32, align: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 64, align: 32, elements: !528, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !91, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Texture_StructUt_Ut0_E", file: !60, line: 1347, baseType: !91, size: 32, align: 32, offset: 32)
!531 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 320, align: 64, elements: !532, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!532 = !{!533, !534, !535}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut1_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64, offset: 128)
!536 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 896, align: 64, elements: !537, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !291, size: 64, align: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !71, size: 32, align: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Texture_StructUt_Ut2_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64, offset: 704)
!546 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 832, align: 64, elements: !547, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !171, size: 192, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16, offset: 400)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !143, size: 128, align: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Texture_StructUt_Ut3_E", file: !60, line: 1347, baseType: !143, size: 128, align: 64, offset: 704)
!556 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 384, align: 64, elements: !557, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!557 = !{!558, !559, !560, !561, !562, !563, !564}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !143, size: 128, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16, offset: 144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !113, size: 16, align: 16, offset: 160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !145, size: 64, align: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Texture_StructUt_Ut4_E", file: !60, line: 1347, baseType: !71, size: 32, align: 32, offset: 320)
!565 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Texture_StructUt_E", file: !60, line: 1347, size: 128, align: 64, elements: !566, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !237, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Texture_StructUt_Ut5_E", file: !60, line: 1347, baseType: !237, size: 64, align: 64, offset: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !5, file: !60, line: 1334, size: 1344, align: 64, elements: !570, identifier: "_ZTSN3pov14Tnormal_StructE")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !86, size: 16, align: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !86, size: 16, align: 16, offset: 16)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !86, size: 16, align: 16, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !71, size: 32, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !91, size: 32, align: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !91, size: 32, align: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !91, size: 32, align: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !95, size: 64, align: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !98, size: 64, align: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !101, size: 64, align: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_E", size: 896, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "Amount", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1337, baseType: !91, size: 32, align: 32, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1338, baseType: !91, size: 32, align: 32, offset: 1312)
!584 = !DICompositeType(tag: DW_TAG_union_type, scope: !"_ZTSN3pov14Tnormal_StructE", file: !60, line: 1336, size: 896, align: 64, elements: !585, identifier: "_ZTSN3pov14Tnormal_StructUt_E")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !165, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !168, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !91, size: 32, align: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", size: 256, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", size: 64, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", size: 320, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", size: 896, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", size: 832, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", size: 384, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", size: 128, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !134, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, baseType: !188, size: 64, align: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 256, align: 64, elements: !603, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut_E")
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !60, line: 1336, baseType: !91, size: 32, align: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64, offset: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 64, align: 32, elements: !607, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut0_E")
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !60, line: 1336, baseType: !91, size: 32, align: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut0_E", file: !60, line: 1336, baseType: !91, size: 32, align: 32, offset: 32)
!610 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 320, align: 64, elements: !611, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut1_E")
!611 = !{!612, !613, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut1_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64, offset: 128)
!615 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 896, align: 64, elements: !616, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut2_E")
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !291, size: 64, align: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !71, size: 32, align: 32, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut2_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64, offset: 704)
!625 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 832, align: 64, elements: !626, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut3_E")
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !171, size: 192, align: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16, offset: 400)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !143, size: 128, align: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut3_E", file: !60, line: 1336, baseType: !143, size: 128, align: 64, offset: 704)
!635 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 384, align: 64, elements: !636, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut4_E")
!636 = !{!637, !638, !639, !640, !641, !642, !643}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !143, size: 128, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16, offset: 144)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !113, size: 16, align: 16, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !145, size: 64, align: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut4_E", file: !60, line: 1336, baseType: !71, size: 32, align: 32, offset: 320)
!644 = !DICompositeType(tag: DW_TAG_structure_type, scope: !"_ZTSN3pov14Tnormal_StructUt_E", file: !60, line: 1336, size: 128, align: 64, elements: !645, identifier: "_ZTSN3pov14Tnormal_StructUt_Ut5_E")
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !60, line: 1336, baseType: !237, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !"_ZTSN3pov14Tnormal_StructUt_Ut5_E", file: !60, line: 1336, baseType: !237, size: 64, align: 64, offset: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !5, file: !60, line: 1356, size: 928, align: 32, elements: !649, identifier: "_ZTSN3pov13Finish_StructE")
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !669, !670, !671, !672, !673, !674}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !91, size: 32, align: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Brilliance", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1358, baseType: !91, size: 32, align: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !91, size: 32, align: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1359, baseType: !91, size: 32, align: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Phong", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !91, size: 32, align: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Phong_Size", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1360, baseType: !91, size: 32, align: 32, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Irid", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !91, size: 32, align: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Film_Thickness", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !91, size: 32, align: 32, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Irid_Turb", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1361, baseType: !91, size: 32, align: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Caustics", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !91, size: 32, align: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_IOR", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !91, size: 32, align: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Dispersion", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !91, size: 32, align: 32, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Temp_Refract", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !91, size: 32, align: 32, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Exp", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1362, baseType: !91, size: 32, align: 32, offset: 416)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Crand", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1363, baseType: !91, size: 32, align: 32, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1363, baseType: !91, size: 32, align: 32, offset: 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !667, size: 96, align: 32, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", scope: !5, file: !60, line: 682, baseType: !668)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 96, align: 32, elements: !173)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Max", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !667, size: 96, align: 32, offset: 608)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Min", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1364, baseType: !667, size: 96, align: 32, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Falloff", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1365, baseType: !91, size: 32, align: 32, offset: 800)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Reflection_Type", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1366, baseType: !71, size: 32, align: 32, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Reflect_Metallic", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1367, baseType: !91, size: 32, align: 32, offset: 864)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Conserve_Energy", scope: !"_ZTSN3pov13Finish_StructE", file: !60, line: 1368, baseType: !71, size: 32, align: 32, offset: 896)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !60, line: 1566, size: 3456, align: 64, elements: !676, identifier: "_ZTSN3pov19Light_Source_StructE")
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !721, !722, !723, !724}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !320, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !71, size: 32, align: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !188, size: 64, align: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !140, size: 64, align: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !140, size: 64, align: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !327, size: 64, align: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !188, size: 64, align: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !188, size: 64, align: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !332, size: 64, align: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !335, size: 192, align: 32, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !337, size: 64, align: 64, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !337, size: 64, align: 64, offset: 832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !91, size: 32, align: 32, offset: 896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !214, size: 32, align: 32, offset: 928)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1568, baseType: !188, size: 64, align: 64, offset: 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1569, baseType: !129, size: 160, align: 32, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !171, size: 192, align: 64, offset: 1216)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !171, size: 192, align: 64, offset: 1408)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !171, size: 192, align: 64, offset: 1600)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !171, size: 192, align: 64, offset: 1792)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !"_ZTSN3pov19Light_Source_StructE", file: !60, line: 1570, baseType: !171, size: 192, align: 64, offset: 1984)
