; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/blocksort.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [38 x i8] c"      %d work, %d block, ratio %5.2f\0A\00", align 1
@.str1 = private unnamed_addr constant [54 x i8] c"    too repetitive; using fallback sorting algorithm\0A\00", align 1
@.str2 = private unnamed_addr constant [28 x i8] c"        bucket sorting ...\0A\00", align 1
@.str3 = private unnamed_addr constant [23 x i8] c"        depth %6d has \00", align 1
@.str4 = private unnamed_addr constant [24 x i8] c"%6d unresolved strings\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !366, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/blocksort.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !8, !9, !10, !12, !5, !14, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !6, line: 87, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib_private.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !6, line: 83, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !6, line: 84, baseType: !13)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !6, line: 82, baseType: !11)
!15 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!16 = !{!17, !120, !146, !199, !209, !258, !327, !343, !358}
!17 = !DISubprogram(name: "BZ2_blockSort", scope: !1, file: !1, line: 1078, type: !18, isLocal: false, isDefinition: true, scopeLine: 1079, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EState*)* @BZ2_blockSort, variables: !108)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !6, line: 300, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 231, size: 446144, align: 64, elements: !23)
!23 = !{!24, !51, !52, !53, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !92, !96, !97, !101, !103, !104}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !22, file: !6, line: 233, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !27, line: 221, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 204, size: 640, align: 64, elements: !29)
!29 = !{!30, !33, !34, !35, !36, !37, !38, !39, !40, !42, !46, !50}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !28, file: !27, line: 205, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !28, file: !27, line: 206, baseType: !15, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !28, file: !27, line: 207, baseType: !15, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !28, file: !27, line: 208, baseType: !15, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !28, file: !27, line: 210, baseType: !31, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !28, file: !27, line: 211, baseType: !15, size: 32, align: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !28, file: !27, line: 212, baseType: !15, size: 32, align: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !28, file: !27, line: 213, baseType: !15, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !28, file: !27, line: 215, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !28, file: !27, line: 217, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!41, !41, !13, !13}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !28, file: !27, line: 218, baseType: !47, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !41, !41}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !28, file: !27, line: 219, baseType: !41, size: 64, align: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !22, file: !6, line: 237, baseType: !12, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !6, line: 238, baseType: !12, size: 32, align: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !22, file: !6, line: 241, baseType: !54, size: 32, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !6, line: 85, baseType: !15)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !22, file: !6, line: 244, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !22, file: !6, line: 245, baseType: !56, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !22, file: !6, line: 246, baseType: !56, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !22, file: !6, line: 247, baseType: !12, size: 32, align: 32, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, file: !6, line: 250, baseType: !56, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !22, file: !6, line: 251, baseType: !9, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !22, file: !6, line: 252, baseType: !4, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !22, file: !6, line: 253, baseType: !9, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !22, file: !6, line: 256, baseType: !12, size: 32, align: 32, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !22, file: !6, line: 259, baseType: !54, size: 32, align: 32, offset: 736)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !22, file: !6, line: 260, baseType: !12, size: 32, align: 32, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !22, file: !6, line: 261, baseType: !12, size: 32, align: 32, offset: 800)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !22, file: !6, line: 261, baseType: !12, size: 32, align: 32, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !22, file: !6, line: 264, baseType: !12, size: 32, align: 32, offset: 864)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !22, file: !6, line: 265, baseType: !12, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !22, file: !6, line: 266, baseType: !12, size: 32, align: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !22, file: !6, line: 267, baseType: !12, size: 32, align: 32, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !22, file: !6, line: 270, baseType: !12, size: 32, align: 32, offset: 992)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !22, file: !6, line: 271, baseType: !75, size: 2048, align: 8, offset: 1024)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !22, file: !6, line: 272, baseType: !79, size: 2048, align: 8, offset: 3072)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !76)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !22, file: !6, line: 275, baseType: !54, size: 32, align: 32, offset: 5120)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !22, file: !6, line: 276, baseType: !12, size: 32, align: 32, offset: 5152)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !22, file: !6, line: 279, baseType: !54, size: 32, align: 32, offset: 5184)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !22, file: !6, line: 280, baseType: !54, size: 32, align: 32, offset: 5216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !22, file: !6, line: 283, baseType: !12, size: 32, align: 32, offset: 5248)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !22, file: !6, line: 284, baseType: !12, size: 32, align: 32, offset: 5280)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !22, file: !6, line: 285, baseType: !12, size: 32, align: 32, offset: 5312)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !22, file: !6, line: 288, baseType: !12, size: 32, align: 32, offset: 5344)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !22, file: !6, line: 289, baseType: !89, size: 8256, align: 32, offset: 5376)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8256, align: 32, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 258)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !22, file: !6, line: 290, baseType: !93, size: 144016, align: 8, offset: 13632)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 144016, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 18002)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !22, file: !6, line: 291, baseType: !93, size: 144016, align: 8, offset: 157648)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !22, file: !6, line: 293, baseType: !98, size: 12384, align: 8, offset: 301664)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 12384, align: 8, elements: !99)
!99 = !{!100, !91}
!100 = !DISubrange(count: 6)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !22, file: !6, line: 294, baseType: !102, size: 49536, align: 32, offset: 314048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 49536, align: 32, elements: !99)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !22, file: !6, line: 295, baseType: !102, size: 49536, align: 32, offset: 363584)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !22, file: !6, line: 297, baseType: !105, size: 33024, align: 32, offset: 413120)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 33024, align: 32, elements: !106)
!106 = !{!91, !107}
!107 = !DISubrange(count: 4)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !17, file: !1, line: 1078, type: !20)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !17, file: !1, line: 1080, type: !56)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !17, file: !1, line: 1081, type: !9)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftab", scope: !17, file: !1, line: 1082, type: !56)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nblock", scope: !17, file: !1, line: 1083, type: !12)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "verb", scope: !17, file: !1, line: 1084, type: !12)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wfact", scope: !17, file: !1, line: 1085, type: !12)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quadrant", scope: !17, file: !1, line: 1086, type: !4)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "budget", scope: !17, file: !1, line: 1087, type: !12)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "budgetInit", scope: !17, file: !1, line: 1088, type: !12)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !17, file: !1, line: 1089, type: !12)
!120 = !DISubprogram(name: "fallbackSort", scope: !1, file: !1, line: 259, type: !121, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i32*, i32, i32)* @fallbackSort, variables: !123)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !56, !56, !56, !12, !12}
!123 = !{!124, !125, !126, !127, !128, !129, !133, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmap", arg: 1, scope: !120, file: !1, line: 259, type: !56)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eclass", arg: 2, scope: !120, file: !1, line: 260, type: !56)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bhtab", arg: 3, scope: !120, file: !1, line: 261, type: !56)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nblock", arg: 4, scope: !120, file: !1, line: 262, type: !12)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "verb", arg: 5, scope: !120, file: !1, line: 263, type: !12)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftab", scope: !120, file: !1, line: 265, type: !130)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8224, align: 32, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 257)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftabCopy", scope: !120, file: !1, line: 266, type: !134)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8192, align: 32, elements: !76)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "H", scope: !120, file: !1, line: 267, type: !12)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !120, file: !1, line: 267, type: !12)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !120, file: !1, line: 267, type: !12)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !120, file: !1, line: 267, type: !12)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !120, file: !1, line: 267, type: !12)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !120, file: !1, line: 267, type: !12)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cc", scope: !120, file: !1, line: 267, type: !12)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cc1", scope: !120, file: !1, line: 267, type: !12)
