; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzip2.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.zzzz = type { i8*, %struct.zzzz* }
%struct.UInt64 = type { [8 x i8] }
%struct.utimbuf = type { i64, i64 }

@.str = private unnamed_addr constant [5 x i8] c".bz2\00", align 1
@.str1 = private unnamed_addr constant [4 x i8] c".bz\00", align 1
@.str2 = private unnamed_addr constant [6 x i8] c".tbz2\00", align 1
@.str3 = private unnamed_addr constant [5 x i8] c".tbz\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !27, globals: !488, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzip2.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !9, !12, !19, !24, !25, !8, !26}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !1, line: 261, baseType: !6)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !1, line: 263, baseType: !8)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !1, line: 260, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cell", file: !1, line: 1834, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "zzzz", file: !1, line: 1830, size: 128, align: 64, elements: !15)
!15 = !{!16, !17}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !1, line: 1831, baseType: !9, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !14, file: !1, line: 1832, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 30, baseType: !21)
!20 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !22, line: 92, baseType: !23)
!22 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !1, line: 262, baseType: !6)
!25 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!27 = !{!28, !96, !111, !116, !119, !187, !188, !194, !206, !212, !219, !222, !233, !238, !244, !245, !246, !251, !254, !257, !270, !273, !278, !283, !291, !296, !303, !307, !311, !354, !360, !368, !376, !388, !396, !402, !403, !415, !416, !437, !444, !462, !463, !464, !467, !473}
!28 = !DISubprogram(name: "fopen_output_safely", scope: !1, file: !1, line: 1104, type: !29, isLocal: false, isDefinition: true, scopeLine: 1105, flags: DIFlagPrototyped, isOptimized: true, function: %struct.__sFILE* (i8*, i8*)* @fopen_output_safely, variables: !90)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !9, !72}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 153, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !33, line: 122, size: 1216, align: 64, elements: !35)
!35 = !{!36, !38, !39, !40, !42, !43, !48, !49, !50, !54, !59, !68, !74, !75, !78, !79, !83, !87, !88, !89}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !34, file: !33, line: 123, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !34, file: !33, line: 124, baseType: !8, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !34, file: !33, line: 125, baseType: !8, size: 32, align: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !33, line: 126, baseType: !41, size: 16, align: 16, offset: 128)
!41 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !34, file: !33, line: 127, baseType: !41, size: 16, align: 16, offset: 144)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !34, file: !33, line: 128, baseType: !44, size: 128, align: 64, offset: 192)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !33, line: 88, size: 128, align: 64, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !44, file: !33, line: 89, baseType: !37, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !44, file: !33, line: 90, baseType: !8, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !34, file: !33, line: 129, baseType: !8, size: 32, align: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !34, file: !33, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !34, file: !33, line: 133, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!8, !4}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !34, file: !33, line: 134, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!8, !4, !58, !8}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !34, file: !33, line: 135, baseType: !60, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !4, !63, !8}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !33, line: 77, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !65, line: 71, baseType: !66)
!65 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !22, line: 46, baseType: !67)
!67 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !34, file: !33, line: 136, baseType: !69, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!8, !4, !72, !8}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !34, file: !33, line: 139, baseType: !44, size: 128, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !34, file: !33, line: 140, baseType: !76, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !33, line: 94, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !34, file: !33, line: 141, baseType: !8, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !34, file: !33, line: 144, baseType: !80, size: 24, align: 8, offset: 928)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 24, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !34, file: !33, line: 145, baseType: !84, size: 8, align: 8, offset: 952)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !34, file: !33, line: 148, baseType: !44, size: 128, align: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !34, file: !33, line: 151, baseType: !8, size: 32, align: 32, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !33, line: 152, baseType: !63, size: 64, align: 64, offset: 1152)
!90 = !{!91, !92, !93, !94}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !28, file: !1, line: 1104, type: !9)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !28, file: !1, line: 1104, type: !72)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !28, file: !1, line: 1107, type: !31)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fh", scope: !28, file: !1, line: 1108, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntNative", file: !1, line: 275, baseType: !8)
!96 = !DISubprogram(name: "main", scope: !1, file: !1, line: 1911, type: !97, isLocal: false, isDefinition: true, scopeLine: 1912, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !100)
!97 = !DISubroutineType(types: !98)
!98 = !{!95, !95, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !96, file: !1, line: 1911, type: !95)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !96, file: !1, line: 1911, type: !99)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !96, file: !1, line: 1913, type: !7)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !96, file: !1, line: 1913, type: !7)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !96, file: !1, line: 1914, type: !9)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argList", scope: !96, file: !1, line: 1915, type: !12)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aa", scope: !96, file: !1, line: 1916, type: !12)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decode", scope: !96, file: !1, line: 1917, type: !5)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aa2", scope: !110, file: !1, line: 2157, type: !12)
!110 = distinct !DILexicalBlock(scope: !96, file: !1, line: 2156, column: 23)
!111 = !DISubprogram(name: "mySIGSEGVorSIGBUScatcher", scope: !1, file: !1, line: 956, type: !112, isLocal: true, isDefinition: true, scopeLine: 957, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @mySIGSEGVorSIGBUScatcher, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !95}
!114 = !{!115}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !111, file: !1, line: 956, type: !95)
!116 = !DISubprogram(name: "showFileNames", scope: !1, file: !1, line: 807, type: !117, isLocal: true, isDefinition: true, scopeLine: 808, flags: DIFlagPrototyped, isOptimized: true, variables: !2)
!117 = !DISubroutineType(types: !118)
!118 = !{null}
!119 = !DISubprogram(name: "cleanUpAndFail", scope: !1, file: !1, line: 820, type: !120, isLocal: true, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @cleanUpAndFail, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !7}
!122 = !{!123, !124, !125}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ec", arg: 1, scope: !119, file: !1, line: 820, type: !7)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retVal", scope: !119, file: !1, line: 822, type: !95)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statBuf", scope: !119, file: !1, line: 824, type: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !127, line: 182, size: 1152, align: 64, elements: !128)
!127 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!128 = !{!129, !134, !140, !143, !147, !153, !157, !158, !166, !167, !168, !169, !172, !176, !180, !181, !182, !183}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !126, file: !127, line: 182, baseType: !130, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !131, line: 30, baseType: !132)
!131 = !DIFile(filename: "/usr/include/sys/_types/_dev_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !65, line: 57, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !22, line: 44, baseType: !8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !126, file: !127, line: 182, baseType: !135, size: 16, align: 16, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !136, line: 30, baseType: !137)
!136 = !DIFile(filename: "/usr/include/sys/_types/_mode_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !65, line: 70, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !22, line: 43, baseType: !139)
!139 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !126, file: !127, line: 182, baseType: !141, size: 16, align: 16, offset: 48)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !142, line: 30, baseType: !138)
!142 = !DIFile(filename: "/usr/include/sys/_types/_nlink_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !126, file: !127, line: 182, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !65, line: 62, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !22, line: 47, baseType: !146)
!146 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !126, file: !127, line: 182, baseType: !148, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !149, line: 30, baseType: !150)
!149 = !DIFile(filename: "/usr/include/sys/_types/_uid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !65, line: 75, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 45, baseType: !152)
!152 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !126, file: !127, line: 182, baseType: !154, size: 32, align: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !155, line: 30, baseType: !156)
!155 = !DIFile(filename: "/usr/include/sys/_types/_gid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !65, line: 60, baseType: !151)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !126, file: !127, line: 182, baseType: !130, size: 32, align: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !126, file: !127, line: 182, baseType: !159, size: 128, align: 64, offset: 256)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !160, line: 30, size: 128, align: 64, elements: !161)
!160 = !DIFile(filename: "/usr/include/sys/_types/_timespec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !{!162, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !159, file: !160, line: 32, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !22, line: 120, baseType: !164)
!164 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !159, file: !160, line: 33, baseType: !164, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !126, file: !127, line: 182, baseType: !159, size: 128, align: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !126, file: !127, line: 182, baseType: !159, size: 128, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !126, file: !127, line: 182, baseType: !159, size: 128, align: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !126, file: !127, line: 182, baseType: !170, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !171, line: 30, baseType: !64)
!171 = !DIFile(filename: "/usr/include/sys/_types/_off_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !126, file: !127, line: 182, baseType: !173, size: 64, align: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !174, line: 30, baseType: !175)
!174 = !DIFile(filename: "/usr/include/sys/_types/_blkcnt_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !65, line: 55, baseType: !66)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !126, file: !127, line: 182, baseType: !177, size: 32, align: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !178, line: 30, baseType: !179)
!178 = !DIFile(filename: "/usr/include/sys/_types/_blksize_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !65, line: 56, baseType: !133)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !126, file: !127, line: 182, baseType: !151, size: 32, align: 32, offset: 928)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !126, file: !127, line: 182, baseType: !151, size: 32, align: 32, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !126, file: !127, line: 182, baseType: !133, size: 32, align: 32, offset: 992)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !126, file: !127, line: 182, baseType: !184, size: 128, align: 64, offset: 1024)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, align: 64, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DISubprogram(name: "cadvise", scope: !1, file: !1, line: 792, type: !117, isLocal: true, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, variables: !2)
!188 = !DISubprogram(name: "copyFileName", scope: !1, file: !1, line: 1064, type: !189, isLocal: true, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*)* @copyFileName, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !9, !9}
!191 = !{!192, !193}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "to", arg: 1, scope: !188, file: !1, line: 1064, type: !9)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from", arg: 2, scope: !188, file: !1, line: 1064, type: !9)
!194 = !DISubprogram(name: "addFlagsFromEnvVar", scope: !1, file: !1, line: 1882, type: !195, isLocal: true, isDefinition: true, scopeLine: 1883, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.zzzz**, i8*)* @addFlagsFromEnvVar, variables: !198)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197, !9}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!198 = !{!199, !200, !201, !202, !203, !204, !205}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argList", arg: 1, scope: !194, file: !1, line: 1882, type: !197)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "varName", arg: 2, scope: !194, file: !1, line: 1882, type: !9)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !194, file: !1, line: 1884, type: !7)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !194, file: !1, line: 1884, type: !7)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !194, file: !1, line: 1884, type: !7)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "envbase", scope: !194, file: !1, line: 1885, type: !9)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !194, file: !1, line: 1885, type: !9)
!206 = !DISubprogram(name: "isspace", scope: !207, file: !207, line: 267, type: !208, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, variables: !210)
!207 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!208 = !DISubroutineType(types: !209)
!209 = !{!8, !8}
!210 = !{!211}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !206, file: !207, line: 267, type: !8)
!212 = !DISubprogram(name: "__istype", scope: !207, file: !207, line: 153, type: !213, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !216)
!213 = !DISubroutineType(types: !214)
!214 = !{!8, !215, !23}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !22, line: 70, baseType: !8)
!216 = !{!217, !218}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !212, file: !207, line: 153, type: !215)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !212, file: !207, line: 153, type: !23)
!219 = !DISubprogram(name: "isascii", scope: !207, file: !207, line: 135, type: !208, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, variables: !220)
!220 = !{!221}
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !219, file: !207, line: 135, type: !8)
!222 = !DISubprogram(name: "snocString", scope: !1, file: !1, line: 1864, type: !223, isLocal: true, isDefinition: true, scopeLine: 1865, flags: DIFlagPrototyped, isOptimized: true, function: %struct.zzzz* (%struct.zzzz*, i8*)* @snocString, variables: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!12, !12, !9}
!225 = !{!226, !227, !228, !231}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "root", arg: 1, scope: !222, file: !1, line: 1864, type: !12)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !222, file: !1, line: 1864, type: !9)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !229, file: !1, line: 1867, type: !12)
!229 = distinct !DILexicalBlock(scope: !230, file: !1, line: 1866, column: 22)
!230 = distinct !DILexicalBlock(scope: !222, file: !1, line: 1866, column: 8)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !232, file: !1, line: 1872, type: !12)
!232 = distinct !DILexicalBlock(scope: !230, file: !1, line: 1871, column: 11)
!233 = !DISubprogram(name: "mkCell", scope: !1, file: !1, line: 1851, type: !234, isLocal: true, isDefinition: true, scopeLine: 1852, flags: DIFlagPrototyped, isOptimized: true, variables: !236)
!234 = !DISubroutineType(types: !235)
!235 = !{!12}
!236 = !{!237}
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !233, file: !1, line: 1853, type: !12)
!238 = !DISubprogram(name: "myMalloc", scope: !1, file: !1, line: 1839, type: !239, isLocal: true, isDefinition: true, scopeLine: 1840, flags: DIFlagPrototyped, isOptimized: true, variables: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{!4, !7}
!241 = !{!242, !243}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !238, file: !1, line: 1839, type: !7)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !238, file: !1, line: 1841, type: !4)
!244 = !DISubprogram(name: "outOfMemory", scope: !1, file: !1, line: 1016, type: !117, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @outOfMemory, variables: !2)
!245 = !DISubprogram(name: "license", scope: !1, file: !1, line: 1736, type: !117, isLocal: true, isDefinition: true, scopeLine: 1737, flags: DIFlagPrototyped, isOptimized: true, variables: !2)
!246 = !DISubprogram(name: "usage", scope: !1, file: !1, line: 1761, type: !247, isLocal: true, isDefinition: true, scopeLine: 1762, flags: DIFlagPrototyped, isOptimized: true, variables: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !9}
!249 = !{!250}
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullProgName", arg: 1, scope: !246, file: !1, line: 1761, type: !9)
!251 = !DISubprogram(name: "redundant", scope: !1, file: !1, line: 1805, type: !247, isLocal: true, isDefinition: true, scopeLine: 1806, flags: DIFlagPrototyped, isOptimized: true, variables: !252)
!252 = !{!253}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 1, scope: !251, file: !1, line: 1805, type: !9)
!254 = !DISubprogram(name: "mySignalCatcher", scope: !1, file: !1, line: 945, type: !112, isLocal: true, isDefinition: true, scopeLine: 946, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @mySignalCatcher, variables: !255)
!255 = !{!256}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !254, file: !1, line: 945, type: !95)
!257 = !DISubprogram(name: "compress", scope: !1, file: !1, line: 1268, type: !247, isLocal: true, isDefinition: true, scopeLine: 1269, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @compress, variables: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265}
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !257, file: !1, line: 1268, type: !9)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inStr", scope: !257, file: !1, line: 1270, type: !31)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outStr", scope: !257, file: !1, line: 1271, type: !31)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !257, file: !1, line: 1272, type: !7)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !257, file: !1, line: 1272, type: !7)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statBuf", scope: !257, file: !1, line: 1273, type: !126)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retVal", scope: !266, file: !1, line: 1438, type: !95)
!266 = distinct !DILexicalBlock(scope: !267, file: !1, line: 1437, column: 30)
!267 = distinct !DILexicalBlock(scope: !268, file: !1, line: 1437, column: 12)
!268 = distinct !DILexicalBlock(scope: !269, file: !1, line: 1434, column: 29)
!269 = distinct !DILexicalBlock(scope: !257, file: !1, line: 1434, column: 9)
!270 = !DISubprogram(name: "panic", scope: !1, file: !1, line: 881, type: !247, isLocal: true, isDefinition: true, scopeLine: 882, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @panic, variables: !271)
!271 = !{!272}
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !270, file: !1, line: 881, type: !9)
!273 = !DISubprogram(name: "containsDubiousChars", scope: !1, file: !1, line: 1219, type: !274, isLocal: true, isDefinition: true, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true, variables: !276)
!274 = !DISubroutineType(types: !275)
!275 = !{!5, !9}
!276 = !{!277}
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !273, file: !1, line: 1219, type: !9)
!278 = !DISubprogram(name: "fileExists", scope: !1, file: !1, line: 1085, type: !274, isLocal: true, isDefinition: true, scopeLine: 1086, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i8*)* @fileExists, variables: !279)
!279 = !{!280, !281, !282}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !278, file: !1, line: 1085, type: !9)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !278, file: !1, line: 1087, type: !31)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exists", scope: !278, file: !1, line: 1088, type: !5)
!283 = !DISubprogram(name: "hasSuffix", scope: !1, file: !1, line: 1246, type: !284, isLocal: true, isDefinition: true, scopeLine: 1247, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i8*, i8*)* @hasSuffix, variables: !286)
!284 = !DISubroutineType(types: !285)
!285 = !{!5, !9, !9}
!286 = !{!287, !288, !289, !290}
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !283, file: !1, line: 1246, type: !9)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "suffix", arg: 2, scope: !283, file: !1, line: 1246, type: !9)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns", scope: !283, file: !1, line: 1248, type: !7)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nx", scope: !283, file: !1, line: 1249, type: !7)
!291 = !DISubprogram(name: "notAStandardFile", scope: !1, file: !1, line: 1125, type: !274, isLocal: true, isDefinition: true, scopeLine: 1126, flags: DIFlagPrototyped, isOptimized: true, variables: !292)
!292 = !{!293, !294, !295}
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !291, file: !1, line: 1125, type: !9)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !291, file: !1, line: 1127, type: !95)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statBuf", scope: !291, file: !1, line: 1128, type: !126)
!296 = !DISubprogram(name: "countHardLinks", scope: !1, file: !1, line: 1142, type: !297, isLocal: true, isDefinition: true, scopeLine: 1143, flags: DIFlagPrototyped, isOptimized: true, variables: !299)
!297 = !DISubroutineType(types: !298)
!298 = !{!7, !9}
!299 = !{!300, !301, !302}
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !296, file: !1, line: 1142, type: !9)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !296, file: !1, line: 1144, type: !95)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statBuf", scope: !296, file: !1, line: 1145, type: !126)
!303 = !DISubprogram(name: "saveInputFileMetaInfo", scope: !1, file: !1, line: 1182, type: !247, isLocal: true, isDefinition: true, scopeLine: 1183, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @saveInputFileMetaInfo, variables: !304)
!304 = !{!305, !306}
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "srcName", arg: 1, scope: !303, file: !1, line: 1182, type: !9)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retVal", scope: !303, file: !1, line: 1185, type: !95)
!307 = !DISubprogram(name: "pad", scope: !1, file: !1, line: 1053, type: !247, isLocal: true, isDefinition: true, scopeLine: 1054, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @pad, variables: !308)
!308 = !{!309, !310}
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !307, file: !1, line: 1053, type: !9)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !307, file: !1, line: 1055, type: !7)
!311 = !DISubprogram(name: "compressStream", scope: !1, file: !1, line: 438, type: !312, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, variables: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !31, !31}
!314 = !{!315, !316, !317, !321, !325, !326, !328, !329, !330, !331, !332, !333, !334, !342, !343, !351, !352, !353}
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 1, scope: !311, file: !1, line: 438, type: !31)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "zStream", arg: 2, scope: !311, file: !1, line: 438, type: !31)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bzf", scope: !311, file: !1, line: 441, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "BZFILE", file: !320, line: 292, baseType: null)
!320 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuf", scope: !311, file: !1, line: 442, type: !322)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40000, align: 8, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 5000)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nIbuf", scope: !311, file: !1, line: 443, type: !7)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_in_lo32", scope: !311, file: !1, line: 444, type: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !1, line: 264, baseType: !152)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_in_hi32", scope: !311, file: !1, line: 444, type: !327)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_out_lo32", scope: !311, file: !1, line: 445, type: !327)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_out_hi32", scope: !311, file: !1, line: 445, type: !327)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bzerr", scope: !311, file: !1, line: 446, type: !7)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bzerr_dummy", scope: !311, file: !1, line: 446, type: !7)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !311, file: !1, line: 446, type: !7)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf_nin", scope: !335, file: !1, line: 497, type: !339)
!335 = distinct !DILexicalBlock(scope: !336, file: !1, line: 496, column: 14)
!336 = distinct !DILexicalBlock(scope: !337, file: !1, line: 494, column: 11)
!337 = distinct !DILexicalBlock(scope: !338, file: !1, line: 493, column: 24)
!338 = distinct !DILexicalBlock(scope: !311, file: !1, line: 493, column: 8)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, align: 8, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 32)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf_nout", scope: !335, file: !1, line: 497, type: !339)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_in", scope: !335, file: !1, line: 498, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt64", file: !1, line: 336, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 335, size: 64, align: 8, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !345, file: !1, line: 335, baseType: !348, size: 64, align: 8)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, align: 8, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 8)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_out", scope: !335, file: !1, line: 498, type: !344)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_in_d", scope: !335, file: !1, line: 499, type: !25)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes_out_d", scope: !335, file: !1, line: 499, type: !25)
!354 = !DISubprogram(name: "myfeof", scope: !1, file: !1, line: 423, type: !355, isLocal: true, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, function: i8 (%struct.__sFILE*)* @myfeof, variables: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!5, !31}
!357 = !{!358, !359}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !354, file: !1, line: 423, type: !31)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !354, file: !1, line: 426, type: !7)
!360 = !DISubprogram(name: "uInt64_from_UInt32s", scope: !1, file: !1, line: 340, type: !361, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, variables: !364)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !363, !327, !327}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!364 = !{!365, !366, !367}
!365 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !360, file: !1, line: 340, type: !363)
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lo32", arg: 2, scope: !360, file: !1, line: 340, type: !327)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hi32", arg: 3, scope: !360, file: !1, line: 340, type: !327)
!368 = !DISubprogram(name: "uInt64_to_double", scope: !1, file: !1, line: 354, type: !369, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, variables: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!25, !363}
!371 = !{!372, !373, !374, !375}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !368, file: !1, line: 354, type: !363)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !368, file: !1, line: 356, type: !7)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !368, file: !1, line: 357, type: !25)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !368, file: !1, line: 358, type: !25)
!376 = !DISubprogram(name: "uInt64_toAscii", scope: !1, file: !1, line: 397, type: !377, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.UInt64*)* @uInt64_toAscii, variables: !379)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !58, !363}
!379 = !{!380, !381, !382, !383, !384, !386, !387}
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 1, scope: !376, file: !1, line: 397, type: !58)
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !376, file: !1, line: 397, type: !363)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !376, file: !1, line: 399, type: !7)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !376, file: !1, line: 399, type: !7)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !376, file: !1, line: 400, type: !385)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 8, elements: !340)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nBuf", scope: !376, file: !1, line: 401, type: !7)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_copy", scope: !376, file: !1, line: 402, type: !344)
!388 = !DISubprogram(name: "uInt64_qrm10", scope: !1, file: !1, line: 379, type: !389, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, variables: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!7, !363}
!391 = !{!392, !393, !394, !395}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !388, file: !1, line: 379, type: !363)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rem", scope: !388, file: !1, line: 381, type: !327)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !388, file: !1, line: 381, type: !327)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !388, file: !1, line: 382, type: !7)
!396 = !DISubprogram(name: "uInt64_isZero", scope: !1, file: !1, line: 368, type: !397, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: true, variables: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!5, !363}
!399 = !{!400, !401}
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !396, file: !1, line: 368, type: !363)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !396, file: !1, line: 370, type: !7)
!402 = !DISubprogram(name: "configError", scope: !1, file: !1, line: 1028, type: !117, isLocal: true, isDefinition: true, scopeLine: 1029, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @configError, variables: !2)
!403 = !DISubprogram(name: "applySavedMetaInfoToOutputFile", scope: !1, file: !1, line: 1194, type: !247, isLocal: true, isDefinition: true, scopeLine: 1195, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @applySavedMetaInfoToOutputFile, variables: !404)
!404 = !{!405, !406, !407}
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstName", arg: 1, scope: !403, file: !1, line: 1194, type: !9)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retVal", scope: !403, file: !1, line: 1197, type: !95)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uTimBuf", scope: !403, file: !1, line: 1198, type: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", file: !409, line: 64, size: 128, align: 64, elements: !410)
!409 = !DIFile(filename: "/usr/include/utime.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!410 = !{!411, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !408, file: !409, line: 65, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !413, line: 30, baseType: !163)
!413 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!414 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !408, file: !409, line: 66, baseType: !412, size: 64, align: 64, offset: 64)
!415 = !DISubprogram(name: "ioError", scope: !1, file: !1, line: 931, type: !117, isLocal: true, isDefinition: true, scopeLine: 932, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @ioError, variables: !2)
!416 = !DISubprogram(name: "uncompress", scope: !1, file: !1, line: 1449, type: !247, isLocal: true, isDefinition: true, scopeLine: 1450, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @uncompress, variables: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !433}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !416, file: !1, line: 1449, type: !9)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inStr", scope: !416, file: !1, line: 1451, type: !31)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outStr", scope: !416, file: !1, line: 1452, type: !31)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !416, file: !1, line: 1453, type: !7)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !416, file: !1, line: 1453, type: !7)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magicNumberOK", scope: !416, file: !1, line: 1454, type: !5)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cantGuess", scope: !416, file: !1, line: 1455, type: !5)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statBuf", scope: !416, file: !1, line: 1456, type: !126)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retVal", scope: !427, file: !1, line: 1616, type: !95)
!427 = distinct !DILexicalBlock(scope: !428, file: !1, line: 1615, column: 33)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 1615, column: 15)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 1612, column: 32)
!430 = distinct !DILexicalBlock(scope: !431, file: !1, line: 1612, column: 12)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 1611, column: 25)
!432 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1611, column: 9)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retVal", scope: !434, file: !1, line: 1624, type: !95)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 1623, column: 32)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 1623, column: 12)
!436 = distinct !DILexicalBlock(scope: !432, file: !1, line: 1620, column: 11)
!437 = !DISubprogram(name: "mapSuffix", scope: !1, file: !1, line: 1256, type: !438, isLocal: true, isDefinition: true, scopeLine: 1258, flags: DIFlagPrototyped, isOptimized: true, variables: !440)
!438 = !DISubroutineType(types: !439)
!439 = !{!5, !9, !9, !9}
!440 = !{!441, !442, !443}
!441 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !437, file: !1, line: 1256, type: !9)
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldSuffix", arg: 2, scope: !437, file: !1, line: 1257, type: !9)
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newSuffix", arg: 3, scope: !437, file: !1, line: 1257, type: !9)
!444 = !DISubprogram(name: "uncompressStream", scope: !1, file: !1, line: 548, type: !445, isLocal: true, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, variables: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{!5, !31, !31}
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "zStream", arg: 1, scope: !444, file: !1, line: 548, type: !31)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !444, file: !1, line: 548, type: !31)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bzf", scope: !444, file: !1, line: 551, type: !318)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bzerr", scope: !444, file: !1, line: 552, type: !7)
