; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.DState = type { %struct.bz_stream*, i32, i8, i32, i8, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, [256 x i32], i32, [257 x i32], [257 x i32], i32*, i16*, i8*, i32, i32, i32, i32, i32, [256 x i8], [16 x i8], [256 x i8], [4096 x i8], [16 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x [258 x i32]], [6 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !116, globals: !619, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !9, !12, !15, !16, !27, !13, !6, !89, !29}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !7, line: 83, baseType: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib_private.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !7, line: 87, baseType: !11)
!11 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !7, line: 85, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !7, line: 82, baseType: !8)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "bzFile", file: !1, line: 962, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 949, size: 40832, align: 64, elements: !19)
!19 = !{!20, !83, !88, !90, !91, !114, !115}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !18, file: !1, line: 953, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !23, line: 153, baseType: !24)
!23 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !23, line: 122, size: 1216, align: 64, elements: !25)
!25 = !{!26, !28, !30, !31, !33, !34, !39, !40, !41, !45, !51, !61, !67, !68, !71, !72, !76, !80, !81, !82}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !24, file: !23, line: 123, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !24, file: !23, line: 124, baseType: !29, size: 32, align: 32, offset: 64)
!29 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !24, file: !23, line: 125, baseType: !29, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !24, file: !23, line: 126, baseType: !32, size: 16, align: 16, offset: 128)
!32 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !24, file: !23, line: 127, baseType: !32, size: 16, align: 16, offset: 144)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !24, file: !23, line: 128, baseType: !35, size: 128, align: 64, offset: 192)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !23, line: 88, size: 128, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !35, file: !23, line: 89, baseType: !27, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !35, file: !23, line: 90, baseType: !29, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !24, file: !23, line: 129, baseType: !29, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !24, file: !23, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !24, file: !23, line: 133, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!29, !4}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !24, file: !23, line: 134, baseType: !46, size: 64, align: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!29, !4, !49, !29}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !24, file: !23, line: 135, baseType: !52, size: 64, align: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !4, !55, !29}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !23, line: 77, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !57, line: 71, baseType: !58)
!57 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !59, line: 46, baseType: !60)
!59 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !24, file: !23, line: 136, baseType: !62, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!29, !4, !65, !29}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !24, file: !23, line: 139, baseType: !35, size: 128, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !24, file: !23, line: 140, baseType: !69, size: 64, align: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !23, line: 94, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !24, file: !23, line: 141, baseType: !29, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !24, file: !23, line: 144, baseType: !73, size: 24, align: 8, offset: 928)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 24, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !24, file: !23, line: 145, baseType: !77, size: 8, align: 8, offset: 952)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, align: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !24, file: !23, line: 148, baseType: !35, size: 128, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !24, file: !23, line: 151, baseType: !29, size: 32, align: 32, offset: 1088)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !24, file: !23, line: 152, baseType: !55, size: 64, align: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !18, file: !1, line: 955, baseType: !84, size: 40000, align: 8, offset: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 40000, align: 8, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !7, line: 81, baseType: !50)
!86 = !{!87}
!87 = !DISubrange(count: 5000)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bufN", scope: !18, file: !1, line: 956, baseType: !89, size: 32, align: 32, offset: 40064)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !7, line: 84, baseType: !29)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !18, file: !1, line: 957, baseType: !15, size: 8, align: 8, offset: 40096)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !18, file: !1, line: 958, baseType: !92, size: 640, align: 64, offset: 40128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !93, line: 221, baseType: !94)
!93 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/401.bzip2/src/bzlib.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!94 = !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 204, size: 640, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !109, !113}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !94, file: !93, line: 205, baseType: !49, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !94, file: !93, line: 206, baseType: !14, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !94, file: !93, line: 207, baseType: !14, size: 32, align: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !94, file: !93, line: 208, baseType: !14, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !94, file: !93, line: 210, baseType: !49, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !94, file: !93, line: 211, baseType: !14, size: 32, align: 32, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !94, file: !93, line: 212, baseType: !14, size: 32, align: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !94, file: !93, line: 213, baseType: !14, size: 32, align: 32, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !94, file: !93, line: 215, baseType: !4, size: 64, align: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !94, file: !93, line: 217, baseType: !106, size: 64, align: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!4, !4, !29, !29}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !94, file: !93, line: 218, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !4, !4}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !94, file: !93, line: 219, baseType: !4, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lastErr", scope: !18, file: !1, line: 959, baseType: !89, size: 32, align: 32, offset: 40768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "initialisedOk", scope: !18, file: !1, line: 960, baseType: !15, size: 8, align: 8, offset: 40800)
!116 = !{!117, !122, !193, !201, !207, !297, !306, !315, !319, !333, !345, !355, !370, !382, !389, !400, !410, !423, !435, !438, !444, !450, !459, !465, !470, !477, !484, !487, !495, !499, !504, !508, !516, !522, !541, !546, !549, !552, !558, !576, !582, !605, !611}
!117 = !DISubprogram(name: "BZ2_bz__AssertH__fail", scope: !1, file: !1, line: 87, type: !118, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @BZ2_bz__AssertH__fail, variables: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !29}
!120 = !{!121}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errcode", arg: 1, scope: !117, file: !1, line: 87, type: !29)
!122 = !DISubprogram(name: "BZ2_bzCompressInit", scope: !1, file: !1, line: 205, type: !123, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bz_stream*, i32, i32, i32)* @BZ2_bzCompressInit, variables: !126)
!123 = !DISubroutineType(types: !124)
!124 = !{!29, !125, !29, !29, !29}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strm", arg: 1, scope: !122, file: !1, line: 206, type: !125)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blockSize100k", arg: 2, scope: !122, file: !1, line: 207, type: !29)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "verbosity", arg: 3, scope: !122, file: !1, line: 208, type: !29)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workFactor", arg: 4, scope: !122, file: !1, line: 209, type: !29)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !122, file: !1, line: 211, type: !89)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !122, file: !1, line: 212, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !7, line: 300, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 231, size: 446144, align: 64, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !163, !165, !166, !167, !168, !169, !170, !171, !172, !173, !177, !181, !182, !186, !188, !189}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !135, file: !7, line: 233, baseType: !125, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !135, file: !7, line: 237, baseType: !89, size: 32, align: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !135, file: !7, line: 238, baseType: !89, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !135, file: !7, line: 241, baseType: !13, size: 32, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !135, file: !7, line: 244, baseType: !12, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !135, file: !7, line: 245, baseType: !12, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !135, file: !7, line: 246, baseType: !12, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !135, file: !7, line: 247, baseType: !89, size: 32, align: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !135, file: !7, line: 250, baseType: !12, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !135, file: !7, line: 251, baseType: !5, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !135, file: !7, line: 252, baseType: !9, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !135, file: !7, line: 253, baseType: !5, size: 64, align: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !135, file: !7, line: 256, baseType: !89, size: 32, align: 32, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !135, file: !7, line: 259, baseType: !13, size: 32, align: 32, offset: 736)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !135, file: !7, line: 260, baseType: !89, size: 32, align: 32, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !135, file: !7, line: 261, baseType: !89, size: 32, align: 32, offset: 800)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !135, file: !7, line: 261, baseType: !89, size: 32, align: 32, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !135, file: !7, line: 264, baseType: !89, size: 32, align: 32, offset: 864)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !135, file: !7, line: 265, baseType: !89, size: 32, align: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !135, file: !7, line: 266, baseType: !89, size: 32, align: 32, offset: 928)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !135, file: !7, line: 267, baseType: !89, size: 32, align: 32, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !135, file: !7, line: 270, baseType: !89, size: 32, align: 32, offset: 992)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !135, file: !7, line: 271, baseType: !160, size: 2048, align: 8, offset: 1024)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 2048, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !135, file: !7, line: 272, baseType: !164, size: 2048, align: 8, offset: 3072)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2048, align: 8, elements: !161)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !135, file: !7, line: 275, baseType: !13, size: 32, align: 32, offset: 5120)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !135, file: !7, line: 276, baseType: !89, size: 32, align: 32, offset: 5152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !135, file: !7, line: 279, baseType: !13, size: 32, align: 32, offset: 5184)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !135, file: !7, line: 280, baseType: !13, size: 32, align: 32, offset: 5216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !135, file: !7, line: 283, baseType: !89, size: 32, align: 32, offset: 5248)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !135, file: !7, line: 284, baseType: !89, size: 32, align: 32, offset: 5280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !135, file: !7, line: 285, baseType: !89, size: 32, align: 32, offset: 5312)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !135, file: !7, line: 288, baseType: !89, size: 32, align: 32, offset: 5344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !135, file: !7, line: 289, baseType: !174, size: 8256, align: 32, offset: 5376)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8256, align: 32, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 258)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !135, file: !7, line: 290, baseType: !178, size: 144016, align: 8, offset: 13632)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 144016, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 18002)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !135, file: !7, line: 291, baseType: !178, size: 144016, align: 8, offset: 157648)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !135, file: !7, line: 293, baseType: !183, size: 12384, align: 8, offset: 301664)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 12384, align: 8, elements: !184)
!184 = !{!185, !176}
!185 = !DISubrange(count: 6)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !135, file: !7, line: 294, baseType: !187, size: 49536, align: 32, offset: 314048)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 49536, align: 32, elements: !184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !135, file: !7, line: 295, baseType: !187, size: 49536, align: 32, offset: 363584)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !135, file: !7, line: 297, baseType: !190, size: 33024, align: 32, offset: 413120)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 33024, align: 32, elements: !191)
!191 = !{!176, !192}
!192 = !DISubrange(count: 4)
!193 = !DISubprogram(name: "BZ2_bzCompress", scope: !1, file: !1, line: 464, type: !194, isLocal: false, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bz_stream*, i32)* @BZ2_bzCompress, variables: !196)
!194 = !DISubroutineType(types: !195)
!195 = !{!29, !125, !29}
!196 = !{!197, !198, !199, !200}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strm", arg: 1, scope: !193, file: !1, line: 464, type: !125)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "action", arg: 2, scope: !193, file: !1, line: 464, type: !29)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "progress", scope: !193, file: !1, line: 466, type: !15)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !193, file: !1, line: 467, type: !133)
!201 = !DISubprogram(name: "BZ2_bzCompressEnd", scope: !1, file: !1, line: 525, type: !202, isLocal: false, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bz_stream*)* @BZ2_bzCompressEnd, variables: !204)
!202 = !DISubroutineType(types: !203)
!203 = !{!29, !125}
!204 = !{!205, !206}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strm", arg: 1, scope: !201, file: !1, line: 525, type: !125)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !201, file: !1, line: 527, type: !133)
!207 = !DISubprogram(name: "BZ2_bzDecompressInit", scope: !1, file: !1, line: 549, type: !208, isLocal: false, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bz_stream*, i32, i32)* @BZ2_bzDecompressInit, variables: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!29, !125, !29, !29}
!210 = !{!211, !212, !213, !214}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strm", arg: 1, scope: !207, file: !1, line: 550, type: !125)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "verbosity", arg: 2, scope: !207, file: !1, line: 551, type: !29)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "small", arg: 3, scope: !207, file: !1, line: 552, type: !29)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !207, file: !1, line: 554, type: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "DState", file: !7, line: 472, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 382, size: 513152, align: 64, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !237, !238, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !256, !257, !261, !263, !264, !265, !266, !267, !268, !269, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !295, !296}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !217, file: !7, line: 384, baseType: !125, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !217, file: !7, line: 387, baseType: !89, size: 32, align: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_ch", scope: !217, file: !7, line: 390, baseType: !6, size: 8, align: 8, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_len", scope: !217, file: !7, line: 391, baseType: !89, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "blockRandomised", scope: !217, file: !7, line: 392, baseType: !15, size: 8, align: 8, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !217, file: !7, line: 393, baseType: !89, size: 32, align: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !217, file: !7, line: 393, baseType: !89, size: 32, align: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !217, file: !7, line: 396, baseType: !13, size: 32, align: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !217, file: !7, line: 397, baseType: !89, size: 32, align: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !217, file: !7, line: 400, baseType: !89, size: 32, align: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "smallDecompress", scope: !217, file: !7, line: 401, baseType: !15, size: 8, align: 8, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "currBlockNo", scope: !217, file: !7, line: 402, baseType: !89, size: 32, align: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !217, file: !7, line: 403, baseType: !89, size: 32, align: 32, offset: 416)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !217, file: !7, line: 406, baseType: !89, size: 32, align: 32, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tPos", scope: !217, file: !7, line: 407, baseType: !13, size: 32, align: 32, offset: 480)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !217, file: !7, line: 408, baseType: !89, size: 32, align: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "unzftab", scope: !217, file: !7, line: 409, baseType: !236, size: 8192, align: 32, offset: 544)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, align: 32, elements: !161)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nblock_used", scope: !217, file: !7, line: 410, baseType: !89, size: 32, align: 32, offset: 8736)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cftab", scope: !217, file: !7, line: 411, baseType: !239, size: 8224, align: 32, offset: 8768)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8224, align: 32, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 257)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cftabCopy", scope: !217, file: !7, line: 412, baseType: !239, size: 8224, align: 32, offset: 16992)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !217, file: !7, line: 415, baseType: !12, size: 64, align: 64, offset: 25216)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ll16", scope: !217, file: !7, line: 418, baseType: !9, size: 64, align: 64, offset: 25280)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ll4", scope: !217, file: !7, line: 419, baseType: !5, size: 64, align: 64, offset: 25344)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "storedBlockCRC", scope: !217, file: !7, line: 422, baseType: !13, size: 32, align: 32, offset: 25408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "storedCombinedCRC", scope: !217, file: !7, line: 423, baseType: !13, size: 32, align: 32, offset: 25440)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedBlockCRC", scope: !217, file: !7, line: 424, baseType: !13, size: 32, align: 32, offset: 25472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedCombinedCRC", scope: !217, file: !7, line: 425, baseType: !13, size: 32, align: 32, offset: 25504)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !217, file: !7, line: 428, baseType: !89, size: 32, align: 32, offset: 25536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !217, file: !7, line: 429, baseType: !160, size: 2048, align: 8, offset: 25568)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "inUse16", scope: !217, file: !7, line: 430, baseType: !253, size: 128, align: 8, offset: 27616)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 128, align: 8, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "seqToUnseq", scope: !217, file: !7, line: 431, baseType: !164, size: 2048, align: 8, offset: 27744)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mtfa", scope: !217, file: !7, line: 434, baseType: !258, size: 32768, align: 8, offset: 29792)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32768, align: 8, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 4096)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mtfbase", scope: !217, file: !7, line: 435, baseType: !262, size: 512, align: 32, offset: 62560)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, align: 32, elements: !254)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !217, file: !7, line: 436, baseType: !178, size: 144016, align: 8, offset: 63072)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !217, file: !7, line: 437, baseType: !178, size: 144016, align: 8, offset: 207088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !217, file: !7, line: 438, baseType: !183, size: 12384, align: 8, offset: 351104)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !217, file: !7, line: 440, baseType: !187, size: 49536, align: 32, offset: 363488)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !217, file: !7, line: 441, baseType: !187, size: 49536, align: 32, offset: 413024)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !217, file: !7, line: 442, baseType: !187, size: 49536, align: 32, offset: 462560)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "minLens", scope: !217, file: !7, line: 443, baseType: !270, size: 192, align: 32, offset: 512096)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 192, align: 32, elements: !271)
!271 = !{!185}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "save_i", scope: !217, file: !7, line: 446, baseType: !89, size: 32, align: 32, offset: 512288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "save_j", scope: !217, file: !7, line: 447, baseType: !89, size: 32, align: 32, offset: 512320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "save_t", scope: !217, file: !7, line: 448, baseType: !89, size: 32, align: 32, offset: 512352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "save_alphaSize", scope: !217, file: !7, line: 449, baseType: !89, size: 32, align: 32, offset: 512384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "save_nGroups", scope: !217, file: !7, line: 450, baseType: !89, size: 32, align: 32, offset: 512416)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "save_nSelectors", scope: !217, file: !7, line: 451, baseType: !89, size: 32, align: 32, offset: 512448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "save_EOB", scope: !217, file: !7, line: 452, baseType: !89, size: 32, align: 32, offset: 512480)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupNo", scope: !217, file: !7, line: 453, baseType: !89, size: 32, align: 32, offset: 512512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupPos", scope: !217, file: !7, line: 454, baseType: !89, size: 32, align: 32, offset: 512544)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "save_nextSym", scope: !217, file: !7, line: 455, baseType: !89, size: 32, align: 32, offset: 512576)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblockMAX", scope: !217, file: !7, line: 456, baseType: !89, size: 32, align: 32, offset: 512608)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblock", scope: !217, file: !7, line: 457, baseType: !89, size: 32, align: 32, offset: 512640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "save_es", scope: !217, file: !7, line: 458, baseType: !89, size: 32, align: 32, offset: 512672)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "save_N", scope: !217, file: !7, line: 459, baseType: !89, size: 32, align: 32, offset: 512704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "save_curr", scope: !217, file: !7, line: 460, baseType: !89, size: 32, align: 32, offset: 512736)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "save_zt", scope: !217, file: !7, line: 461, baseType: !89, size: 32, align: 32, offset: 512768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "save_zn", scope: !217, file: !7, line: 462, baseType: !89, size: 32, align: 32, offset: 512800)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "save_zvec", scope: !217, file: !7, line: 463, baseType: !89, size: 32, align: 32, offset: 512832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "save_zj", scope: !217, file: !7, line: 464, baseType: !89, size: 32, align: 32, offset: 512864)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "save_gSel", scope: !217, file: !7, line: 465, baseType: !89, size: 32, align: 32, offset: 512896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "save_gMinlen", scope: !217, file: !7, line: 466, baseType: !89, size: 32, align: 32, offset: 512928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "save_gLimit", scope: !217, file: !7, line: 467, baseType: !294, size: 64, align: 64, offset: 512960)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "save_gBase", scope: !217, file: !7, line: 468, baseType: !294, size: 64, align: 64, offset: 513024)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "save_gPerm", scope: !217, file: !7, line: 469, baseType: !294, size: 64, align: 64, offset: 513088)
!297 = !DISubprogram(name: "BZ2_indexIntoF", scope: !1, file: !1, line: 743, type: !298, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*)* @BZ2_indexIntoF, variables: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!89, !89, !294}
!300 = !{!301, !302, !303, !304, !305}
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indx", arg: 1, scope: !297, file: !1, line: 743, type: !89)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cftab", arg: 2, scope: !297, file: !1, line: 743, type: !294)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !297, file: !1, line: 745, type: !89)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "na", scope: !297, file: !1, line: 745, type: !89)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mid", scope: !297, file: !1, line: 745, type: !89)
!306 = !DISubprogram(name: "BZ2_bzDecompress", scope: !1, file: !1, line: 864, type: !202, isLocal: false, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bz_stream*)* @BZ2_bzDecompress, variables: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strm", arg: 1, scope: !306, file: !1, line: 864, type: !125)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "corrupt", scope: !306, file: !1, line: 866, type: !15)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !306, file: !1, line: 867, type: !215)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !312, file: !1, line: 898, type: !89)
!312 = distinct !DILexicalBlock(scope: !313, file: !1, line: 897, column: 37)
!313 = distinct !DILexicalBlock(scope: !314, file: !1, line: 897, column: 11)
!314 = distinct !DILexicalBlock(scope: !306, file: !1, line: 873, column: 17)
!315 = !DISubprogram(name: "BZ2_bzDecompressEnd", scope: !1, file: !1, line: 918, type: !202, isLocal: false, isDefinition: true, scopeLine: 919, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bz_stream*)* @BZ2_bzDecompressEnd, variables: !316)
!316 = !{!317, !318}
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strm", arg: 1, scope: !315, file: !1, line: 918, type: !125)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !315, file: !1, line: 920, type: !215)
!319 = !DISubprogram(name: "BZ2_bzWriteOpen", scope: !1, file: !1, line: 980, type: !320, isLocal: false, isDefinition: true, scopeLine: 990, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32*, %struct.__sFILE*, i32, i32, i32)* @BZ2_bzWriteOpen, variables: !325)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !324, !21, !29, !29, !29}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "BZFILE", file: !93, line: 292, baseType: null)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!325 = !{!326, !327, !328, !329, !330, !331, !332}
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bzerror", arg: 1, scope: !319, file: !1, line: 981, type: !324)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !319, file: !1, line: 985, type: !21)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blockSize100k", arg: 3, scope: !319, file: !1, line: 987, type: !29)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "verbosity", arg: 4, scope: !319, file: !1, line: 988, type: !29)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "workFactor", arg: 5, scope: !319, file: !1, line: 989, type: !29)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !319, file: !1, line: 991, type: !89)
