; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ActiveThorns.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.T_SKTREE = type { %struct.T_SKTREE*, %struct.T_SKTREE*, %struct.T_SKTREE*, %struct.T_SKTREE*, i8*, i8* }
%struct.iAttributeList = type { i8*, %union.iAttributeData }
%union.iAttributeData = type { i8** }
%struct.IMPLEMENTATION = type { i32, %struct.T_SKTREE*, i8*, i32, i8**, i32, i8** }
%struct.THORN = type { i32, i8* }
%struct.uStringList = type { i32, %struct.iInternalStringList*, %struct.iInternalStringList*, %struct.iInternalStringList* }
%struct.iInternalStringList = type { %struct.iInternalStringList*, i8* }

@.str = private unnamed_addr constant [5 x i8] c"name\00", align 1
@.str1 = private unnamed_addr constant [15 x i8] c"implementation\00", align 1
@.str2 = private unnamed_addr constant [10 x i8] c"ancestors\00", align 1
@.str3 = private unnamed_addr constant [8 x i8] c"friends\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str4 = private unnamed_addr constant [42 x i8] c"Unknown/unimplemented thorn attribute %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !347, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ActiveThorns.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !12, !29, !33, !36}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "THORN", file: !1, line: 42, size: 128, align: 64, elements: !6)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !5, file: !1, line: 45, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "IMPLEMENTATION", file: !1, line: 48, size: 448, align: 64, elements: !14)
!14 = !{!15, !16, !30, !31, !32, !34, !35}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !13, file: !1, line: 50, baseType: !8, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "thornlist", scope: !13, file: !1, line: 51, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sktree", file: !19, line: 23, baseType: !20)
!19 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/SKBinTree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_SKTREE", file: !19, line: 14, size: 384, align: 64, elements: !21)
!21 = !{!22, !24, !25, !26, !27, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !20, file: !19, line: 16, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !20, file: !19, line: 17, baseType: !23, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !19, line: 18, baseType: !23, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !20, file: !19, line: 19, baseType: !23, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !20, file: !19, line: 20, baseType: !10, size: 64, align: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !19, line: 22, baseType: !29, size: 64, align: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "activating_thorn", scope: !13, file: !1, line: 52, baseType: !10, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n_ancestors", scope: !13, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", scope: !13, file: !1, line: 55, baseType: !33, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "n_friends", scope: !13, file: !1, line: 57, baseType: !8, size: 32, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "friends", scope: !13, file: !1, line: 58, baseType: !33, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!39 = !{!40, !43, !78, !88, !94, !103, !111, !117, !122, !131, !136, !142, !148, !154, !222, !230, !236, !244, !247, !255, !256, !262, !285, !304, !317, !325, !331, !340}
!40 = !DISubprogram(name: "CCTKi_version_main_ActiveThorns_c", scope: !1, file: !1, line: 36, type: !41, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_ActiveThorns_c, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{!37}
!43 = !DISubprogram(name: "CCTKi_RegisterThorn", scope: !1, file: !1, line: 132, type: !44, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.iAttributeList*)* @CCTKi_RegisterThorn, variables: !67)
!44 = !DISubroutineType(types: !45)
!45 = !{!8, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "iAttributeList", file: !49, line: 31, size: 128, align: 64, elements: !50)
!49 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctki_ActiveThorns.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !48, file: !49, line: 33, baseType: !37, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "AttributeData", scope: !48, file: !49, line: 34, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DICompositeType(tag: DW_TAG_union_type, name: "iAttributeData", file: !49, line: 25, size: 64, align: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "StringList", scope: !53, file: !49, line: 27, baseType: !36, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "FuncList", scope: !53, file: !49, line: 28, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "iFuncList", file: !49, line: 18, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "keyword", scope: !59, file: !49, line: 20, baseType: !37, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !59, file: !49, line: 21, baseType: !37, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !59, file: !49, line: 22, baseType: !64, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null}
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attributes", arg: 1, scope: !43, file: !1, line: 132, type: !46)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !43, file: !1, line: 134, type: !8)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !43, file: !1, line: 135, type: !8)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !43, file: !1, line: 137, type: !17)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !43, file: !1, line: 138, type: !17)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !43, file: !1, line: 140, type: !4)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !43, file: !1, line: 142, type: !37)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !43, file: !1, line: 143, type: !37)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ancestors", scope: !43, file: !1, line: 145, type: !36)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "friends", scope: !43, file: !1, line: 146, type: !36)
!78 = !DISubprogram(name: "CCTKi_ActivateThorn", scope: !1, file: !1, line: 298, type: !79, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTKi_ActivateThorn, variables: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{!8, !37}
!81 = !{!82, !83, !84, !85, !86, !87}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !78, file: !1, line: 298, type: !37)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !78, file: !1, line: 300, type: !8)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thornnode", scope: !78, file: !1, line: 301, type: !17)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impnode", scope: !78, file: !1, line: 302, type: !17)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !78, file: !1, line: 304, type: !4)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !78, file: !1, line: 305, type: !12)
!88 = !DISubprogram(name: "CCTK_IsThornActive", scope: !1, file: !1, line: 390, type: !79, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_IsThornActive, variables: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !88, file: !1, line: 390, type: !37)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !88, file: !1, line: 392, type: !8)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !88, file: !1, line: 393, type: !17)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !88, file: !1, line: 395, type: !4)
!94 = !DISubprogram(name: "cctk_isthornactive_", scope: !1, file: !1, line: 415, type: !95, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @cctk_isthornactive_, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!8, !10, !97}
!97 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!98 = !{!99, !100, !101, !102}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 1, scope: !94, file: !1, line: 416, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 2, scope: !94, file: !1, line: 416, type: !97)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !94, file: !1, line: 418, type: !8)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !94, file: !1, line: 419, type: !10)
!103 = !DISubprogram(name: "CCTK_ThornImplementation", scope: !1, file: !1, line: 450, type: !104, isLocal: false, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @CCTK_ThornImplementation, variables: !106)
!104 = !DISubroutineType(types: !105)
!105 = !{!37, !37}
!106 = !{!107, !108, !109, !110}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !103, file: !1, line: 450, type: !37)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !103, file: !1, line: 452, type: !37)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !103, file: !1, line: 453, type: !17)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !103, file: !1, line: 455, type: !4)
!111 = !DISubprogram(name: "CCTK_ImplementationThorn", scope: !1, file: !1, line: 497, type: !104, isLocal: false, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @CCTK_ImplementationThorn, variables: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !111, file: !1, line: 497, type: !37)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !111, file: !1, line: 499, type: !37)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !111, file: !1, line: 501, type: !17)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !111, file: !1, line: 503, type: !12)
!117 = !DISubprogram(name: "CCTK_IsThornCompiled", scope: !1, file: !1, line: 547, type: !79, isLocal: false, isDefinition: true, scopeLine: 548, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_IsThornCompiled, variables: !118)
!118 = !{!119, !120, !121}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !117, file: !1, line: 547, type: !37)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !117, file: !1, line: 549, type: !8)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !117, file: !1, line: 550, type: !17)
!122 = !DISubprogram(name: "cctk_isthorncompiled_", scope: !1, file: !1, line: 565, type: !123, isLocal: false, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_isthorncompiled_, variables: !126)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125, !10, !97}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!126 = !{!127, !128, !129, !130}
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 1, scope: !122, file: !1, line: 566, type: !125)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !122, file: !1, line: 566, type: !10)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !122, file: !1, line: 566, type: !97)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !122, file: !1, line: 568, type: !10)
!131 = !DISubprogram(name: "CCTK_IsImplementationCompiled", scope: !1, file: !1, line: 600, type: !79, isLocal: false, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_IsImplementationCompiled, variables: !132)
!132 = !{!133, !134, !135}
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !131, file: !1, line: 600, type: !37)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !131, file: !1, line: 602, type: !8)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !131, file: !1, line: 603, type: !17)
!136 = !DISubprogram(name: "cctk_isimplementationcompiled_", scope: !1, file: !1, line: 618, type: !123, isLocal: false, isDefinition: true, scopeLine: 620, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_isimplementationcompiled_, variables: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 1, scope: !136, file: !1, line: 619, type: !125)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !136, file: !1, line: 619, type: !10)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !136, file: !1, line: 619, type: !97)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !136, file: !1, line: 621, type: !10)
!142 = !DISubprogram(name: "CCTK_IsImplementationActive", scope: !1, file: !1, line: 653, type: !79, isLocal: false, isDefinition: true, scopeLine: 654, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_IsImplementationActive, variables: !143)
!143 = !{!144, !145, !146, !147}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !142, file: !1, line: 653, type: !37)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !142, file: !1, line: 655, type: !8)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !142, file: !1, line: 657, type: !17)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !142, file: !1, line: 659, type: !12)
!148 = !DISubprogram(name: "cctk_isimplementationactive_", scope: !1, file: !1, line: 679, type: !123, isLocal: false, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_isimplementationactive_, variables: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 1, scope: !148, file: !1, line: 680, type: !125)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !148, file: !1, line: 680, type: !10)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !148, file: !1, line: 680, type: !97)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !148, file: !1, line: 682, type: !10)
!154 = !DISubprogram(name: "CCTKi_PrintThorns", scope: !1, file: !1, line: 727, type: !155, isLocal: false, isDefinition: true, scopeLine: 728, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, i32)* @CCTKi_PrintThorns, variables: !215)
!155 = !DISubroutineType(types: !156)
!156 = !{!8, !157, !37, !8}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !159, line: 153, baseType: !160)
!159 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !159, line: 122, size: 1216, align: 64, elements: !161)
!161 = !{!162, !165, !166, !167, !169, !170, !175, !176, !177, !181, !185, !195, !199, !200, !203, !204, !208, !212, !213, !214}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !160, file: !159, line: 123, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !160, file: !159, line: 124, baseType: !8, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !160, file: !159, line: 125, baseType: !8, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !160, file: !159, line: 126, baseType: !168, size: 16, align: 16, offset: 128)
!168 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !160, file: !159, line: 127, baseType: !168, size: 16, align: 16, offset: 144)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !160, file: !159, line: 128, baseType: !171, size: 128, align: 64, offset: 192)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !159, line: 88, size: 128, align: 64, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !171, file: !159, line: 89, baseType: !163, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !171, file: !159, line: 90, baseType: !8, size: 32, align: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !160, file: !159, line: 129, baseType: !8, size: 32, align: 32, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !160, file: !159, line: 132, baseType: !29, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !160, file: !159, line: 133, baseType: !178, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!8, !29}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !160, file: !159, line: 134, baseType: !182, size: 64, align: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!8, !29, !10, !8}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !160, file: !159, line: 135, baseType: !186, size: 64, align: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!189, !29, !189, !8}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !159, line: 77, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !191, line: 71, baseType: !192)
!191 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !193, line: 46, baseType: !194)
!193 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !160, file: !159, line: 136, baseType: !196, size: 64, align: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!8, !29, !37, !8}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !160, file: !159, line: 139, baseType: !171, size: 128, align: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !160, file: !159, line: 140, baseType: !201, size: 64, align: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !159, line: 94, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !160, file: !159, line: 141, baseType: !8, size: 32, align: 32, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !160, file: !159, line: 144, baseType: !205, size: 24, align: 8, offset: 928)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 24, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !160, file: !159, line: 145, baseType: !209, size: 8, align: 8, offset: 952)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 8, align: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !160, file: !159, line: 148, baseType: !171, size: 128, align: 64, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !160, file: !159, line: 151, baseType: !8, size: 32, align: 32, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !160, file: !159, line: 152, baseType: !189, size: 64, align: 64, offset: 1152)
!215 = !{!216, !217, !218, !219, !220, !221}
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !154, file: !1, line: 727, type: !157)
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !154, file: !1, line: 727, type: !37)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "active", arg: 3, scope: !154, file: !1, line: 727, type: !8)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !154, file: !1, line: 729, type: !8)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !154, file: !1, line: 730, type: !17)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !154, file: !1, line: 732, type: !4)
!222 = !DISubprogram(name: "CCTKi_PrintImps", scope: !1, file: !1, line: 791, type: !155, isLocal: false, isDefinition: true, scopeLine: 792, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, i32)* @CCTKi_PrintImps, variables: !223)
!223 = !{!224, !225, !226, !227, !228, !229}
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !222, file: !1, line: 791, type: !157)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !222, file: !1, line: 791, type: !37)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "active", arg: 3, scope: !222, file: !1, line: 791, type: !8)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !222, file: !1, line: 793, type: !8)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !222, file: !1, line: 794, type: !17)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !222, file: !1, line: 796, type: !12)
!230 = !DISubprogram(name: "CCTK_ActivatingThorn", scope: !1, file: !1, line: 841, type: !104, isLocal: false, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @CCTK_ActivatingThorn, variables: !231)
!231 = !{!232, !233, !234, !235}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !230, file: !1, line: 841, type: !37)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !230, file: !1, line: 843, type: !37)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !230, file: !1, line: 845, type: !17)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !230, file: !1, line: 847, type: !12)
!236 = !DISubprogram(name: "CCTK_ImpThornList", scope: !1, file: !1, line: 895, type: !237, isLocal: false, isDefinition: true, scopeLine: 896, flags: DIFlagPrototyped, isOptimized: true, function: %struct.T_SKTREE* (i8*)* @CCTK_ImpThornList, variables: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!17, !37}
!239 = !{!240, !241, !242, !243}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !236, file: !1, line: 895, type: !37)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !236, file: !1, line: 897, type: !17)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !236, file: !1, line: 899, type: !17)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !236, file: !1, line: 901, type: !12)
!244 = !DISubprogram(name: "CCTK_NumCompiledThorns", scope: !1, file: !1, line: 940, type: !245, isLocal: false, isDefinition: true, scopeLine: 941, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumCompiledThorns, variables: !2)
!245 = !DISubroutineType(types: !246)
!246 = !{!8}
!247 = !DISubprogram(name: "CCTK_CompiledThorn", scope: !1, file: !1, line: 971, type: !248, isLocal: false, isDefinition: true, scopeLine: 972, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_CompiledThorn, variables: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{!37, !8}
!250 = !{!251, !252, !253, !254}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tindex", arg: 1, scope: !247, file: !1, line: 971, type: !8)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !247, file: !1, line: 973, type: !8)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !247, file: !1, line: 974, type: !17)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret_val", scope: !247, file: !1, line: 975, type: !37)
!255 = !DISubprogram(name: "CCTK_NumCompiledImplementations", scope: !1, file: !1, line: 1012, type: !245, isLocal: false, isDefinition: true, scopeLine: 1013, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumCompiledImplementations, variables: !2)
!256 = !DISubprogram(name: "CCTK_CompiledImplementation", scope: !1, file: !1, line: 1043, type: !248, isLocal: false, isDefinition: true, scopeLine: 1044, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_CompiledImplementation, variables: !257)
!257 = !{!258, !259, !260, !261}
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tindex", arg: 1, scope: !256, file: !1, line: 1043, type: !8)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !256, file: !1, line: 1045, type: !8)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !256, file: !1, line: 1046, type: !17)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret_val", scope: !256, file: !1, line: 1047, type: !37)
!262 = !DISubprogram(name: "CCTK_ImplementationRequires", scope: !1, file: !1, line: 1084, type: !263, isLocal: false, isDefinition: true, scopeLine: 1085, flags: DIFlagPrototyped, isOptimized: true, function: %struct.uStringList* (i8*)* @CCTK_ImplementationRequires, variables: !279)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !37}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "uStringList", file: !267, line: 30, baseType: !268)
!267 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/util_StringList.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!268 = !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 24, size: 256, align: 64, elements: !269)
!269 = !{!270, !271, !277, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !268, file: !267, line: 26, baseType: !8, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !268, file: !267, line: 27, baseType: !272, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "iInternalStringList", file: !267, line: 18, size: 128, align: 64, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !267, line: 20, baseType: !272, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !273, file: !267, line: 21, baseType: !10, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !268, file: !267, line: 28, baseType: !272, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !268, file: !267, line: 29, baseType: !272, size: 64, align: 64, offset: 192)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imp", arg: 1, scope: !262, file: !1, line: 1084, type: !37)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !262, file: !1, line: 1086, type: !8)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impnode", scope: !262, file: !1, line: 1087, type: !17)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impdata", scope: !262, file: !1, line: 1088, type: !12)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ancestors", scope: !262, file: !1, line: 1089, type: !265)
!285 = !DISubprogram(name: "CCTKi_ActivateThorns", scope: !1, file: !1, line: 1138, type: !79, isLocal: false, isDefinition: true, scopeLine: 1139, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTKi_ActivateThorns, variables: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "activethornlist", arg: 1, scope: !285, file: !1, line: 1138, type: !37)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !285, file: !1, line: 1140, type: !8)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_list", scope: !285, file: !1, line: 1141, type: !10)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "required_thorns", scope: !285, file: !1, line: 1142, type: !265)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "requested_imps", scope: !285, file: !1, line: 1143, type: !265)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "required_imps", scope: !285, file: !1, line: 1144, type: !265)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "token", scope: !285, file: !1, line: 1145, type: !10)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_imp", scope: !285, file: !1, line: 1146, type: !37)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_warnings", scope: !285, file: !1, line: 1147, type: !8)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_errors", scope: !285, file: !1, line: 1148, type: !8)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impnode", scope: !285, file: !1, line: 1149, type: !17)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impthornlist", scope: !285, file: !1, line: 1150, type: !17)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !285, file: !1, line: 1152, type: !12)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !285, file: !1, line: 1153, type: !8)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp1", scope: !285, file: !1, line: 1155, type: !37)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp2", scope: !285, file: !1, line: 1155, type: !37)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !285, file: !1, line: 1156, type: !37)
!304 = !DISubprogram(name: "RegisterImp", scope: !1, file: !1, line: 1400, type: !305, isLocal: true, isDefinition: true, scopeLine: 1404, flags: DIFlagPrototyped, isOptimized: true, variables: !307)
!305 = !DISubroutineType(types: !306)
!306 = !{!8, !37, !37, !36, !36}
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !304, file: !1, line: 1400, type: !37)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !304, file: !1, line: 1401, type: !37)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ancestors", arg: 3, scope: !304, file: !1, line: 1402, type: !36)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "friends", arg: 4, scope: !304, file: !1, line: 1403, type: !36)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !304, file: !1, line: 1405, type: !8)
