; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CactusDefaultEvolve.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.anon = type { double, double, i8*, i32, i32 }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }

@CCTK_MainLoopIndex = external global i32 ()*
@.str = private unnamed_addr constant [14 x i8] c"CCTK_ANALYSIS\00", align 1
@CCTK_OutputGH = external global i32 (%struct.cGH*)*
@.str1 = private unnamed_addr constant [88 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CactusDefaultEvolve.c\00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str3 = private unnamed_addr constant [83 x i8] c"Variable '%s' has multiple timelevels, default Cactus evolve routine cannot rotate\00", align 1
@CCTK_SetMainLoopIndex = external global i32 (i32)*
@.str4 = private unnamed_addr constant [16 x i8] c"CCTK_CHECKPOINT\00", align 1
@cactus_terminate = common global i32 0, align 4
@.str5 = private unnamed_addr constant [95 x i8] c"$Header: /cactus/Cactus/src/main/CactusDefaultEvolve.c,v 1.55 2001/09/20 21:46:18 tradke Exp $\00", align 1
@cactusrest_ = external global %struct.anon

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !110, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CactusDefaultEvolve.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !76, !105}
!4 = !DISubprogram(name: "CCTKi_version_main_CactusDefaultEvolve_c", scope: !1, file: !1, line: 30, type: !5, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_CactusDefaultEvolve_c, variables: !2)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DISubprogram(name: "CactusDefaultEvolve", scope: !1, file: !1, line: 105, type: !11, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tFleshConfig*)* @CactusDefaultEvolve, variables: !62)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !16, line: 28, baseType: !17)
!16 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!17 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 19, size: 192, align: 64, elements: !18)
!18 = !{!19, !21, !60}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !17, file: !16, line: 21, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !17, file: !16, line: 24, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !25, line: 75, baseType: !26)
!25 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 24, size: 1216, align: 64, elements: !27)
!27 = !{!28, !29, !30, !32, !33, !34, !35, !36, !37, !38, !40, !42, !43, !44, !45, !46, !47, !48, !52, !53}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !26, file: !25, line: 26, baseType: !13, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !26, file: !25, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !26, file: !25, line: 30, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !26, file: !25, line: 31, baseType: !31, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !26, file: !25, line: 32, baseType: !31, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !26, file: !25, line: 33, baseType: !31, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !26, file: !25, line: 36, baseType: !31, size: 64, align: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !26, file: !25, line: 39, baseType: !31, size: 64, align: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !26, file: !25, line: 40, baseType: !31, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !26, file: !25, line: 43, baseType: !39, size: 64, align: 64, offset: 512)
!39 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !26, file: !25, line: 44, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !26, file: !25, line: 47, baseType: !41, size: 64, align: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !26, file: !25, line: 51, baseType: !31, size: 64, align: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !26, file: !25, line: 54, baseType: !31, size: 64, align: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !26, file: !25, line: 57, baseType: !13, size: 32, align: 32, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !26, file: !25, line: 60, baseType: !31, size: 64, align: 64, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !26, file: !25, line: 63, baseType: !39, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !26, file: !25, line: 67, baseType: !49, size: 64, align: 64, offset: 1024)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !26, file: !25, line: 70, baseType: !50, size: 64, align: 64, offset: 1088)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !26, file: !25, line: 73, baseType: !54, size: 64, align: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !25, line: 22, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 18, size: 16, align: 8, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !56, file: !25, line: 20, baseType: !9, size: 8, align: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !56, file: !25, line: 21, baseType: !9, size: 8, align: 8, offset: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !17, file: !16, line: 25, baseType: !61, size: 32, align: 32, offset: 128)
!61 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !64, !65, !66, !67, !69, !72, !74}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !10, file: !1, line: 105, type: !14)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !10, file: !1, line: 107, type: !13)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convergence_level", scope: !10, file: !1, line: 108, type: !61)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iteration", scope: !10, file: !1, line: 108, type: !61)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !68, file: !1, line: 119, type: !13)
!68 = distinct !DILexicalBlock(scope: !10, file: !1, line: 119, column: 3)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !70, file: !1, line: 152, type: !13)
!70 = distinct !DILexicalBlock(scope: !71, file: !1, line: 152, column: 5)
!71 = distinct !DILexicalBlock(scope: !10, file: !1, line: 132, column: 3)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !73, file: !1, line: 162, type: !13)
!73 = distinct !DILexicalBlock(scope: !71, file: !1, line: 162, column: 5)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !75, file: !1, line: 175, type: !13)
!75 = distinct !DILexicalBlock(scope: !71, file: !1, line: 175, column: 5)
!76 = !DISubprogram(name: "DoneMainLoop", scope: !1, file: !1, line: 237, type: !77, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !79)
!77 = !DISubroutineType(types: !78)
!78 = !{!13, !23, !39, !13}
!79 = !{!80, !81, !82, !83, !84, !86, !87, !88, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !76, file: !1, line: 237, type: !23)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 2, scope: !76, file: !1, line: 237, type: !39)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iteration", arg: 3, scope: !76, file: !1, line: 237, type: !13)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !76, file: !1, line: 239, type: !13)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !76, file: !1, line: 240, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !76, file: !1, line: 240, type: !85)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !76, file: !1, line: 240, type: !7)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !76, file: !1, line: 240, type: !89)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !76, file: !1, line: 240, type: !89)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_run_title", scope: !76, file: !1, line: 240, type: !7)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_timer_output", scope: !76, file: !1, line: 240, type: !7)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allow_mixeddim_gfs", scope: !76, file: !1, line: 240, type: !89)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_brief_output", scope: !76, file: !1, line: 240, type: !89)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_full_warnings", scope: !76, file: !1, line: 240, type: !89)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_show_banners", scope: !76, file: !1, line: 240, type: !89)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_show_schedule", scope: !76, file: !1, line: 240, type: !89)
