; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CactusDefaultComm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }

@cctki_paramchecking = external global i32
@cctki_paramcheck_nprocs = external global i32
@.str = private unnamed_addr constant [93 x i8] c"$Header: /cactus/Cactus/src/comm/CactusDefaultComm.c,v 1.48 2001/10/31 11:45:31 tradke Exp $\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_comm_CactusDefaultComm_c() #0 {
  ret i8* getelementptr inbounds ([93 x i8]* @.str, i64 0, i64 0), !dbg !103
}

; Function Attrs: nounwind optsize ssp uwtable
define %struct.cGH* @CactusDefaultSetupGH(%struct.tFleshConfig* %config, i32 %convergence_level) #1 {
  tail call void @llvm.dbg.value(metadata %struct.tFleshConfig* %config, i64 0, metadata !64, metadata !104), !dbg !105
  tail call void @llvm.dbg.value(metadata i32 %convergence_level, i64 0, metadata !65, metadata !104), !dbg !106
  %1 = icmp sgt i32 %convergence_level, 0, !dbg !107
  br i1 %1, label %.thread, label %2, !dbg !109

; <label>:2                                       ; preds = %0

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !43, globals: !97, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CactusDefaultComm.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !13, !23, !31, !32, !33, !36}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !6, line: 75, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 24, size: 1216, align: 64, elements: !8)
!8 = !{!9, !11, !12, !14, !15, !16, !17, !18, !19, !20, !22, !24, !25, !26, !27, !28, !29, !30, !34, !35}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !7, file: !6, line: 26, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !7, file: !6, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !7, file: !6, line: 30, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !7, file: !6, line: 31, baseType: !13, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !7, file: !6, line: 32, baseType: !13, size: 64, align: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !7, file: !6, line: 33, baseType: !13, size: 64, align: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !7, file: !6, line: 36, baseType: !13, size: 64, align: 64, offset: 320)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !7, file: !6, line: 39, baseType: !13, size: 64, align: 64, offset: 384)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !7, file: !6, line: 40, baseType: !13, size: 64, align: 64, offset: 448)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !7, file: !6, line: 43, baseType: !21, size: 64, align: 64, offset: 512)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !7, file: !6, line: 44, baseType: !23, size: 64, align: 64, offset: 576)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !7, file: !6, line: 47, baseType: !23, size: 64, align: 64, offset: 640)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !7, file: !6, line: 51, baseType: !13, size: 64, align: 64, offset: 704)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !7, file: !6, line: 54, baseType: !13, size: 64, align: 64, offset: 768)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !7, file: !6, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !7, file: !6, line: 60, baseType: !13, size: 64, align: 64, offset: 896)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !7, file: !6, line: 63, baseType: !21, size: 64, align: 64, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !6, line: 67, baseType: !31, size: 64, align: 64, offset: 1024)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !7, file: !6, line: 70, baseType: !32, size: 64, align: 64, offset: 1088)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !7, file: !6, line: 73, baseType: !36, size: 64, align: 64, offset: 1152)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !6, line: 22, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 18, size: 16, align: 8, elements: !39)
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !38, file: !6, line: 20, baseType: !41, size: 8, align: 8)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !38, file: !6, line: 21, baseType: !41, size: 8, align: 8, offset: 8)
!43 = !{!44, !49, !72, !80, !84, !90, !94}
!44 = !DISubprogram(name: "CCTKi_version_comm_CactusDefaultComm_c", scope: !1, file: !1, line: 32, type: !45, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_comm_CactusDefaultComm_c, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!49 = !DISubprogram(name: "CactusDefaultSetupGH", scope: !1, file: !1, line: 110, type: !50, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: %struct.cGH* (%struct.tFleshConfig*, i32)* @CactusDefaultSetupGH, variables: !63)
!50 = !DISubroutineType(types: !51)
!51 = !{!4, !52, !10}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !54, line: 28, baseType: !55)
!54 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 19, size: 192, align: 64, elements: !56)
!56 = !{!57, !59, !61}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !55, file: !54, line: 21, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !55, file: !54, line: 24, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !55, file: !54, line: 25, baseType: !62, size: 32, align: 32, offset: 128)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !49, file: !1, line: 110, type: !52)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "convergence_level", arg: 2, scope: !49, file: !1, line: 110, type: !10)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thisGH", scope: !49, file: !1, line: 112, type: !4)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_groups", scope: !49, file: !1, line: 113, type: !10)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_variables", scope: !49, file: !1, line: 114, type: !10)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable", scope: !49, file: !1, line: 115, type: !10)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntimelevels", scope: !49, file: !1, line: 116, type: !10)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_dim", scope: !49, file: !1, line: 117, type: !10)
!72 = !DISubprogram(name: "CactusDefaultMyProc", scope: !1, file: !1, line: 243, type: !73, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CactusDefaultMyProc, variables: !77)
!73 = !DISubroutineType(types: !74)
!74 = !{!10, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!77 = !{!78, !79}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !72, file: !1, line: 243, type: !75)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !72, file: !1, line: 245, type: !10)
!80 = !DISubprogram(name: "CactusDefaultnProcs", scope: !1, file: !1, line: 284, type: !73, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CactusDefaultnProcs, variables: !81)
!81 = !{!82, !83}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !80, file: !1, line: 284, type: !75)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprocs", scope: !80, file: !1, line: 286, type: !10)
!84 = !DISubprogram(name: "CactusDefaultExit", scope: !1, file: !1, line: 338, type: !85, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CactusDefaultExit, variables: !87)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !4, !10}
!87 = !{!88, !89}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !84, file: !1, line: 338, type: !4)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 2, scope: !84, file: !1, line: 338, type: !10)
!90 = !DISubprogram(name: "CactusDefaultAbort", scope: !1, file: !1, line: 381, type: !85, isLocal: false, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CactusDefaultAbort, variables: !91)
!91 = !{!92, !93}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !90, file: !1, line: 381, type: !4)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 2, scope: !90, file: !1, line: 381, type: !10)
!94 = !DISubprogram(name: "CactusDefaultBarrier", scope: !1, file: !1, line: 424, type: !73, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CactusDefaultBarrier, variables: !95)
!95 = !{!96}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !94, file: !1, line: 424, type: !75)
!97 = !{!98}
!98 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 30, type: !47, isLocal: true, isDefinition: true)
!99 = !{i32 2, !"Dwarf Version", i32 2}
