; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/ChooseOutput.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@ioasciipriv_ = external global %struct.anon
@iorest_ = external global %struct.anon.0
@.str = private unnamed_addr constant [15 x i8] c"out1D_xline_yi\00", align 1
@.str1 = private unnamed_addr constant [8 x i8] c"IOASCII\00", align 1
@.str2 = private unnamed_addr constant [13 x i8] c"out_xline_yi\00", align 1
@.str3 = private unnamed_addr constant [7 x i8] c"IOUtil\00", align 1
@.str4 = private unnamed_addr constant [14 x i8] c"out1D_xline_y\00", align 1
@.str5 = private unnamed_addr constant [15 x i8] c"out1D_xline_zi\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !45, globals: !231, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/ChooseOutput.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "asciiioGH", file: !10, line: 55, baseType: !11)
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/ioASCIIGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOASCIIGH", file: !10, line: 20, size: 1024, align: 64, elements: !12)
!12 = !{!13, !14, !15, !16, !19, !20, !21, !22, !23, !24, !25, !26, !27, !39, !40, !41, !44}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_every", scope: !11, file: !10, line: 23, baseType: !7, size: 32, align: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_every", scope: !11, file: !10, line: 24, baseType: !7, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_every", scope: !11, file: !10, line: 25, baseType: !7, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "do_out1D", scope: !11, file: !10, line: 28, baseType: !17, size: 64, align: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "do_out2D", scope: !11, file: !10, line: 29, baseType: !17, size: 64, align: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "do_out3D", scope: !11, file: !10, line: 30, baseType: !17, size: 64, align: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "outdir1D", scope: !11, file: !10, line: 33, baseType: !17, size: 64, align: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "outdir2D", scope: !11, file: !10, line: 34, baseType: !17, size: 64, align: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "outdir3D", scope: !11, file: !10, line: 35, baseType: !17, size: 64, align: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_last", scope: !11, file: !10, line: 38, baseType: !6, size: 64, align: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_last", scope: !11, file: !10, line: 39, baseType: !6, size: 64, align: 64, offset: 576)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_last", scope: !11, file: !10, line: 40, baseType: !6, size: 64, align: 64, offset: 640)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "filenameList1D", scope: !11, file: !10, line: 43, baseType: !28, size: 64, align: 64, offset: 704)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !30, line: 26, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !30, line: 18, size: 256, align: 64, elements: !32)
!32 = !{!33, !35, !36, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !31, file: !30, line: 20, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 21, baseType: !34, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !30, line: 23, baseType: !17, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !30, line: 25, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_2D", scope: !11, file: !10, line: 44, baseType: !28, size: 64, align: 64, offset: 768)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_3D", scope: !11, file: !10, line: 45, baseType: !28, size: 64, align: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "spxyz", scope: !11, file: !10, line: 49, baseType: !42, size: 64, align: 64, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sp2xyz", scope: !11, file: !10, line: 53, baseType: !43, size: 64, align: 64, offset: 960)
!45 = !{!46, !51, !162}
!46 = !DISubprogram(name: "CCTKi_version_CactusBase_IOASCII_ChooseOutput_c", scope: !1, file: !1, line: 26, type: !47, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOASCII_ChooseOutput_c, variables: !2)
!47 = !DISubroutineType(types: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!51 = !DISubprogram(name: "IOASCII_Choose1D", scope: !1, file: !1, line: 76, type: !52, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cGH*)* @IOASCII_Choose1D, variables: !87)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !56, line: 75, baseType: !57)
!56 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 24, size: 1216, align: 64, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !80}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !57, file: !56, line: 26, baseType: !7, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !57, file: !56, line: 27, baseType: !7, size: 32, align: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !57, file: !56, line: 30, baseType: !6, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !57, file: !56, line: 31, baseType: !6, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !57, file: !56, line: 32, baseType: !6, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !57, file: !56, line: 33, baseType: !6, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !57, file: !56, line: 36, baseType: !6, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !57, file: !56, line: 39, baseType: !6, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !57, file: !56, line: 40, baseType: !6, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !57, file: !56, line: 43, baseType: !5, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !57, file: !56, line: 44, baseType: !4, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !57, file: !56, line: 47, baseType: !4, size: 64, align: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !57, file: !56, line: 51, baseType: !6, size: 64, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !57, file: !56, line: 54, baseType: !6, size: 64, align: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !57, file: !56, line: 57, baseType: !7, size: 32, align: 32, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !57, file: !56, line: 60, baseType: !6, size: 64, align: 64, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !57, file: !56, line: 63, baseType: !5, size: 64, align: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !56, line: 67, baseType: !77, size: 64, align: 64, offset: 1024)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !57, file: !56, line: 70, baseType: !78, size: 64, align: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !57, file: !56, line: 73, baseType: !81, size: 64, align: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !56, line: 22, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 18, size: 16, align: 8, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !83, file: !56, line: 20, baseType: !18, size: 8, align: 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !83, file: !56, line: 21, baseType: !18, size: 8, align: 8, offset: 8)
!87 = !{!88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !153, !154, !155, !156, !160}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !51, file: !1, line: 76, type: !54)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_y", scope: !51, file: !1, line: 78, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_z", scope: !51, file: !1, line: 78, type: !90)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_x", scope: !51, file: !1, line: 78, type: !90)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_z", scope: !51, file: !1, line: 78, type: !90)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_x", scope: !51, file: !1, line: 78, type: !90)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_y", scope: !51, file: !1, line: 78, type: !90)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xyplane_z", scope: !51, file: !1, line: 78, type: !90)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xzplane_y", scope: !51, file: !1, line: 78, type: !90)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_yzplane_x", scope: !51, file: !1, line: 78, type: !90)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_style", scope: !51, file: !1, line: 78, type: !49)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_vars", scope: !51, file: !1, line: 78, type: !49)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_style", scope: !51, file: !1, line: 78, type: !49)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_vars", scope: !51, file: !1, line: 78, type: !49)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_style", scope: !51, file: !1, line: 78, type: !49)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_vars", scope: !51, file: !1, line: 78, type: !49)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_format", scope: !51, file: !1, line: 78, type: !49)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_style", scope: !51, file: !1, line: 78, type: !49)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir1D", scope: !51, file: !1, line: 78, type: !49)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir2D", scope: !51, file: !1, line: 78, type: !49)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir3D", scope: !51, file: !1, line: 78, type: !49)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_d", scope: !51, file: !1, line: 78, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_every", scope: !51, file: !1, line: 78, type: !111)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_x", scope: !51, file: !1, line: 78, type: !111)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_yi", scope: !51, file: !1, line: 78, type: !111)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_zi", scope: !51, file: !1, line: 78, type: !111)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_y", scope: !51, file: !1, line: 78, type: !111)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_xi", scope: !51, file: !1, line: 78, type: !111)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_zi", scope: !51, file: !1, line: 78, type: !111)
