; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Comm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }

@.str = private unnamed_addr constant [71 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Comm.c\00", align 1
@.str1 = private unnamed_addr constant [5 x i8] c"PUGH\00", align 1
@.str2 = private unnamed_addr constant [34 x i8] c"PUGH_SyncGroup: Unknown group: %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !114, globals: !267, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Comm.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !82, !6, !32}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !8, line: 126, baseType: !9)
!8 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !8, line: 96, size: 832, align: 64, elements: !10)
!10 = !{!11, !14, !16, !17, !19, !20, !21, !22, !23, !24, !25, !54, !63, !77, !78, !79, !80}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 98, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 99, baseType: !15, size: 32, align: 32, offset: 64)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !9, file: !8, line: 100, baseType: !15, size: 32, align: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !9, file: !8, line: 101, baseType: !18, size: 64, align: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !9, file: !8, line: 102, baseType: !18, size: 64, align: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !9, file: !8, line: 103, baseType: !15, size: 32, align: 32, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !9, file: !8, line: 104, baseType: !15, size: 32, align: 32, offset: 288)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !9, file: !8, line: 106, baseType: !18, size: 64, align: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !9, file: !8, line: 114, baseType: !15, size: 32, align: 32, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !9, file: !8, line: 115, baseType: !15, size: 32, align: 32, offset: 416)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !9, file: !8, line: 117, baseType: !26, size: 64, align: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !8, line: 72, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !8, line: 37, size: 2368, align: 64, elements: !29)
!29 = !{!30, !31, !33, !35, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !51, !53}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !28, file: !8, line: 39, baseType: !15, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !28, file: !8, line: 41, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !28, file: !8, line: 44, baseType: !34, size: 64, align: 64, offset: 128)
!34 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !28, file: !8, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !28, file: !8, line: 46, baseType: !36, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !28, file: !8, line: 47, baseType: !32, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !28, file: !8, line: 49, baseType: !32, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !28, file: !8, line: 50, baseType: !15, size: 32, align: 32, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !28, file: !8, line: 51, baseType: !32, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !28, file: !8, line: 52, baseType: !36, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !28, file: !8, line: 55, baseType: !32, size: 64, align: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !28, file: !8, line: 56, baseType: !32, size: 64, align: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !28, file: !8, line: 59, baseType: !32, size: 64, align: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !28, file: !8, line: 60, baseType: !47, size: 512, align: 64, offset: 832)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DISubrange(count: 4)
!50 = !DISubrange(count: 2)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !28, file: !8, line: 64, baseType: !52, size: 512, align: 64, offset: 1344)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, align: 64, elements: !48)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !28, file: !8, line: 68, baseType: !52, size: 512, align: 64, offset: 1856)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !9, file: !8, line: 118, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !8, line: 29, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !8, line: 23, size: 256, align: 64, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !57, file: !8, line: 25, baseType: !15, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !57, file: !8, line: 26, baseType: !32, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !57, file: !8, line: 27, baseType: !36, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !57, file: !8, line: 28, baseType: !32, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !9, file: !8, line: 120, baseType: !64, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !8, line: 94, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !8, line: 74, size: 448, align: 64, elements: !67)
!67 = !{!68, !69, !71, !72, !73, !74, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !66, file: !8, line: 77, baseType: !32, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !66, file: !8, line: 78, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !66, file: !8, line: 79, baseType: !70, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !66, file: !8, line: 80, baseType: !15, size: 32, align: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !66, file: !8, line: 82, baseType: !32, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !66, file: !8, line: 84, baseType: !15, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !66, file: !8, line: 85, baseType: !15, size: 32, align: 32, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !66, file: !8, line: 86, baseType: !15, size: 32, align: 32, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !9, file: !8, line: 121, baseType: !64, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !9, file: !8, line: 123, baseType: !15, size: 32, align: 32, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !9, file: !8, line: 124, baseType: !15, size: 32, align: 32, offset: 736)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !9, file: !8, line: 125, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !84, line: 81, baseType: !85)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !84, line: 13, size: 1152, align: 64, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !111, !113}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !85, file: !84, line: 17, baseType: !18, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !85, file: !84, line: 18, baseType: !15, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !85, file: !84, line: 21, baseType: !15, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !85, file: !84, line: 22, baseType: !15, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !85, file: !84, line: 23, baseType: !15, size: 32, align: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !85, file: !84, line: 27, baseType: !15, size: 32, align: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !85, file: !84, line: 28, baseType: !15, size: 32, align: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !85, file: !84, line: 29, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !85, file: !84, line: 32, baseType: !15, size: 32, align: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !85, file: !84, line: 34, baseType: !32, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !85, file: !84, line: 35, baseType: !15, size: 32, align: 32, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !85, file: !84, line: 37, baseType: !15, size: 32, align: 32, offset: 480)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !85, file: !84, line: 41, baseType: !34, size: 64, align: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !85, file: !84, line: 41, baseType: !34, size: 64, align: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !85, file: !84, line: 41, baseType: !34, size: 64, align: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !85, file: !84, line: 41, baseType: !34, size: 64, align: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !85, file: !84, line: 44, baseType: !15, size: 32, align: 32, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !85, file: !84, line: 45, baseType: !15, size: 32, align: 32, offset: 800)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !85, file: !84, line: 46, baseType: !15, size: 32, align: 32, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !85, file: !84, line: 49, baseType: !15, size: 32, align: 32, offset: 864)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !85, file: !84, line: 53, baseType: !15, size: 32, align: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !85, file: !84, line: 76, baseType: !110, size: 64, align: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !85, file: !84, line: 77, baseType: !112, size: 64, align: 64, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !85, file: !84, line: 79, baseType: !12, size: 64, align: 64, offset: 1088)
!114 = !{!115, !120, !173, !180, !189, !195, !200, !203, !210, !217, !224, !232, !240, !246, !250}
!115 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_Comm_c", scope: !1, file: !1, line: 30, type: !116, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_Comm_c, variables: !2)
!116 = !DISubroutineType(types: !117)
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!120 = !DISubprogram(name: "PUGH_SyncGroup", scope: !1, file: !1, line: 75, type: !121, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @PUGH_SyncGroup, variables: !155)
!121 = !DISubroutineType(types: !122)
!122 = !{!15, !123, !118}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !125, line: 75, baseType: !126)
!125 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!126 = !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 24, size: 1216, align: 64, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !126, file: !125, line: 26, baseType: !15, size: 32, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !126, file: !125, line: 27, baseType: !15, size: 32, align: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !126, file: !125, line: 30, baseType: !32, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !126, file: !125, line: 31, baseType: !32, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !126, file: !125, line: 32, baseType: !32, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !126, file: !125, line: 33, baseType: !32, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !126, file: !125, line: 36, baseType: !32, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !126, file: !125, line: 39, baseType: !32, size: 64, align: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !126, file: !125, line: 40, baseType: !32, size: 64, align: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !126, file: !125, line: 43, baseType: !34, size: 64, align: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !126, file: !125, line: 44, baseType: !139, size: 64, align: 64, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !126, file: !125, line: 47, baseType: !139, size: 64, align: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !126, file: !125, line: 51, baseType: !32, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !126, file: !125, line: 54, baseType: !32, size: 64, align: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !126, file: !125, line: 57, baseType: !15, size: 32, align: 32, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !126, file: !125, line: 60, baseType: !32, size: 64, align: 64, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !126, file: !125, line: 63, baseType: !34, size: 64, align: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !125, line: 67, baseType: !95, size: 64, align: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !126, file: !125, line: 70, baseType: !70, size: 64, align: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !126, file: !125, line: 73, baseType: !149, size: 64, align: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !125, line: 22, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 18, size: 16, align: 8, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !151, file: !125, line: 20, baseType: !13, size: 8, align: 8)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !151, file: !125, line: 21, baseType: !13, size: 8, align: 8, offset: 8)
!155 = !{!156, !157, !158, !171, !172}
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !120, file: !1, line: 75, type: !123)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 2, scope: !120, file: !1, line: 75, type: !118)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pgroup", scope: !120, file: !1, line: 77, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !160, line: 24, baseType: !161)
!160 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!161 = !DICompositeType(tag: DW_TAG_structure_type, file: !160, line: 14, size: 256, align: 32, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !161, file: !160, line: 16, baseType: !15, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !161, file: !160, line: 17, baseType: !15, size: 32, align: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !161, file: !160, line: 18, baseType: !15, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !161, file: !160, line: 19, baseType: !15, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !161, file: !160, line: 20, baseType: !15, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !161, file: !160, line: 21, baseType: !15, size: 32, align: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !161, file: !160, line: 22, baseType: !15, size: 32, align: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !161, file: !160, line: 23, baseType: !15, size: 32, align: 32, offset: 224)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !120, file: !1, line: 78, type: !15)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !120, file: !1, line: 79, type: !15)
!173 = !DISubprogram(name: "PUGH_EnableGroupComm", scope: !1, file: !1, line: 142, type: !121, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @PUGH_EnableGroupComm, variables: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !173, file: !1, line: 142, type: !123)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 2, scope: !173, file: !1, line: 142, type: !118)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !173, file: !1, line: 144, type: !15)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pgroup", scope: !173, file: !1, line: 145, type: !159)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !173, file: !1, line: 146, type: !15)
!180 = !DISubprogram(name: "PUGH_DisableGroupComm", scope: !1, file: !1, line: 200, type: !121, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @PUGH_DisableGroupComm, variables: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !180, file: !1, line: 200, type: !123)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 2, scope: !180, file: !1, line: 200, type: !118)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !180, file: !1, line: 202, type: !15)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pgroup", scope: !180, file: !1, line: 203, type: !159)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !180, file: !1, line: 204, type: !15)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !180, file: !1, line: 206, type: !82)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !180, file: !1, line: 207, type: !15)
!189 = !DISubprogram(name: "PUGH_EnableGArrayComm", scope: !1, file: !1, line: 250, type: !190, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PGA*, i32)* @PUGH_EnableGArrayComm, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{!15, !6, !15}
!192 = !{!193, !194}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GA", arg: 1, scope: !189, file: !1, line: 250, type: !6)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "commflag", arg: 2, scope: !189, file: !1, line: 251, type: !15)
!195 = !DISubprogram(name: "PUGH_DisableGArrayComm", scope: !1, file: !1, line: 274, type: !196, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PGA*)* @PUGH_DisableGArrayComm, variables: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{!15, !6}
!198 = !{!199}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GA", arg: 1, scope: !195, file: !1, line: 274, type: !6)
!200 = !DISubprogram(name: "PUGH_SyncGArray", scope: !1, file: !1, line: 325, type: !196, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PGA*)* @PUGH_SyncGArray, variables: !201)
!201 = !{!202}
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GA", arg: 1, scope: !200, file: !1, line: 325, type: !6)
!203 = !DISubprogram(name: "PUGH_Barrier", scope: !1, file: !1, line: 337, type: !204, isLocal: false, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @PUGH_Barrier, variables: !208)
