; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CommandLine.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.PARAM_PROPS = type { i8*, i8*, i32, i8*, i8*, i32, %struct.RANGE*, i32, i32 }
%struct.RANGE = type { %struct.RANGE*, %struct.RANGE*, i8*, i8*, i32, i8* }

@CCTK_MyProc = external global i32 (%struct.cGH*)*
@.str = private unnamed_addr constant [25 x i8] c"Thorn '%s' %savailable.\0A\00", align 1
@.str1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str2 = private unnamed_addr constant [3 x i8] c"un\00", align 1
@CCTK_Exit = external global i32 (%struct.cGH*, i32)*
@.str3 = private unnamed_addr constant [58 x i8] c"\0AParameters of thorn '%s' providing implementation '%s':\0A\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str4 = private unnamed_addr constant [29 x i8] c"Unknown verbosity option %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !111, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/CommandLine.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !12, !19, !55, !62, !67, !73, !78, !82, !85, !86, !91, !95, !98, !105}
!6 = !DISubprogram(name: "CCTKi_version_main_CommandLine_c", scope: !1, file: !1, line: 40, type: !7, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_CommandLine_c, variables: !2)
!7 = !DISubroutineType(types: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DISubprogram(name: "CCTKi_CommandLineTestThornCompiled", scope: !1, file: !1, line: 99, type: !13, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineTestThornCompiled, variables: !15)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !9}
!15 = !{!16, !17}
!16 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !12, file: !1, line: 99, type: !9)
!17 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !12, file: !1, line: 101, type: !18)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DISubprogram(name: "CCTKi_CommandLineDescribeAllParameters", scope: !1, file: !1, line: 132, type: !13, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineDescribeAllParameters, variables: !20)
!20 = !{!21, !22, !23, !24, !25, !27, !28}
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !19, file: !1, line: 132, type: !9)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !19, file: !1, line: 134, type: !18)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_thorns", scope: !19, file: !1, line: 134, type: !18)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !19, file: !1, line: 134, type: !18)
!25 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !19, file: !1, line: 135, type: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thornname", scope: !19, file: !1, line: 136, type: !9)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "properties", scope: !19, file: !1, line: 137, type: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "cParamData", file: !32, line: 112, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Parameter.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "PARAM_PROPS", file: !32, line: 97, size: 512, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !53, !54}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !32, line: 99, baseType: !26, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !33, file: !32, line: 100, baseType: !26, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !33, file: !32, line: 101, baseType: !18, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !33, file: !32, line: 103, baseType: !26, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !33, file: !32, line: 104, baseType: !26, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !32, line: 106, baseType: !18, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !33, file: !32, line: 107, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_range", file: !32, line: 82, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "RANGE", file: !32, line: 74, size: 384, align: 64, elements: !45)
!45 = !{!46, !48, !49, !50, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !44, file: !32, line: 76, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !32, line: 77, baseType: !47, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !44, file: !32, line: 78, baseType: !26, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !44, file: !32, line: 79, baseType: !26, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !44, file: !32, line: 80, baseType: !18, size: 32, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !44, file: !32, line: 81, baseType: !26, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "n_set", scope: !33, file: !32, line: 109, baseType: !18, size: 32, align: 32, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "steerable", scope: !33, file: !32, line: 110, baseType: !18, size: 32, align: 32, offset: 480)
!55 = !DISubprogram(name: "CCTKi_CommandLineDescribeParameter", scope: !1, file: !1, line: 198, type: !13, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineDescribeParameter, variables: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !55, file: !1, line: 198, type: !9)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !55, file: !1, line: 200, type: !26)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !55, file: !1, line: 200, type: !26)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cthorn", scope: !55, file: !1, line: 201, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "properties", scope: !55, file: !1, line: 202, type: !29)
!62 = !DISubprogram(name: "CCTKi_CommandLineTestParameters", scope: !1, file: !1, line: 248, type: !13, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineTestParameters, variables: !63)
!63 = !{!64, !65, !66}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !62, file: !1, line: 248, type: !9)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprocs", scope: !62, file: !1, line: 250, type: !18)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endptr", scope: !62, file: !1, line: 251, type: !26)
!67 = !DISubprogram(name: "CCTKi_CommandLineWarningLevel", scope: !1, file: !1, line: 289, type: !13, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineWarningLevel, variables: !68)
!68 = !{!69, !70, !71}
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !67, file: !1, line: 289, type: !9)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endptr", scope: !67, file: !1, line: 291, type: !26)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "warninglevel", scope: !67, file: !1, line: 292, type: !72)
!72 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DISubprogram(name: "CCTKi_CommandLineErrorLevel", scope: !1, file: !1, line: 322, type: !13, isLocal: false, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineErrorLevel, variables: !74)
!74 = !{!75, !76, !77}
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !73, file: !1, line: 322, type: !9)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endptr", scope: !73, file: !1, line: 324, type: !26)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errorlevel", scope: !73, file: !1, line: 325, type: !72)
!78 = !DISubprogram(name: "CCTKi_CommandLineParameterLevel", scope: !1, file: !1, line: 355, type: !13, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTKi_CommandLineParameterLevel, variables: !79)
!79 = !{!80, !81}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 1, scope: !78, file: !1, line: 355, type: !9)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parameterlevel", scope: !78, file: !1, line: 357, type: !18)
!82 = !DISubprogram(name: "CCTKi_CommandLineRedirectStdout", scope: !1, file: !1, line: 392, type: !83, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @CCTKi_CommandLineRedirectStdout, variables: !2)
!83 = !DISubroutineType(types: !84)
!84 = !{null}
