; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Coord.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }
%struct.Coordsystem = type { i8*, i32, i8*, %struct.Coordprops* }
%struct.Coordprops = type { i8*, i32, %struct.Coordpropslistcomp*, %struct.Coordpropslistphysi* }
%struct.Coordpropslistcomp = type { %struct.cGH*, double, double, %struct.Coordpropslistcomp* }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.Coordpropslistphysi = type { %struct.cGH*, i32, i32, %struct.Coordpropslistphysi* }

@CoordSystems = internal global %struct.cHandledData* null, align 8
@num_systems = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [74 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Coord.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [49 x i8] c"CCTK_CoordRegisterSystem: Dimension %d not valid\00", align 1
@.str3 = private unnamed_addr constant [57 x i8] c"CCTK_CoordRegisterSystem: System '%s' already registered\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !74, globals: !365, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Coord.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !17, !24, !67, !10, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Coordsystem", file: !1, line: 38, size: 256, align: 64, elements: !8)
!8 = !{!9, !13, !15, !16}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !7, file: !1, line: 40, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "dimension", scope: !7, file: !1, line: 41, baseType: !14, size: 32, align: 32, offset: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "systemname", scope: !7, file: !1, line: 42, baseType: !10, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "coords", scope: !7, file: !1, line: 43, baseType: !17, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Coordprops", file: !1, line: 46, size: 256, align: 64, elements: !19)
!19 = !{!20, !22, !23, !66}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !1, line: 48, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !18, file: !1, line: 49, baseType: !14, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "listcomp", scope: !18, file: !1, line: 50, baseType: !24, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Coordpropslistcomp", file: !1, line: 54, size: 256, align: 64, elements: !26)
!26 = !{!27, !63, !64, !65}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !25, file: !1, line: 57, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !30, line: 75, baseType: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 24, size: 1216, align: 64, elements: !32)
!32 = !{!33, !34, !35, !37, !38, !39, !40, !41, !42, !43, !45, !47, !48, !49, !50, !51, !52, !53, !55, !56}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !31, file: !30, line: 26, baseType: !14, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !31, file: !30, line: 27, baseType: !14, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !31, file: !30, line: 30, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !31, file: !30, line: 31, baseType: !36, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !31, file: !30, line: 32, baseType: !36, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !31, file: !30, line: 33, baseType: !36, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !31, file: !30, line: 36, baseType: !36, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !31, file: !30, line: 39, baseType: !36, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !31, file: !30, line: 40, baseType: !36, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !31, file: !30, line: 43, baseType: !44, size: 64, align: 64, offset: 512)
!44 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !31, file: !30, line: 44, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !31, file: !30, line: 47, baseType: !46, size: 64, align: 64, offset: 640)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !31, file: !30, line: 51, baseType: !36, size: 64, align: 64, offset: 704)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !31, file: !30, line: 54, baseType: !36, size: 64, align: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !31, file: !30, line: 57, baseType: !14, size: 32, align: 32, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !31, file: !30, line: 60, baseType: !36, size: 64, align: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !31, file: !30, line: 63, baseType: !44, size: 64, align: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !30, line: 67, baseType: !54, size: 64, align: 64, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !31, file: !30, line: 70, baseType: !4, size: 64, align: 64, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !31, file: !30, line: 73, baseType: !57, size: 64, align: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !30, line: 22, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 18, size: 16, align: 8, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !59, file: !30, line: 20, baseType: !12, size: 8, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !59, file: !30, line: 21, baseType: !12, size: 8, align: 8, offset: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !25, file: !1, line: 59, baseType: !44, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !25, file: !1, line: 60, baseType: !44, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !1, line: 62, baseType: !24, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "listphysi", scope: !18, file: !1, line: 51, baseType: !67, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Coordpropslistphysi", file: !1, line: 65, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !68, file: !1, line: 68, baseType: !28, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !68, file: !1, line: 70, baseType: !14, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !68, file: !1, line: 71, baseType: !14, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !1, line: 73, baseType: !67, size: 64, align: 64, offset: 128)
!74 = !{!75, !78, !87, !102, !114, !129, !144, !161, !176, !191, !197, !204, !212, !221, !231, !236, !242, !251, !262, !280, !295, !310, !325, !337, !350, !353, !357}
!75 = !DISubprogram(name: "CCTKi_version_main_Coord_c", scope: !1, file: !1, line: 31, type: !76, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_Coord_c, variables: !2)
!76 = !DISubroutineType(types: !77)
!77 = !{!10}
!78 = !DISubprogram(name: "CCTKi_CoordRegisterSystem", scope: !1, file: !1, line: 158, type: !79, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*, i8*)* @CCTKi_CoordRegisterSystem, variables: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{!14, !14, !10, !10}
!81 = !{!82, !83, !84, !85, !86}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !78, file: !1, line: 158, type: !14)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !78, file: !1, line: 159, type: !10)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 3, scope: !78, file: !1, line: 160, type: !10)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !78, file: !1, line: 162, type: !14)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_system", scope: !78, file: !1, line: 163, type: !6)
!87 = !DISubprogram(name: "cctki_coordregistersystem_", scope: !1, file: !1, line: 220, type: !88, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i8*, i8*, i32, i32)* @cctki_coordregistersystem_, variables: !93)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !36, !90, !21, !21, !92, !92}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!92 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !87, file: !1, line: 221, type: !36)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !87, file: !1, line: 221, type: !90)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 3, scope: !87, file: !1, line: 221, type: !21)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 4, scope: !87, file: !1, line: 221, type: !21)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 5, scope: !87, file: !1, line: 221, type: !92)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 6, scope: !87, file: !1, line: 221, type: !92)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thorn", scope: !87, file: !1, line: 223, type: !21)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !87, file: !1, line: 223, type: !21)
!102 = !DISubprogram(name: "CCTK_CoordRegisterData", scope: !1, file: !1, line: 250, type: !103, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*, i8*, i8*)* @CCTK_CoordRegisterData, variables: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{!14, !14, !10, !10, !10}
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !102, file: !1, line: 250, type: !14)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gfname", arg: 2, scope: !102, file: !1, line: 251, type: !10)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordname", arg: 3, scope: !102, file: !1, line: 252, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 4, scope: !102, file: !1, line: 253, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !102, file: !1, line: 255, type: !14)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !102, file: !1, line: 256, type: !14)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dup", scope: !102, file: !1, line: 257, type: !14)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !102, file: !1, line: 258, type: !6)
!114 = !DISubprogram(name: "cctk_coordregisterdata_", scope: !1, file: !1, line: 324, type: !115, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i8*, i8*, i8*, i32, i32, i32)* @cctk_coordregisterdata_, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !36, !90, !21, !21, !21, !92, !92, !92}
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !114, file: !1, line: 325, type: !36)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 2, scope: !114, file: !1, line: 325, type: !90)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 3, scope: !114, file: !1, line: 325, type: !21)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 4, scope: !114, file: !1, line: 325, type: !21)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str3", arg: 5, scope: !114, file: !1, line: 325, type: !21)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 6, scope: !114, file: !1, line: 325, type: !92)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 7, scope: !114, file: !1, line: 325, type: !92)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen3", arg: 8, scope: !114, file: !1, line: 325, type: !92)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gf", scope: !114, file: !1, line: 327, type: !21)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !114, file: !1, line: 327, type: !21)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !114, file: !1, line: 327, type: !21)
!129 = !DISubprogram(name: "CCTK_CoordRegisterRange", scope: !1, file: !1, line: 390, type: !130, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, double, double, i32, i8*, i8*)* @CCTK_CoordRegisterRange, variables: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{!14, !28, !44, !44, !14, !10, !10}
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !129, file: !1, line: 390, type: !28)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min", arg: 2, scope: !129, file: !1, line: 391, type: !44)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max", arg: 3, scope: !129, file: !1, line: 392, type: !44)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !129, file: !1, line: 393, type: !14)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordname", arg: 5, scope: !129, file: !1, line: 394, type: !10)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 6, scope: !129, file: !1, line: 395, type: !10)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !129, file: !1, line: 397, type: !14)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !129, file: !1, line: 398, type: !14)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !129, file: !1, line: 399, type: !14)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newguy", scope: !129, file: !1, line: 400, type: !24)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !129, file: !1, line: 401, type: !6)
!144 = !DISubprogram(name: "cctk_coordregisterrange_", scope: !1, file: !1, line: 494, type: !145, isLocal: false, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, double*, double*, i32*, i8*, i8*, i32, i32)* @cctk_coordregisterrange_, variables: !149)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !36, !28, !147, !147, !90, !21, !21, !92, !92}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !144, file: !1, line: 495, type: !36)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !144, file: !1, line: 496, type: !28)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 3, scope: !144, file: !1, line: 497, type: !147)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 4, scope: !144, file: !1, line: 498, type: !147)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 5, scope: !144, file: !1, line: 499, type: !90)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 6, scope: !144, file: !1, line: 500, type: !21)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 7, scope: !144, file: !1, line: 500, type: !21)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 8, scope: !144, file: !1, line: 500, type: !92)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 9, scope: !144, file: !1, line: 500, type: !92)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !144, file: !1, line: 502, type: !21)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !144, file: !1, line: 502, type: !21)
!161 = !DISubprogram(name: "CCTK_CoordRegisterRangePhysIndex", scope: !1, file: !1, line: 561, type: !162, isLocal: false, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i8*, i8*)* @CCTK_CoordRegisterRangePhysIndex, variables: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{!14, !28, !14, !14, !14, !10, !10}
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !161, file: !1, line: 561, type: !28)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min", arg: 2, scope: !161, file: !1, line: 562, type: !14)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max", arg: 3, scope: !161, file: !1, line: 563, type: !14)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !161, file: !1, line: 564, type: !14)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordname", arg: 5, scope: !161, file: !1, line: 565, type: !10)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 6, scope: !161, file: !1, line: 566, type: !10)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !161, file: !1, line: 568, type: !14)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !161, file: !1, line: 569, type: !14)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !161, file: !1, line: 570, type: !14)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newguy", scope: !161, file: !1, line: 571, type: !67)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !161, file: !1, line: 572, type: !6)
!176 = !DISubprogram(name: "cctk_coordregisterrangephysindex_", scope: !1, file: !1, line: 667, type: !177, isLocal: false, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*, i8*, i8*, i32, i32)* @cctk_coordregisterrangephysindex_, variables: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !36, !28, !90, !90, !90, !21, !21, !92, !92}
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !176, file: !1, line: 668, type: !36)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !176, file: !1, line: 669, type: !28)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 3, scope: !176, file: !1, line: 670, type: !90)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 4, scope: !176, file: !1, line: 671, type: !90)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 5, scope: !176, file: !1, line: 672, type: !90)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 6, scope: !176, file: !1, line: 673, type: !21)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 7, scope: !176, file: !1, line: 673, type: !21)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 8, scope: !176, file: !1, line: 673, type: !92)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 9, scope: !176, file: !1, line: 673, type: !92)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !176, file: !1, line: 675, type: !21)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !176, file: !1, line: 675, type: !21)
!191 = !DISubprogram(name: "CCTK_CoordSystemHandle", scope: !1, file: !1, line: 703, type: !192, isLocal: false, isDefinition: true, scopeLine: 704, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_CoordSystemHandle, variables: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{!14, !10}
!194 = !{!195, !196}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 1, scope: !191, file: !1, line: 703, type: !10)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !191, file: !1, line: 705, type: !14)
!197 = !DISubprogram(name: "CCTK_CoordSystemName", scope: !1, file: !1, line: 741, type: !198, isLocal: false, isDefinition: true, scopeLine: 742, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_CoordSystemName, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!10, !14}
!200 = !{!201, !202, !203}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !197, file: !1, line: 741, type: !14)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !197, file: !1, line: 743, type: !10)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !197, file: !1, line: 744, type: !6)
!204 = !DISubprogram(name: "cctk_coordsystemhandle_", scope: !1, file: !1, line: 762, type: !205, isLocal: false, isDefinition: true, scopeLine: 764, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_coordsystemhandle_, variables: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !36, !21, !92}
!207 = !{!208, !209, !210, !211}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !204, file: !1, line: 763, type: !36)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !204, file: !1, line: 763, type: !21)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !204, file: !1, line: 763, type: !92)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !204, file: !1, line: 765, type: !21)
!212 = !DISubprogram(name: "CCTK_CoordIndex", scope: !1, file: !1, line: 817, type: !79, isLocal: false, isDefinition: true, scopeLine: 818, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*, i8*)* @CCTK_CoordIndex, variables: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !212, file: !1, line: 817, type: !14)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !212, file: !1, line: 817, type: !10)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 3, scope: !212, file: !1, line: 817, type: !10)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !212, file: !1, line: 819, type: !14)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !212, file: !1, line: 820, type: !14)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "foundit", scope: !212, file: !1, line: 821, type: !14)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !212, file: !1, line: 822, type: !6)
!221 = !DISubprogram(name: "cctk_coordindex_", scope: !1, file: !1, line: 873, type: !88, isLocal: false, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i8*, i8*, i32, i32)* @cctk_coordindex_, variables: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230}
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 1, scope: !221, file: !1, line: 874, type: !36)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 2, scope: !221, file: !1, line: 874, type: !90)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 3, scope: !221, file: !1, line: 874, type: !21)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 4, scope: !221, file: !1, line: 874, type: !21)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 5, scope: !221, file: !1, line: 874, type: !92)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 6, scope: !221, file: !1, line: 874, type: !92)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !221, file: !1, line: 876, type: !21)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !221, file: !1, line: 876, type: !21)
!231 = !DISubprogram(name: "CCTK_CoordSystemDim", scope: !1, file: !1, line: 883, type: !192, isLocal: false, isDefinition: true, scopeLine: 884, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_CoordSystemDim, variables: !232)
!232 = !{!233, !234, !235}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 1, scope: !231, file: !1, line: 883, type: !10)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !231, file: !1, line: 885, type: !14)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !231, file: !1, line: 886, type: !6)
!236 = !DISubprogram(name: "cctk_coordsystemdim_", scope: !1, file: !1, line: 905, type: !205, isLocal: false, isDefinition: true, scopeLine: 907, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_coordsystemdim_, variables: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !236, file: !1, line: 906, type: !36)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !236, file: !1, line: 906, type: !21)
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !236, file: !1, line: 906, type: !92)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !236, file: !1, line: 908, type: !21)
!242 = !DISubprogram(name: "CCTK_CoordDir", scope: !1, file: !1, line: 932, type: !243, isLocal: false, isDefinition: true, scopeLine: 933, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @CCTK_CoordDir, variables: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{!14, !10, !10}
!245 = !{!246, !247, !248, !249, !250}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !242, file: !1, line: 932, type: !10)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 2, scope: !242, file: !1, line: 932, type: !10)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !242, file: !1, line: 934, type: !14)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !242, file: !1, line: 935, type: !14)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !242, file: !1, line: 936, type: !6)
!251 = !DISubprogram(name: "cctk_coorddir_", scope: !1, file: !1, line: 968, type: !252, isLocal: false, isDefinition: true, scopeLine: 970, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i8*, i32, i32)* @cctk_coorddir_, variables: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !36, !21, !21, !92, !92}
!254 = !{!255, !256, !257, !258, !259, !260, !261}
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !251, file: !1, line: 969, type: !36)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !251, file: !1, line: 969, type: !21)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 3, scope: !251, file: !1, line: 969, type: !21)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 4, scope: !251, file: !1, line: 969, type: !92)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 5, scope: !251, file: !1, line: 969, type: !92)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !251, file: !1, line: 971, type: !21)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !251, file: !1, line: 971, type: !21)
!262 = !DISubprogram(name: "CCTK_CoordRange", scope: !1, file: !1, line: 1034, type: !263, isLocal: false, isDefinition: true, scopeLine: 1040, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, double*, double*, i32, i8*, i8*)* @CCTK_CoordRange, variables: !267)
!263 = !DISubroutineType(types: !264)
!264 = !{!14, !265, !46, !46, !14, !10, !10}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !262, file: !1, line: 1034, type: !265)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 2, scope: !262, file: !1, line: 1035, type: !46)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 3, scope: !262, file: !1, line: 1036, type: !46)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coorddir", arg: 4, scope: !262, file: !1, line: 1037, type: !14)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordname", arg: 5, scope: !262, file: !1, line: 1038, type: !10)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 6, scope: !262, file: !1, line: 1039, type: !10)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !262, file: !1, line: 1041, type: !14)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !262, file: !1, line: 1042, type: !14)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gotrange", scope: !262, file: !1, line: 1043, type: !14)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr", scope: !262, file: !1, line: 1044, type: !24)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !262, file: !1, line: 1045, type: !6)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord", scope: !262, file: !1, line: 1046, type: !17)
!280 = !DISubprogram(name: "cctk_coordrange_", scope: !1, file: !1, line: 1136, type: !281, isLocal: false, isDefinition: true, scopeLine: 1143, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, double*, double*, i32*, i8*, i8*, i32, i32)* @cctk_coordrange_, variables: !283)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !36, !265, !46, !46, !90, !21, !21, !92, !92}
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !280, file: !1, line: 1137, type: !36)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !280, file: !1, line: 1138, type: !265)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 3, scope: !280, file: !1, line: 1139, type: !46)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 4, scope: !280, file: !1, line: 1140, type: !46)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 5, scope: !280, file: !1, line: 1141, type: !90)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 6, scope: !280, file: !1, line: 1142, type: !21)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 7, scope: !280, file: !1, line: 1142, type: !21)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 8, scope: !280, file: !1, line: 1142, type: !92)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 9, scope: !280, file: !1, line: 1142, type: !92)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !280, file: !1, line: 1144, type: !21)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !280, file: !1, line: 1144, type: !21)
!295 = !DISubprogram(name: "CCTK_CoordRangePhysIndex", scope: !1, file: !1, line: 1207, type: !296, isLocal: false, isDefinition: true, scopeLine: 1213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, i32*, i32, i8*, i8*)* @CCTK_CoordRangePhysIndex, variables: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{!14, !265, !36, !36, !14, !10, !10}
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !295, file: !1, line: 1207, type: !265)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 2, scope: !295, file: !1, line: 1208, type: !36)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 3, scope: !295, file: !1, line: 1209, type: !36)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coorddir", arg: 4, scope: !295, file: !1, line: 1210, type: !14)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coordname", arg: 5, scope: !295, file: !1, line: 1211, type: !10)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 6, scope: !295, file: !1, line: 1212, type: !10)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !295, file: !1, line: 1214, type: !14)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !295, file: !1, line: 1215, type: !14)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr", scope: !295, file: !1, line: 1216, type: !67)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !295, file: !1, line: 1217, type: !6)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord", scope: !295, file: !1, line: 1218, type: !17)
!310 = !DISubprogram(name: "cctk_coordrangephysindex_", scope: !1, file: !1, line: 1313, type: !311, isLocal: false, isDefinition: true, scopeLine: 1320, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*, i8*, i8*, i32, i32)* @cctk_coordrangephysindex_, variables: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !36, !265, !36, !36, !90, !21, !21, !92, !92}
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !310, file: !1, line: 1314, type: !36)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !310, file: !1, line: 1315, type: !265)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 3, scope: !310, file: !1, line: 1316, type: !36)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 4, scope: !310, file: !1, line: 1317, type: !36)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 5, scope: !310, file: !1, line: 1318, type: !90)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 6, scope: !310, file: !1, line: 1319, type: !21)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 7, scope: !310, file: !1, line: 1319, type: !21)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 8, scope: !310, file: !1, line: 1319, type: !92)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 9, scope: !310, file: !1, line: 1319, type: !92)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !310, file: !1, line: 1321, type: !21)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !310, file: !1, line: 1321, type: !21)
!325 = !DISubprogram(name: "CCTK_CoordLocalRange", scope: !1, file: !1, line: 1351, type: !263, isLocal: false, isDefinition: true, scopeLine: 1357, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, double*, double*, i32, i8*, i8*)* @CCTK_CoordLocalRange, variables: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !325, file: !1, line: 1351, type: !265)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 2, scope: !325, file: !1, line: 1352, type: !46)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 3, scope: !325, file: !1, line: 1353, type: !46)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !325, file: !1, line: 1354, type: !14)
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 5, scope: !325, file: !1, line: 1355, type: !10)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 6, scope: !325, file: !1, line: 1356, type: !10)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !325, file: !1, line: 1358, type: !14)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "realdir", scope: !325, file: !1, line: 1359, type: !14)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_lower", scope: !325, file: !1, line: 1360, type: !44)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_upper", scope: !325, file: !1, line: 1361, type: !44)
!337 = !DISubprogram(name: "cctk_coordlocalrange_", scope: !1, file: !1, line: 1394, type: !281, isLocal: false, isDefinition: true, scopeLine: 1401, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, double*, double*, i32*, i8*, i8*, i32, i32)* @cctk_coordlocalrange_, variables: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !337, file: !1, line: 1395, type: !36)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !337, file: !1, line: 1396, type: !265)
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lower", arg: 3, scope: !337, file: !1, line: 1397, type: !46)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "upper", arg: 4, scope: !337, file: !1, line: 1398, type: !46)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 5, scope: !337, file: !1, line: 1399, type: !90)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 6, scope: !337, file: !1, line: 1400, type: !21)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 7, scope: !337, file: !1, line: 1400, type: !21)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 8, scope: !337, file: !1, line: 1400, type: !92)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 9, scope: !337, file: !1, line: 1400, type: !92)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !337, file: !1, line: 1402, type: !21)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "systemname", scope: !337, file: !1, line: 1402, type: !21)
!350 = !DISubprogram(name: "CCTK_NumCoordSystems", scope: !1, file: !1, line: 1422, type: !351, isLocal: false, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumCoordSystems, variables: !2)
!351 = !DISubroutineType(types: !352)
!352 = !{!14}
!353 = !DISubprogram(name: "CCTK_CoordSystemImplementation", scope: !1, file: !1, line: 1447, type: !198, isLocal: false, isDefinition: true, scopeLine: 1448, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_CoordSystemImplementation, variables: !354)
!354 = !{!355, !356}
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !353, file: !1, line: 1447, type: !14)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !353, file: !1, line: 1449, type: !6)
!357 = !DISubprogram(name: "CCTK_CoordName", scope: !1, file: !1, line: 1484, type: !358, isLocal: false, isDefinition: true, scopeLine: 1485, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, i8*)* @CCTK_CoordName, variables: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{!10, !14, !10}
!360 = !{!361, !362, !363, !364}
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !357, file: !1, line: 1484, type: !14)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "systemname", arg: 2, scope: !357, file: !1, line: 1484, type: !10)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !357, file: !1, line: 1486, type: !6)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !357, file: !1, line: 1487, type: !10)
!365 = !{!366, !367, !383}
!366 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 29, type: !10, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariable(name: "CoordSystems", scope: !0, file: !1, line: 81, type: !368, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @CoordSystems)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !370, line: 28, baseType: !371)
!370 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 23, size: 128, align: 64, elements: !372)
!372 = !{!373, !381, !382}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !371, file: !370, line: 25, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !370, line: 21, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 16, size: 192, align: 64, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !376, file: !370, line: 18, baseType: !92, size: 32, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !370, line: 19, baseType: !21, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !376, file: !370, line: 20, baseType: !5, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !371, file: !370, line: 26, baseType: !92, size: 32, align: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !371, file: !370, line: 27, baseType: !92, size: 32, align: 32, offset: 96)
!383 = !DIGlobalVariable(name: "num_systems", scope: !0, file: !1, line: 82, type: !14, isLocal: true, isDefinition: true, variable: i32* @num_systems)
!384 = !{i32 2, !"Dwarf Version", i32 2}
!385 = !{i32 2, !"Debug Info Version", i32 700000003}
!386 = !{i32 1, !"PIC Level", i32 2}
!387 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!388 = !DILocation(line: 31, column: 1, scope: !75)
!389 = !DIExpression()
!390 = !DILocation(line: 158, column: 36, scope: !78)
!391 = !DILocation(line: 159, column: 43, scope: !78)
!392 = !DILocation(line: 160, column: 22, scope: !78)
!393 = !DILocation(line: 162, column: 7, scope: !78)
!394 = !DILocation(line: 167, column: 19, scope: !78)
!395 = !{!396, !396, i64 0}
!396 = !{!"any pointer", !397, i64 0}
!397 = !{!"omnipotent char", !398, i64 0}
!398 = !{!"Simple C/C++ TBAA"}
!399 = !DILocation(line: 167, column: 45, scope: !78)
!400 = !DILocation(line: 167, column: 3, scope: !78)
!401 = !DILocation(line: 163, column: 23, scope: !78)
!402 = !DILocation(line: 168, column: 9, scope: !403)
!403 = distinct !DILexicalBlock(scope: !78, file: !1, line: 168, column: 7)
!404 = !DILocation(line: 168, column: 7, scope: !78)
!405 = !DILocation(line: 171, column: 41, scope: !406)
!406 = distinct !DILexicalBlock(scope: !403, file: !1, line: 169, column: 3)
!407 = !DILocation(line: 171, column: 16, scope: !406)
!408 = !DILocation(line: 174, column: 9, scope: !409)
!409 = distinct !DILexicalBlock(scope: !406, file: !1, line: 174, column: 9)
!410 = !DILocation(line: 174, column: 9, scope: !406)
!411 = !DILocation(line: 176, column: 15, scope: !412)
!412 = distinct !DILexicalBlock(scope: !413, file: !1, line: 176, column: 11)
!413 = distinct !DILexicalBlock(scope: !409, file: !1, line: 175, column: 5)
!414 = !DILocation(line: 176, column: 11, scope: !413)
!415 = !DILocation(line: 178, column: 21, scope: !416)
!416 = distinct !DILexicalBlock(scope: !412, file: !1, line: 177, column: 7)
!417 = !DILocation(line: 178, column: 32, scope: !416)
!418 = !{!419, !420, i64 8}
!419 = !{!"Coordsystem", !396, i64 0, !420, i64 8, !396, i64 16, !396, i64 24}
!420 = !{!"int", !397, i64 0}
!421 = !DILocation(line: 179, column: 31, scope: !416)
!422 = !DILocation(line: 179, column: 2, scope: !416)
!423 = !DILocation(line: 179, column: 14, scope: !416)
!424 = !DILocation(line: 179, column: 29, scope: !416)
!425 = !{!419, !396, i64 0}
!426 = !DILocation(line: 180, column: 34, scope: !416)
!427 = !DILocation(line: 180, column: 9, scope: !416)
!428 = !DILocation(line: 180, column: 21, scope: !416)
!429 = !DILocation(line: 180, column: 32, scope: !416)
!430 = !{!419, !396, i64 16}
!431 = !DILocation(line: 181, column: 60, scope: !416)
!432 = !DILocation(line: 181, column: 52, scope: !416)
!433 = !DILocation(line: 181, column: 9, scope: !416)
!434 = !DILocation(line: 181, column: 21, scope: !416)
!435 = !DILocation(line: 181, column: 28, scope: !416)
!436 = !{!419, !396, i64 24}
!437 = !DILocation(line: 183, column: 61, scope: !416)
!438 = !DILocation(line: 183, column: 18, scope: !416)
!439 = !DILocation(line: 186, column: 13, scope: !416)
!440 = !{!420, !420, i64 0}
!441 = !DILocation(line: 188, column: 7, scope: !416)
!442 = !DILocation(line: 192, column: 9, scope: !443)
!443 = distinct !DILexicalBlock(scope: !412, file: !1, line: 190, column: 7)
!444 = !DILocation(line: 200, column: 21, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 200, column: 9)
!446 = distinct !DILexicalBlock(scope: !403, file: !1, line: 199, column: 3)
!447 = !DILocation(line: 200, column: 31, scope: !445)
!448 = !DILocation(line: 200, column: 9, scope: !446)
!449 = !DILocation(line: 203, column: 7, scope: !450)
!450 = distinct !DILexicalBlock(scope: !445, file: !1, line: 201, column: 5)
!451 = !DILocation(line: 206, column: 5, scope: !450)
!452 = !DILocation(line: 210, column: 7, scope: !453)
