; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/CopyBoundary.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@.str = private unnamed_addr constant [83 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/CopyBoundary.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"Boundary\00", align 1
@.str2 = private unnamed_addr constant [54 x i8] c"Invalid variable indices %d and/or %d in BndCopyDirVI\00", align 1
@.str3 = private unnamed_addr constant [51 x i8] c"Invalid variable indices %d and/or %d in BndCopyVI\00", align 1
@.str4 = private unnamed_addr constant [51 x i8] c"Invalid group indices %d and/or %d in BndCopyDirGI\00", align 1
@.str5 = private unnamed_addr constant [48 x i8] c"Invalid group indices %d and/or %d in BndCopyGI\00", align 1
@.str6 = private unnamed_addr constant [53 x i8] c"Invalid group names '%s' and/or '%s' in BndCopyDirGN\00", align 1
@.str7 = private unnamed_addr constant [50 x i8] c"Invalid group names '%s' and/or '%s' in BndCopyGN\00", align 1
@.str8 = private unnamed_addr constant [56 x i8] c"Invalid variable names '%s' and/or '%s' in BndCopyDirVN\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !351, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/CopyBoundary.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymmetryGHex", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/Symmetry.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symmetry", file: !6, line: 27, size: 64, align: 64, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "GFSym", scope: !7, file: !6, line: 34, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !{!16, !21, !69, !81, !91, !100, !110, !118, !127, !134, !147, !162, !174, !187, !198, !210, !220, !231}
!16 = !DISubprogram(name: "CCTKi_version_CactusBase_Boundary_CopyBoundary_c", scope: !1, file: !1, line: 30, type: !17, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_Boundary_CopyBoundary_c, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!21 = !DISubprogram(name: "BndCopyDirVI", scope: !1, file: !1, line: 141, type: !22, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i32)* @BndCopyDirVI, variables: !61)
!22 = !DISubroutineType(types: !23)
!23 = !{!12, !24, !12, !12, !12, !12}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !27, line: 75, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 24, size: 1216, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !41, !43, !44, !45, !46, !47, !48, !49, !53, !54}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !28, file: !27, line: 26, baseType: !12, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !28, file: !27, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !28, file: !27, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !28, file: !27, line: 31, baseType: !11, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !28, file: !27, line: 32, baseType: !11, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !28, file: !27, line: 33, baseType: !11, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !28, file: !27, line: 36, baseType: !11, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !28, file: !27, line: 39, baseType: !11, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !28, file: !27, line: 40, baseType: !11, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !28, file: !27, line: 43, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !28, file: !27, line: 44, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !28, file: !27, line: 47, baseType: !42, size: 64, align: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !28, file: !27, line: 51, baseType: !11, size: 64, align: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !28, file: !27, line: 54, baseType: !11, size: 64, align: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !28, file: !27, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !28, file: !27, line: 60, baseType: !11, size: 64, align: 64, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !28, file: !27, line: 63, baseType: !40, size: 64, align: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !28, file: !27, line: 67, baseType: !50, size: 64, align: 64, offset: 1024)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !28, file: !27, line: 70, baseType: !51, size: 64, align: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !28, file: !27, line: 73, baseType: !55, size: 64, align: 64, offset: 1152)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !27, line: 22, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 18, size: 16, align: 8, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !57, file: !27, line: 20, baseType: !14, size: 8, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !57, file: !27, line: 21, baseType: !14, size: 8, align: 8, offset: 8)
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !21, file: !1, line: 141, type: !24)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 2, scope: !21, file: !1, line: 142, type: !12)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 3, scope: !21, file: !1, line: 143, type: !12)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi_to", arg: 4, scope: !21, file: !1, line: 144, type: !12)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi_from", arg: 5, scope: !21, file: !1, line: 145, type: !12)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !21, file: !1, line: 147, type: !12)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_vars", scope: !21, file: !1, line: 147, type: !12)
!69 = !DISubprogram(name: "bndcopydirvi_", scope: !1, file: !1, line: 166, type: !70, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*, i32*)* @bndcopydirvi_, variables: !74)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !11, !24, !72, !72, !72, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!74 = !{!75, !76, !77, !78, !79, !80}
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !69, file: !1, line: 167, type: !11)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !69, file: !1, line: 168, type: !24)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 3, scope: !69, file: !1, line: 169, type: !72)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !69, file: !1, line: 170, type: !72)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi_to", arg: 5, scope: !69, file: !1, line: 171, type: !72)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi_from", arg: 6, scope: !69, file: !1, line: 172, type: !72)
!81 = !DISubprogram(name: "BndCopyVI", scope: !1, file: !1, line: 214, type: !82, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, i32, i32)* @BndCopyVI, variables: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{!12, !24, !72, !12, !12}
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !81, file: !1, line: 214, type: !24)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 2, scope: !81, file: !1, line: 215, type: !72)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi_to", arg: 3, scope: !81, file: !1, line: 216, type: !12)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi_from", arg: 4, scope: !81, file: !1, line: 217, type: !12)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !81, file: !1, line: 219, type: !12)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_vars", scope: !81, file: !1, line: 219, type: !12)
!91 = !DISubprogram(name: "bndcopyvi_", scope: !1, file: !1, line: 238, type: !92, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*)* @bndcopyvi_, variables: !94)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !11, !24, !72, !72, !72}
!94 = !{!95, !96, !97, !98, !99}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !91, file: !1, line: 239, type: !11)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !91, file: !1, line: 240, type: !24)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 3, scope: !91, file: !1, line: 241, type: !72)
