; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/DefaultTimers.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cClockFuncs = type { i8*, i32, i8* (i32)*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*, %struct.cTimerVal*)*, void (i32, i8*, %struct.cTimerVal*)* }
%struct.cTimerVal = type { i32, i8*, i8*, %union.anon }
%union.anon = type { i64 }

@.str = private unnamed_addr constant [89 x i8] c"$Header: /cactus/Cactus/src/main/DefaultTimers.c,v 1.17 2001/12/11 22:15:10 tradke Exp $\00", align 1
@.str1 = private unnamed_addr constant [13 x i8] c"GetTimeOfDay\00", align 1
@.str2 = private unnamed_addr constant [13 x i8] c"gettimeofday\00", align 1
@.str3 = private unnamed_addr constant [5 x i8] c"secs\00", align 1
@.str4 = private unnamed_addr constant [10 x i8] c"GetrUsage\00", align 1
@.str5 = private unnamed_addr constant [10 x i8] c"getrusage\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_main_DefaultTimers_c() #0 {
  ret i8* getelementptr inbounds ([89 x i8]* @.str, i64 0, i64 0), !dbg !202
}

; Function Attrs: nounwind optsize ssp uwtable
define i32 @CCTKi_RegisterDefaultTimerFunctions() #1 {
  %functions.i1 = alloca %struct.cClockFuncs, align 8
  %functions.i = alloca %struct.cClockFuncs, align 8
  %1 = bitcast %struct.cClockFuncs* %functions.i to i8*, !dbg !203

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !36, globals: !191, imports: !43)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/DefaultTimers.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Timers.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "val_none", value: 0)
!7 = !DIEnumerator(name: "val_int", value: 1)
!8 = !DIEnumerator(name: "val_long", value: 2)
!9 = !DIEnumerator(name: "val_double", value: 3)
!10 = !{!11, !29, !22, !30}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_GetTimeOfDayTimer", file: !1, line: 132, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 128, size: 256, align: 64, elements: !14)
!14 = !{!15, !28}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !13, file: !1, line: 130, baseType: !16, size: 128, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !17, line: 30, size: 128, align: 64, elements: !18)
!17 = !DIFile(filename: "/usr/include/sys/_types/_timeval.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !{!19, !23}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !16, file: !17, line: 32, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !21, line: 120, baseType: !22)
!21 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !16, file: !17, line: 33, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_suseconds_t", file: !25, line: 74, baseType: !26)
!25 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !21, line: 44, baseType: !27)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !13, file: !1, line: 131, baseType: !16, size: 128, align: 64, offset: 128)
!29 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_GetrUsageTimer", file: !1, line: 504, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 500, size: 256, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !32, file: !1, line: 502, baseType: !16, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !32, file: !1, line: 503, baseType: !16, size: 128, align: 64, offset: 128)
!36 = !{!37, !44, !47, !88, !92, !96, !108, !115, !120, !126, !132, !135, !139, !143, !168, !174, !179, !185}
!37 = !DISubprogram(name: "CCTKi_version_main_DefaultTimers_c", scope: !1, file: !1, line: 37, type: !38, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_DefaultTimers_c, variables: !43)
!38 = !DISubroutineType(types: !39)
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !{}
!44 = !DISubprogram(name: "CCTKi_RegisterDefaultTimerFunctions", scope: !1, file: !1, line: 92, type: !45, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTKi_RegisterDefaultTimerFunctions, variables: !43)
!45 = !DISubroutineType(types: !46)
!46 = !{!27}
!47 = !DISubprogram(name: "CCTKi_RegisterTimersGetTimeOfDay", scope: !1, file: !1, line: 472, type: !48, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !{!51}
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "functions", scope: !47, file: !1, line: 474, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "cClockFuncs", file: !4, line: 49, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 38, size: 576, align: 64, elements: !54)
!54 = !{!55, !56, !57, !62, !66, !67, !68, !69, !87}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !4, line: 40, baseType: !40, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "n_vals", scope: !53, file: !4, line: 41, baseType: !27, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !53, file: !4, line: 42, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !27}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !53, file: !4, line: 43, baseType: !63, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !27, !61}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !53, file: !4, line: 44, baseType: !63, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !53, file: !4, line: 45, baseType: !63, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !53, file: !4, line: 46, baseType: !63, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !53, file: !4, line: 47, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !27, !61, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerVal", file: !4, line: 29, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 18, size: 256, align: 64, elements: !76)
!76 = !{!77, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !4, line: 20, baseType: !78, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerValType", file: !4, line: 16, baseType: !3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "heading", scope: !75, file: !4, line: 21, baseType: !40, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !75, file: !4, line: 22, baseType: !40, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !75, file: !4, line: 28, baseType: !82, size: 64, align: 64, offset: 192)
!82 = !DICompositeType(tag: DW_TAG_union_type, scope: !75, file: !4, line: 23, size: 64, align: 64, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !82, file: !4, line: 25, baseType: !27, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !82, file: !4, line: 26, baseType: !22, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !82, file: !4, line: 27, baseType: !29, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !53, file: !4, line: 48, baseType: !70, size: 64, align: 64, offset: 512)
!88 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDayCreate", scope: !1, file: !1, line: 162, type: !59, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTKi_TimerGetTimeOfDayCreate, variables: !89)
!89 = !{!90, !91}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !88, file: !1, line: 162, type: !27)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !88, file: !1, line: 164, type: !11)
!92 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDayDestroy", scope: !1, file: !1, line: 207, type: !64, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetTimeOfDayDestroy, variables: !93)
!93 = !{!94, !95}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !92, file: !1, line: 207, type: !27)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !92, file: !1, line: 207, type: !61)
!96 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDayStart", scope: !1, file: !1, line: 245, type: !64, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetTimeOfDayStart, variables: !97)
!97 = !{!98, !99, !100, !101, !102}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !96, file: !1, line: 245, type: !27)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !96, file: !1, line: 245, type: !61)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !96, file: !1, line: 247, type: !11)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !96, file: !1, line: 249, type: !16)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tzp", scope: !96, file: !1, line: 250, type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !104, line: 124, size: 64, align: 32, elements: !105)
!104 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !103, file: !104, line: 125, baseType: !27, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !103, file: !104, line: 126, baseType: !27, size: 32, align: 32, offset: 32)
!108 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDayStop", scope: !1, file: !1, line: 297, type: !64, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetTimeOfDayStop, variables: !109)
!109 = !{!110, !111, !112, !113, !114}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !108, file: !1, line: 297, type: !27)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !108, file: !1, line: 297, type: !61)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !108, file: !1, line: 299, type: !11)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !108, file: !1, line: 301, type: !16)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tzp", scope: !108, file: !1, line: 302, type: !103)
!115 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDayReset", scope: !1, file: !1, line: 350, type: !64, isLocal: true, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetTimeOfDayReset, variables: !116)
!116 = !{!117, !118, !119}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !115, file: !1, line: 350, type: !27)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !115, file: !1, line: 350, type: !61)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !115, file: !1, line: 352, type: !11)
!120 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDayGet", scope: !1, file: !1, line: 399, type: !71, isLocal: true, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, %struct.cTimerVal*)* @CCTKi_TimerGetTimeOfDayGet, variables: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !120, file: !1, line: 399, type: !27)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !120, file: !1, line: 399, type: !61)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vals", arg: 3, scope: !120, file: !1, line: 399, type: !73)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !120, file: !1, line: 401, type: !11)
!126 = !DISubprogram(name: "CCTKi_TimerGetTimeOfDaySet", scope: !1, file: !1, line: 447, type: !71, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, %struct.cTimerVal*)* @CCTKi_TimerGetTimeOfDaySet, variables: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !126, file: !1, line: 447, type: !27)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !126, file: !1, line: 447, type: !61)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vals", arg: 3, scope: !126, file: !1, line: 447, type: !73)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !126, file: !1, line: 449, type: !11)
!132 = !DISubprogram(name: "CCTKi_RegisterTimersGetrUsage", scope: !1, file: !1, line: 844, type: !48, isLocal: true, isDefinition: true, scopeLine: 845, flags: DIFlagPrototyped, isOptimized: true, variables: !133)
!133 = !{!134}
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "functions", scope: !132, file: !1, line: 846, type: !52)
!135 = !DISubprogram(name: "CCTKi_TimerGetrUsageCreate", scope: !1, file: !1, line: 535, type: !59, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTKi_TimerGetrUsageCreate, variables: !136)
!136 = !{!137, !138}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !135, file: !1, line: 535, type: !27)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !135, file: !1, line: 537, type: !30)
!139 = !DISubprogram(name: "CCTKi_TimerGetrUsageDestroy", scope: !1, file: !1, line: 579, type: !64, isLocal: true, isDefinition: true, scopeLine: 580, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetrUsageDestroy, variables: !140)
!140 = !{!141, !142}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !139, file: !1, line: 579, type: !27)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !139, file: !1, line: 579, type: !61)
!143 = !DISubprogram(name: "CCTKi_TimerGetrUsageStart", scope: !1, file: !1, line: 617, type: !64, isLocal: true, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetrUsageStart, variables: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !143, file: !1, line: 617, type: !27)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !143, file: !1, line: 617, type: !61)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !143, file: !1, line: 619, type: !30)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ru", scope: !143, file: !1, line: 621, type: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !150, line: 152, size: 1152, align: 64, elements: !151)
!150 = !DIFile(filename: "/usr/include/sys/resource.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !149, file: !150, line: 153, baseType: !16, size: 128, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !149, file: !150, line: 154, baseType: !16, size: 128, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !149, file: !150, line: 163, baseType: !22, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !149, file: !150, line: 165, baseType: !22, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !149, file: !150, line: 166, baseType: !22, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !149, file: !150, line: 167, baseType: !22, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !149, file: !150, line: 168, baseType: !22, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !149, file: !150, line: 169, baseType: !22, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !149, file: !150, line: 170, baseType: !22, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !149, file: !150, line: 171, baseType: !22, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !149, file: !150, line: 172, baseType: !22, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !149, file: !150, line: 173, baseType: !22, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !149, file: !150, line: 174, baseType: !22, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !149, file: !150, line: 175, baseType: !22, size: 64, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !149, file: !150, line: 176, baseType: !22, size: 64, align: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !149, file: !150, line: 177, baseType: !22, size: 64, align: 64, offset: 1088)
!168 = !DISubprogram(name: "CCTKi_TimerGetrUsageStop", scope: !1, file: !1, line: 668, type: !64, isLocal: true, isDefinition: true, scopeLine: 669, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetrUsageStop, variables: !169)
!169 = !{!170, !171, !172, !173}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !168, file: !1, line: 668, type: !27)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !168, file: !1, line: 668, type: !61)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !168, file: !1, line: 670, type: !30)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ru", scope: !168, file: !1, line: 672, type: !149)
!174 = !DISubprogram(name: "CCTKi_TimerGetrUsageReset", scope: !1, file: !1, line: 720, type: !64, isLocal: true, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @CCTKi_TimerGetrUsageReset, variables: !175)
!175 = !{!176, !177, !178}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !174, file: !1, line: 720, type: !27)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !174, file: !1, line: 720, type: !61)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !174, file: !1, line: 722, type: !30)
!179 = !DISubprogram(name: "CCTKi_TimerGetrUsageGet", scope: !1, file: !1, line: 768, type: !71, isLocal: true, isDefinition: true, scopeLine: 769, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, %struct.cTimerVal*)* @CCTKi_TimerGetrUsageGet, variables: !180)
!180 = !{!181, !182, !183, !184}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !179, file: !1, line: 768, type: !27)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !179, file: !1, line: 768, type: !61)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vals", arg: 3, scope: !179, file: !1, line: 768, type: !73)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !179, file: !1, line: 770, type: !30)
!185 = !DISubprogram(name: "CCTKi_TimerGetrUsageSet", scope: !1, file: !1, line: 818, type: !71, isLocal: true, isDefinition: true, scopeLine: 819, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, %struct.cTimerVal*)* @CCTKi_TimerGetrUsageSet, variables: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timernum", arg: 1, scope: !185, file: !1, line: 818, type: !27)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idata", arg: 2, scope: !185, file: !1, line: 818, type: !61)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vals", arg: 3, scope: !185, file: !1, line: 818, type: !73)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !185, file: !1, line: 820, type: !30)
!191 = !{!192, !193, !195, !196, !197}
!192 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 35, type: !40, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariable(name: "GetTimeOfDayHeading", scope: !0, file: !1, line: 134, type: !194, isLocal: true, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!195 = !DIGlobalVariable(name: "GetTimeOfDayUnits", scope: !0, file: !1, line: 135, type: !194, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariable(name: "GetrUsageHeading", scope: !0, file: !1, line: 506, type: !194, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariable(name: "GetrUsageUnits", scope: !0, file: !1, line: 507, type: !194, isLocal: true, isDefinition: true)
!198 = !{i32 2, !"Dwarf Version", i32 2}
!199 = !{i32 2, !"Debug Info Version", i32 700000003}
!200 = !{i32 1, !"PIC Level", i32 2}
