; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Evolve.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.anon.1 = type { double, double, i8*, i32, i32 }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }

@CCTK_MainLoopIndex = external global i32 ()*
@.str = private unnamed_addr constant [14 x i8] c"CCTK_ANALYSIS\00", align 1
@CCTK_OutputGH = external global i32 (%struct.cGH*)*
@CCTK_SetMainLoopIndex = external global i32 (i32)*
@.str1 = private unnamed_addr constant [16 x i8] c"CCTK_CHECKPOINT\00", align 1
@.str2 = private unnamed_addr constant [86 x i8] c"$Header: /cactus/CactusPUGH/PUGH/src/Evolve.c,v 1.16 2001/10/31 12:04:59 tradke Exp $\00", align 1
@cactusrest_ = external global %struct.anon.1
@.str3 = private unnamed_addr constant [6 x i8] c"never\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !234, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Evolve.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !77, !153, !158}
!4 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_Evolve_c", scope: !1, file: !1, line: 28, type: !5, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_Evolve_c, variables: !2)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DISubprogram(name: "PUGH_Evolve", scope: !1, file: !1, line: 74, type: !11, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tFleshConfig*)* @PUGH_Evolve, variables: !62)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !16, line: 28, baseType: !17)
!16 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!17 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 19, size: 192, align: 64, elements: !18)
!18 = !{!19, !21, !60}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !17, file: !16, line: 21, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !17, file: !16, line: 24, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !25, line: 75, baseType: !26)
!25 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 24, size: 1216, align: 64, elements: !27)
!27 = !{!28, !29, !30, !32, !33, !34, !35, !36, !37, !38, !40, !42, !43, !44, !45, !46, !47, !48, !52, !53}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !26, file: !25, line: 26, baseType: !13, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !26, file: !25, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !26, file: !25, line: 30, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !26, file: !25, line: 31, baseType: !31, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !26, file: !25, line: 32, baseType: !31, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !26, file: !25, line: 33, baseType: !31, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !26, file: !25, line: 36, baseType: !31, size: 64, align: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !26, file: !25, line: 39, baseType: !31, size: 64, align: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !26, file: !25, line: 40, baseType: !31, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !26, file: !25, line: 43, baseType: !39, size: 64, align: 64, offset: 512)
!39 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !26, file: !25, line: 44, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !26, file: !25, line: 47, baseType: !41, size: 64, align: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !26, file: !25, line: 51, baseType: !31, size: 64, align: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !26, file: !25, line: 54, baseType: !31, size: 64, align: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !26, file: !25, line: 57, baseType: !13, size: 32, align: 32, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !26, file: !25, line: 60, baseType: !31, size: 64, align: 64, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !26, file: !25, line: 63, baseType: !39, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !26, file: !25, line: 67, baseType: !49, size: 64, align: 64, offset: 1024)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !26, file: !25, line: 70, baseType: !50, size: 64, align: 64, offset: 1088)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !26, file: !25, line: 73, baseType: !54, size: 64, align: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !25, line: 22, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 18, size: 16, align: 8, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !56, file: !25, line: 20, baseType: !9, size: 8, align: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !56, file: !25, line: 21, baseType: !9, size: 8, align: 8, offset: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !17, file: !16, line: 25, baseType: !61, size: 32, align: 32, offset: 128)
!61 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !64, !65, !66, !68, !71, !73, !75}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !10, file: !1, line: 74, type: !14)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convergence_level", scope: !10, file: !1, line: 76, type: !61)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iteration", scope: !10, file: !1, line: 77, type: !61)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !67, file: !1, line: 82, type: !13)
!67 = distinct !DILexicalBlock(scope: !10, file: !1, line: 82, column: 3)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !69, file: !1, line: 92, type: !13)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 92, column: 5)
!70 = distinct !DILexicalBlock(scope: !10, file: !1, line: 90, column: 3)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !72, file: !1, line: 106, type: !13)
!72 = distinct !DILexicalBlock(scope: !70, file: !1, line: 106, column: 5)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !74, file: !1, line: 117, type: !13)
!74 = distinct !DILexicalBlock(scope: !70, file: !1, line: 117, column: 5)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !76, file: !1, line: 128, type: !13)
!76 = distinct !DILexicalBlock(scope: !70, file: !1, line: 128, column: 5)
!77 = !DISubprogram(name: "DoneMainLoop", scope: !1, file: !1, line: 178, type: !78, isLocal: true, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, variables: !82)
!78 = !DISubroutineType(types: !79)
!79 = !{!13, !80, !39, !13}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!82 = !{!83, !84, !85, !86, !87, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !147, !148, !149, !150}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !77, file: !1, line: 178, type: !80)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "time", arg: 2, scope: !77, file: !1, line: 178, type: !39)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iteration", arg: 3, scope: !77, file: !1, line: 178, type: !13)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !77, file: !1, line: 180, type: !13)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !77, file: !1, line: 181, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !77, file: !1, line: 181, type: !88)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !77, file: !1, line: 181, type: !88)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !77, file: !1, line: 181, type: !88)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !77, file: !1, line: 181, type: !88)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !77, file: !1, line: 181, type: !88)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !77, file: !1, line: 181, type: !88)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !77, file: !1, line: 181, type: !88)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !77, file: !1, line: 181, type: !88)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !77, file: !1, line: 181, type: !88)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !77, file: !1, line: 181, type: !88)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !77, file: !1, line: 181, type: !88)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !77, file: !1, line: 181, type: !7)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !77, file: !1, line: 181, type: !7)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !77, file: !1, line: 181, type: !7)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !77, file: !1, line: 181, type: !7)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !77, file: !1, line: 181, type: !7)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !77, file: !1, line: 181, type: !7)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !77, file: !1, line: 181, type: !7)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !77, file: !1, line: 181, type: !7)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !77, file: !1, line: 181, type: !7)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !77, file: !1, line: 181, type: !7)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !77, file: !1, line: 181, type: !7)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !77, file: !1, line: 181, type: !88)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !77, file: !1, line: 181, type: !88)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !77, file: !1, line: 181, type: !88)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !77, file: !1, line: 181, type: !88)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !77, file: !1, line: 181, type: !88)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !77, file: !1, line: 181, type: !88)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !77, file: !1, line: 181, type: !88)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !77, file: !1, line: 181, type: !88)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !77, file: !1, line: 181, type: !88)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !77, file: !1, line: 181, type: !88)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !77, file: !1, line: 181, type: !88)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !77, file: !1, line: 181, type: !88)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !77, file: !1, line: 181, type: !88)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !77, file: !1, line: 181, type: !88)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !77, file: !1, line: 181, type: !88)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !77, file: !1, line: 181, type: !88)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !77, file: !1, line: 181, type: !88)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !77, file: !1, line: 181, type: !88)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !77, file: !1, line: 181, type: !88)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !77, file: !1, line: 181, type: !88)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !77, file: !1, line: 181, type: !88)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !77, file: !1, line: 181, type: !88)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !77, file: !1, line: 181, type: !88)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !77, file: !1, line: 181, type: !88)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !77, file: !1, line: 181, type: !88)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !77, file: !1, line: 181, type: !88)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !77, file: !1, line: 181, type: !88)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !77, file: !1, line: 181, type: !88)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !77, file: !1, line: 181, type: !88)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !77, file: !1, line: 181, type: !88)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !77, file: !1, line: 181, type: !88)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !77, file: !1, line: 181, type: !88)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !77, file: !1, line: 181, type: !88)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !77, file: !1, line: 181, type: !7)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !77, file: !1, line: 181, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !77, file: !1, line: 181, type: !146)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !77, file: !1, line: 181, type: !88)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !77, file: !1, line: 181, type: !88)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !77, file: !1, line: 181, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DISubprogram(name: "StepGH", scope: !1, file: !1, line: 234, type: !154, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, variables: !156)
!154 = !DISubroutineType(types: !155)
!155 = !{!13, !23}
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !153, file: !1, line: 234, type: !23)
!158 = !DISubprogram(name: "RotateTimeLevelsGH", scope: !1, file: !1, line: 263, type: !159, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, variables: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !23}
!161 = !{!162, !163, !164, !165, !166, !167}
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cgh", arg: 1, scope: !158, file: !1, line: 263, type: !23)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !158, file: !1, line: 265, type: !13)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numtimelevels", scope: !158, file: !1, line: 266, type: !13)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !158, file: !1, line: 267, type: !13)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !158, file: !1, line: 268, type: !51)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !158, file: !1, line: 269, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !170, line: 81, baseType: !171)
!170 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !170, line: 13, size: 1152, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !223, !233}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !171, file: !170, line: 17, baseType: !51, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !171, file: !170, line: 18, baseType: !13, size: 32, align: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !171, file: !170, line: 21, baseType: !13, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !171, file: !170, line: 22, baseType: !13, size: 32, align: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !171, file: !170, line: 23, baseType: !13, size: 32, align: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !171, file: !170, line: 27, baseType: !13, size: 32, align: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !171, file: !170, line: 28, baseType: !13, size: 32, align: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !171, file: !170, line: 29, baseType: !49, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !171, file: !170, line: 32, baseType: !13, size: 32, align: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !171, file: !170, line: 34, baseType: !31, size: 64, align: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !171, file: !170, line: 35, baseType: !13, size: 32, align: 32, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !171, file: !170, line: 37, baseType: !13, size: 32, align: 32, offset: 480)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !171, file: !170, line: 41, baseType: !39, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !171, file: !170, line: 41, baseType: !39, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !171, file: !170, line: 41, baseType: !39, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !171, file: !170, line: 41, baseType: !39, size: 64, align: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !171, file: !170, line: 44, baseType: !13, size: 32, align: 32, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !171, file: !170, line: 45, baseType: !13, size: 32, align: 32, offset: 800)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !171, file: !170, line: 46, baseType: !13, size: 32, align: 32, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !171, file: !170, line: 49, baseType: !13, size: 32, align: 32, offset: 864)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !171, file: !170, line: 53, baseType: !13, size: 32, align: 32, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !171, file: !170, line: 76, baseType: !195, size: 64, align: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !198, line: 72, baseType: !199)
!198 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !198, line: 37, size: 2368, align: 64, elements: !200)
!200 = !{!201, !202, !203, !204, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !220, !222}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !199, file: !198, line: 39, baseType: !13, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !199, file: !198, line: 41, baseType: !31, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !199, file: !198, line: 44, baseType: !39, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !199, file: !198, line: 45, baseType: !205, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !199, file: !198, line: 46, baseType: !205, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !199, file: !198, line: 47, baseType: !31, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !199, file: !198, line: 49, baseType: !31, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !199, file: !198, line: 50, baseType: !13, size: 32, align: 32, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !199, file: !198, line: 51, baseType: !31, size: 64, align: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !199, file: !198, line: 52, baseType: !205, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !199, file: !198, line: 55, baseType: !31, size: 64, align: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !199, file: !198, line: 56, baseType: !31, size: 64, align: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !199, file: !198, line: 59, baseType: !31, size: 64, align: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !199, file: !198, line: 60, baseType: !216, size: 512, align: 64, offset: 832)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, align: 64, elements: !217)
!217 = !{!218, !219}
!218 = !DISubrange(count: 4)
!219 = !DISubrange(count: 2)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !199, file: !198, line: 64, baseType: !221, size: 512, align: 64, offset: 1344)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 512, align: 64, elements: !217)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !199, file: !198, line: 68, baseType: !221, size: 512, align: 64, offset: 1856)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !171, file: !170, line: 77, baseType: !224, size: 64, align: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !198, line: 29, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !198, line: 23, size: 256, align: 64, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !227, file: !198, line: 25, baseType: !13, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !227, file: !198, line: 26, baseType: !31, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !227, file: !198, line: 27, baseType: !205, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !227, file: !198, line: 28, baseType: !31, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !171, file: !170, line: 79, baseType: !20, size: 64, align: 64, offset: 1088)
!234 = !{!235}
!235 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 26, type: !7, isLocal: true, isDefinition: true)
!236 = !{i32 2, !"Dwarf Version", i32 2}
!237 = !{i32 2, !"Debug Info Version", i32 700000003}
!238 = !{i32 1, !"PIC Level", i32 2}
!239 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!240 = !DILocation(line: 28, column: 1, scope: !4)
!241 = !DIExpression()
!242 = !DILocation(line: 74, column: 31, scope: !10)
!243 = !DILocation(line: 77, column: 26, scope: !10)
!244 = !{!245, !245, i64 0}
!245 = !{!"any pointer", !246, i64 0}
!246 = !{!"omnipotent char", !247, i64 0}
!247 = !{!"Simple C/C++ TBAA"}
!248 = !DILocation(line: 77, column: 16, scope: !10)
!249 = !DILocation(line: 82, column: 3, scope: !67)
!250 = !DILocation(line: 76, column: 16, scope: !10)
!251 = !DILocation(line: 82, column: 3, scope: !252)
!252 = distinct !DILexicalBlock(scope: !253, file: !1, line: 82, column: 3)
!253 = distinct !DILexicalBlock(scope: !67, file: !1, line: 82, column: 3)
!254 = !{!255, !256, i64 16}
!255 = !{!"", !245, i64 0, !245, i64 8, !256, i64 16}
!256 = !{!"int", !246, i64 0}
!257 = !DILocation(line: 89, column: 34, scope: !10)
!258 = !DILocation(line: 82, column: 3, scope: !253)
!259 = !DILocation(line: 178, column: 61, scope: !77, inlinedAt: !260)
!260 = distinct !DILocation(line: 89, column: 12, scope: !10)
!261 = !DILocation(line: 181, column: 3, scope: !77, inlinedAt: !260)
!262 = !DILocation(line: 184, column: 12, scope: !77, inlinedAt: !260)
!263 = !DILocation(line: 184, column: 27, scope: !77, inlinedAt: !260)
!264 = !DILocation(line: 82, column: 3, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !1, line: 82, column: 3)
!266 = distinct !DILexicalBlock(scope: !252, file: !1, line: 82, column: 3)
!267 = !DILocation(line: 82, column: 3, scope: !266)
!268 = !DILocation(line: 84, column: 21, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !1, line: 83, column: 3)
!270 = distinct !DILexicalBlock(scope: !265, file: !1, line: 82, column: 3)
!271 = !DILocation(line: 84, column: 29, scope: !269)
!272 = !{!255, !245, i64 8}
!273 = !DILocation(line: 84, column: 7, scope: !269)
!274 = !DILocation(line: 85, column: 7, scope: !269)
!275 = !DILocation(line: 85, column: 29, scope: !269)
!276 = !DILocation(line: 85, column: 21, scope: !269)
!277 = !DILocation(line: 87, column: 3, scope: !270)
!278 = !DILocation(line: 87, column: 3, scope: !266)
!279 = !DILocation(line: 89, column: 26, scope: !10)
!280 = !DILocation(line: 89, column: 55, scope: !10)
!281 = !DILocation(line: 184, column: 30, scope: !77, inlinedAt: !260)
!282 = !DILocation(line: 180, column: 7, scope: !77, inlinedAt: !260)
!283 = !DILocation(line: 185, column: 7, scope: !77, inlinedAt: !260)
!284 = !DILocation(line: 187, column: 9, scope: !285, inlinedAt: !260)
!285 = distinct !DILexicalBlock(scope: !286, file: !1, line: 187, column: 9)
!286 = distinct !DILexicalBlock(scope: !287, file: !1, line: 186, column: 3)
!287 = distinct !DILexicalBlock(scope: !77, file: !1, line: 185, column: 7)
!288 = !DILocation(line: 187, column: 9, scope: !286, inlinedAt: !260)
!289 = !DILocation(line: 191, column: 14, scope: !290, inlinedAt: !260)
!290 = distinct !DILexicalBlock(scope: !285, file: !1, line: 191, column: 14)
!291 = !DILocation(line: 191, column: 14, scope: !285, inlinedAt: !260)
!292 = !DILocation(line: 193, column: 26, scope: !293, inlinedAt: !260)
!293 = distinct !DILexicalBlock(scope: !290, file: !1, line: 192, column: 5)
!294 = !DILocation(line: 194, column: 5, scope: !293, inlinedAt: !260)
!295 = !DILocation(line: 197, column: 29, scope: !296, inlinedAt: !260)
!296 = distinct !DILexicalBlock(scope: !297, file: !1, line: 197, column: 11)
!297 = distinct !DILexicalBlock(scope: !290, file: !1, line: 196, column: 5)
!298 = !DILocation(line: 197, column: 11, scope: !297, inlinedAt: !260)
