; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/FlatBoundary.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@.str = private unnamed_addr constant [83 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/FlatBoundary.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"Boundary\00", align 1
@.str2 = private unnamed_addr constant [39 x i8] c"Invalid group index %d in BndFlatDirGI\00", align 1
@.str3 = private unnamed_addr constant [36 x i8] c"Invalid group index %d in BndFlatGI\00", align 1
@.str4 = private unnamed_addr constant [40 x i8] c"Invalid group name '%s' in BndFlatDirGN\00", align 1
@.str5 = private unnamed_addr constant [37 x i8] c"Invalid group name '%s' in BndFlatGN\00", align 1
@.str6 = private unnamed_addr constant [42 x i8] c"Invalid variable index %d in BndFlatDirVI\00", align 1
@.str7 = private unnamed_addr constant [39 x i8] c"Invalid variable index %d in BndFlatVI\00", align 1
@.str8 = private unnamed_addr constant [43 x i8] c"Invalid variable name '%s' in BndFlatDirVN\00", align 1
@.str9 = private unnamed_addr constant [40 x i8] c"Invalid variable name '%s' in BndFlatVN\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !318, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/FlatBoundary.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymmetryGHex", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/Symmetry.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symmetry", file: !6, line: 27, size: 64, align: 64, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "GFSym", scope: !7, file: !6, line: 34, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !{!16, !21, !68, !79, !88, !96, !106, !118, !127, !137, !144, !151, !157, !163, !171, !180, !187, !195}
!16 = !DISubprogram(name: "CCTKi_version_CactusBase_Boundary_FlatBoundary_c", scope: !1, file: !1, line: 33, type: !17, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_Boundary_FlatBoundary_c, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!21 = !DISubprogram(name: "BndFlatDirGI", scope: !1, file: !1, line: 134, type: !22, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32)* @BndFlatDirGI, variables: !61)
!22 = !DISubroutineType(types: !23)
!23 = !{!12, !24, !12, !12, !12}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !27, line: 75, baseType: !28)
!27 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 24, size: 1216, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !41, !43, !44, !45, !46, !47, !48, !49, !53, !54}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !28, file: !27, line: 26, baseType: !12, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !28, file: !27, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !28, file: !27, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !28, file: !27, line: 31, baseType: !11, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !28, file: !27, line: 32, baseType: !11, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !28, file: !27, line: 33, baseType: !11, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !28, file: !27, line: 36, baseType: !11, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !28, file: !27, line: 39, baseType: !11, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !28, file: !27, line: 40, baseType: !11, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !28, file: !27, line: 43, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !28, file: !27, line: 44, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !28, file: !27, line: 47, baseType: !42, size: 64, align: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !28, file: !27, line: 51, baseType: !11, size: 64, align: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !28, file: !27, line: 54, baseType: !11, size: 64, align: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !28, file: !27, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !28, file: !27, line: 60, baseType: !11, size: 64, align: 64, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !28, file: !27, line: 63, baseType: !40, size: 64, align: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !28, file: !27, line: 67, baseType: !50, size: 64, align: 64, offset: 1024)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !28, file: !27, line: 70, baseType: !51, size: 64, align: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !28, file: !27, line: 73, baseType: !55, size: 64, align: 64, offset: 1152)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !27, line: 22, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 18, size: 16, align: 8, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !57, file: !27, line: 20, baseType: !14, size: 8, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !57, file: !27, line: 21, baseType: !14, size: 8, align: 8, offset: 8)
!61 = !{!62, !63, !64, !65, !66, !67}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !21, file: !1, line: 134, type: !24)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 2, scope: !21, file: !1, line: 135, type: !12)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 3, scope: !21, file: !1, line: 136, type: !12)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 4, scope: !21, file: !1, line: 137, type: !12)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_vi", scope: !21, file: !1, line: 139, type: !12)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !21, file: !1, line: 139, type: !12)
!68 = !DISubprogram(name: "bndflatdirgi_", scope: !1, file: !1, line: 158, type: !69, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*)* @bndflatdirgi_, variables: !73)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !11, !24, !71, !71, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!73 = !{!74, !75, !76, !77, !78}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !68, file: !1, line: 159, type: !11)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !68, file: !1, line: 160, type: !24)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 3, scope: !68, file: !1, line: 161, type: !71)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !68, file: !1, line: 162, type: !71)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 5, scope: !68, file: !1, line: 163, type: !71)
!79 = !DISubprogram(name: "BndFlatGI", scope: !1, file: !1, line: 200, type: !80, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, i32)* @BndFlatGI, variables: !82)
!80 = !DISubroutineType(types: !81)
!81 = !{!12, !24, !71, !12}
!82 = !{!83, !84, !85, !86, !87}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !79, file: !1, line: 200, type: !24)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 2, scope: !79, file: !1, line: 201, type: !71)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 3, scope: !79, file: !1, line: 202, type: !12)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_vi", scope: !79, file: !1, line: 204, type: !12)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !79, file: !1, line: 204, type: !12)
!88 = !DISubprogram(name: "bndflatgi_", scope: !1, file: !1, line: 223, type: !89, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*)* @bndflatgi_, variables: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !11, !24, !71, !71}
!91 = !{!92, !93, !94, !95}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !88, file: !1, line: 224, type: !11)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !88, file: !1, line: 225, type: !24)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 3, scope: !88, file: !1, line: 226, type: !71)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 4, scope: !88, file: !1, line: 227, type: !71)
!96 = !DISubprogram(name: "BndFlatDirGN", scope: !1, file: !1, line: 271, type: !97, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i8*)* @BndFlatDirGN, variables: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{!12, !24, !12, !12, !19}
