; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/GetHyperslab.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.hslab_mapping_t = type { i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32, i32, void (i8*, i8*, i32, i32, i32)*, %struct.hslab_mapping_t*, %struct.hslab_mapping_t*, %struct.cGroup }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !84, globals: !288, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/GetHyperslab.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !13, !80, !82}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !9, line: 126, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !9, line: 96, size: 832, align: 64, elements: !11)
!11 = !{!12, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !52, !61, !75, !76, !77, !78}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !10, file: !9, line: 98, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !10, file: !9, line: 99, baseType: !6, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !10, file: !9, line: 100, baseType: !6, size: 32, align: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !10, file: !9, line: 101, baseType: !4, size: 64, align: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !10, file: !9, line: 102, baseType: !4, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !10, file: !9, line: 103, baseType: !6, size: 32, align: 32, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !10, file: !9, line: 104, baseType: !6, size: 32, align: 32, offset: 288)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !10, file: !9, line: 106, baseType: !4, size: 64, align: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !10, file: !9, line: 114, baseType: !6, size: 32, align: 32, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !10, file: !9, line: 115, baseType: !6, size: 32, align: 32, offset: 416)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !10, file: !9, line: 117, baseType: !25, size: 64, align: 64, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !9, line: 72, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !9, line: 37, size: 2368, align: 64, elements: !28)
!28 = !{!29, !30, !31, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !49, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !27, file: !9, line: 39, baseType: !6, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !27, file: !9, line: 41, baseType: !5, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !27, file: !9, line: 44, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !27, file: !9, line: 45, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !27, file: !9, line: 46, baseType: !34, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !27, file: !9, line: 47, baseType: !5, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !27, file: !9, line: 49, baseType: !5, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !27, file: !9, line: 50, baseType: !6, size: 32, align: 32, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !27, file: !9, line: 51, baseType: !5, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !27, file: !9, line: 52, baseType: !34, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !27, file: !9, line: 55, baseType: !5, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !27, file: !9, line: 56, baseType: !5, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !27, file: !9, line: 59, baseType: !5, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !27, file: !9, line: 60, baseType: !45, size: 512, align: 64, offset: 832)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DISubrange(count: 4)
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !27, file: !9, line: 64, baseType: !50, size: 512, align: 64, offset: 1344)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, align: 64, elements: !46)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !27, file: !9, line: 68, baseType: !50, size: 512, align: 64, offset: 1856)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !10, file: !9, line: 118, baseType: !53, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !9, line: 29, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !9, line: 23, size: 256, align: 64, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !55, file: !9, line: 25, baseType: !6, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !55, file: !9, line: 26, baseType: !5, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !55, file: !9, line: 27, baseType: !34, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !55, file: !9, line: 28, baseType: !5, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !10, file: !9, line: 120, baseType: !62, size: 64, align: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !9, line: 94, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !9, line: 74, size: 448, align: 64, elements: !65)
!65 = !{!66, !67, !69, !70, !71, !72, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !64, file: !9, line: 77, baseType: !5, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !64, file: !9, line: 78, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !64, file: !9, line: 79, baseType: !68, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !64, file: !9, line: 80, baseType: !6, size: 32, align: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !64, file: !9, line: 82, baseType: !5, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !64, file: !9, line: 84, baseType: !6, size: 32, align: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !64, file: !9, line: 85, baseType: !6, size: 32, align: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !64, file: !9, line: 86, baseType: !6, size: 32, align: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !10, file: !9, line: 121, baseType: !62, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !10, file: !9, line: 123, baseType: !6, size: 32, align: 32, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !10, file: !9, line: 124, baseType: !6, size: 32, align: 32, offset: 736)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !10, file: !9, line: 125, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!84 = !{!85, !88, !180, !197, !261}
!85 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGHSlab_GetHyperslab_c", scope: !1, file: !1, line: 27, type: !86, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGHSlab_GetHyperslab_c, variables: !2)
!86 = !DISubroutineType(types: !87)
!87 = !{!80}
!88 = !DISubprogram(name: "Hyperslab_Get", scope: !1, file: !1, line: 53, type: !89, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i32, i8*)* @Hyperslab_Get, variables: !125)
!89 = !DISubroutineType(types: !90)
!90 = !{!6, !91, !6, !6, !6, !6, !4}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !94, line: 75, baseType: !95)
!94 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 24, size: 1216, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !109, !110, !111, !112, !113, !114, !115, !117, !118}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !95, file: !94, line: 26, baseType: !6, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !95, file: !94, line: 27, baseType: !6, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !95, file: !94, line: 30, baseType: !5, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !95, file: !94, line: 31, baseType: !5, size: 64, align: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !95, file: !94, line: 32, baseType: !5, size: 64, align: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !95, file: !94, line: 33, baseType: !5, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !95, file: !94, line: 36, baseType: !5, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !95, file: !94, line: 39, baseType: !5, size: 64, align: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !95, file: !94, line: 40, baseType: !5, size: 64, align: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !95, file: !94, line: 43, baseType: !32, size: 64, align: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !95, file: !94, line: 44, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !95, file: !94, line: 47, baseType: !108, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !95, file: !94, line: 51, baseType: !5, size: 64, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !95, file: !94, line: 54, baseType: !5, size: 64, align: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !95, file: !94, line: 57, baseType: !6, size: 32, align: 32, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !95, file: !94, line: 60, baseType: !5, size: 64, align: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !95, file: !94, line: 63, baseType: !32, size: 64, align: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !94, line: 67, baseType: !116, size: 64, align: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !95, file: !94, line: 70, baseType: !68, size: 64, align: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !95, file: !94, line: 73, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !94, line: 22, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 18, size: 16, align: 8, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !121, file: !94, line: 20, baseType: !14, size: 8, align: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !121, file: !94, line: 21, baseType: !14, size: 8, align: 8, offset: 8)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !88, file: !1, line: 53, type: !91)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapping_handle", arg: 2, scope: !88, file: !1, line: 54, type: !6)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 3, scope: !88, file: !1, line: 55, type: !6)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevel", arg: 4, scope: !88, file: !1, line: 56, type: !6)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdatatype", arg: 5, scope: !88, file: !1, line: 57, type: !6)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdata", arg: 6, scope: !88, file: !1, line: 58, type: !4)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !88, file: !1, line: 60, type: !6)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !88, file: !1, line: 61, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "hslab_mapping_t", file: !136, line: 45, baseType: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/PUGHSlabi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "hslab_mapping_t", file: !136, line: 24, size: 1280, align: 64, elements: !138)
!138 = !{!139, !140, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !164, !166, !167}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !137, file: !136, line: 26, baseType: !6, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "target_proc", scope: !137, file: !136, line: 27, baseType: !6, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "hdim", scope: !137, file: !136, line: 28, baseType: !142, size: 32, align: 32, offset: 64)
!142 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vdim", scope: !137, file: !136, line: 29, baseType: !142, size: 32, align: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vectors", scope: !137, file: !136, line: 30, baseType: !5, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "local_startpoint", scope: !137, file: !136, line: 31, baseType: !5, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "local_endpoint", scope: !137, file: !136, line: 32, baseType: !5, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "global_startpoint", scope: !137, file: !136, line: 33, baseType: !5, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "global_endpoint", scope: !137, file: !136, line: 34, baseType: !5, size: 64, align: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "do_dir", scope: !137, file: !136, line: 35, baseType: !5, size: 64, align: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !137, file: !136, line: 36, baseType: !5, size: 64, align: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "global_hsize", scope: !137, file: !136, line: 37, baseType: !5, size: 64, align: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "local_hsize", scope: !137, file: !136, line: 38, baseType: !5, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "totals", scope: !137, file: !136, line: 39, baseType: !142, size: 32, align: 32, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_full_hyperslab", scope: !137, file: !136, line: 40, baseType: !6, size: 32, align: 32, offset: 736)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "is_diagonal_in_3D", scope: !137, file: !136, line: 41, baseType: !6, size: 32, align: 32, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "conversion_fn", scope: !137, file: !136, line: 42, baseType: !157, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hslabConversionFn", file: !158, line: 21, baseType: !159)
!158 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/PUGHSlab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !162, !4, !6, !6, !6}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !136, line: 43, baseType: !165, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 43, baseType: !165, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "vinfo", scope: !137, file: !136, line: 44, baseType: !168, size: 256, align: 32, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !169, line: 24, baseType: !170)
!169 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!170 = !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 14, size: 256, align: 32, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !170, file: !169, line: 16, baseType: !6, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !170, file: !169, line: 17, baseType: !6, size: 32, align: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !170, file: !169, line: 18, baseType: !6, size: 32, align: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !170, file: !169, line: 19, baseType: !6, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !170, file: !169, line: 20, baseType: !6, size: 32, align: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !170, file: !169, line: 21, baseType: !6, size: 32, align: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !170, file: !169, line: 22, baseType: !6, size: 32, align: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !170, file: !169, line: 23, baseType: !6, size: 32, align: 32, offset: 224)
!180 = !DISubprogram(name: "Hyperslab_GetList", scope: !1, file: !1, line: 80, type: !181, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32*, i32*, i8**)* @Hyperslab_GetList, variables: !187)
!181 = !DISubroutineType(types: !182)
!182 = !{!6, !91, !6, !6, !183, !183, !183, !185}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !180, file: !1, line: 80, type: !91)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapping_handle", arg: 2, scope: !180, file: !1, line: 81, type: !6)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_arrays", arg: 3, scope: !180, file: !1, line: 82, type: !6)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindices", arg: 4, scope: !180, file: !1, line: 83, type: !183)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevels", arg: 5, scope: !180, file: !1, line: 84, type: !183)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdatatypes", arg: 6, scope: !180, file: !1, line: 85, type: !183)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdata", arg: 7, scope: !180, file: !1, line: 86, type: !185)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !180, file: !1, line: 88, type: !6)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !180, file: !1, line: 88, type: !6)
!197 = !DISubprogram(name: "GetLocalHyperslab", scope: !1, file: !1, line: 206, type: !198, isLocal: true, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, variables: !202)
!198 = !DISubroutineType(types: !199)
!199 = !{!6, !91, !200, !6, !6, !6, !4}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !258, !259, !260}
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !197, file: !1, line: 206, type: !91)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapping", arg: 2, scope: !197, file: !1, line: 207, type: !200)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 3, scope: !197, file: !1, line: 208, type: !6)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevel", arg: 4, scope: !197, file: !1, line: 209, type: !6)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdatatype", arg: 5, scope: !197, file: !1, line: 210, type: !6)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdata", arg: 6, scope: !197, file: !1, line: 211, type: !4)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "point", scope: !197, file: !1, line: 213, type: !5)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startpoint", scope: !197, file: !1, line: 214, type: !5)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endpoint", scope: !197, file: !1, line: 215, type: !5)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "downsample", scope: !197, file: !1, line: 216, type: !5)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "points_per_dim", scope: !197, file: !1, line: 217, type: !5)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !197, file: !1, line: 218, type: !6)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !197, file: !1, line: 219, type: !6)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdim", scope: !197, file: !1, line: 220, type: !6)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdata_size", scope: !197, file: !1, line: 221, type: !6)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hdata_size", scope: !197, file: !1, line: 222, type: !6)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim0_points", scope: !197, file: !1, line: 223, type: !6)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim0_hsize", scope: !197, file: !1, line: 224, type: !6)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !197, file: !1, line: 225, type: !80)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_hdata", scope: !197, file: !1, line: 226, type: !13)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdata", scope: !197, file: !1, line: 227, type: !162)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !197, file: !1, line: 228, type: !6)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vinfo", scope: !197, file: !1, line: 229, type: !168)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !197, file: !1, line: 230, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !229, line: 81, baseType: !230)
!229 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !229, line: 13, size: 1152, align: 64, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !255, !257}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !230, file: !229, line: 17, baseType: !4, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !230, file: !229, line: 18, baseType: !6, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !230, file: !229, line: 21, baseType: !6, size: 32, align: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !230, file: !229, line: 22, baseType: !6, size: 32, align: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !230, file: !229, line: 23, baseType: !6, size: 32, align: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !230, file: !229, line: 27, baseType: !6, size: 32, align: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !230, file: !229, line: 28, baseType: !6, size: 32, align: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !230, file: !229, line: 29, baseType: !116, size: 64, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !230, file: !229, line: 32, baseType: !6, size: 32, align: 32, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !230, file: !229, line: 34, baseType: !5, size: 64, align: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !230, file: !229, line: 35, baseType: !6, size: 32, align: 32, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !230, file: !229, line: 37, baseType: !6, size: 32, align: 32, offset: 480)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !230, file: !229, line: 41, baseType: !32, size: 64, align: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !230, file: !229, line: 41, baseType: !32, size: 64, align: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !230, file: !229, line: 41, baseType: !32, size: 64, align: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !230, file: !229, line: 41, baseType: !32, size: 64, align: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !230, file: !229, line: 44, baseType: !6, size: 32, align: 32, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !230, file: !229, line: 45, baseType: !6, size: 32, align: 32, offset: 800)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !230, file: !229, line: 46, baseType: !6, size: 32, align: 32, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !230, file: !229, line: 49, baseType: !6, size: 32, align: 32, offset: 864)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !230, file: !229, line: 53, baseType: !6, size: 32, align: 32, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !230, file: !229, line: 76, baseType: !254, size: 64, align: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !230, file: !229, line: 77, baseType: !256, size: 64, align: 64, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !230, file: !229, line: 79, baseType: !13, size: 64, align: 64, offset: 1088)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GA", scope: !197, file: !1, line: 231, type: !7)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errormsg", scope: !197, file: !1, line: 232, type: !80)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "conversion_fn", scope: !197, file: !1, line: 233, type: !157)
!261 = !DISubprogram(name: "GetDiagonalFromFrom3D", scope: !1, file: !1, line: 474, type: !198, isLocal: true, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: true, variables: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !285}
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !261, file: !1, line: 474, type: !91)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapping", arg: 2, scope: !261, file: !1, line: 475, type: !200)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 3, scope: !261, file: !1, line: 476, type: !6)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevel", arg: 4, scope: !261, file: !1, line: 477, type: !6)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdatatype", arg: 5, scope: !261, file: !1, line: 478, type: !6)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdata", arg: 6, scope: !261, file: !1, line: 479, type: !4)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !261, file: !1, line: 481, type: !6)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !261, file: !1, line: 481, type: !6)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !261, file: !1, line: 481, type: !6)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !261, file: !1, line: 481, type: !6)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprocs", scope: !261, file: !1, line: 481, type: !6)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "linear_idx", scope: !261, file: !1, line: 481, type: !6)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_npoints", scope: !261, file: !1, line: 482, type: !6)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npoints", scope: !261, file: !1, line: 482, type: !6)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdatatype", scope: !261, file: !1, line: 483, type: !6)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "htypesize", scope: !261, file: !1, line: 483, type: !6)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtypesize", scope: !261, file: !1, line: 483, type: !6)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdata", scope: !261, file: !1, line: 484, type: !80)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_hdata", scope: !261, file: !1, line: 485, type: !13)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !261, file: !1, line: 486, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extras", scope: !261, file: !1, line: 487, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!288 = !{!289}
!289 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 25, type: !80, isLocal: true, isDefinition: true)
!290 = !{i32 2, !"Dwarf Version", i32 2}
!291 = !{i32 2, !"Debug Info Version", i32 700000003}
!292 = !{i32 1, !"PIC Level", i32 2}
!293 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!294 = !DILocation(line: 27, column: 1, scope: !85)
!295 = !DIExpression()
!296 = !DILocation(line: 53, column: 36, scope: !88)
!297 = !DILocation(line: 54, column: 36, scope: !88)
