; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/GHExtensions.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cFunctionData = type { i32, i32 (%struct.cGH*, i8*)*, i32, i32, i32*, i32, i32, i32*, i8*, i8*, i8* }

@GHExtensions = internal global %struct.cHandledData* null, align 8
@num_extensions = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [88 x i8] c"$Header: /cactus/Cactus/src/main/GHExtensions.c,v 1.27 2001/07/04 13:20:29 tradke Exp $\00", align 1
@.str1 = private unnamed_addr constant [81 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/GHExtensions.c\00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str3 = private unnamed_addr constant [55 x i8] c"GH Extension '%s' has not registered a SetupGH routine\00", align 1
@.str4 = private unnamed_addr constant [54 x i8] c"GH Extension '%s' has not registered a InitGH routine\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !71, globals: !173, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/GHExtensions.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !50, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHExtension", file: !1, line: 47, size: 192, align: 64, elements: !6)
!6 = !{!7, !61, !65}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "SetupGH", scope: !5, file: !1, line: 49, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !12, !28, !22}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !14, line: 28, baseType: !15)
!14 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 19, size: 192, align: 64, elements: !16)
!16 = !{!17, !20, !59}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !15, file: !14, line: 21, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !15, file: !14, line: 24, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !24, line: 75, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 24, size: 1216, align: 64, elements: !26)
!26 = !{!27, !29, !30, !32, !33, !34, !35, !36, !37, !38, !40, !42, !43, !44, !45, !46, !47, !48, !51, !52}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !25, file: !24, line: 26, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !25, file: !24, line: 27, baseType: !28, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !25, file: !24, line: 30, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !25, file: !24, line: 31, baseType: !31, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !25, file: !24, line: 32, baseType: !31, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !25, file: !24, line: 33, baseType: !31, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !25, file: !24, line: 36, baseType: !31, size: 64, align: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !25, file: !24, line: 39, baseType: !31, size: 64, align: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !25, file: !24, line: 40, baseType: !31, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !25, file: !24, line: 43, baseType: !39, size: 64, align: 64, offset: 512)
!39 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !25, file: !24, line: 44, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !25, file: !24, line: 47, baseType: !41, size: 64, align: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !25, file: !24, line: 51, baseType: !31, size: 64, align: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !25, file: !24, line: 54, baseType: !31, size: 64, align: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !25, file: !24, line: 57, baseType: !28, size: 32, align: 32, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !25, file: !24, line: 60, baseType: !31, size: 64, align: 64, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !25, file: !24, line: 63, baseType: !39, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !24, line: 67, baseType: !49, size: 64, align: 64, offset: 1024)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !25, file: !24, line: 70, baseType: !50, size: 64, align: 64, offset: 1088)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !25, file: !24, line: 73, baseType: !53, size: 64, align: 64, offset: 1152)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !24, line: 22, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 18, size: 16, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !55, file: !24, line: 20, baseType: !19, size: 8, align: 8)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !55, file: !24, line: 21, baseType: !19, size: 8, align: 8, offset: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !15, file: !14, line: 25, baseType: !60, size: 32, align: 32, offset: 128)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "InitGH", scope: !5, file: !1, line: 50, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!28, !22}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ScheduleTraverseGH", scope: !5, file: !1, line: 51, baseType: !66, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!28, !22, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!71 = !{!72, !75, !82, !88, !96, !104, !112, !122, !127, !134, !137, !145, !154, !161, !166, !169}
!72 = !DISubprogram(name: "CCTKi_version_main_GHExtensions_c", scope: !1, file: !1, line: 29, type: !73, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_GHExtensions_c, variables: !2)
!73 = !DISubroutineType(types: !74)
!74 = !{!69}
!75 = !DISubprogram(name: "CCTK_RegisterGHExtension", scope: !1, file: !1, line: 127, type: !76, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_RegisterGHExtension, variables: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{!28, !69}
!78 = !{!79, !80, !81}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !75, file: !1, line: 127, type: !69)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !75, file: !1, line: 130, type: !28)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_extension", scope: !75, file: !1, line: 132, type: !4)
!82 = !DISubprogram(name: "CCTK_UnregisterGHExtension", scope: !1, file: !1, line: 200, type: !76, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_UnregisterGHExtension, variables: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !82, file: !1, line: 200, type: !69)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !82, file: !1, line: 202, type: !28)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret_val", scope: !82, file: !1, line: 202, type: !28)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !82, file: !1, line: 203, type: !11)
!88 = !DISubprogram(name: "CCTK_RegisterGHExtensionSetupGH", scope: !1, file: !1, line: 269, type: !89, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8* (%struct.tFleshConfig*, i32, %struct.cGH*)*)* @CCTK_RegisterGHExtensionSetupGH, variables: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!28, !28, !8}
!91 = !{!92, !93, !94, !95}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !88, file: !1, line: 269, type: !28)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !88, file: !1, line: 270, type: !8)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !88, file: !1, line: 272, type: !28)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !88, file: !1, line: 273, type: !4)
!96 = !DISubprogram(name: "CCTK_RegisterGHExtensionInitGH", scope: !1, file: !1, line: 324, type: !97, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*)*)* @CCTK_RegisterGHExtensionInitGH, variables: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{!28, !28, !62}
!99 = !{!100, !101, !102, !103}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !96, file: !1, line: 324, type: !28)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !96, file: !1, line: 325, type: !62)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !96, file: !1, line: 327, type: !28)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !96, file: !1, line: 328, type: !4)
!104 = !DISubprogram(name: "CCTK_RegisterGHExtensionScheduleTraverseGH", scope: !1, file: !1, line: 379, type: !105, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*, i8*)*)* @CCTK_RegisterGHExtensionScheduleTraverseGH, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{!28, !28, !66}
!107 = !{!108, !109, !110, !111}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !104, file: !1, line: 379, type: !28)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !104, file: !1, line: 380, type: !66)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !104, file: !1, line: 382, type: !28)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !104, file: !1, line: 383, type: !4)
!112 = !DISubprogram(name: "CCTKi_SetupGHExtensions", scope: !1, file: !1, line: 449, type: !113, isLocal: false, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tFleshConfig*, i32, %struct.cGH*)* @CCTKi_SetupGHExtensions, variables: !115)
!113 = !DISubroutineType(types: !114)
!114 = !{!28, !12, !28, !22}
!115 = !{!116, !117, !118, !119, !120, !121}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !112, file: !1, line: 449, type: !12)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "convergence_level", arg: 2, scope: !112, file: !1, line: 450, type: !28)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 3, scope: !112, file: !1, line: 451, type: !22)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !112, file: !1, line: 453, type: !28)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !112, file: !1, line: 454, type: !28)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !112, file: !1, line: 455, type: !4)
!122 = !DISubprogram(name: "CCTKi_InitGHExtensions", scope: !1, file: !1, line: 523, type: !63, isLocal: false, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CCTKi_InitGHExtensions, variables: !123)
!123 = !{!124, !125, !126}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !122, file: !1, line: 523, type: !22)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !122, file: !1, line: 525, type: !28)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !122, file: !1, line: 526, type: !4)
!127 = !DISubprogram(name: "CCTKi_ScheduleTraverseGHExtensions", scope: !1, file: !1, line: 573, type: !67, isLocal: false, isDefinition: true, scopeLine: 575, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTKi_ScheduleTraverseGHExtensions, variables: !128)
!128 = !{!129, !130, !131, !132, !133}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !127, file: !1, line: 573, type: !22)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !127, file: !1, line: 574, type: !69)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !127, file: !1, line: 576, type: !28)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !127, file: !1, line: 576, type: !28)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !127, file: !1, line: 577, type: !4)
!134 = !DISubprogram(name: "CCTK_GHExtensionHandle", scope: !1, file: !1, line: 630, type: !76, isLocal: false, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_GHExtensionHandle, variables: !135)
!135 = !{!136}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !134, file: !1, line: 630, type: !69)
!137 = !DISubprogram(name: "cctk_ghextensionhandle_", scope: !1, file: !1, line: 635, type: !138, isLocal: false, isDefinition: true, scopeLine: 637, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_ghextensionhandle_, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !31, !18, !60}
!140 = !{!141, !142, !143, !144}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !137, file: !1, line: 636, type: !31)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !137, file: !1, line: 636, type: !18)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !137, file: !1, line: 636, type: !60)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !137, file: !1, line: 638, type: !18)
!145 = !DISubprogram(name: "CCTK_GHExtension", scope: !1, file: !1, line: 670, type: !146, isLocal: false, isDefinition: true, scopeLine: 671, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.cGH*, i8*)* @CCTK_GHExtension, variables: !150)
!146 = !DISubroutineType(types: !147)
!147 = !{!11, !148, !69}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!150 = !{!151, !152, !153}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !145, file: !1, line: 670, type: !148)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !145, file: !1, line: 670, type: !69)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !145, file: !1, line: 672, type: !28)
!154 = !DISubprogram(name: "CheckAllExtensionsSetup", scope: !1, file: !1, line: 707, type: !155, isLocal: true, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: true, variables: !157)
!155 = !DISubroutineType(types: !156)
!156 = !{!28}
!157 = !{!158, !159, !160}
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !154, file: !1, line: 709, type: !28)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !154, file: !1, line: 710, type: !28)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extension", scope: !154, file: !1, line: 711, type: !4)
!161 = !DISubprogram(name: "DummySetupGH", scope: !1, file: !1, line: 806, type: !9, isLocal: true, isDefinition: true, scopeLine: 809, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.tFleshConfig*, i32, %struct.cGH*)* @DummySetupGH, variables: !162)
!162 = !{!163, !164, !165}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !161, file: !1, line: 806, type: !12)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "convergence_level", arg: 2, scope: !161, file: !1, line: 807, type: !28)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 3, scope: !161, file: !1, line: 808, type: !22)
!166 = !DISubprogram(name: "DummyInitGH", scope: !1, file: !1, line: 842, type: !63, isLocal: true, isDefinition: true, scopeLine: 843, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @DummyInitGH, variables: !167)
!167 = !{!168}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !166, file: !1, line: 842, type: !22)
!169 = !DISubprogram(name: "DummyScheduleTraverseGH", scope: !1, file: !1, line: 881, type: !67, isLocal: true, isDefinition: true, scopeLine: 883, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @DummyScheduleTraverseGH, variables: !170)
!170 = !{!171, !172}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !169, file: !1, line: 881, type: !22)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !169, file: !1, line: 882, type: !69)
!173 = !{!174, !175, !191}
!174 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 27, type: !69, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariable(name: "GHExtensions", scope: !0, file: !1, line: 86, type: !176, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @GHExtensions)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !178, line: 28, baseType: !179)
!178 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 23, size: 128, align: 64, elements: !180)
!180 = !{!181, !189, !190}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !179, file: !178, line: 25, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !178, line: 21, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 16, size: 192, align: 64, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !184, file: !178, line: 18, baseType: !60, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !178, line: 19, baseType: !18, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !178, line: 20, baseType: !11, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !179, file: !178, line: 26, baseType: !60, size: 32, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !179, file: !178, line: 27, baseType: !60, size: 32, align: 32, offset: 96)
!191 = !DIGlobalVariable(name: "num_extensions", scope: !0, file: !1, line: 87, type: !28, isLocal: true, isDefinition: true, variable: i32* @num_extensions)
!192 = !{i32 2, !"Dwarf Version", i32 2}
!193 = !{i32 2, !"Debug Info Version", i32 700000003}
!194 = !{i32 1, !"PIC Level", i32 2}
!195 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!196 = !DILocation(line: 29, column: 1, scope: !72)
!197 = !DIExpression()
!198 = !DILocation(line: 127, column: 42, scope: !75)
!199 = !DILocation(line: 135, column: 27, scope: !75)
!200 = !{!201, !201, i64 0}
!201 = !{!"any pointer", !202, i64 0}
!202 = !{!"omnipotent char", !203, i64 0}
!203 = !{!"Simple C/C++ TBAA"}
!204 = !DILocation(line: 135, column: 12, scope: !75)
!205 = !DILocation(line: 130, column: 7, scope: !75)
!206 = !DILocation(line: 137, column: 13, scope: !207)
!207 = distinct !DILexicalBlock(scope: !75, file: !1, line: 137, column: 6)
!208 = !DILocation(line: 137, column: 6, scope: !75)
!209 = !DILocation(line: 140, column: 43, scope: !210)
!210 = distinct !DILexicalBlock(scope: !207, file: !1, line: 138, column: 3)
!211 = !DILocation(line: 142, column: 8, scope: !212)
!212 = distinct !DILexicalBlock(scope: !210, file: !1, line: 142, column: 8)
!213 = !DILocation(line: 142, column: 8, scope: !210)
!214 = !DILocation(line: 145, column: 16, scope: !215)
!215 = distinct !DILexicalBlock(scope: !212, file: !1, line: 143, column: 5)
!216 = !DILocation(line: 153, column: 30, scope: !215)
!217 = !DILocation(line: 157, column: 21, scope: !215)
!218 = !{!219, !219, i64 0}
!219 = !{!"int", !202, i64 0}
!220 = !DILocation(line: 158, column: 5, scope: !215)
!221 = !DILocation(line: 171, column: 3, scope: !75)
!222 = !DILocation(line: 200, column: 44, scope: !82)
!223 = !DILocation(line: 202, column: 15, scope: !82)
!224 = !DILocation(line: 206, column: 27, scope: !82)
!225 = !DILocation(line: 203, column: 9, scope: !82)
!226 = !DILocation(line: 206, column: 12, scope: !82)
!227 = !DILocation(line: 202, column: 7, scope: !82)
!228 = !DILocation(line: 208, column: 13, scope: !229)
!229 = distinct !DILexicalBlock(scope: !82, file: !1, line: 208, column: 6)
!230 = !DILocation(line: 208, column: 6, scope: !82)
!231 = !DILocation(line: 211, column: 27, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !1, line: 211, column: 9)
!233 = distinct !DILexicalBlock(scope: !229, file: !1, line: 209, column: 3)
!234 = !DILocation(line: 211, column: 9, scope: !232)
!235 = !DILocation(line: 211, column: 49, scope: !232)
!236 = !DILocation(line: 211, column: 9, scope: !233)
!237 = !DILocation(line: 213, column: 13, scope: !238)
!238 = distinct !DILexicalBlock(scope: !232, file: !1, line: 212, column: 5)
!239 = !DILocation(line: 213, column: 7, scope: !238)
!240 = !DILocation(line: 215, column: 21, scope: !238)
!241 = !DILocation(line: 223, column: 5, scope: !238)
!242 = !DILocation(line: 226, column: 3, scope: !82)
!243 = !DILocation(line: 269, column: 41, scope: !88)
!244 = !DILocation(line: 270, column: 45, scope: !88)
!245 = !DILocation(line: 276, column: 35, scope: !88)
!246 = !DILocation(line: 276, column: 15, scope: !88)
!247 = !DILocation(line: 278, column: 6, scope: !248)
!248 = distinct !DILexicalBlock(scope: !88, file: !1, line: 278, column: 6)
!249 = !DILocation(line: 278, column: 6, scope: !88)
!250 = !DILocation(line: 280, column: 16, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !1, line: 279, column: 3)
!252 = !DILocation(line: 280, column: 24, scope: !251)
!253 = !{!254, !201, i64 0}
!254 = !{!"GHExtension", !201, i64 0, !201, i64 8, !201, i64 16}
!255 = !DILocation(line: 272, column: 7, scope: !88)
!256 = !DILocation(line: 282, column: 3, scope: !251)
!257 = !DILocation(line: 288, column: 3, scope: !88)
!258 = !DILocation(line: 324, column: 40, scope: !96)
!259 = !DILocation(line: 325, column: 42, scope: !96)
