; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/GHExtension.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cFunctionData = type { i32, i32 (%struct.cGH*, i8*)*, i32, i32, i32*, i32, i32, i32*, i8*, i8*, i8* }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !98, globals: !625, imports: !104)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/GHExtension.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "LangNone", value: 0)
!7 = !DIEnumerator(name: "LangC", value: 1)
!8 = !DIEnumerator(name: "LangFortran", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !10)
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "FunctionNoArgs", value: 0)
!12 = !DIEnumerator(name: "FunctionOneArg", value: 1)
!13 = !DIEnumerator(name: "FunctionStandard", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 16, size: 32, align: 32, elements: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Timers.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "val_none", value: 0)
!18 = !DIEnumerator(name: "val_int", value: 1)
!19 = !DIEnumerator(name: "val_long", value: 2)
!20 = !DIEnumerator(name: "val_double", value: 3)
!21 = !{!22, !24, !23, !26}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !28, line: 126, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !28, line: 96, size: 832, align: 64, elements: !30)
!30 = !{!31, !32, !33, !34, !36, !37, !38, !39, !40, !41, !42, !70, !79, !93, !94, !95, !96}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !28, line: 98, baseType: !24, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !29, file: !28, line: 99, baseType: !23, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !29, file: !28, line: 100, baseType: !23, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !29, file: !28, line: 101, baseType: !35, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 102, baseType: !35, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !29, file: !28, line: 103, baseType: !23, size: 32, align: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !29, file: !28, line: 104, baseType: !23, size: 32, align: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !29, file: !28, line: 106, baseType: !35, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !29, file: !28, line: 114, baseType: !23, size: 32, align: 32, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !29, file: !28, line: 115, baseType: !23, size: 32, align: 32, offset: 416)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !29, file: !28, line: 117, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !28, line: 72, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !28, line: 37, size: 2368, align: 64, elements: !46)
!46 = !{!47, !48, !49, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !67, !69}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !45, file: !28, line: 39, baseType: !23, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !45, file: !28, line: 41, baseType: !22, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !45, file: !28, line: 44, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !45, file: !28, line: 45, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !45, file: !28, line: 46, baseType: !52, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !45, file: !28, line: 47, baseType: !22, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !45, file: !28, line: 49, baseType: !22, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !45, file: !28, line: 50, baseType: !23, size: 32, align: 32, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !45, file: !28, line: 51, baseType: !22, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !45, file: !28, line: 52, baseType: !52, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !45, file: !28, line: 55, baseType: !22, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !45, file: !28, line: 56, baseType: !22, size: 64, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !45, file: !28, line: 59, baseType: !22, size: 64, align: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !45, file: !28, line: 60, baseType: !63, size: 512, align: 64, offset: 832)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DISubrange(count: 4)
!66 = !DISubrange(count: 2)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !45, file: !28, line: 64, baseType: !68, size: 512, align: 64, offset: 1344)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, align: 64, elements: !64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !45, file: !28, line: 68, baseType: !68, size: 512, align: 64, offset: 1856)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !29, file: !28, line: 118, baseType: !71, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !28, line: 29, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !28, line: 23, size: 256, align: 64, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !73, file: !28, line: 25, baseType: !23, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !73, file: !28, line: 26, baseType: !22, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !73, file: !28, line: 27, baseType: !52, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !73, file: !28, line: 28, baseType: !22, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !29, file: !28, line: 120, baseType: !80, size: 64, align: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !28, line: 94, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !28, line: 74, size: 448, align: 64, elements: !83)
!83 = !{!84, !85, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !82, file: !28, line: 77, baseType: !22, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !82, file: !28, line: 78, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !82, file: !28, line: 79, baseType: !86, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !82, file: !28, line: 80, baseType: !23, size: 32, align: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !82, file: !28, line: 82, baseType: !22, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !82, file: !28, line: 84, baseType: !23, size: 32, align: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !82, file: !28, line: 85, baseType: !23, size: 32, align: 32, offset: 352)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !82, file: !28, line: 86, baseType: !23, size: 32, align: 32, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !29, file: !28, line: 121, baseType: !80, size: 64, align: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !29, file: !28, line: 123, baseType: !23, size: 32, align: 32, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !29, file: !28, line: 124, baseType: !23, size: 32, align: 32, offset: 736)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !29, file: !28, line: 125, baseType: !97, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!98 = !{!99, !105, !275, !343, !350, !378, !448, !515, !581, !608, !617}
!99 = !DISubprogram(name: "CCTKi_version_CactusPUGH_pugh_GHExtension_c", scope: !1, file: !1, line: 29, type: !100, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_pugh_GHExtension_c, variables: !104)
!100 = !DISubroutineType(types: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!104 = !{}
!105 = !DISubprogram(name: "PUGH_SetupGH", scope: !1, file: !1, line: 76, type: !106, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.tFleshConfig*, i32, %struct.cGH*)* @PUGH_SetupGH, variables: !151)
!106 = !DISubroutineType(types: !107)
!107 = !{!35, !108, !23, !116}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !110, line: 28, baseType: !111)
!110 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 19, size: 192, align: 64, elements: !112)
!112 = !{!113, !114, !149}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !111, file: !110, line: 21, baseType: !24, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !111, file: !110, line: 24, baseType: !115, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !118, line: 75, baseType: !119)
!118 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 24, size: 1216, align: 64, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !133, !134, !135, !136, !137, !138, !139, !141, !142}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !119, file: !118, line: 26, baseType: !23, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !119, file: !118, line: 27, baseType: !23, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !119, file: !118, line: 30, baseType: !22, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !119, file: !118, line: 31, baseType: !22, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !119, file: !118, line: 32, baseType: !22, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !119, file: !118, line: 33, baseType: !22, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !119, file: !118, line: 36, baseType: !22, size: 64, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !119, file: !118, line: 39, baseType: !22, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !119, file: !118, line: 40, baseType: !22, size: 64, align: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !119, file: !118, line: 43, baseType: !50, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !119, file: !118, line: 44, baseType: !132, size: 64, align: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !119, file: !118, line: 47, baseType: !132, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !119, file: !118, line: 51, baseType: !22, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !119, file: !118, line: 54, baseType: !22, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !119, file: !118, line: 57, baseType: !23, size: 32, align: 32, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !119, file: !118, line: 60, baseType: !22, size: 64, align: 64, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !119, file: !118, line: 63, baseType: !50, size: 64, align: 64, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !118, line: 67, baseType: !140, size: 64, align: 64, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !119, file: !118, line: 70, baseType: !86, size: 64, align: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !119, file: !118, line: 73, baseType: !143, size: 64, align: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !118, line: 22, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 18, size: 16, align: 8, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !145, file: !118, line: 20, baseType: !25, size: 8, align: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !145, file: !118, line: 21, baseType: !25, size: 8, align: 8, offset: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !111, file: !110, line: 25, baseType: !150, size: 32, align: 32, offset: 128)
!150 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !190, !203, !204, !205, !206, !207, !208, !209, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271, !272}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !105, file: !1, line: 76, type: !108)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "convergence_level", arg: 2, scope: !105, file: !1, line: 77, type: !23)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 3, scope: !105, file: !1, line: 78, type: !116)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !105, file: !1, line: 80, type: !23)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !105, file: !1, line: 80, type: !23)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxdim", scope: !105, file: !1, line: 80, type: !23)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newGH", scope: !105, file: !1, line: 81, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !161, line: 81, baseType: !162)
!161 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !161, line: 13, size: 1152, align: 64, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !189}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !162, file: !161, line: 17, baseType: !35, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !162, file: !161, line: 18, baseType: !23, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !162, file: !161, line: 21, baseType: !23, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !162, file: !161, line: 22, baseType: !23, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !162, file: !161, line: 23, baseType: !23, size: 32, align: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !162, file: !161, line: 27, baseType: !23, size: 32, align: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !162, file: !161, line: 28, baseType: !23, size: 32, align: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !162, file: !161, line: 29, baseType: !140, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !162, file: !161, line: 32, baseType: !23, size: 32, align: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !162, file: !161, line: 34, baseType: !22, size: 64, align: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !162, file: !161, line: 35, baseType: !23, size: 32, align: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !162, file: !161, line: 37, baseType: !23, size: 32, align: 32, offset: 480)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !162, file: !161, line: 41, baseType: !50, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !162, file: !161, line: 41, baseType: !50, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !162, file: !161, line: 41, baseType: !50, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !162, file: !161, line: 41, baseType: !50, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !162, file: !161, line: 44, baseType: !23, size: 32, align: 32, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !162, file: !161, line: 45, baseType: !23, size: 32, align: 32, offset: 800)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !162, file: !161, line: 46, baseType: !23, size: 32, align: 32, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !162, file: !161, line: 49, baseType: !23, size: 32, align: 32, offset: 864)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !162, file: !161, line: 53, baseType: !23, size: 32, align: 32, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !162, file: !161, line: 76, baseType: !186, size: 64, align: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !162, file: !161, line: 77, baseType: !188, size: 64, align: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !162, file: !161, line: 79, baseType: !24, size: 64, align: 64, offset: 1088)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pgroup", scope: !105, file: !1, line: 82, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !192, line: 24, baseType: !193)
!192 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!193 = !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 14, size: 256, align: 32, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !193, file: !192, line: 16, baseType: !23, size: 32, align: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !193, file: !192, line: 17, baseType: !23, size: 32, align: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !193, file: !192, line: 18, baseType: !23, size: 32, align: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !193, file: !192, line: 19, baseType: !23, size: 32, align: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !193, file: !192, line: 20, baseType: !23, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !193, file: !192, line: 21, baseType: !23, size: 32, align: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !193, file: !192, line: 22, baseType: !23, size: 32, align: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !193, file: !192, line: 23, baseType: !23, size: 32, align: 32, offset: 224)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !105, file: !1, line: 83, type: !52)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsize", scope: !105, file: !1, line: 84, type: !22)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghostsize", scope: !105, file: !1, line: 84, type: !22)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perme", scope: !105, file: !1, line: 84, type: !22)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupghostsize", scope: !105, file: !1, line: 84, type: !22)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupsize", scope: !105, file: !1, line: 84, type: !22)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !105, file: !1, line: 85, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !105, file: !1, line: 85, type: !210)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !105, file: !1, line: 85, type: !210)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !105, file: !1, line: 85, type: !210)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !105, file: !1, line: 85, type: !210)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !105, file: !1, line: 85, type: !210)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !105, file: !1, line: 85, type: !210)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !105, file: !1, line: 85, type: !210)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !105, file: !1, line: 85, type: !210)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !105, file: !1, line: 85, type: !210)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !105, file: !1, line: 85, type: !210)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !105, file: !1, line: 85, type: !210)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !105, file: !1, line: 85, type: !102)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !105, file: !1, line: 85, type: !102)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !105, file: !1, line: 85, type: !102)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !105, file: !1, line: 85, type: !102)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !105, file: !1, line: 85, type: !102)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !105, file: !1, line: 85, type: !102)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !105, file: !1, line: 85, type: !102)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !105, file: !1, line: 85, type: !102)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !105, file: !1, line: 85, type: !102)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !105, file: !1, line: 85, type: !102)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !105, file: !1, line: 85, type: !102)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !105, file: !1, line: 85, type: !210)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !105, file: !1, line: 85, type: !210)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !105, file: !1, line: 85, type: !210)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !105, file: !1, line: 85, type: !210)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !105, file: !1, line: 85, type: !210)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !105, file: !1, line: 85, type: !210)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !105, file: !1, line: 85, type: !210)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !105, file: !1, line: 85, type: !210)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !105, file: !1, line: 85, type: !210)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !105, file: !1, line: 85, type: !210)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !105, file: !1, line: 85, type: !210)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !105, file: !1, line: 85, type: !210)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !105, file: !1, line: 85, type: !210)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !105, file: !1, line: 85, type: !210)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !105, file: !1, line: 85, type: !210)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !105, file: !1, line: 85, type: !210)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !105, file: !1, line: 85, type: !210)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !105, file: !1, line: 85, type: !210)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !105, file: !1, line: 85, type: !210)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !105, file: !1, line: 85, type: !210)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !105, file: !1, line: 85, type: !210)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !105, file: !1, line: 85, type: !210)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !105, file: !1, line: 85, type: !210)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !105, file: !1, line: 85, type: !210)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !105, file: !1, line: 85, type: !210)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !105, file: !1, line: 85, type: !210)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !105, file: !1, line: 85, type: !210)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !105, file: !1, line: 85, type: !210)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !105, file: !1, line: 85, type: !210)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !105, file: !1, line: 85, type: !210)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !105, file: !1, line: 85, type: !210)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !105, file: !1, line: 85, type: !210)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !105, file: !1, line: 85, type: !210)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !105, file: !1, line: 85, type: !102)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !105, file: !1, line: 85, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !105, file: !1, line: 85, type: !268)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !105, file: !1, line: 85, type: !210)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !105, file: !1, line: 85, type: !210)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !105, file: !1, line: 85, type: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!275 = !DISubprogram(name: "PUGH_InitGH", scope: !1, file: !1, line: 294, type: !276, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @PUGH_InitGH, variables: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{!23, !116}
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !275, file: !1, line: 294, type: !116)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !275, file: !1, line: 296, type: !23)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !275, file: !1, line: 297, type: !210)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !275, file: !1, line: 297, type: !210)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !275, file: !1, line: 297, type: !210)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !275, file: !1, line: 297, type: !210)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !275, file: !1, line: 297, type: !210)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !275, file: !1, line: 297, type: !210)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !275, file: !1, line: 297, type: !210)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !275, file: !1, line: 297, type: !210)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !275, file: !1, line: 297, type: !210)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !275, file: !1, line: 297, type: !210)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !275, file: !1, line: 297, type: !210)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !275, file: !1, line: 297, type: !210)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !275, file: !1, line: 297, type: !102)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !275, file: !1, line: 297, type: !102)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !275, file: !1, line: 297, type: !102)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !275, file: !1, line: 297, type: !102)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !275, file: !1, line: 297, type: !102)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !275, file: !1, line: 297, type: !102)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !275, file: !1, line: 297, type: !102)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !275, file: !1, line: 297, type: !102)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !275, file: !1, line: 297, type: !102)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !275, file: !1, line: 297, type: !102)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !275, file: !1, line: 297, type: !102)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !275, file: !1, line: 297, type: !210)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !275, file: !1, line: 297, type: !210)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !275, file: !1, line: 297, type: !210)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !275, file: !1, line: 297, type: !210)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !275, file: !1, line: 297, type: !210)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !275, file: !1, line: 297, type: !210)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !275, file: !1, line: 297, type: !210)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !275, file: !1, line: 297, type: !210)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !275, file: !1, line: 297, type: !210)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !275, file: !1, line: 297, type: !210)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !275, file: !1, line: 297, type: !210)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !275, file: !1, line: 297, type: !210)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !275, file: !1, line: 297, type: !210)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !275, file: !1, line: 297, type: !210)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !275, file: !1, line: 297, type: !210)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !275, file: !1, line: 297, type: !210)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !275, file: !1, line: 297, type: !210)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !275, file: !1, line: 297, type: !210)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !275, file: !1, line: 297, type: !210)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !275, file: !1, line: 297, type: !210)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !275, file: !1, line: 297, type: !210)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !275, file: !1, line: 297, type: !210)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !275, file: !1, line: 297, type: !210)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !275, file: !1, line: 297, type: !210)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !275, file: !1, line: 297, type: !210)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !275, file: !1, line: 297, type: !210)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !275, file: !1, line: 297, type: !210)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !275, file: !1, line: 297, type: !210)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !275, file: !1, line: 297, type: !210)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !275, file: !1, line: 297, type: !210)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !275, file: !1, line: 297, type: !210)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !275, file: !1, line: 297, type: !210)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !275, file: !1, line: 297, type: !210)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !275, file: !1, line: 297, type: !102)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !275, file: !1, line: 297, type: !268)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !275, file: !1, line: 297, type: !268)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !275, file: !1, line: 297, type: !210)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !275, file: !1, line: 297, type: !210)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !275, file: !1, line: 297, type: !273)
!343 = !DISubprogram(name: "PUGH_ScheduleTraverseGH", scope: !1, file: !1, line: 349, type: !344, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @PUGH_ScheduleTraverseGH, variables: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{!23, !116, !102}
!346 = !{!347, !348, !349}
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !343, file: !1, line: 349, type: !116)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !343, file: !1, line: 350, type: !102)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !343, file: !1, line: 352, type: !23)
!350 = !DISubprogram(name: "PUGH_RegisterCallFunc", scope: !1, file: !1, line: 366, type: !351, isLocal: false, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: true, function: void (i32 (i8*, %struct.cFunctionData*, i8*)*)* @PUGH_RegisterCallFunc, variables: !376)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!23, !35, !356, !35}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "cFunctionData", file: !4, line: 43, baseType: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 18, size: 576, align: 64, elements: !359)
!359 = !{!360, !362, !366, !368, !369, !370, !371, !372, !373, !374, !375}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !358, file: !4, line: 20, baseType: !361, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "cLanguage", file: !4, line: 14, baseType: !3)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "FortranCaller", scope: !358, file: !4, line: 22, baseType: !363, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!23, !116, !35}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !4, line: 24, baseType: !367, size: 32, align: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "cFunctionType", file: !4, line: 16, baseType: !9)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "n_SyncGroups", scope: !358, file: !4, line: 26, baseType: !23, size: 32, align: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "SyncGroups", scope: !358, file: !4, line: 28, baseType: !22, size: 64, align: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !358, file: !4, line: 32, baseType: !23, size: 32, align: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "n_TriggerGroups", scope: !358, file: !4, line: 37, baseType: !23, size: 32, align: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "TriggerGroups", scope: !358, file: !4, line: 38, baseType: !22, size: 64, align: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !358, file: !4, line: 39, baseType: !24, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !358, file: !4, line: 40, baseType: !24, size: 64, align: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !358, file: !4, line: 41, baseType: !24, size: 64, align: 64, offset: 512)
!376 = !{!377}
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !350, file: !1, line: 366, type: !353)
!378 = !DISubprogram(name: "PUGH_GFSize", scope: !1, file: !1, line: 393, type: !379, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*)* @PUGH_GFSize, variables: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !23, !22}
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !378, file: !1, line: 393, type: !23)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsize", arg: 2, scope: !378, file: !1, line: 393, type: !22)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !378, file: !1, line: 395, type: !23)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !378, file: !1, line: 395, type: !23)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !378, file: !1, line: 396, type: !210)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !378, file: !1, line: 396, type: !210)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !378, file: !1, line: 396, type: !210)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !378, file: !1, line: 396, type: !210)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !378, file: !1, line: 396, type: !210)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !378, file: !1, line: 396, type: !210)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !378, file: !1, line: 396, type: !210)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !378, file: !1, line: 396, type: !210)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !378, file: !1, line: 396, type: !210)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !378, file: !1, line: 396, type: !210)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !378, file: !1, line: 396, type: !210)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !378, file: !1, line: 396, type: !210)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !378, file: !1, line: 396, type: !102)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !378, file: !1, line: 396, type: !102)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !378, file: !1, line: 396, type: !102)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !378, file: !1, line: 396, type: !102)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !378, file: !1, line: 396, type: !102)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !378, file: !1, line: 396, type: !102)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !378, file: !1, line: 396, type: !102)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !378, file: !1, line: 396, type: !102)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !378, file: !1, line: 396, type: !102)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !378, file: !1, line: 396, type: !102)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !378, file: !1, line: 396, type: !102)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !378, file: !1, line: 396, type: !210)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !378, file: !1, line: 396, type: !210)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !378, file: !1, line: 396, type: !210)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !378, file: !1, line: 396, type: !210)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !378, file: !1, line: 396, type: !210)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !378, file: !1, line: 396, type: !210)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !378, file: !1, line: 396, type: !210)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !378, file: !1, line: 396, type: !210)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !378, file: !1, line: 396, type: !210)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !378, file: !1, line: 396, type: !210)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !378, file: !1, line: 396, type: !210)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !378, file: !1, line: 396, type: !210)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !378, file: !1, line: 396, type: !210)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !378, file: !1, line: 396, type: !210)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !378, file: !1, line: 396, type: !210)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !378, file: !1, line: 396, type: !210)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !378, file: !1, line: 396, type: !210)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !378, file: !1, line: 396, type: !210)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !378, file: !1, line: 396, type: !210)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !378, file: !1, line: 396, type: !210)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !378, file: !1, line: 396, type: !210)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !378, file: !1, line: 396, type: !210)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !378, file: !1, line: 396, type: !210)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !378, file: !1, line: 396, type: !210)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !378, file: !1, line: 396, type: !210)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !378, file: !1, line: 396, type: !210)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !378, file: !1, line: 396, type: !210)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !378, file: !1, line: 396, type: !210)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !378, file: !1, line: 396, type: !210)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !378, file: !1, line: 396, type: !210)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !378, file: !1, line: 396, type: !210)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !378, file: !1, line: 396, type: !210)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !378, file: !1, line: 396, type: !210)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !378, file: !1, line: 396, type: !102)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !378, file: !1, line: 396, type: !268)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !378, file: !1, line: 396, type: !268)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !378, file: !1, line: 396, type: !210)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !378, file: !1, line: 396, type: !210)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !378, file: !1, line: 396, type: !273)
!448 = !DISubprogram(name: "PUGH_GFGhostsize", scope: !1, file: !1, line: 439, type: !379, isLocal: false, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*)* @PUGH_GFGhostsize, variables: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !448, file: !1, line: 439, type: !23)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghostsize", arg: 2, scope: !448, file: !1, line: 439, type: !22)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !448, file: !1, line: 441, type: !23)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !448, file: !1, line: 442, type: !210)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !448, file: !1, line: 442, type: !210)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !448, file: !1, line: 442, type: !210)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !448, file: !1, line: 442, type: !210)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !448, file: !1, line: 442, type: !210)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !448, file: !1, line: 442, type: !210)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !448, file: !1, line: 442, type: !210)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !448, file: !1, line: 442, type: !210)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !448, file: !1, line: 442, type: !210)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !448, file: !1, line: 442, type: !210)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !448, file: !1, line: 442, type: !210)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !448, file: !1, line: 442, type: !210)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !448, file: !1, line: 442, type: !102)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !448, file: !1, line: 442, type: !102)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !448, file: !1, line: 442, type: !102)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !448, file: !1, line: 442, type: !102)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !448, file: !1, line: 442, type: !102)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !448, file: !1, line: 442, type: !102)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !448, file: !1, line: 442, type: !102)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !448, file: !1, line: 442, type: !102)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !448, file: !1, line: 442, type: !102)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !448, file: !1, line: 442, type: !102)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !448, file: !1, line: 442, type: !102)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !448, file: !1, line: 442, type: !210)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !448, file: !1, line: 442, type: !210)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !448, file: !1, line: 442, type: !210)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !448, file: !1, line: 442, type: !210)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !448, file: !1, line: 442, type: !210)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !448, file: !1, line: 442, type: !210)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !448, file: !1, line: 442, type: !210)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !448, file: !1, line: 442, type: !210)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !448, file: !1, line: 442, type: !210)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !448, file: !1, line: 442, type: !210)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !448, file: !1, line: 442, type: !210)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !448, file: !1, line: 442, type: !210)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !448, file: !1, line: 442, type: !210)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !448, file: !1, line: 442, type: !210)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !448, file: !1, line: 442, type: !210)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !448, file: !1, line: 442, type: !210)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !448, file: !1, line: 442, type: !210)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !448, file: !1, line: 442, type: !210)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !448, file: !1, line: 442, type: !210)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !448, file: !1, line: 442, type: !210)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !448, file: !1, line: 442, type: !210)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !448, file: !1, line: 442, type: !210)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !448, file: !1, line: 442, type: !210)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !448, file: !1, line: 442, type: !210)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !448, file: !1, line: 442, type: !210)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !448, file: !1, line: 442, type: !210)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !448, file: !1, line: 442, type: !210)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !448, file: !1, line: 442, type: !210)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !448, file: !1, line: 442, type: !210)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !448, file: !1, line: 442, type: !210)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !448, file: !1, line: 442, type: !210)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !448, file: !1, line: 442, type: !210)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !448, file: !1, line: 442, type: !210)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !448, file: !1, line: 442, type: !102)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !448, file: !1, line: 442, type: !268)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !448, file: !1, line: 442, type: !268)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !448, file: !1, line: 442, type: !210)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !448, file: !1, line: 442, type: !210)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !448, file: !1, line: 442, type: !273)
!515 = !DISubprogram(name: "PUGH_GFPeriodic", scope: !1, file: !1, line: 485, type: !379, isLocal: false, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*)* @PUGH_GFPeriodic, variables: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !515, file: !1, line: 485, type: !23)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !515, file: !1, line: 485, type: !22)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !515, file: !1, line: 487, type: !210)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !515, file: !1, line: 487, type: !210)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !515, file: !1, line: 487, type: !210)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !515, file: !1, line: 487, type: !210)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !515, file: !1, line: 487, type: !210)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !515, file: !1, line: 487, type: !210)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !515, file: !1, line: 487, type: !210)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !515, file: !1, line: 487, type: !210)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !515, file: !1, line: 487, type: !210)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !515, file: !1, line: 487, type: !210)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !515, file: !1, line: 487, type: !210)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !515, file: !1, line: 487, type: !210)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !515, file: !1, line: 487, type: !102)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !515, file: !1, line: 487, type: !102)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !515, file: !1, line: 487, type: !102)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !515, file: !1, line: 487, type: !102)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !515, file: !1, line: 487, type: !102)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !515, file: !1, line: 487, type: !102)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !515, file: !1, line: 487, type: !102)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !515, file: !1, line: 487, type: !102)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !515, file: !1, line: 487, type: !102)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !515, file: !1, line: 487, type: !102)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !515, file: !1, line: 487, type: !102)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !515, file: !1, line: 487, type: !210)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !515, file: !1, line: 487, type: !210)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !515, file: !1, line: 487, type: !210)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !515, file: !1, line: 487, type: !210)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !515, file: !1, line: 487, type: !210)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !515, file: !1, line: 487, type: !210)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !515, file: !1, line: 487, type: !210)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !515, file: !1, line: 487, type: !210)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !515, file: !1, line: 487, type: !210)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !515, file: !1, line: 487, type: !210)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !515, file: !1, line: 487, type: !210)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !515, file: !1, line: 487, type: !210)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !515, file: !1, line: 487, type: !210)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !515, file: !1, line: 487, type: !210)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !515, file: !1, line: 487, type: !210)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !515, file: !1, line: 487, type: !210)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !515, file: !1, line: 487, type: !210)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !515, file: !1, line: 487, type: !210)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !515, file: !1, line: 487, type: !210)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !515, file: !1, line: 487, type: !210)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !515, file: !1, line: 487, type: !210)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !515, file: !1, line: 487, type: !210)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !515, file: !1, line: 487, type: !210)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !515, file: !1, line: 487, type: !210)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !515, file: !1, line: 487, type: !210)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !515, file: !1, line: 487, type: !210)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !515, file: !1, line: 487, type: !210)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !515, file: !1, line: 487, type: !210)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !515, file: !1, line: 487, type: !210)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !515, file: !1, line: 487, type: !210)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !515, file: !1, line: 487, type: !210)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !515, file: !1, line: 487, type: !210)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !515, file: !1, line: 487, type: !210)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !515, file: !1, line: 487, type: !102)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !515, file: !1, line: 487, type: !268)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !515, file: !1, line: 487, type: !268)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !515, file: !1, line: 487, type: !210)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !515, file: !1, line: 487, type: !210)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !515, file: !1, line: 487, type: !273)
!581 = !DISubprogram(name: "PUGH_PrintTimingInfo", scope: !1, file: !1, line: 524, type: !276, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @PUGH_PrintTimingInfo, variables: !582)
!582 = !{!583, !584, !585, !607}
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !581, file: !1, line: 524, type: !116)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !581, file: !1, line: 526, type: !23)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !581, file: !1, line: 527, type: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerData", file: !15, line: 35, baseType: !588)
!588 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 31, size: 128, align: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "n_vals", scope: !588, file: !15, line: 33, baseType: !23, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !588, file: !15, line: 34, baseType: !592, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerVal", file: !15, line: 29, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 18, size: 256, align: 64, elements: !595)
!595 = !{!596, !598, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !15, line: 20, baseType: !597, size: 32, align: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerValType", file: !15, line: 16, baseType: !14)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "heading", scope: !594, file: !15, line: 21, baseType: !102, size: 64, align: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !594, file: !15, line: 22, baseType: !102, size: 64, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !594, file: !15, line: 28, baseType: !601, size: 64, align: 64, offset: 192)
!601 = !DICompositeType(tag: DW_TAG_union_type, scope: !594, file: !15, line: 23, size: 64, align: 64, elements: !602)
!602 = !{!603, !604, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !601, file: !15, line: 25, baseType: !23, size: 32, align: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !601, file: !15, line: 26, baseType: !605, size: 64, align: 64)
!605 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !601, file: !15, line: 27, baseType: !50, size: 64, align: 64)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !581, file: !1, line: 528, type: !159)
!608 = !DISubprogram(name: "PUGH_InitGHBasics", scope: !1, file: !1, line: 183, type: !609, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cGH*)* @PUGH_InitGHBasics, variables: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !116}
!611 = !{!612, !613, !614, !615, !616}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !608, file: !1, line: 183, type: !116)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !608, file: !1, line: 185, type: !23)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagger", scope: !608, file: !1, line: 185, type: !23)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mypGH", scope: !608, file: !1, line: 186, type: !159)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GFExtras", scope: !608, file: !1, line: 187, type: !43)
!617 = !DISubprogram(name: "PUGH_InitGHVariables", scope: !1, file: !1, line: 241, type: !609, isLocal: true, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, variables: !618)
!618 = !{!619, !620, !621, !622, !623, !624}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !617, file: !1, line: 241, type: !116)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !617, file: !1, line: 243, type: !23)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gtype", scope: !617, file: !1, line: 243, type: !23)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !617, file: !1, line: 243, type: !23)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntimelevels", scope: !617, file: !1, line: 243, type: !23)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mypGH", scope: !617, file: !1, line: 244, type: !159)
!625 = !{!626, !627}
!626 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 27, type: !102, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariable(name: "PUGHCallFunc", scope: !0, file: !1, line: 38, type: !353, isLocal: true, isDefinition: true, variable: i32 (i8*, %struct.cFunctionData*, i8*)** @PUGHCallFunc)
!628 = !{i32 2, !"Dwarf Version", i32 2}
!629 = !{i32 2, !"Debug Info Version", i32 700000003}
!630 = !{i32 1, !"PIC Level", i32 2}
!631 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!632 = !DILocation(line: 29, column: 1, scope: !99)
!633 = !DIExpression()
!634 = !DILocation(line: 76, column: 35, scope: !105)
!635 = !DILocation(line: 77, column: 35, scope: !105)
!636 = !DILocation(line: 78, column: 35, scope: !105)
!637 = !DILocation(line: 93, column: 12, scope: !105)
!638 = !DILocation(line: 80, column: 17, scope: !105)
!639 = !DILocation(line: 95, column: 38, scope: !105)
!640 = !DILocation(line: 95, column: 36, scope: !105)
!641 = !DILocation(line: 95, column: 47, scope: !105)
!642 = !DILocation(line: 95, column: 28, scope: !105)
!643 = !DILocation(line: 95, column: 20, scope: !105)
!644 = !DILocation(line: 84, column: 8, scope: !105)
!645 = !DILocation(line: 96, column: 26, scope: !105)
!646 = !DILocation(line: 84, column: 16, scope: !105)
