; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/GRID_restricted.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32 }

@gridrest_ = common global %struct.anon zeroinitializer, align 8

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!33, !34, !35}
!llvm.ident = !{!36}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !2, globals: !3, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/GRID_restricted.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIGlobalVariable(name: "gridrest_", scope: !0, file: !1, line: 37, type: !5, isLocal: false, isDefinition: true, variable: %struct.anon* @gridrest_)
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 13, size: 1216, align: 64, elements: !6)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !23, !24, !25, !26, !28, !29, !30, !31, !32}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !5, file: !1, line: 15, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "dxyz", scope: !5, file: !1, line: 16, baseType: !8, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !5, file: !1, line: 17, baseType: !8, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !5, file: !1, line: 18, baseType: !8, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !5, file: !1, line: 19, baseType: !8, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !5, file: !1, line: 20, baseType: !8, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "xyzmax", scope: !5, file: !1, line: 21, baseType: !8, size: 64, align: 64, offset: 384)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "xyzmin", scope: !5, file: !1, line: 22, baseType: !8, size: 64, align: 64, offset: 448)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !5, file: !1, line: 23, baseType: !8, size: 64, align: 64, offset: 512)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !5, file: !1, line: 24, baseType: !8, size: 64, align: 64, offset: 576)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "zmax", scope: !5, file: !1, line: 25, baseType: !8, size: 64, align: 64, offset: 640)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "zmin", scope: !5, file: !1, line: 26, baseType: !8, size: 64, align: 64, offset: 704)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "bitant_plane", scope: !5, file: !1, line: 27, baseType: !21, size: 64, align: 64, offset: 768)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !5, file: !1, line: 28, baseType: !21, size: 64, align: 64, offset: 832)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "quadrant_direction", scope: !5, file: !1, line: 29, baseType: !21, size: 64, align: 64, offset: 896)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !5, file: !1, line: 30, baseType: !21, size: 64, align: 64, offset: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_xmax", scope: !5, file: !1, line: 31, baseType: !27, size: 32, align: 32, offset: 1024)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_xmin", scope: !5, file: !1, line: 32, baseType: !27, size: 32, align: 32, offset: 1056)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_ymax", scope: !5, file: !1, line: 33, baseType: !27, size: 32, align: 32, offset: 1088)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_ymin", scope: !5, file: !1, line: 34, baseType: !27, size: 32, align: 32, offset: 1120)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_zmax", scope: !5, file: !1, line: 35, baseType: !27, size: 32, align: 32, offset: 1152)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_zmin", scope: !5, file: !1, line: 36, baseType: !27, size: 32, align: 32, offset: 1184)
!33 = !{i32 2, !"Dwarf Version", i32 2}
!34 = !{i32 2, !"Debug Info Version", i32 700000003}
!35 = !{i32 1, !"PIC Level", i32 2}
!36 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
