; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/GroupsOnGH.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.GROUPDYNAMICDATA = type { i32, i32*, i32*, i32*, i32*, i32*, i32* }

@.str = private unnamed_addr constant [79 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/GroupsOnGH.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [46 x i8] c"Invalid variable name '%s' in CCTK_VarDataPtr\00", align 1
@.str3 = private unnamed_addr constant [63 x i8] c"CCTK_VarPtrDataI: calling CCTK_VarDataPtrI with negative index\00", align 1
@CCTK_EnableGroupComm = external global i32 (%struct.cGH*, i8*)*
@CCTK_EnableGroupStorage = external global i32 (%struct.cGH*, i8*)*
@CCTK_DisableGroupComm = external global i32 (%struct.cGH*, i8*)*
@CCTK_DisableGroupStorage = external global i32 (%struct.cGH*, i8*)*
@CCTK_ArrayGroupSizeB = external global i32* (%struct.cGH*, i32, i32, i8*)*
@CCTK_QueryGroupStorageB = external global i32 (%struct.cGH*, i32, i8*)*
@.str4 = private unnamed_addr constant [62 x i8] c"CCTK_GrouplbndGI: Grid information called for scalar group %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !546, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/GroupsOnGH.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !{!9, !15, !61, !68, !77, !86, !92, !98, !104, !111, !118, !124, !130, !153, !162, !172, !184, !192, !199, !207, !216, !226, !233, !241, !250, !258, !265, !273, !282, !292, !299, !307, !316, !324, !331, !339, !348, !358, !365, !373, !382, !390, !397, !405, !414, !424, !431, !439, !448, !456, !463, !471, !480, !490, !497, !505, !514, !522, !529, !537}
!9 = !DISubprogram(name: "CCTKi_version_main_GroupsOnGH_c", scope: !1, file: !1, line: 29, type: !10, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_GroupsOnGH_c, variables: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DISubprogram(name: "CCTK_VarDataPtr", scope: !1, file: !1, line: 216, type: !16, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.cGH*, i32, i8*)* @CCTK_VarDataPtr, variables: !55)
!16 = !DISubroutineType(types: !17)
!17 = !{!4, !18, !7, !12}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !21, line: 75, baseType: !22)
!21 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 24, size: 1216, align: 64, elements: !23)
!23 = !{!24, !25, !26, !28, !29, !30, !31, !32, !33, !34, !36, !38, !39, !40, !41, !42, !43, !44, !47, !48}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !22, file: !21, line: 26, baseType: !7, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !22, file: !21, line: 27, baseType: !7, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !22, file: !21, line: 30, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !22, file: !21, line: 31, baseType: !27, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !22, file: !21, line: 32, baseType: !27, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !22, file: !21, line: 33, baseType: !27, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !22, file: !21, line: 36, baseType: !27, size: 64, align: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !22, file: !21, line: 39, baseType: !27, size: 64, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !22, file: !21, line: 40, baseType: !27, size: 64, align: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !22, file: !21, line: 43, baseType: !35, size: 64, align: 64, offset: 512)
!35 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !22, file: !21, line: 44, baseType: !37, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !22, file: !21, line: 47, baseType: !37, size: 64, align: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !22, file: !21, line: 51, baseType: !27, size: 64, align: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !22, file: !21, line: 54, baseType: !27, size: 64, align: 64, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !22, file: !21, line: 57, baseType: !7, size: 32, align: 32, offset: 832)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !22, file: !21, line: 60, baseType: !27, size: 64, align: 64, offset: 896)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !22, file: !21, line: 63, baseType: !35, size: 64, align: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !21, line: 67, baseType: !45, size: 64, align: 64, offset: 1024)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !22, file: !21, line: 70, baseType: !46, size: 64, align: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !22, file: !21, line: 73, baseType: !49, size: 64, align: 64, offset: 1152)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !21, line: 22, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 18, size: 16, align: 8, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !51, file: !21, line: 20, baseType: !14, size: 8, align: 8)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !51, file: !21, line: 21, baseType: !14, size: 8, align: 8, offset: 8)
!55 = !{!56, !57, !58, !59, !60}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !15, file: !1, line: 216, type: !18)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevel", arg: 2, scope: !15, file: !1, line: 216, type: !7)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "varname", arg: 3, scope: !15, file: !1, line: 216, type: !12)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !15, file: !1, line: 218, type: !7)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !15, file: !1, line: 219, type: !4)
!61 = !DISubprogram(name: "CCTK_VarDataPtrI", scope: !1, file: !1, line: 282, type: !62, isLocal: false, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.cGH*, i32, i32)* @CCTK_VarDataPtrI, variables: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{!4, !18, !7, !7}
!64 = !{!65, !66, !67}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !61, file: !1, line: 282, type: !18)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevel", arg: 2, scope: !61, file: !1, line: 282, type: !7)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vari", arg: 3, scope: !61, file: !1, line: 282, type: !7)
!68 = !DISubprogram(name: "CCTK_VarDataPtrB", scope: !1, file: !1, line: 337, type: !69, isLocal: false, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.cGH*, i32, i32, i8*)* @CCTK_VarDataPtrB, variables: !72)
!69 = !DISubroutineType(types: !70)
!70 = !{!4, !18, !7, !7, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!72 = !{!73, !74, !75, !76}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !68, file: !1, line: 337, type: !18)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timelevel", arg: 2, scope: !68, file: !1, line: 337, type: !7)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vari", arg: 3, scope: !68, file: !1, line: 337, type: !7)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "varn", arg: 4, scope: !68, file: !1, line: 337, type: !71)
!77 = !DISubprogram(name: "CCTK_EnableGroupCommI", scope: !1, file: !1, line: 363, type: !78, isLocal: false, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CCTK_EnableGroupCommI, variables: !81)
!78 = !DISubroutineType(types: !79)
!79 = !{!7, !80, !7}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!81 = !{!82, !83, !84, !85}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !77, file: !1, line: 363, type: !80)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !77, file: !1, line: 363, type: !7)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !77, file: !1, line: 365, type: !7)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_name", scope: !77, file: !1, line: 366, type: !71)
!86 = !DISubprogram(name: "CCTK_EnableGroupStorageI", scope: !1, file: !1, line: 397, type: !78, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CCTK_EnableGroupStorageI, variables: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !86, file: !1, line: 397, type: !80)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !86, file: !1, line: 397, type: !7)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !86, file: !1, line: 399, type: !7)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_name", scope: !86, file: !1, line: 400, type: !71)
!92 = !DISubprogram(name: "CCTK_DisableGroupCommI", scope: !1, file: !1, line: 434, type: !78, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CCTK_DisableGroupCommI, variables: !93)
!93 = !{!94, !95, !96, !97}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !92, file: !1, line: 434, type: !80)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !92, file: !1, line: 434, type: !7)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !92, file: !1, line: 436, type: !7)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_name", scope: !92, file: !1, line: 437, type: !71)
!98 = !DISubprogram(name: "CCTK_DisableGroupStorageI", scope: !1, file: !1, line: 471, type: !78, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CCTK_DisableGroupStorageI, variables: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !98, file: !1, line: 471, type: !80)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !98, file: !1, line: 471, type: !7)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !98, file: !1, line: 473, type: !7)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_name", scope: !98, file: !1, line: 474, type: !71)
!104 = !DISubprogram(name: "CCTK_ArrayGroupSizeI", scope: !1, file: !1, line: 492, type: !105, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct.cGH*, i32, i32)* @CCTK_ArrayGroupSizeI, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !18, !7, !7}
!107 = !{!108, !109, !110}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !104, file: !1, line: 492, type: !18)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 2, scope: !104, file: !1, line: 492, type: !7)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupi", arg: 3, scope: !104, file: !1, line: 492, type: !7)
!111 = !DISubprogram(name: "CCTK_ArrayGroupSize", scope: !1, file: !1, line: 497, type: !112, isLocal: false, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct.cGH*, i32, i8*)* @CCTK_ArrayGroupSize, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!5, !18, !7, !12}
!114 = !{!115, !116, !117}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !111, file: !1, line: 497, type: !18)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 2, scope: !111, file: !1, line: 497, type: !7)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupn", arg: 3, scope: !111, file: !1, line: 497, type: !12)
!118 = !DISubprogram(name: "CCTK_QueryGroupStorageI", scope: !1, file: !1, line: 502, type: !119, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CCTK_QueryGroupStorageI, variables: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{!7, !18, !7}
!121 = !{!122, !123}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !118, file: !1, line: 502, type: !18)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupi", arg: 2, scope: !118, file: !1, line: 502, type: !7)
!124 = !DISubprogram(name: "CCTK_QueryGroupStorage", scope: !1, file: !1, line: 507, type: !125, isLocal: false, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTK_QueryGroupStorage, variables: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{!7, !18, !12}
!127 = !{!128, !129}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !124, file: !1, line: 507, type: !18)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupn", arg: 2, scope: !124, file: !1, line: 507, type: !12)
!130 = !DISubprogram(name: "CCTK_GrouplbndGI", scope: !1, file: !1, line: 531, type: !131, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32*, i32)* @CCTK_GrouplbndGI, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!7, !18, !7, !27, !7}
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctkGH", arg: 1, scope: !130, file: !1, line: 531, type: !18)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !130, file: !1, line: 532, type: !7)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lbnd", arg: 3, scope: !130, file: !1, line: 533, type: !27)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupindex", arg: 4, scope: !130, file: !1, line: 534, type: !7)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !130, file: !1, line: 536, type: !7)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !130, file: !1, line: 537, type: !7)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usedim", scope: !130, file: !1, line: 538, type: !7)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !130, file: !1, line: 539, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroupDynamicData", file: !143, line: 23, baseType: !144)
!143 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_GroupsOnGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "GROUPDYNAMICDATA", file: !143, line: 14, size: 448, align: 64, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !144, file: !143, line: 16, baseType: !7, size: 32, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "gsh", scope: !144, file: !143, line: 17, baseType: !5, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lsh", scope: !144, file: !143, line: 18, baseType: !5, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "lbnd", scope: !144, file: !143, line: 19, baseType: !5, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ubnd", scope: !144, file: !143, line: 20, baseType: !5, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !144, file: !143, line: 21, baseType: !5, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !144, file: !143, line: 22, baseType: !5, size: 64, align: 64, offset: 384)
!153 = !DISubprogram(name: "cctk_grouplbndgi_", scope: !1, file: !1, line: 574, type: !154, isLocal: false, isDefinition: true, scopeLine: 580, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*)* @cctk_grouplbndgi_, variables: !156)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !27, !18, !5, !27, !5}
!156 = !{!157, !158, !159, !160, !161}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !153, file: !1, line: 575, type: !27)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctkGH", arg: 2, scope: !153, file: !1, line: 576, type: !18)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !153, file: !1, line: 577, type: !5)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lbnd", arg: 4, scope: !153, file: !1, line: 578, type: !27)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupindex", arg: 5, scope: !153, file: !1, line: 579, type: !5)
!162 = !DISubprogram(name: "CCTK_GrouplbndGN", scope: !1, file: !1, line: 586, type: !163, isLocal: false, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32*, i8*)* @CCTK_GrouplbndGN, variables: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{!7, !18, !7, !27, !12}
!165 = !{!166, !167, !168, !169, !170, !171}
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctkGH", arg: 1, scope: !162, file: !1, line: 586, type: !18)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !162, file: !1, line: 587, type: !7)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lbnd", arg: 3, scope: !162, file: !1, line: 588, type: !27)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 4, scope: !162, file: !1, line: 589, type: !12)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !162, file: !1, line: 591, type: !7)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gindex", scope: !162, file: !1, line: 592, type: !7)
!172 = !DISubprogram(name: "cctk_grouplbndgn_", scope: !1, file: !1, line: 608, type: !173, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i8*, i32)* @cctk_grouplbndgn_, variables: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !27, !18, !5, !27, !71, !175}
!175 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!176 = !{!177, !178, !179, !180, !181, !182, !183}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !172, file: !1, line: 609, type: !27)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctkGH", arg: 2, scope: !172, file: !1, line: 610, type: !18)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !172, file: !1, line: 611, type: !5)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lbnd", arg: 4, scope: !172, file: !1, line: 612, type: !27)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 5, scope: !172, file: !1, line: 613, type: !71)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 6, scope: !172, file: !1, line: 613, type: !175)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupname", scope: !172, file: !1, line: 615, type: !71)
!184 = !DISubprogram(name: "CCTK_GrouplbndVI", scope: !1, file: !1, line: 622, type: !131, isLocal: false, isDefinition: true, scopeLine: 626, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32*, i32)* @CCTK_GrouplbndVI, variables: !185)
!185 = !{!186, !187, !188, !189, !190, !191}
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctkGH", arg: 1, scope: !184, file: !1, line: 622, type: !18)
