; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Groups.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGroupDefinition = type { i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, %struct.cVariableDefinition*, i8* }
%struct.cVariableDefinition = type { i8*, i32, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.uExpressionValue = type { i32, %union.anon }
%union.anon = type { double }

@_cctk_one = global i32 1, align 4
@staggered = internal unnamed_addr global i1 false
@n_groups = internal unnamed_addr global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !55, globals: !467, imports: !59)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Groups.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 22, size: 32, align: 32, elements: !15)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/util_Expression.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 20, size: 128, align: 64, elements: !6)
!6 = !{!7, !8}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !5, file: !4, line: 22, baseType: !3, size: 32, align: 32)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !5, file: !4, line: 28, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DICompositeType(tag: DW_TAG_union_type, scope: !5, file: !4, line: 24, size: 64, align: 64, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "rval", scope: !9, file: !4, line: 26, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ival", scope: !9, file: !4, line: 27, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "rval", value: 0)
!17 = !DIEnumerator(name: "ival", value: 1)
!18 = !{!19, !21, !22, !43, !40, !39, !51, !53}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroupDefinition", file: !1, line: 153, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 116, size: 768, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !41, !42, !50}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !24, file: !1, line: 119, baseType: !19, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !24, file: !1, line: 120, baseType: !19, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !24, file: !1, line: 121, baseType: !19, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !24, file: !1, line: 124, baseType: !14, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "gtype", scope: !24, file: !1, line: 127, baseType: !14, size: 32, align: 32, offset: 224)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !24, file: !1, line: 128, baseType: !14, size: 32, align: 32, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !24, file: !1, line: 129, baseType: !14, size: 32, align: 32, offset: 288)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "staggertype", scope: !24, file: !1, line: 130, baseType: !14, size: 32, align: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "gscope", scope: !24, file: !1, line: 132, baseType: !14, size: 32, align: 32, offset: 352)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !24, file: !1, line: 134, baseType: !14, size: 32, align: 32, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "n_timelevels", scope: !24, file: !1, line: 136, baseType: !14, size: 32, align: 32, offset: 416)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "n_variables", scope: !24, file: !1, line: 138, baseType: !14, size: 32, align: 32, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !24, file: !1, line: 141, baseType: !39, size: 64, align: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !24, file: !1, line: 144, baseType: !39, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !24, file: !1, line: 147, baseType: !43, size: 64, align: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "cVariableDefinition", file: !1, line: 114, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 107, size: 192, align: 64, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !1, line: 109, baseType: !19, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !45, file: !1, line: 110, baseType: !14, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "dimensional_comm_array", scope: !45, file: !1, line: 113, baseType: !19, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "vararraysize", scope: !24, file: !1, line: 151, baseType: !51, size: 64, align: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!55 = !{!56, !60, !63, !72, !81, !89, !95, !96, !101, !102, !105, !106, !109, !116, !121, !127, !130, !136, !141, !147, !151, !157, !161, !167, !171, !175, !181, !185, !191, !211, !214, !223, !227, !230, !234, !237, !240, !243, !249, !252, !255, !258, !262, !265, !269, !272, !278, !283, !286, !291, !294, !298, !301, !305, !308, !312, !335, !381, !385, !394, !398, !407, !410, !423, !435, !447}
!56 = !DISubprogram(name: "CCTKi_version_main_Groups_c", scope: !1, file: !1, line: 39, type: !57, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_Groups_c, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!51}
!59 = !{}
!60 = !DISubprogram(name: "CCTK_StaggerVars", scope: !1, file: !1, line: 206, type: !61, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_StaggerVars, variables: !59)
!61 = !DISubroutineType(types: !62)
!62 = !{!14}
!63 = !DISubprogram(name: "CCTK_GroupIndex", scope: !1, file: !1, line: 227, type: !64, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_GroupIndex, variables: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{!14, !51}
!66 = !{!67, !68, !69, !70, !71}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullgroupname", arg: 1, scope: !63, file: !1, line: 227, type: !51)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !63, file: !1, line: 229, type: !14)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !63, file: !1, line: 230, type: !14)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impname", scope: !63, file: !1, line: 231, type: !19)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupname", scope: !63, file: !1, line: 232, type: !19)
!72 = !DISubprogram(name: "cctk_groupindex_", scope: !1, file: !1, line: 271, type: !73, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_groupindex_, variables: !76)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !40, !19, !75}
!75 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!76 = !{!77, !78, !79, !80}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 1, scope: !72, file: !1, line: 272, type: !40)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !72, file: !1, line: 273, type: !19)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !72, file: !1, line: 273, type: !75)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !72, file: !1, line: 275, type: !19)
!81 = !DISubprogram(name: "CCTK_VarIndex", scope: !1, file: !1, line: 296, type: !64, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_VarIndex, variables: !82)
!82 = !{!83, !84, !85, !86, !87, !88}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullvarname", arg: 1, scope: !81, file: !1, line: 296, type: !51)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !81, file: !1, line: 298, type: !14)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !81, file: !1, line: 299, type: !14)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable", scope: !81, file: !1, line: 300, type: !14)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impname", scope: !81, file: !1, line: 301, type: !19)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "varname", scope: !81, file: !1, line: 302, type: !19)
!89 = !DISubprogram(name: "cctk_varindex_", scope: !1, file: !1, line: 352, type: !73, isLocal: false, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_varindex_, variables: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 1, scope: !89, file: !1, line: 353, type: !40)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !89, file: !1, line: 354, type: !19)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !89, file: !1, line: 354, type: !75)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !89, file: !1, line: 356, type: !19)
!95 = !DISubprogram(name: "CCTK_MaxDim", scope: !1, file: !1, line: 375, type: !61, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_MaxDim, variables: !59)
!96 = !DISubprogram(name: "cctk_maxdim_", scope: !1, file: !1, line: 380, type: !97, isLocal: false, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @cctk_maxdim_, variables: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !40}
!99 = !{!100}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !96, file: !1, line: 381, type: !40)
!101 = !DISubprogram(name: "CCTK_NumVars", scope: !1, file: !1, line: 400, type: !61, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumVars, variables: !59)
!102 = !DISubprogram(name: "cctk_numvars_", scope: !1, file: !1, line: 405, type: !97, isLocal: false, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @cctk_numvars_, variables: !103)
!103 = !{!104}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_vars", arg: 1, scope: !102, file: !1, line: 406, type: !40)
!105 = !DISubprogram(name: "CCTK_NumGroups", scope: !1, file: !1, line: 425, type: !61, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumGroups, variables: !59)
!106 = !DISubprogram(name: "cctk_numgroups_", scope: !1, file: !1, line: 430, type: !97, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @cctk_numgroups_, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_groups", arg: 1, scope: !106, file: !1, line: 431, type: !40)
!109 = !DISubprogram(name: "CCTK_GroupNameFromVarI", scope: !1, file: !1, line: 452, type: !110, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_GroupNameFromVarI, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{!19, !14}
!112 = !{!113, !114, !115}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !109, file: !1, line: 452, type: !14)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !109, file: !1, line: 454, type: !14)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !109, file: !1, line: 455, type: !19)
!116 = !DISubprogram(name: "CCTK_GroupIndexFromVarI", scope: !1, file: !1, line: 492, type: !117, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_GroupIndexFromVarI, variables: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{!14, !14}
!119 = !{!120}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !116, file: !1, line: 492, type: !14)
!121 = !DISubprogram(name: "cctk_groupindexfromvari_", scope: !1, file: !1, line: 497, type: !122, isLocal: false, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @cctk_groupindexfromvari_, variables: !124)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !40, !53}
!124 = !{!125, !126}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gindex", arg: 1, scope: !121, file: !1, line: 498, type: !40)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !121, file: !1, line: 499, type: !53)
!127 = !DISubprogram(name: "CCTK_GroupIndexFromVar", scope: !1, file: !1, line: 520, type: !64, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_GroupIndexFromVar, variables: !128)
!128 = !{!129}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !127, file: !1, line: 520, type: !51)
!130 = !DISubprogram(name: "cctk_groupindexfromvar_", scope: !1, file: !1, line: 525, type: !73, isLocal: false, isDefinition: true, scopeLine: 528, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_groupindexfromvar_, variables: !131)
!131 = !{!132, !133, !134, !135}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 1, scope: !130, file: !1, line: 526, type: !40)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !130, file: !1, line: 527, type: !19)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !130, file: !1, line: 527, type: !75)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !130, file: !1, line: 529, type: !19)
!136 = !DISubprogram(name: "CCTK_ImpFromVarI", scope: !1, file: !1, line: 549, type: !137, isLocal: false, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_ImpFromVarI, variables: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{!51, !14}
!139 = !{!140}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !136, file: !1, line: 549, type: !14)
!141 = !DISubprogram(name: "CCTK_FullName", scope: !1, file: !1, line: 572, type: !110, isLocal: false, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_FullName, variables: !142)
!142 = !{!143, !144, !145, !146}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !141, file: !1, line: 572, type: !14)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impname", scope: !141, file: !1, line: 574, type: !51)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "varname", scope: !141, file: !1, line: 575, type: !51)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !141, file: !1, line: 576, type: !19)
!147 = !DISubprogram(name: "CCTK_GroupTypeNumber", scope: !1, file: !1, line: 612, type: !64, isLocal: false, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_GroupTypeNumber, variables: !148)
!148 = !{!149, !150}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !147, file: !1, line: 612, type: !51)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !147, file: !1, line: 614, type: !14)
!151 = !DISubprogram(name: "cctk_grouptypenumber_", scope: !1, file: !1, line: 637, type: !73, isLocal: false, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_grouptypenumber_, variables: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 1, scope: !151, file: !1, line: 638, type: !40)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !151, file: !1, line: 639, type: !19)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !151, file: !1, line: 639, type: !75)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !151, file: !1, line: 641, type: !19)
!157 = !DISubprogram(name: "CCTK_VarTypeNumber", scope: !1, file: !1, line: 661, type: !64, isLocal: false, isDefinition: true, scopeLine: 662, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_VarTypeNumber, variables: !158)
!158 = !{!159, !160}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !157, file: !1, line: 661, type: !51)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !157, file: !1, line: 663, type: !14)
!161 = !DISubprogram(name: "cctk_vartypenumber_", scope: !1, file: !1, line: 731, type: !73, isLocal: false, isDefinition: true, scopeLine: 734, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_vartypenumber_, variables: !162)
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 1, scope: !161, file: !1, line: 732, type: !40)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !161, file: !1, line: 733, type: !19)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !161, file: !1, line: 733, type: !75)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !161, file: !1, line: 735, type: !19)
!167 = !DISubprogram(name: "CCTK_VarTypeName", scope: !1, file: !1, line: 755, type: !137, isLocal: false, isDefinition: true, scopeLine: 756, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_VarTypeName, variables: !168)
!168 = !{!169, !170}
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtype", arg: 1, scope: !167, file: !1, line: 755, type: !14)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !167, file: !1, line: 757, type: !51)
!171 = !DISubprogram(name: "CCTK_GroupScopeNumber", scope: !1, file: !1, line: 837, type: !64, isLocal: false, isDefinition: true, scopeLine: 838, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_GroupScopeNumber, variables: !172)
!172 = !{!173, !174}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !171, file: !1, line: 837, type: !51)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !171, file: !1, line: 839, type: !14)
!175 = !DISubprogram(name: "cctk_groupscopenumber_", scope: !1, file: !1, line: 862, type: !73, isLocal: false, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_groupscopenumber_, variables: !176)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 1, scope: !175, file: !1, line: 863, type: !40)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !175, file: !1, line: 864, type: !19)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !175, file: !1, line: 864, type: !75)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !175, file: !1, line: 866, type: !19)
!181 = !DISubprogram(name: "CCTK_GroupDistribNumber", scope: !1, file: !1, line: 886, type: !64, isLocal: false, isDefinition: true, scopeLine: 887, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_GroupDistribNumber, variables: !182)
!182 = !{!183, !184}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dtype", arg: 1, scope: !181, file: !1, line: 886, type: !51)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !181, file: !1, line: 888, type: !14)
!185 = !DISubprogram(name: "cctk_groupdistribnumber_", scope: !1, file: !1, line: 907, type: !73, isLocal: false, isDefinition: true, scopeLine: 910, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_groupdistribnumber_, variables: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 1, scope: !185, file: !1, line: 908, type: !40)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !185, file: !1, line: 909, type: !19)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !185, file: !1, line: 909, type: !75)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !185, file: !1, line: 911, type: !19)
!191 = !DISubprogram(name: "CCTK_GroupData", scope: !1, file: !1, line: 933, type: !192, isLocal: false, isDefinition: true, scopeLine: 934, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.cGroup*)* @CCTK_GroupData, variables: !207)
!192 = !DISubroutineType(types: !193)
!193 = !{!14, !14, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !196, line: 24, baseType: !197)
!196 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!197 = !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 14, size: 256, align: 32, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !197, file: !196, line: 16, baseType: !14, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !197, file: !196, line: 17, baseType: !14, size: 32, align: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !197, file: !196, line: 18, baseType: !14, size: 32, align: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !197, file: !196, line: 19, baseType: !14, size: 32, align: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !197, file: !196, line: 20, baseType: !14, size: 32, align: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !197, file: !196, line: 21, baseType: !14, size: 32, align: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !197, file: !196, line: 22, baseType: !14, size: 32, align: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !197, file: !196, line: 23, baseType: !14, size: 32, align: 32, offset: 224)
!207 = !{!208, !209, !210}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !191, file: !1, line: 933, type: !14)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gp", arg: 2, scope: !191, file: !1, line: 933, type: !194)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !191, file: !1, line: 935, type: !14)
!211 = !DISubprogram(name: "CCTK_VarName", scope: !1, file: !1, line: 984, type: !137, isLocal: false, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_VarName, variables: !212)
!212 = !{!213}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !211, file: !1, line: 984, type: !14)
!214 = !DISubprogram(name: "CCTK_DecomposeName", scope: !1, file: !1, line: 1014, type: !215, isLocal: false, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8**, i8**)* @CCTK_DecomposeName, variables: !218)
!215 = !DISubroutineType(types: !216)
!216 = !{!14, !51, !217, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!218 = !{!219, !220, !221, !222}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 1, scope: !214, file: !1, line: 1014, type: !51)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "implementation", arg: 2, scope: !214, file: !1, line: 1015, type: !217)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !214, file: !1, line: 1016, type: !217)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !214, file: !1, line: 1018, type: !14)
!223 = !DISubprogram(name: "CCTK_GroupName", scope: !1, file: !1, line: 1064, type: !110, isLocal: false, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_GroupName, variables: !224)
!224 = !{!225, !226}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !223, file: !1, line: 1064, type: !14)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !223, file: !1, line: 1066, type: !19)
!227 = !DISubprogram(name: "CCTK_FirstVarIndexI", scope: !1, file: !1, line: 1099, type: !117, isLocal: false, isDefinition: true, scopeLine: 1100, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_FirstVarIndexI, variables: !228)
!228 = !{!229}
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !227, file: !1, line: 1099, type: !14)
!230 = !DISubprogram(name: "cctk_firstvarindexi_", scope: !1, file: !1, line: 1105, type: !122, isLocal: false, isDefinition: true, scopeLine: 1108, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @cctk_firstvarindexi_, variables: !231)
!231 = !{!232, !233}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "first", arg: 1, scope: !230, file: !1, line: 1106, type: !40)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !230, file: !1, line: 1107, type: !53)
!234 = !DISubprogram(name: "CCTK_FirstVarIndex", scope: !1, file: !1, line: 1127, type: !64, isLocal: false, isDefinition: true, scopeLine: 1128, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_FirstVarIndex, variables: !235)
!235 = !{!236}
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 1, scope: !234, file: !1, line: 1127, type: !51)
!237 = !DISubprogram(name: "CCTK_NumVarsInGroupI", scope: !1, file: !1, line: 1147, type: !117, isLocal: false, isDefinition: true, scopeLine: 1148, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_NumVarsInGroupI, variables: !238)
!238 = !{!239}
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !237, file: !1, line: 1147, type: !14)
!240 = !DISubprogram(name: "CCTK_NumVarsInGroup", scope: !1, file: !1, line: 1167, type: !64, isLocal: false, isDefinition: true, scopeLine: 1168, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_NumVarsInGroup, variables: !241)
!241 = !{!242}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 1, scope: !240, file: !1, line: 1167, type: !51)
!243 = !DISubprogram(name: "cctk_numvarsingroup_", scope: !1, file: !1, line: 1172, type: !73, isLocal: false, isDefinition: true, scopeLine: 1175, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_numvarsingroup_, variables: !244)
!244 = !{!245, !246, !247, !248}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 1, scope: !243, file: !1, line: 1173, type: !40)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !243, file: !1, line: 1174, type: !19)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !243, file: !1, line: 1174, type: !75)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupname", scope: !243, file: !1, line: 1176, type: !19)
!249 = !DISubprogram(name: "CCTK_GroupTypeFromVarI", scope: !1, file: !1, line: 1196, type: !117, isLocal: false, isDefinition: true, scopeLine: 1197, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_GroupTypeFromVarI, variables: !250)
!250 = !{!251}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !249, file: !1, line: 1196, type: !14)
!252 = !DISubprogram(name: "CCTK_GroupTypeI", scope: !1, file: !1, line: 1217, type: !117, isLocal: false, isDefinition: true, scopeLine: 1218, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_GroupTypeI, variables: !253)
!253 = !{!254}
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !252, file: !1, line: 1217, type: !14)
!255 = !DISubprogram(name: "CCTK_VarTypeI", scope: !1, file: !1, line: 1237, type: !117, isLocal: false, isDefinition: true, scopeLine: 1238, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_VarTypeI, variables: !256)
!256 = !{!257}
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !255, file: !1, line: 1237, type: !14)
!258 = !DISubprogram(name: "cctk_vartypei_", scope: !1, file: !1, line: 1243, type: !122, isLocal: false, isDefinition: true, scopeLine: 1246, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @cctk_vartypei_, variables: !259)
!259 = !{!260, !261}
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !258, file: !1, line: 1244, type: !40)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !258, file: !1, line: 1245, type: !53)
!262 = !DISubprogram(name: "CCTK_NumTimeLevelsFromVarI", scope: !1, file: !1, line: 1265, type: !117, isLocal: false, isDefinition: true, scopeLine: 1266, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_NumTimeLevelsFromVarI, variables: !263)
!263 = !{!264}
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !262, file: !1, line: 1265, type: !14)
!265 = !DISubprogram(name: "cctk_numtimelevelsfromvari_", scope: !1, file: !1, line: 1271, type: !122, isLocal: false, isDefinition: true, scopeLine: 1274, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @cctk_numtimelevelsfromvari_, variables: !266)
!266 = !{!267, !268}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 1, scope: !265, file: !1, line: 1272, type: !40)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !265, file: !1, line: 1273, type: !53)
!269 = !DISubprogram(name: "CCTK_NumTimeLevelsFromVar", scope: !1, file: !1, line: 1292, type: !64, isLocal: false, isDefinition: true, scopeLine: 1293, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_NumTimeLevelsFromVar, variables: !270)
!270 = !{!271}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !269, file: !1, line: 1292, type: !51)
!272 = !DISubprogram(name: "cctk_numtimelevelsfromvar_", scope: !1, file: !1, line: 1297, type: !73, isLocal: false, isDefinition: true, scopeLine: 1300, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_numtimelevelsfromvar_, variables: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 1, scope: !272, file: !1, line: 1298, type: !40)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !272, file: !1, line: 1299, type: !19)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !272, file: !1, line: 1299, type: !75)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !272, file: !1, line: 1301, type: !19)
!278 = !DISubprogram(name: "cctk_printgroup_", scope: !1, file: !1, line: 1316, type: !279, isLocal: false, isDefinition: true, scopeLine: 1318, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @cctk_printgroup_, variables: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !53}
!281 = !{!282}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !278, file: !1, line: 1317, type: !53)
!283 = !DISubprogram(name: "cctk_printvar_", scope: !1, file: !1, line: 1332, type: !279, isLocal: false, isDefinition: true, scopeLine: 1334, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @cctk_printvar_, variables: !284)
!284 = !{!285}
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !283, file: !1, line: 1333, type: !53)
!286 = !DISubprogram(name: "CCTK_GroupSizesI", scope: !1, file: !1, line: 1353, type: !287, isLocal: false, isDefinition: true, scopeLine: 1354, flags: DIFlagPrototyped, isOptimized: true, function: i32** (i32)* @CCTK_GroupSizesI, variables: !289)
!287 = !DISubroutineType(types: !288)
!288 = !{!39, !14}
!289 = !{!290}
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !286, file: !1, line: 1353, type: !14)
!291 = !DISubprogram(name: "CCTK_GroupGhostsizesI", scope: !1, file: !1, line: 1374, type: !287, isLocal: false, isDefinition: true, scopeLine: 1375, flags: DIFlagPrototyped, isOptimized: true, function: i32** (i32)* @CCTK_GroupGhostsizesI, variables: !292)
!292 = !{!293}
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !291, file: !1, line: 1374, type: !14)
!294 = !DISubprogram(name: "CCTK_VarTypeSize", scope: !1, file: !1, line: 1394, type: !117, isLocal: false, isDefinition: true, scopeLine: 1395, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_VarTypeSize, variables: !295)
!295 = !{!296, !297}
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtype", arg: 1, scope: !294, file: !1, line: 1394, type: !14)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var_size", scope: !294, file: !1, line: 1396, type: !14)
!298 = !DISubprogram(name: "CCTK_GroupDimI", scope: !1, file: !1, line: 1497, type: !117, isLocal: false, isDefinition: true, scopeLine: 1498, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_GroupDimI, variables: !299)
!299 = !{!300}
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !298, file: !1, line: 1497, type: !14)
!301 = !DISubprogram(name: "cctk_groupdimi_", scope: !1, file: !1, line: 1502, type: !122, isLocal: false, isDefinition: true, scopeLine: 1505, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @cctk_groupdimi_, variables: !302)
!302 = !{!303, !304}
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !301, file: !1, line: 1503, type: !40)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !301, file: !1, line: 1504, type: !53)
!305 = !DISubprogram(name: "CCTK_GroupDimFromVarI", scope: !1, file: !1, line: 1524, type: !117, isLocal: false, isDefinition: true, scopeLine: 1525, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_GroupDimFromVarI, variables: !306)
!306 = !{!307}
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 1, scope: !305, file: !1, line: 1524, type: !14)
!308 = !DISubprogram(name: "cctk_groupdimfromvari_", scope: !1, file: !1, line: 1530, type: !122, isLocal: false, isDefinition: true, scopeLine: 1533, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @cctk_groupdimfromvari_, variables: !309)
!309 = !{!310, !311}
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !308, file: !1, line: 1531, type: !40)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !308, file: !1, line: 1532, type: !53)
!312 = !DISubprogram(name: "CCTK_TraverseString", scope: !1, file: !1, line: 1582, type: !313, isLocal: false, isDefinition: true, scopeLine: 1588, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, void (i32, i8*, i8*)*, i8*, i32)* @CCTK_TraverseString, variables: !318)
!313 = !DISubroutineType(types: !314)
!314 = !{!14, !51, !315, !21, !14}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !14, !51, !21}
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traverse_string", arg: 1, scope: !312, file: !1, line: 1582, type: !51)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !312, file: !1, line: 1583, type: !315)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback_arg", arg: 3, scope: !312, file: !1, line: 1586, type: !21)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "selection", arg: 4, scope: !312, file: !1, line: 1587, type: !14)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !312, file: !1, line: 1589, type: !14)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nesting", scope: !312, file: !1, line: 1589, type: !14)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !312, file: !1, line: 1589, type: !14)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gindex", scope: !312, file: !1, line: 1589, type: !14)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !312, file: !1, line: 1589, type: !14)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !312, file: !1, line: 1589, type: !14)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "selected_all", scope: !312, file: !1, line: 1589, type: !14)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delimiter", scope: !312, file: !1, line: 1590, type: !20)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !312, file: !1, line: 1590, type: !19)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parse_string", scope: !312, file: !1, line: 1590, type: !19)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_var_string", scope: !312, file: !1, line: 1590, type: !19)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "option_string", scope: !312, file: !1, line: 1590, type: !19)
!335 = !DISubprogram(name: "CCTKi_CreateGroup", scope: !1, file: !1, line: 1815, type: !336, isLocal: false, isDefinition: true, scopeLine: 1830, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i8*, i8*, i8*, i8*, i32, ...)* @CCTKi_CreateGroup, variables: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{!14, !51, !51, !51, !51, !51, !51, !14, !14, !51, !51, !51, !51, !14, null}
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !370, !371, !372, !373}
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 1, scope: !335, file: !1, line: 1815, type: !51)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !335, file: !1, line: 1816, type: !51)
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imp", arg: 3, scope: !335, file: !1, line: 1817, type: !51)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gtype", arg: 4, scope: !335, file: !1, line: 1818, type: !51)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtype", arg: 5, scope: !335, file: !1, line: 1819, type: !51)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gscope", arg: 6, scope: !335, file: !1, line: 1820, type: !51)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dimension", arg: 7, scope: !335, file: !1, line: 1821, type: !14)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ntimelevels", arg: 8, scope: !335, file: !1, line: 1822, type: !14)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stype", arg: 9, scope: !335, file: !1, line: 1823, type: !51)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dtype", arg: 10, scope: !335, file: !1, line: 1824, type: !51)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 11, scope: !335, file: !1, line: 1825, type: !51)
!350 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghostsize", arg: 12, scope: !335, file: !1, line: 1826, type: !51)
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_variables", arg: 13, scope: !335, file: !1, line: 1827, type: !14)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !335, file: !1, line: 1831, type: !14)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupscope", scope: !335, file: !1, line: 1832, type: !14)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "staggercode", scope: !335, file: !1, line: 1833, type: !14)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable", scope: !335, file: !1, line: 1834, type: !14)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !335, file: !1, line: 1836, type: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !358, line: 30, baseType: !359)
!358 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stdarg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 1836, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 192, align: 64, elements: !368)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 1836, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 1836, size: 192, align: 64, elements: !363)
!363 = !{!364, !365, !366, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !362, file: !1, line: 1836, baseType: !75, size: 32, align: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !362, file: !1, line: 1836, baseType: !75, size: 32, align: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !362, file: !1, line: 1836, baseType: !21, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !362, file: !1, line: 1836, baseType: !21, size: 64, align: 64, offset: 128)
!368 = !{!369}
!369 = !DISubrange(count: 1)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable_name", scope: !335, file: !1, line: 1838, type: !19)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vararraysize", scope: !335, file: !1, line: 1839, type: !19)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !335, file: !1, line: 1841, type: !22)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !374, file: !1, line: 1925, type: !19)
!374 = distinct !DILexicalBlock(scope: !375, file: !1, line: 1924, column: 7)
!375 = distinct !DILexicalBlock(scope: !376, file: !1, line: 1923, column: 7)
!376 = distinct !DILexicalBlock(scope: !377, file: !1, line: 1923, column: 7)
!377 = distinct !DILexicalBlock(scope: !378, file: !1, line: 1920, column: 5)
!378 = distinct !DILexicalBlock(scope: !379, file: !1, line: 1899, column: 8)
!379 = distinct !DILexicalBlock(scope: !380, file: !1, line: 1888, column: 3)
!380 = distinct !DILexicalBlock(scope: !335, file: !1, line: 1887, column: 7)
!381 = !DISubprogram(name: "CCTK_GroupImplementationI", scope: !1, file: !1, line: 1997, type: !137, isLocal: false, isDefinition: true, scopeLine: 1998, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_GroupImplementationI, variables: !382)
!382 = !{!383, !384}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !381, file: !1, line: 1997, type: !14)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !381, file: !1, line: 1999, type: !51)
!385 = !DISubprogram(name: "CCTKi_GroupLengthAsPointer", scope: !1, file: !1, line: 2230, type: !386, isLocal: false, isDefinition: true, scopeLine: 2231, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i8*)* @CCTKi_GroupLengthAsPointer, variables: !388)
!386 = !DISubroutineType(types: !387)
!387 = !{!53, !51}
!388 = !{!389, !390, !391, !392, !393}
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullgroupname", arg: 1, scope: !385, file: !1, line: 2230, type: !51)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !385, file: !1, line: 2232, type: !14)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !385, file: !1, line: 2233, type: !53)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impname", scope: !385, file: !1, line: 2234, type: !19)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupname", scope: !385, file: !1, line: 2234, type: !19)
!394 = !DISubprogram(name: "isspace", scope: !395, file: !395, line: 267, type: !117, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, variables: !396)
!395 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!396 = !{!397}
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !394, file: !395, line: 267, type: !14)
!398 = !DISubprogram(name: "__istype", scope: !395, file: !395, line: 153, type: !399, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !404)
!399 = !DISubroutineType(types: !400)
!400 = !{!14, !401, !403}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !402, line: 70, baseType: !14)
!402 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!403 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!404 = !{!405, !406}
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !398, file: !395, line: 153, type: !401)
!406 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !398, file: !395, line: 153, type: !403)
