; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Hash.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.T_HASH = type { i32, i32, i32, %struct.T_HASH_ENTRY** }
%struct.T_HASH_ENTRY = type { %struct.T_HASH_ENTRY*, %struct.T_HASH_ENTRY*, i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [81 x i8] c"$Header: /cactus/Cactus/src/util/Hash.c,v 1.10 2001/06/25 20:36:46 goodale Exp $\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_util_Hash_c() #0 {
  ret i8* getelementptr inbounds ([81 x i8]* @.str, i64 0, i64 0), !dbg !142
}

; Function Attrs: nounwind optsize ssp uwtable
define noalias %struct.T_HASH* @Util_HashCreate(i32 %initial_size) #1 {
  tail call void @llvm.dbg.value(metadata i32 %initial_size, i64 0, metadata !39, metadata !143), !dbg !144
  %1 = tail call i8* @malloc(i64 24) #6, !dbg !145
  %2 = bitcast i8* %1 to %struct.T_HASH*, !dbg !146
  tail call void @llvm.dbg.value(metadata %struct.T_HASH* %2, i64 0, metadata !40, metadata !143), !dbg !147
  %3 = icmp eq i8* %1, null, !dbg !148
  br i1 %3, label %18, label %.preheader, !dbg !150

.preheader:                                       ; preds = %0, %.preheader
  %storemerge = phi i32 [ %5, %.preheader ], [ 2, %0 ]
  %4 = icmp ult i32 %storemerge, %initial_size, !dbg !151
  %5 = shl i32 %storemerge, 1, !dbg !153
  br i1 %4, label %.preheader, label %6, !dbg !154


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !29, globals: !136, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Hash.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !14, !15, !25, !28}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uHash", file: !6, line: 39, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/util_Hash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_HASH", file: !6, line: 32, size: 192, align: 64, elements: !8)
!8 = !{!9, !11, !12, !13}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !7, file: !6, line: 34, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !7, file: !6, line: 35, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !7, file: !6, line: 36, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !7, file: !6, line: 38, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "iHashEntry", file: !6, line: 30, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_HASH_ENTRY", file: !6, line: 19, size: 320, align: 64, elements: !18)
!18 = !{!19, !21, !22, !23, !24, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !17, file: !6, line: 21, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !6, line: 22, baseType: !20, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !17, file: !6, line: 24, baseType: !10, size: 32, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "klen", scope: !17, file: !6, line: 26, baseType: !10, size: 32, align: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !17, file: !6, line: 27, baseType: !25, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !6, line: 29, baseType: !28, size: 64, align: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!29 = !{!30, !35, !41, !56, !67, !81, !91, !101, !110, !120}
!30 = !DISubprogram(name: "CCTKi_version_util_Hash_c", scope: !1, file: !1, line: 23, type: !31, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_util_Hash_c, variables: !2)
!31 = !DISubroutineType(types: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!35 = !DISubprogram(name: "Util_HashCreate", scope: !1, file: !1, line: 79, type: !36, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: %struct.T_HASH* (i32)* @Util_HashCreate, variables: !38)
!36 = !DISubroutineType(types: !37)
!37 = !{!4, !10}
!38 = !{!39, !40}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "initial_size", arg: 1, scope: !35, file: !1, line: 79, type: !10)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !35, file: !1, line: 81, type: !4)
!41 = !DISubprogram(name: "Util_HashDestroy", scope: !1, file: !1, line: 144, type: !42, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.T_HASH*, void (i8*)*)* @Util_HashDestroy, variables: !48)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !4, !45}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !28}
!48 = !{!49, !50, !51, !52, !53, !54, !55}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash", arg: 1, scope: !41, file: !1, line: 144, type: !4)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delete_entry", arg: 2, scope: !41, file: !1, line: 144, type: !45)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !41, file: !1, line: 146, type: !10)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "array", scope: !41, file: !1, line: 148, type: !14)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !41, file: !1, line: 149, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !41, file: !1, line: 150, type: !15)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "location", scope: !41, file: !1, line: 152, type: !10)
!56 = !DISubprogram(name: "Util_HashStore", scope: !1, file: !1, line: 232, type: !57, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.T_HASH*, i32, i8*, i32, i8*)* @Util_HashStore, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!44, !4, !10, !33, !10, !28}
!59 = !{!60, !61, !62, !63, !64, !65, !66}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash", arg: 1, scope: !56, file: !1, line: 232, type: !4)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "klen", arg: 2, scope: !56, file: !1, line: 233, type: !10)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 3, scope: !56, file: !1, line: 234, type: !33)
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hashval", arg: 4, scope: !56, file: !1, line: 235, type: !10)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 5, scope: !56, file: !1, line: 236, type: !28)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !56, file: !1, line: 238, type: !44)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !56, file: !1, line: 239, type: !15)
