; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/Hyperslab.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }
%struct.CCTK_COMPLEX32 = type { x86_fp80, x86_fp80 }
%struct.CCTK_COMPLEX16 = type { double, double }
%struct.CCTK_COMPLEX8 = type { float, float }

@.str = private unnamed_addr constant [80 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/Hyperslab.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"PUGHSlab\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !111, globals: !387, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/Hyperslab.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !80, !84, !85, !91, !93, !95, !97, !103, !105}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !9, line: 126, baseType: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !9, line: 96, size: 832, align: 64, elements: !11)
!11 = !{!12, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !52, !61, !75, !76, !77, !78}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !10, file: !9, line: 98, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !10, file: !9, line: 99, baseType: !6, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !10, file: !9, line: 100, baseType: !6, size: 32, align: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !10, file: !9, line: 101, baseType: !4, size: 64, align: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !10, file: !9, line: 102, baseType: !4, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !10, file: !9, line: 103, baseType: !6, size: 32, align: 32, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !10, file: !9, line: 104, baseType: !6, size: 32, align: 32, offset: 288)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !10, file: !9, line: 106, baseType: !4, size: 64, align: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !10, file: !9, line: 114, baseType: !6, size: 32, align: 32, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !10, file: !9, line: 115, baseType: !6, size: 32, align: 32, offset: 416)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !10, file: !9, line: 117, baseType: !25, size: 64, align: 64, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !9, line: 72, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !9, line: 37, size: 2368, align: 64, elements: !28)
!28 = !{!29, !30, !31, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !49, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !27, file: !9, line: 39, baseType: !6, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !27, file: !9, line: 41, baseType: !5, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !27, file: !9, line: 44, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !27, file: !9, line: 45, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !27, file: !9, line: 46, baseType: !34, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !27, file: !9, line: 47, baseType: !5, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !27, file: !9, line: 49, baseType: !5, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !27, file: !9, line: 50, baseType: !6, size: 32, align: 32, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !27, file: !9, line: 51, baseType: !5, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !27, file: !9, line: 52, baseType: !34, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !27, file: !9, line: 55, baseType: !5, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !27, file: !9, line: 56, baseType: !5, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !27, file: !9, line: 59, baseType: !5, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !27, file: !9, line: 60, baseType: !45, size: 512, align: 64, offset: 832)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DISubrange(count: 4)
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !27, file: !9, line: 64, baseType: !50, size: 512, align: 64, offset: 1344)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, align: 64, elements: !46)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !27, file: !9, line: 68, baseType: !50, size: 512, align: 64, offset: 1856)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !10, file: !9, line: 118, baseType: !53, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !9, line: 29, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !9, line: 23, size: 256, align: 64, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !55, file: !9, line: 25, baseType: !6, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !55, file: !9, line: 26, baseType: !5, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !55, file: !9, line: 27, baseType: !34, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !55, file: !9, line: 28, baseType: !5, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !10, file: !9, line: 120, baseType: !62, size: 64, align: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !9, line: 94, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !9, line: 74, size: 448, align: 64, elements: !65)
!65 = !{!66, !67, !69, !70, !71, !72, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !64, file: !9, line: 77, baseType: !5, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !64, file: !9, line: 78, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !64, file: !9, line: 79, baseType: !68, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !64, file: !9, line: 80, baseType: !6, size: 32, align: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !64, file: !9, line: 82, baseType: !5, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !64, file: !9, line: 84, baseType: !6, size: 32, align: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !64, file: !9, line: 85, baseType: !6, size: 32, align: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !64, file: !9, line: 86, baseType: !6, size: 32, align: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !10, file: !9, line: 121, baseType: !62, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !10, file: !9, line: 123, baseType: !6, size: 32, align: 32, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !10, file: !9, line: 124, baseType: !6, size: 32, align: 32, offset: 736)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !10, file: !9, line: 125, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_BYTE", file: !82, line: 59, baseType: !83)
!82 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_COMPLEX16", file: !82, line: 44, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 40, size: 128, align: 64, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !87, file: !82, line: 42, baseType: !32, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !87, file: !82, line: 43, baseType: !32, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_COMPLEX8", file: !82, line: 52, baseType: !99)
!99 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 48, size: 64, align: 32, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !99, file: !82, line: 50, baseType: !96, size: 32, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !99, file: !82, line: 51, baseType: !96, size: 32, align: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_COMPLEX32", file: !82, line: 36, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 32, size: 256, align: 128, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !107, file: !82, line: 34, baseType: !104, size: 128, align: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !107, file: !82, line: 35, baseType: !104, size: 128, align: 128, offset: 128)
!111 = !{!112, !117, !331, !370}
!112 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGHSlab_Hyperslab_c", scope: !1, file: !1, line: 27, type: !113, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGHSlab_Hyperslab_c, variables: !2)
!113 = !DISubroutineType(types: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!117 = !DISubprogram(name: "Hyperslab_GetLocalHyperslab", scope: !1, file: !1, line: 246, type: !118, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i32*, i32*, i32*, i32*, i8**, i32*, i32*, i32*)* @Hyperslab_GetLocalHyperslab, variables: !155)
!118 = !DISubroutineType(types: !119)
!119 = !{!6, !120, !6, !6, !6, !153, !153, !153, !153, !68, !5, !5, !5}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !123, line: 75, baseType: !124)
!123 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!124 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 24, size: 1216, align: 64, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !145, !146}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !124, file: !123, line: 26, baseType: !6, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !124, file: !123, line: 27, baseType: !6, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !124, file: !123, line: 30, baseType: !5, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !124, file: !123, line: 31, baseType: !5, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !124, file: !123, line: 32, baseType: !5, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !124, file: !123, line: 33, baseType: !5, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !124, file: !123, line: 36, baseType: !5, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !124, file: !123, line: 39, baseType: !5, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !124, file: !123, line: 40, baseType: !5, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !124, file: !123, line: 43, baseType: !32, size: 64, align: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !124, file: !123, line: 44, baseType: !84, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !124, file: !123, line: 47, baseType: !84, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !124, file: !123, line: 51, baseType: !5, size: 64, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !124, file: !123, line: 54, baseType: !5, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !124, file: !123, line: 57, baseType: !6, size: 32, align: 32, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !124, file: !123, line: 60, baseType: !5, size: 64, align: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !124, file: !123, line: 63, baseType: !32, size: 64, align: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !123, line: 67, baseType: !144, size: 64, align: 64, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !124, file: !123, line: 70, baseType: !68, size: 64, align: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !124, file: !123, line: 73, baseType: !147, size: 64, align: 64, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !123, line: 22, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 18, size: 16, align: 8, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !149, file: !123, line: 20, baseType: !14, size: 8, align: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !149, file: !123, line: 21, baseType: !14, size: 8, align: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !191, !192, !193, !194, !226, !227, !228, !236, !239, !242, !243, !244, !245, !246, !247, !249, !250, !251, !252, !253, !254, !256, !257, !258, !259, !260, !261, !263, !264, !265, !266, !267, !268, !270, !271, !272, !273, !274, !275, !277, !278, !279, !280, !281, !282, !284, !285, !286, !287, !288, !289, !291, !292, !293, !294, !295, !296, !298, !299, !300, !301, !302, !303, !305, !306, !307, !308, !309, !310, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !326, !327, !328, !329, !330}
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !117, file: !1, line: 246, type: !120)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !117, file: !1, line: 247, type: !6)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtimelvl", arg: 3, scope: !117, file: !1, line: 248, type: !6)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdim", arg: 4, scope: !117, file: !1, line: 249, type: !6)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "global_origin", arg: 5, scope: !117, file: !1, line: 250, type: !153)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "directions", arg: 6, scope: !117, file: !1, line: 251, type: !153)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "extents", arg: 7, scope: !117, file: !1, line: 252, type: !153)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "downsample_", arg: 8, scope: !117, file: !1, line: 253, type: !153)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hdata", arg: 9, scope: !117, file: !1, line: 254, type: !68)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hsize", arg: 10, scope: !117, file: !1, line: 255, type: !5)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hsize_global", arg: 11, scope: !117, file: !1, line: 256, type: !5)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hoffset_global", arg: 12, scope: !117, file: !1, line: 257, type: !5)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "point", scope: !117, file: !1, line: 259, type: !5)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !117, file: !1, line: 260, type: !5)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endpoint", scope: !117, file: !1, line: 261, type: !5)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "downsample", scope: !117, file: !1, line: 262, type: !5)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "my_global_origin", scope: !117, file: !1, line: 263, type: !5)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_endpoint", scope: !117, file: !1, line: 264, type: !5)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "points_per_dim", scope: !117, file: !1, line: 265, type: !5)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_dir", scope: !117, file: !1, line: 266, type: !5)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagger_index", scope: !117, file: !1, line: 267, type: !6)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !117, file: !1, line: 268, type: !6)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vinfo", scope: !117, file: !1, line: 269, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !180, line: 24, baseType: !181)
!180 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 14, size: 256, align: 32, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !181, file: !180, line: 16, baseType: !6, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !181, file: !180, line: 17, baseType: !6, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !181, file: !180, line: 18, baseType: !6, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !181, file: !180, line: 19, baseType: !6, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !181, file: !180, line: 20, baseType: !6, size: 32, align: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !181, file: !180, line: 21, baseType: !6, size: 32, align: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !181, file: !180, line: 22, baseType: !6, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !181, file: !180, line: 23, baseType: !6, size: 32, align: 32, offset: 224)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdim", scope: !117, file: !1, line: 270, type: !6)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totals", scope: !117, file: !1, line: 271, type: !6)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !117, file: !1, line: 272, type: !6)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !117, file: !1, line: 273, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !197, line: 81, baseType: !198)
!197 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !197, line: 13, size: 1152, align: 64, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !223, !225}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !198, file: !197, line: 17, baseType: !4, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !198, file: !197, line: 18, baseType: !6, size: 32, align: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !198, file: !197, line: 21, baseType: !6, size: 32, align: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !198, file: !197, line: 22, baseType: !6, size: 32, align: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !198, file: !197, line: 23, baseType: !6, size: 32, align: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !198, file: !197, line: 27, baseType: !6, size: 32, align: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !198, file: !197, line: 28, baseType: !6, size: 32, align: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !198, file: !197, line: 29, baseType: !144, size: 64, align: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !198, file: !197, line: 32, baseType: !6, size: 32, align: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !198, file: !197, line: 34, baseType: !5, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !198, file: !197, line: 35, baseType: !6, size: 32, align: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !198, file: !197, line: 37, baseType: !6, size: 32, align: 32, offset: 480)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !198, file: !197, line: 41, baseType: !32, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !198, file: !197, line: 41, baseType: !32, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !198, file: !197, line: 41, baseType: !32, size: 64, align: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !198, file: !197, line: 41, baseType: !32, size: 64, align: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !198, file: !197, line: 44, baseType: !6, size: 32, align: 32, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !198, file: !197, line: 45, baseType: !6, size: 32, align: 32, offset: 800)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !198, file: !197, line: 46, baseType: !6, size: 32, align: 32, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !198, file: !197, line: 49, baseType: !6, size: 32, align: 32, offset: 864)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !198, file: !197, line: 53, baseType: !6, size: 32, align: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !198, file: !197, line: 76, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !198, file: !197, line: 77, baseType: !224, size: 64, align: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !198, file: !197, line: 79, baseType: !13, size: 64, align: 64, offset: 1088)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GA", scope: !117, file: !1, line: 274, type: !7)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errormsg", scope: !117, file: !1, line: 275, type: !115)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npoints", scope: !229, file: !1, line: 389, type: !6)
!229 = distinct !DILexicalBlock(scope: !230, file: !1, line: 388, column: 7)
!230 = distinct !DILexicalBlock(scope: !231, file: !1, line: 386, column: 11)
!231 = distinct !DILexicalBlock(scope: !232, file: !1, line: 385, column: 5)
!232 = distinct !DILexicalBlock(scope: !233, file: !1, line: 383, column: 9)
!233 = distinct !DILexicalBlock(scope: !234, file: !1, line: 380, column: 3)
!234 = distinct !DILexicalBlock(scope: !235, file: !1, line: 379, column: 3)
!235 = distinct !DILexicalBlock(scope: !117, file: !1, line: 379, column: 3)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdata", scope: !237, file: !1, line: 484, type: !4)
!237 = distinct !DILexicalBlock(scope: !238, file: !1, line: 483, column: 3)
!238 = distinct !DILexicalBlock(scope: !117, file: !1, line: 482, column: 7)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !240, file: !1, line: 526, type: !6)
!240 = distinct !DILexicalBlock(scope: !241, file: !1, line: 526, column: 9)
!241 = distinct !DILexicalBlock(scope: !237, file: !1, line: 524, column: 5)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !240, file: !1, line: 526, type: !6)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !240, file: !1, line: 526, type: !6)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim0_elements", scope: !240, file: !1, line: 526, type: !6)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !240, file: !1, line: 526, type: !80)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_hdata", scope: !240, file: !1, line: 526, type: !80)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !248, file: !1, line: 532, type: !6)
!248 = distinct !DILexicalBlock(scope: !241, file: !1, line: 532, column: 9)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !248, file: !1, line: 532, type: !6)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !248, file: !1, line: 532, type: !6)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim0_elements", scope: !248, file: !1, line: 532, type: !6)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !248, file: !1, line: 532, type: !5)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_hdata", scope: !248, file: !1, line: 532, type: !5)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !255, file: !1, line: 538, type: !6)
!255 = distinct !DILexicalBlock(scope: !241, file: !1, line: 538, column: 9)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !255, file: !1, line: 538, type: !6)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !255, file: !1, line: 538, type: !6)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim0_elements", scope: !255, file: !1, line: 538, type: !6)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !255, file: !1, line: 538, type: !84)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_hdata", scope: !255, file: !1, line: 538, type: !84)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !262, file: !1, line: 544, type: !6)
!262 = distinct !DILexicalBlock(scope: !241, file: !1, line: 544, column: 9)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !262, file: !1, line: 544, type: !6)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !262, file: !1, line: 544, type: !6)
