; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Interp.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.t_interp_operator = type { i8*, i8*, i32 (%struct.cGH*, i8*, i32, i32, i32, i8**, i32*, i32*, i8**, i32*)*, i32 (%struct.cGH*, i32, i32, i32, i32, i32*, i8**, i32*, i8**, i32*, i8**, i32*, i8**, i32*)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [75 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Interp.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [86 x i8] c"CCTKi_InterpRegisterOperatorGV: NULL pointer passed as interpolation operator routine\00", align 1
@interp_operators = internal global %struct.cHandledData* null, align 8
@num_interp_operators = internal unnamed_addr global i32 0, align 4
@.str3 = private unnamed_addr constant [80 x i8] c"CCTKi_InterpRegisterOperatorGV: Couldn't allocate interpolation operator handle\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !71, globals: !285, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Interp.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !70, !30}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_interp_operator", file: !1, line: 100, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 94, size: 256, align: 64, elements: !9)
!9 = !{!10, !14, !15, !65}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !8, file: !1, line: 96, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !1, line: 97, baseType: !11, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "interp_operator_GV", scope: !8, file: !1, line: 98, baseType: !16, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "cInterpOperatorGV", file: !17, line: 26, baseType: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Interp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !22, !11, !21, !21, !21, !57, !61, !61, !63, !61}
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !24, line: 75, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 24, size: 1216, align: 64, elements: !26)
!26 = !{!27, !28, !29, !31, !32, !33, !34, !35, !36, !37, !39, !41, !42, !43, !44, !45, !46, !47, !49, !50}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !25, file: !24, line: 26, baseType: !21, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !25, file: !24, line: 27, baseType: !21, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !25, file: !24, line: 30, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !25, file: !24, line: 31, baseType: !30, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !25, file: !24, line: 32, baseType: !30, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !25, file: !24, line: 33, baseType: !30, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !25, file: !24, line: 36, baseType: !30, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !25, file: !24, line: 39, baseType: !30, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !25, file: !24, line: 40, baseType: !30, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !25, file: !24, line: 43, baseType: !38, size: 64, align: 64, offset: 512)
!38 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !25, file: !24, line: 44, baseType: !40, size: 64, align: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !25, file: !24, line: 47, baseType: !40, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !25, file: !24, line: 51, baseType: !30, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !25, file: !24, line: 54, baseType: !30, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !25, file: !24, line: 57, baseType: !21, size: 32, align: 32, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !25, file: !24, line: 60, baseType: !30, size: 64, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !25, file: !24, line: 63, baseType: !38, size: 64, align: 64, offset: 960)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !24, line: 67, baseType: !48, size: 64, align: 64, offset: 1024)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !25, file: !24, line: 70, baseType: !5, size: 64, align: 64, offset: 1088)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !25, file: !24, line: 73, baseType: !51, size: 64, align: 64, offset: 1152)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !24, line: 22, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 18, size: 16, align: 8, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !53, file: !24, line: 20, baseType: !13, size: 8, align: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !53, file: !24, line: 21, baseType: !13, size: 8, align: 8, offset: 8)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "interp_operator_local", scope: !8, file: !1, line: 99, baseType: !66, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "cInterpOperatorLocal", file: !17, line: 39, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!21, !22, !21, !21, !21, !21, !61, !57, !61, !57, !61, !57, !61, !63, !61}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!71 = !{!72, !75, !84, !93, !99, !109, !116, !162, !196, !236, !277, !280}
!72 = !DISubprogram(name: "CCTKi_version_comm_Interp_c", scope: !1, file: !1, line: 39, type: !73, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_comm_Interp_c, variables: !2)
!73 = !DISubroutineType(types: !74)
!74 = !{!11}
!75 = !DISubprogram(name: "CCTKi_InterpRegisterOperatorGV", scope: !1, file: !1, line: 140, type: !76, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32 (%struct.cGH*, i8*, i32, i32, i32, i8**, i32*, i32*, i8**, i32*)*, i8*)* @CCTKi_InterpRegisterOperatorGV, variables: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{!21, !11, !16, !11}
!78 = !{!79, !80, !81, !82, !83}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 1, scope: !75, file: !1, line: 140, type: !11)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operator_GV", arg: 2, scope: !75, file: !1, line: 141, type: !16)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !75, file: !1, line: 142, type: !11)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !75, file: !1, line: 144, type: !21)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !75, file: !1, line: 145, type: !6)
!84 = !DISubprogram(name: "CCTKi_InterpRegisterOperatorLocal", scope: !1, file: !1, line: 231, type: !85, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32 (%struct.cGH*, i32, i32, i32, i32, i32*, i8**, i32*, i8**, i32*, i8**, i32*, i8**, i32*)*, i8*)* @CCTKi_InterpRegisterOperatorLocal, variables: !87)
!85 = !DISubroutineType(types: !86)
!86 = !{!21, !11, !66, !11}
!87 = !{!88, !89, !90, !91, !92}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 1, scope: !84, file: !1, line: 231, type: !11)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operator_local", arg: 2, scope: !84, file: !1, line: 232, type: !66)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !84, file: !1, line: 233, type: !11)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !84, file: !1, line: 235, type: !21)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !84, file: !1, line: 236, type: !6)
!93 = !DISubprogram(name: "CCTK_InterpHandle", scope: !1, file: !1, line: 314, type: !94, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_InterpHandle, variables: !96)
!94 = !DISubroutineType(types: !95)
!95 = !{!21, !11}
!96 = !{!97, !98}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !93, file: !1, line: 314, type: !11)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !93, file: !1, line: 316, type: !21)
!99 = !DISubprogram(name: "cctk_interphandle_", scope: !1, file: !1, line: 337, type: !100, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8*, i32)* @cctk_interphandle_, variables: !104)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !30, !102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!103 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!104 = !{!105, !106, !107, !108}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !99, file: !1, line: 338, type: !30)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !99, file: !1, line: 338, type: !102)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !99, file: !1, line: 338, type: !103)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !99, file: !1, line: 340, type: !102)
!109 = !DISubprogram(name: "CCTK_InterpOperator", scope: !1, file: !1, line: 366, type: !110, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_InterpOperator, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{!11, !21}
!112 = !{!113, !114, !115}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !109, file: !1, line: 366, type: !21)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !109, file: !1, line: 368, type: !11)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !109, file: !1, line: 369, type: !6)
!116 = !DISubprogram(name: "CCTK_InterpGV", scope: !1, file: !1, line: 469, type: !117, isLocal: false, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i32, i32, ...)* @CCTK_InterpGV, variables: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{!21, !22, !21, !21, !21, !21, !21, null}
!119 = !{!120, !121, !122, !123, !124, !125, !126, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !154, !156, !158, !160}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !116, file: !1, line: 469, type: !22)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operator_handle", arg: 2, scope: !116, file: !1, line: 470, type: !21)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coord_system_handle", arg: 3, scope: !116, file: !1, line: 471, type: !21)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_points", arg: 4, scope: !116, file: !1, line: 472, type: !21)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_in_array_indices", arg: 5, scope: !116, file: !1, line: 473, type: !21)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_out_arrays", arg: 6, scope: !116, file: !1, line: 474, type: !21)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !116, file: !1, line: 477, type: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !128, line: 30, baseType: !129)
!128 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stdarg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 477, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, align: 64, elements: !138)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 477, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 477, size: 192, align: 64, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !132, file: !1, line: 477, baseType: !103, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !132, file: !1, line: 477, baseType: !103, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !132, file: !1, line: 477, baseType: !4, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !132, file: !1, line: 477, baseType: !4, size: 64, align: 64, offset: 128)
!138 = !{!139}
!139 = !DISubrange(count: 1)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_dims", scope: !116, file: !1, line: 478, type: !21)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !116, file: !1, line: 478, type: !21)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !116, file: !1, line: 479, type: !11)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_array_indices", scope: !116, file: !1, line: 480, type: !30)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_array_types", scope: !116, file: !1, line: 480, type: !30)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_array_types", scope: !116, file: !1, line: 480, type: !30)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_arrays", scope: !116, file: !1, line: 481, type: !70)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_arrays", scope: !116, file: !1, line: 482, type: !5)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !116, file: !1, line: 483, type: !6)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !150, file: !1, line: 515, type: !21)
!150 = distinct !DILexicalBlock(scope: !151, file: !1, line: 515, column: 5)
!151 = distinct !DILexicalBlock(scope: !152, file: !1, line: 504, column: 3)
!152 = distinct !DILexicalBlock(scope: !153, file: !1, line: 497, column: 12)
!153 = distinct !DILexicalBlock(scope: !116, file: !1, line: 491, column: 7)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !155, file: !1, line: 516, type: !21)
!155 = distinct !DILexicalBlock(scope: !151, file: !1, line: 516, column: 5)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !157, file: !1, line: 517, type: !21)
!157 = distinct !DILexicalBlock(scope: !151, file: !1, line: 517, column: 5)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !159, file: !1, line: 519, type: !21)
!159 = distinct !DILexicalBlock(scope: !151, file: !1, line: 519, column: 5)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !161, file: !1, line: 520, type: !21)
!161 = distinct !DILexicalBlock(scope: !151, file: !1, line: 520, column: 5)
!162 = !DISubprogram(name: "cctk_interpgv_", scope: !1, file: !1, line: 540, type: !163, isLocal: false, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*, i32*, i32*, ...)* @cctk_interpgv_, variables: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !30, !22, !61, !61, !61, !61, !61, null}
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !188, !190, !192, !194}
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fortranreturn", arg: 1, scope: !162, file: !1, line: 541, type: !30)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !162, file: !1, line: 542, type: !22)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operator_handle", arg: 3, scope: !162, file: !1, line: 543, type: !61)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coord_system_handle", arg: 4, scope: !162, file: !1, line: 544, type: !61)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_points", arg: 5, scope: !162, file: !1, line: 545, type: !61)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_in_array_indices", arg: 6, scope: !162, file: !1, line: 546, type: !61)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_out_arrays", arg: 7, scope: !162, file: !1, line: 547, type: !61)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !162, file: !1, line: 550, type: !127)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_dims", scope: !162, file: !1, line: 551, type: !21)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !162, file: !1, line: 551, type: !21)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !162, file: !1, line: 552, type: !11)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_array_indices", scope: !162, file: !1, line: 553, type: !30)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_array_types", scope: !162, file: !1, line: 553, type: !30)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_array_types", scope: !162, file: !1, line: 553, type: !30)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_arrays", scope: !162, file: !1, line: 554, type: !70)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_arrays", scope: !162, file: !1, line: 555, type: !5)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !162, file: !1, line: 556, type: !6)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !184, file: !1, line: 588, type: !21)
!184 = distinct !DILexicalBlock(scope: !185, file: !1, line: 588, column: 5)
!185 = distinct !DILexicalBlock(scope: !186, file: !1, line: 578, column: 3)
!186 = distinct !DILexicalBlock(scope: !187, file: !1, line: 571, column: 12)
!187 = distinct !DILexicalBlock(scope: !162, file: !1, line: 564, column: 7)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !189, file: !1, line: 589, type: !21)
!189 = distinct !DILexicalBlock(scope: !185, file: !1, line: 589, column: 5)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !191, file: !1, line: 590, type: !21)
!191 = distinct !DILexicalBlock(scope: !185, file: !1, line: 590, column: 5)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !193, file: !1, line: 591, type: !21)
!193 = distinct !DILexicalBlock(scope: !185, file: !1, line: 591, column: 5)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !195, file: !1, line: 592, type: !21)
!195 = distinct !DILexicalBlock(scope: !185, file: !1, line: 592, column: 5)
!196 = !DISubprogram(name: "CCTK_InterpLocal", scope: !1, file: !1, line: 708, type: !117, isLocal: false, isDefinition: true, scopeLine: 715, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i32, i32, ...)* @CCTK_InterpLocal, variables: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !220, !222, !224, !226, !228, !230, !232, !234}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !196, file: !1, line: 708, type: !22)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operator_handle", arg: 2, scope: !196, file: !1, line: 709, type: !21)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_points", arg: 3, scope: !196, file: !1, line: 710, type: !21)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 4, scope: !196, file: !1, line: 711, type: !21)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_in_arrays", arg: 5, scope: !196, file: !1, line: 712, type: !21)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_out_arrays", arg: 6, scope: !196, file: !1, line: 713, type: !21)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !196, file: !1, line: 716, type: !127)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !196, file: !1, line: 717, type: !21)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_dims", scope: !196, file: !1, line: 718, type: !30)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_array_types", scope: !196, file: !1, line: 719, type: !30)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_array_types", scope: !196, file: !1, line: 719, type: !30)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_array_types", scope: !196, file: !1, line: 720, type: !30)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_array_types", scope: !196, file: !1, line: 720, type: !30)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_arrays", scope: !196, file: !1, line: 721, type: !70)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_arrays", scope: !196, file: !1, line: 721, type: !70)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_arrays", scope: !196, file: !1, line: 721, type: !70)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_arrays", scope: !196, file: !1, line: 722, type: !5)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !196, file: !1, line: 723, type: !6)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !217, file: !1, line: 749, type: !21)
!217 = distinct !DILexicalBlock(scope: !218, file: !1, line: 749, column: 5)
!218 = distinct !DILexicalBlock(scope: !219, file: !1, line: 736, column: 3)
!219 = distinct !DILexicalBlock(scope: !196, file: !1, line: 729, column: 7)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !221, file: !1, line: 750, type: !21)
!221 = distinct !DILexicalBlock(scope: !218, file: !1, line: 750, column: 5)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !223, file: !1, line: 751, type: !21)
!223 = distinct !DILexicalBlock(scope: !218, file: !1, line: 751, column: 5)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !225, file: !1, line: 752, type: !21)
!225 = distinct !DILexicalBlock(scope: !218, file: !1, line: 752, column: 5)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !227, file: !1, line: 753, type: !21)
!227 = distinct !DILexicalBlock(scope: !218, file: !1, line: 753, column: 5)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !229, file: !1, line: 754, type: !21)
!229 = distinct !DILexicalBlock(scope: !218, file: !1, line: 754, column: 5)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !231, file: !1, line: 755, type: !21)
!231 = distinct !DILexicalBlock(scope: !218, file: !1, line: 755, column: 5)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !233, file: !1, line: 756, type: !21)
!233 = distinct !DILexicalBlock(scope: !218, file: !1, line: 756, column: 5)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !235, file: !1, line: 757, type: !21)
!235 = distinct !DILexicalBlock(scope: !218, file: !1, line: 757, column: 5)
!236 = !DISubprogram(name: "cctk_interplocal_", scope: !1, file: !1, line: 784, type: !163, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, i32*, i32*, i32*, ...)* @cctk_interplocal_, variables: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !261, !263, !265, !267, !269, !271, !273, !275}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fortranreturn", arg: 1, scope: !236, file: !1, line: 785, type: !30)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !236, file: !1, line: 786, type: !22)
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operator_handle", arg: 3, scope: !236, file: !1, line: 787, type: !61)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_points", arg: 4, scope: !236, file: !1, line: 788, type: !61)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 5, scope: !236, file: !1, line: 789, type: !61)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_in_arrays", arg: 6, scope: !236, file: !1, line: 790, type: !61)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_out_arrays", arg: 7, scope: !236, file: !1, line: 791, type: !61)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !236, file: !1, line: 794, type: !127)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !236, file: !1, line: 795, type: !21)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_dims", scope: !236, file: !1, line: 796, type: !30)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_array_types", scope: !236, file: !1, line: 797, type: !30)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_array_types", scope: !236, file: !1, line: 797, type: !30)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_array_types", scope: !236, file: !1, line: 798, type: !30)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_array_types", scope: !236, file: !1, line: 798, type: !30)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_arrays", scope: !236, file: !1, line: 799, type: !70)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp_coord_arrays", scope: !236, file: !1, line: 799, type: !70)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_arrays", scope: !236, file: !1, line: 799, type: !70)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_arrays", scope: !236, file: !1, line: 800, type: !5)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !236, file: !1, line: 801, type: !6)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !258, file: !1, line: 827, type: !21)
!258 = distinct !DILexicalBlock(scope: !259, file: !1, line: 827, column: 5)
!259 = distinct !DILexicalBlock(scope: !260, file: !1, line: 814, column: 3)
!260 = distinct !DILexicalBlock(scope: !236, file: !1, line: 807, column: 7)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !262, file: !1, line: 828, type: !21)
!262 = distinct !DILexicalBlock(scope: !259, file: !1, line: 828, column: 5)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !264, file: !1, line: 829, type: !21)
!264 = distinct !DILexicalBlock(scope: !259, file: !1, line: 829, column: 5)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !266, file: !1, line: 830, type: !21)
!266 = distinct !DILexicalBlock(scope: !259, file: !1, line: 830, column: 5)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !268, file: !1, line: 831, type: !21)
!268 = distinct !DILexicalBlock(scope: !259, file: !1, line: 831, column: 5)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !270, file: !1, line: 832, type: !21)
!270 = distinct !DILexicalBlock(scope: !259, file: !1, line: 832, column: 5)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !272, file: !1, line: 833, type: !21)
!272 = distinct !DILexicalBlock(scope: !259, file: !1, line: 833, column: 5)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !274, file: !1, line: 834, type: !21)
!274 = distinct !DILexicalBlock(scope: !259, file: !1, line: 834, column: 5)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !276, file: !1, line: 835, type: !21)
!276 = distinct !DILexicalBlock(scope: !259, file: !1, line: 835, column: 5)
!277 = !DISubprogram(name: "CCTK_NumInterpOperators", scope: !1, file: !1, line: 874, type: !278, isLocal: false, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumInterpOperators, variables: !2)
!278 = !DISubroutineType(types: !279)
!279 = !{!21}
!280 = !DISubprogram(name: "CCTK_InterpOperatorImplementation", scope: !1, file: !1, line: 892, type: !110, isLocal: false, isDefinition: true, scopeLine: 893, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_InterpOperatorImplementation, variables: !281)
!281 = !{!282, !283, !284}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !280, file: !1, line: 892, type: !21)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operator", scope: !280, file: !1, line: 894, type: !6)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imp", scope: !280, file: !1, line: 895, type: !11)
!285 = !{!286, !287, !303}
!286 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 37, type: !11, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariable(name: "interp_operators", scope: !0, file: !1, line: 108, type: !288, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @interp_operators)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !290, line: 28, baseType: !291)
!290 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!291 = !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 23, size: 128, align: 64, elements: !292)
!292 = !{!293, !301, !302}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !291, file: !290, line: 25, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !290, line: 21, baseType: !296)
!296 = !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 16, size: 192, align: 64, elements: !297)
!297 = !{!298, !299, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !296, file: !290, line: 18, baseType: !103, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !290, line: 19, baseType: !102, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !290, line: 20, baseType: !4, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !291, file: !290, line: 26, baseType: !103, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !291, file: !290, line: 27, baseType: !103, size: 32, align: 32, offset: 96)
!303 = !DIGlobalVariable(name: "num_interp_operators", scope: !0, file: !1, line: 109, type: !21, isLocal: true, isDefinition: true, variable: i32* @num_interp_operators)
!304 = !{i32 2, !"Dwarf Version", i32 2}
!305 = !{i32 2, !"Debug Info Version", i32 700000003}
!306 = !{i32 1, !"PIC Level", i32 2}
!307 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!308 = !DILocation(line: 39, column: 1, scope: !72)
!309 = !DIExpression()
!310 = !DILocation(line: 140, column: 49, scope: !75)
!311 = !DILocation(line: 141, column: 27, scope: !75)
!312 = !DILocation(line: 142, column: 21, scope: !75)
!313 = !DILocation(line: 149, column: 19, scope: !314)
!314 = distinct !DILexicalBlock(scope: !75, file: !1, line: 149, column: 7)
!315 = !DILocation(line: 149, column: 7, scope: !75)
!316 = !DILocation(line: 151, column: 5, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !1, line: 150, column: 3)
!318 = !DILocation(line: 144, column: 7, scope: !75)
!319 = !DILocation(line: 155, column: 3, scope: !317)
!320 = !DILocation(line: 159, column: 30, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !1, line: 157, column: 3)
!322 = !{!323, !323, i64 0}
!323 = !{!"any pointer", !324, i64 0}
!324 = !{!"omnipotent char", !325, i64 0}
!325 = !{!"Simple C/C++ TBAA"}
!326 = !DILocation(line: 159, column: 54, scope: !321)
!327 = !DILocation(line: 159, column: 14, scope: !321)
!328 = !DILocation(line: 161, column: 16, scope: !329)
!329 = distinct !DILexicalBlock(scope: !321, file: !1, line: 161, column: 9)
!330 = !DILocation(line: 161, column: 9, scope: !321)
!331 = !DILocation(line: 164, column: 40, scope: !332)
!332 = distinct !DILexicalBlock(scope: !329, file: !1, line: 162, column: 5)
!333 = !DILocation(line: 164, column: 16, scope: !332)
!334 = !DILocation(line: 165, column: 11, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !1, line: 165, column: 11)
!336 = !DILocation(line: 165, column: 11, scope: !332)
!337 = !DILocation(line: 167, column: 29, scope: !338)
!338 = distinct !DILexicalBlock(scope: !335, file: !1, line: 166, column: 7)
!339 = !DILocation(line: 145, column: 22, scope: !75)
!340 = !DILocation(line: 167, column: 2, scope: !338)
!341 = !DILocation(line: 167, column: 12, scope: !338)
!342 = !DILocation(line: 167, column: 27, scope: !338)
!343 = !{!344, !323, i64 0}
!344 = !{!"", !323, i64 0, !323, i64 8, !323, i64 16, !323, i64 24}
!345 = !DILocation(line: 168, column: 2, scope: !338)
!346 = !DILocation(line: 168, column: 12, scope: !338)
!347 = !DILocation(line: 168, column: 17, scope: !338)
!348 = !{!344, !323, i64 8}
!349 = !DILocation(line: 169, column: 9, scope: !338)
!350 = !DILocation(line: 169, column: 19, scope: !338)
!351 = !DILocation(line: 169, column: 38, scope: !338)
!352 = !{!344, !323, i64 16}
!353 = !DILocation(line: 170, column: 9, scope: !338)
!354 = !DILocation(line: 170, column: 19, scope: !338)
!355 = !DILocation(line: 170, column: 41, scope: !338)
!356 = !{!344, !323, i64 24}
!357 = !DILocation(line: 171, column: 59, scope: !338)
!358 = !DILocation(line: 171, column: 18, scope: !338)
!359 = !DILocation(line: 174, column: 29, scope: !338)
!360 = !{!361, !361, i64 0}
!361 = !{!"int", !324, i64 0}
!362 = !DILocation(line: 175, column: 7, scope: !338)
!363 = !DILocation(line: 178, column: 9, scope: !364)
!364 = distinct !DILexicalBlock(scope: !335, file: !1, line: 177, column: 7)
!365 = !DILocation(line: 184, column: 14, scope: !366)
!366 = distinct !DILexicalBlock(scope: !329, file: !1, line: 184, column: 14)
!367 = !DILocation(line: 184, column: 24, scope: !366)
!368 = !DILocation(line: 184, column: 43, scope: !366)
!369 = !DILocation(line: 184, column: 14, scope: !329)
!370 = !DILocation(line: 186, column: 36, scope: !371)
!371 = distinct !DILexicalBlock(scope: !366, file: !1, line: 185, column: 5)
!372 = !DILocation(line: 187, column: 5, scope: !371)
