; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/IO_restricted.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@iorest_ = common global %struct.anon zeroinitializer, align 8

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!62, !63, !64}
!llvm.ident = !{!65}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !2, globals: !3, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/IO_restricted.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIGlobalVariable(name: "iorest_", scope: !0, file: !1, line: 66, type: !5, isLocal: false, isDefinition: true, variable: %struct.anon* @iorest_)
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 13, size: 2368, align: 64, elements: !6)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16, !17, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "out_xline_y", scope: !5, file: !1, line: 15, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "out_xline_z", scope: !5, file: !1, line: 16, baseType: !8, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "out_xyplane_z", scope: !5, file: !1, line: 17, baseType: !8, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "out_xzplane_y", scope: !5, file: !1, line: 18, baseType: !8, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "out_yline_x", scope: !5, file: !1, line: 19, baseType: !8, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "out_yline_z", scope: !5, file: !1, line: 20, baseType: !8, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "out_yzplane_x", scope: !5, file: !1, line: 21, baseType: !8, size: 64, align: 64, offset: 384)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "out_zline_x", scope: !5, file: !1, line: 22, baseType: !8, size: 64, align: 64, offset: 448)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "out_zline_y", scope: !5, file: !1, line: 23, baseType: !8, size: 64, align: 64, offset: 512)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_ID_file", scope: !5, file: !1, line: 24, baseType: !18, size: 64, align: 64, offset: 576)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_dir", scope: !5, file: !1, line: 25, baseType: !18, size: 64, align: 64, offset: 640)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_file", scope: !5, file: !1, line: 26, baseType: !18, size: 64, align: 64, offset: 704)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "newverbose", scope: !5, file: !1, line: 27, baseType: !18, size: 64, align: 64, offset: 768)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_mode", scope: !5, file: !1, line: 28, baseType: !18, size: 64, align: 64, offset: 832)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out_fileinfo", scope: !5, file: !1, line: 29, baseType: !18, size: 64, align: 64, offset: 896)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "outdir", scope: !5, file: !1, line: 30, baseType: !18, size: 64, align: 64, offset: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "parfile_name", scope: !5, file: !1, line: 31, baseType: !18, size: 64, align: 64, offset: 1024)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "parfile_write", scope: !5, file: !1, line: 32, baseType: !18, size: 64, align: 64, offset: 1088)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "recover", scope: !5, file: !1, line: 33, baseType: !18, size: 64, align: 64, offset: 1152)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "recover_ID_files", scope: !5, file: !1, line: 34, baseType: !18, size: 64, align: 64, offset: 1216)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "recover_ID_vars", scope: !5, file: !1, line: 35, baseType: !18, size: 64, align: 64, offset: 1280)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "recover_file", scope: !5, file: !1, line: 36, baseType: !18, size: 64, align: 64, offset: 1344)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_dir", scope: !5, file: !1, line: 37, baseType: !18, size: 64, align: 64, offset: 1408)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_ID", scope: !5, file: !1, line: 38, baseType: !34, size: 32, align: 32, offset: 1472)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_every", scope: !5, file: !1, line: 39, baseType: !34, size: 32, align: 32, offset: 1504)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_keep", scope: !5, file: !1, line: 40, baseType: !34, size: 32, align: 32, offset: 1536)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_keep_all", scope: !5, file: !1, line: 41, baseType: !34, size: 32, align: 32, offset: 1568)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "checkpoint_on_terminate", scope: !5, file: !1, line: 42, baseType: !34, size: 32, align: 32, offset: 1600)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "new_filename_scheme", scope: !5, file: !1, line: 43, baseType: !34, size: 32, align: 32, offset: 1632)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_downsample_x", scope: !5, file: !1, line: 44, baseType: !34, size: 32, align: 32, offset: 1664)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_downsample_y", scope: !5, file: !1, line: 45, baseType: !34, size: 32, align: 32, offset: 1696)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_downsample_z", scope: !5, file: !1, line: 46, baseType: !34, size: 32, align: 32, offset: 1728)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_parameters", scope: !5, file: !1, line: 47, baseType: !34, size: 32, align: 32, offset: 1760)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_procs", scope: !5, file: !1, line: 48, baseType: !34, size: 32, align: 32, offset: 1792)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_septimefiles", scope: !5, file: !1, line: 49, baseType: !34, size: 32, align: 32, offset: 1824)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_single", scope: !5, file: !1, line: 50, baseType: !34, size: 32, align: 32, offset: 1856)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_unchunked", scope: !5, file: !1, line: 51, baseType: !34, size: 32, align: 32, offset: 1888)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "out_every", scope: !5, file: !1, line: 52, baseType: !34, size: 32, align: 32, offset: 1920)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "out_xline_yi", scope: !5, file: !1, line: 53, baseType: !34, size: 32, align: 32, offset: 1952)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "out_xline_zi", scope: !5, file: !1, line: 54, baseType: !34, size: 32, align: 32, offset: 1984)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "out_xyplane_zi", scope: !5, file: !1, line: 55, baseType: !34, size: 32, align: 32, offset: 2016)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "out_xzplane_yi", scope: !5, file: !1, line: 56, baseType: !34, size: 32, align: 32, offset: 2048)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "out_yline_xi", scope: !5, file: !1, line: 57, baseType: !34, size: 32, align: 32, offset: 2080)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "out_yline_zi", scope: !5, file: !1, line: 58, baseType: !34, size: 32, align: 32, offset: 2112)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "out_yzplane_xi", scope: !5, file: !1, line: 59, baseType: !34, size: 32, align: 32, offset: 2144)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "out_zline_xi", scope: !5, file: !1, line: 60, baseType: !34, size: 32, align: 32, offset: 2176)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "out_zline_yi", scope: !5, file: !1, line: 61, baseType: !34, size: 32, align: 32, offset: 2208)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "parfile_update_every", scope: !5, file: !1, line: 62, baseType: !34, size: 32, align: 32, offset: 2240)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "print_timing_info", scope: !5, file: !1, line: 63, baseType: !34, size: 32, align: 32, offset: 2272)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "recover_and_remove", scope: !5, file: !1, line: 64, baseType: !34, size: 32, align: 32, offset: 2304)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !5, file: !1, line: 65, baseType: !34, size: 32, align: 32, offset: 2336)
!62 = !{i32 2, !"Dwarf Version", i32 2}
!63 = !{i32 2, !"Debug Info Version", i32 700000003}
!64 = !{i32 1, !"PIC Level", i32 2}
!65 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
