; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/IOASCII_private.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@ioasciipriv_ = common global %struct.anon zeroinitializer, align 8

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!47, !48, !49}
!llvm.ident = !{!50}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !2, globals: !3, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/IOASCII_private.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIGlobalVariable(name: "ioasciipriv_", scope: !0, file: !1, line: 51, type: !5, isLocal: false, isDefinition: true, variable: %struct.anon* @ioasciipriv_)
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 13, size: 1792, align: 64, elements: !6)
!6 = !{!7, !9, !10, !11, !12, !13, !14, !15, !16, !17, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_xline_y", scope: !5, file: !1, line: 15, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_xline_z", scope: !5, file: !1, line: 16, baseType: !8, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_yline_x", scope: !5, file: !1, line: 17, baseType: !8, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_yline_z", scope: !5, file: !1, line: 18, baseType: !8, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_zline_x", scope: !5, file: !1, line: 19, baseType: !8, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_zline_y", scope: !5, file: !1, line: 20, baseType: !8, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_xyplane_z", scope: !5, file: !1, line: 21, baseType: !8, size: 64, align: 64, offset: 384)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_xzplane_y", scope: !5, file: !1, line: 22, baseType: !8, size: 64, align: 64, offset: 448)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_yzplane_x", scope: !5, file: !1, line: 23, baseType: !8, size: 64, align: 64, offset: 512)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_style", scope: !5, file: !1, line: 24, baseType: !18, size: 64, align: 64, offset: 576)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_vars", scope: !5, file: !1, line: 25, baseType: !18, size: 64, align: 64, offset: 640)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_style", scope: !5, file: !1, line: 26, baseType: !18, size: 64, align: 64, offset: 704)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_vars", scope: !5, file: !1, line: 27, baseType: !18, size: 64, align: 64, offset: 768)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_style", scope: !5, file: !1, line: 28, baseType: !18, size: 64, align: 64, offset: 832)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_vars", scope: !5, file: !1, line: 29, baseType: !18, size: 64, align: 64, offset: 896)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !5, file: !1, line: 30, baseType: !18, size: 64, align: 64, offset: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "out_style", scope: !5, file: !1, line: 31, baseType: !18, size: 64, align: 64, offset: 1024)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "outdir1D", scope: !5, file: !1, line: 32, baseType: !18, size: 64, align: 64, offset: 1088)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "outdir2D", scope: !5, file: !1, line: 33, baseType: !18, size: 64, align: 64, offset: 1152)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "outdir3D", scope: !5, file: !1, line: 34, baseType: !18, size: 64, align: 64, offset: 1216)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_d", scope: !5, file: !1, line: 35, baseType: !31, size: 32, align: 32, offset: 1280)
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_every", scope: !5, file: !1, line: 36, baseType: !31, size: 32, align: 32, offset: 1312)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_x", scope: !5, file: !1, line: 37, baseType: !31, size: 32, align: 32, offset: 1344)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_xline_yi", scope: !5, file: !1, line: 38, baseType: !31, size: 32, align: 32, offset: 1376)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_xline_zi", scope: !5, file: !1, line: 39, baseType: !31, size: 32, align: 32, offset: 1408)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_y", scope: !5, file: !1, line: 40, baseType: !31, size: 32, align: 32, offset: 1440)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_yline_xi", scope: !5, file: !1, line: 41, baseType: !31, size: 32, align: 32, offset: 1472)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_yline_zi", scope: !5, file: !1, line: 42, baseType: !31, size: 32, align: 32, offset: 1504)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_z", scope: !5, file: !1, line: 43, baseType: !31, size: 32, align: 32, offset: 1536)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_zline_xi", scope: !5, file: !1, line: 44, baseType: !31, size: 32, align: 32, offset: 1568)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_zline_yi", scope: !5, file: !1, line: 45, baseType: !31, size: 32, align: 32, offset: 1600)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_every", scope: !5, file: !1, line: 46, baseType: !31, size: 32, align: 32, offset: 1632)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_xyplane_zi", scope: !5, file: !1, line: 47, baseType: !31, size: 32, align: 32, offset: 1664)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_xzplane_yi", scope: !5, file: !1, line: 48, baseType: !31, size: 32, align: 32, offset: 1696)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_yzplane_xi", scope: !5, file: !1, line: 49, baseType: !31, size: 32, align: 32, offset: 1728)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_every", scope: !5, file: !1, line: 50, baseType: !31, size: 32, align: 32, offset: 1760)
!47 = !{i32 2, !"Dwarf Version", i32 2}
!48 = !{i32 2, !"Debug Info Version", i32 700000003}
!49 = !{i32 1, !"PIC Level", i32 2}
!50 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
