; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/IOMethods.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.IOMethod = type { i8*, i8*, i32 (%struct.cGH*)*, i32 (%struct.cGH*, i8*, i8*)*, i32 (%struct.cGH*, i32)*, i32 (%struct.cGH*, i32)* }

@IOMethods = internal global %struct.cHandledData* null, align 8
@num_methods = internal unnamed_addr global i32 0, align 4
@CCTK_OutputVarAsByMethod = external global i32 (%struct.cGH*, i8*, i8*, i8*)*
@.str = private unnamed_addr constant [78 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/IOMethods.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [88 x i8] c"CactusDefaultOutputVarAsByMethod: I/O method '%s' not found for output of variable '%s'\00", align 1
@.str3 = private unnamed_addr constant [83 x i8] c"$Header: /cactus/Cactus/src/IO/IOMethods.c,v 1.36 2001/12/30 13:12:06 tradke Exp $\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_IO_IOMethods_c() #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !65, globals: !213, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/IOMethods.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !47, !46}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOMethod", file: !6, line: 18, size: 384, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_IOMethods.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !12, !13, !56, !60, !64}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !5, file: !6, line: 20, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5, file: !6, line: 21, baseType: !9, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "OutputGH", scope: !5, file: !6, line: 22, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18}
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !21, line: 75, baseType: !22)
!21 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 24, size: 1216, align: 64, elements: !23)
!23 = !{!24, !25, !26, !28, !29, !30, !31, !32, !33, !34, !36, !38, !39, !40, !41, !42, !43, !44, !48, !49}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !22, file: !21, line: 26, baseType: !17, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !22, file: !21, line: 27, baseType: !17, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !22, file: !21, line: 30, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !22, file: !21, line: 31, baseType: !27, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !22, file: !21, line: 32, baseType: !27, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !22, file: !21, line: 33, baseType: !27, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !22, file: !21, line: 36, baseType: !27, size: 64, align: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !22, file: !21, line: 39, baseType: !27, size: 64, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !22, file: !21, line: 40, baseType: !27, size: 64, align: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !22, file: !21, line: 43, baseType: !35, size: 64, align: 64, offset: 512)
!35 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !22, file: !21, line: 44, baseType: !37, size: 64, align: 64, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !22, file: !21, line: 47, baseType: !37, size: 64, align: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !22, file: !21, line: 51, baseType: !27, size: 64, align: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !22, file: !21, line: 54, baseType: !27, size: 64, align: 64, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !22, file: !21, line: 57, baseType: !17, size: 32, align: 32, offset: 832)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !22, file: !21, line: 60, baseType: !27, size: 64, align: 64, offset: 896)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !22, file: !21, line: 63, baseType: !35, size: 64, align: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !21, line: 67, baseType: !45, size: 64, align: 64, offset: 1024)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !22, file: !21, line: 70, baseType: !46, size: 64, align: 64, offset: 1088)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !22, file: !21, line: 73, baseType: !50, size: 64, align: 64, offset: 1152)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !21, line: 22, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 18, size: 16, align: 8, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !52, file: !21, line: 20, baseType: !11, size: 8, align: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !52, file: !21, line: 21, baseType: !11, size: 8, align: 8, offset: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "OutputVarAs", scope: !5, file: !6, line: 23, baseType: !57, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!17, !18, !9, !9}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "TriggerOutput", scope: !5, file: !6, line: 24, baseType: !61, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!17, !18, !17}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "TimeToOutput", scope: !5, file: !6, line: 25, baseType: !61, size: 64, align: 64, offset: 320)
!65 = !{!66, !69, !77, !84, !91, !98, !103, !111, !118, !124, !138, !141, !147, !151, !157, !167, !182, !188, !197, !200, !204, !209}
!66 = !DISubprogram(name: "CCTKi_version_IO_IOMethods_c", scope: !1, file: !1, line: 30, type: !67, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_IO_IOMethods_c, variables: !2)
!67 = !DISubroutineType(types: !68)
!68 = !{!9}
!69 = !DISubprogram(name: "CCTKi_RegisterIOMethod", scope: !1, file: !1, line: 103, type: !70, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @CCTKi_RegisterIOMethod, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!17, !9, !9}
!72 = !{!73, !74, !75, !76}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 1, scope: !69, file: !1, line: 103, type: !9)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !69, file: !1, line: 103, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !69, file: !1, line: 105, type: !17)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_method", scope: !69, file: !1, line: 106, type: !4)
!77 = !DISubprogram(name: "CCTK_RegisterIOMethodOutputGH", scope: !1, file: !1, line: 175, type: !78, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*)*)* @CCTK_RegisterIOMethodOutputGH, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{!17, !17, !14}
!80 = !{!81, !82, !83}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !77, file: !1, line: 175, type: !17)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "OutputGH", arg: 2, scope: !77, file: !1, line: 175, type: !14)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !77, file: !1, line: 177, type: !4)
!84 = !DISubprogram(name: "CCTK_RegisterIOMethodOutputVarAs", scope: !1, file: !1, line: 217, type: !85, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*, i8*, i8*)*)* @CCTK_RegisterIOMethodOutputVarAs, variables: !87)
!85 = !DISubroutineType(types: !86)
!86 = !{!17, !17, !57}
!87 = !{!88, !89, !90}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !84, file: !1, line: 217, type: !17)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "OutputVarAs", arg: 2, scope: !84, file: !1, line: 218, type: !57)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !84, file: !1, line: 222, type: !4)
!91 = !DISubprogram(name: "CCTK_RegisterIOMethodTriggerOutput", scope: !1, file: !1, line: 262, type: !92, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*, i32)*)* @CCTK_RegisterIOMethodTriggerOutput, variables: !94)
!92 = !DISubroutineType(types: !93)
!93 = !{!17, !17, !61}
!94 = !{!95, !96, !97}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !91, file: !1, line: 262, type: !17)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "TriggerOutput", arg: 2, scope: !91, file: !1, line: 263, type: !61)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !91, file: !1, line: 266, type: !4)
!98 = !DISubprogram(name: "CCTK_RegisterIOMethodTimeToOutput", scope: !1, file: !1, line: 306, type: !92, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*, i32)*)* @CCTK_RegisterIOMethodTimeToOutput, variables: !99)
!99 = !{!100, !101, !102}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !98, file: !1, line: 306, type: !17)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "TimeToOutput", arg: 2, scope: !98, file: !1, line: 307, type: !61)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !98, file: !1, line: 310, type: !4)
!103 = !DISubprogram(name: "CCTK_OutputVarAs", scope: !1, file: !1, line: 365, type: !58, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*)* @CCTK_OutputVarAs, variables: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !103, file: !1, line: 365, type: !18)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !103, file: !1, line: 365, type: !9)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !103, file: !1, line: 365, type: !9)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !103, file: !1, line: 367, type: !17)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !103, file: !1, line: 367, type: !17)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !103, file: !1, line: 368, type: !4)
!111 = !DISubprogram(name: "CCTK_OutputVar", scope: !1, file: !1, line: 416, type: !112, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTK_OutputVar, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!17, !18, !9}
!114 = !{!115, !116, !117}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !111, file: !1, line: 416, type: !18)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !111, file: !1, line: 416, type: !9)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !111, file: !1, line: 418, type: !17)
!118 = !DISubprogram(name: "CCTK_OutputVarByMethod", scope: !1, file: !1, line: 458, type: !58, isLocal: false, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*)* @CCTK_OutputVarByMethod, variables: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !118, file: !1, line: 458, type: !18)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !118, file: !1, line: 458, type: !9)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "method", arg: 3, scope: !118, file: !1, line: 458, type: !9)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !118, file: !1, line: 460, type: !17)
!124 = !DISubprogram(name: "cctk_outputvarbymethod_", scope: !1, file: !1, line: 468, type: !125, isLocal: false, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i8*, i8*, i32, i32)* @cctk_outputvarbymethod_, variables: !129)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !27, !18, !127, !127, !128, !128}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!128 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !124, file: !1, line: 469, type: !27)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !124, file: !1, line: 469, type: !18)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 3, scope: !124, file: !1, line: 469, type: !127)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 4, scope: !124, file: !1, line: 469, type: !127)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 5, scope: !124, file: !1, line: 469, type: !128)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 6, scope: !124, file: !1, line: 469, type: !128)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !124, file: !1, line: 471, type: !127)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !124, file: !1, line: 471, type: !127)
!138 = !DISubprogram(name: "CCTK_NumIOMethods", scope: !1, file: !1, line: 492, type: !139, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_NumIOMethods, variables: !2)
!139 = !DISubroutineType(types: !140)
!140 = !{!17}
!141 = !DISubprogram(name: "CCTK_IOMethodImplementation", scope: !1, file: !1, line: 516, type: !142, isLocal: false, isDefinition: true, scopeLine: 517, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_IOMethodImplementation, variables: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{!9, !17}
!144 = !{!145, !146}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !141, file: !1, line: 516, type: !17)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !141, file: !1, line: 518, type: !4)
!147 = !DISubprogram(name: "CCTK_IOMethod", scope: !1, file: !1, line: 545, type: !142, isLocal: false, isDefinition: true, scopeLine: 546, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @CCTK_IOMethod, variables: !148)
!148 = !{!149, !150}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !147, file: !1, line: 545, type: !17)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !147, file: !1, line: 547, type: !4)
!151 = !DISubprogram(name: "CactusDefaultOutputGH", scope: !1, file: !1, line: 652, type: !15, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CactusDefaultOutputGH, variables: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !151, file: !1, line: 652, type: !18)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !151, file: !1, line: 654, type: !17)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !151, file: !1, line: 654, type: !17)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !151, file: !1, line: 655, type: !4)
!157 = !DISubprogram(name: "CactusDefaultOutputVarAsByMethod", scope: !1, file: !1, line: 714, type: !158, isLocal: false, isDefinition: true, scopeLine: 718, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*, i8*)* @CactusDefaultOutputVarAsByMethod, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{!17, !18, !9, !9, !9}
!160 = !{!161, !162, !163, !164, !165, !166}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !157, file: !1, line: 714, type: !18)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !157, file: !1, line: 715, type: !9)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "methodname", arg: 3, scope: !157, file: !1, line: 716, type: !9)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 4, scope: !157, file: !1, line: 717, type: !9)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !157, file: !1, line: 719, type: !17)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !157, file: !1, line: 720, type: !4)
!167 = !DISubprogram(name: "cctk_outputvarasbymethod_", scope: !1, file: !1, line: 739, type: !168, isLocal: false, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i8*, i8*, i8*, i32, i32, i32)* @cctk_outputvarasbymethod_, variables: !170)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !27, !18, !127, !127, !127, !128, !128, !128}
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !167, file: !1, line: 740, type: !27)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !167, file: !1, line: 740, type: !18)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 3, scope: !167, file: !1, line: 740, type: !127)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str2", arg: 4, scope: !167, file: !1, line: 740, type: !127)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str3", arg: 5, scope: !167, file: !1, line: 740, type: !127)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 6, scope: !167, file: !1, line: 740, type: !128)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen2", arg: 7, scope: !167, file: !1, line: 740, type: !128)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen3", arg: 8, scope: !167, file: !1, line: 740, type: !128)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !167, file: !1, line: 742, type: !127)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "methodname", scope: !167, file: !1, line: 742, type: !127)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alias", scope: !167, file: !1, line: 742, type: !127)
!182 = !DISubprogram(name: "CCTKi_TriggerSaysGo", scope: !1, file: !1, line: 787, type: !62, isLocal: false, isDefinition: true, scopeLine: 788, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CCTKi_TriggerSaysGo, variables: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !182, file: !1, line: 787, type: !18)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "variable", arg: 2, scope: !182, file: !1, line: 787, type: !17)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !182, file: !1, line: 789, type: !17)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !182, file: !1, line: 790, type: !4)
!188 = !DISubprogram(name: "CCTKi_TriggerAction", scope: !1, file: !1, line: 842, type: !189, isLocal: false, isDefinition: true, scopeLine: 843, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @CCTKi_TriggerAction, variables: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!17, !47, !17}
!191 = !{!192, !193, !194, !195, !196}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !188, file: !1, line: 842, type: !47)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "variable", arg: 2, scope: !188, file: !1, line: 842, type: !17)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !188, file: !1, line: 844, type: !17)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmethods", scope: !188, file: !1, line: 845, type: !17)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !188, file: !1, line: 846, type: !4)
!197 = !DISubprogram(name: "DummyOutputGH", scope: !1, file: !1, line: 573, type: !15, isLocal: true, isDefinition: true, scopeLine: 574, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @DummyOutputGH, variables: !198)
!198 = !{!199}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !197, file: !1, line: 573, type: !18)
!200 = !DISubprogram(name: "DummyTimeToOutput", scope: !1, file: !1, line: 588, type: !62, isLocal: true, isDefinition: true, scopeLine: 589, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @DummyTimeToOutput, variables: !201)
!201 = !{!202, !203}
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !200, file: !1, line: 588, type: !18)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !200, file: !1, line: 588, type: !17)
!204 = !DISubprogram(name: "DummyOutputVarAs", scope: !1, file: !1, line: 604, type: !58, isLocal: true, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*)* @DummyOutputVarAs, variables: !205)
!205 = !{!206, !207, !208}
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !204, file: !1, line: 604, type: !18)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !204, file: !1, line: 605, type: !9)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !204, file: !1, line: 606, type: !9)
!209 = !DISubprogram(name: "DummyTriggerOutput", scope: !1, file: !1, line: 615, type: !62, isLocal: true, isDefinition: true, scopeLine: 616, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @DummyTriggerOutput, variables: !210)
!210 = !{!211, !212}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !209, file: !1, line: 615, type: !18)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 2, scope: !209, file: !1, line: 615, type: !17)
!213 = !{!214, !215, !231}
!214 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 28, type: !9, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariable(name: "IOMethods", scope: !0, file: !1, line: 67, type: !216, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @IOMethods)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !218, line: 28, baseType: !219)
!218 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 23, size: 128, align: 64, elements: !220)
!220 = !{!221, !229, !230}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !219, file: !218, line: 25, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !218, line: 21, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 16, size: 192, align: 64, elements: !225)
!225 = !{!226, !227, !228}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !224, file: !218, line: 18, baseType: !128, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !224, file: !218, line: 19, baseType: !127, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !218, line: 20, baseType: !47, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !219, file: !218, line: 26, baseType: !128, size: 32, align: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !219, file: !218, line: 27, baseType: !128, size: 32, align: 32, offset: 96)
!231 = !DIGlobalVariable(name: "num_methods", scope: !0, file: !1, line: 68, type: !17, isLocal: true, isDefinition: true, variable: i32* @num_methods)
!232 = !{i32 2, !"Dwarf Version", i32 2}
!233 = !{i32 2, !"Debug Info Version", i32 700000003}
!234 = !{i32 1, !"PIC Level", i32 2}
!235 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!236 = !DILocation(line: 30, column: 1, scope: !66)
!237 = !DIExpression()
!238 = !DILocation(line: 103, column: 41, scope: !69)
!239 = !DILocation(line: 103, column: 60, scope: !69)
!240 = !DILocation(line: 110, column: 28, scope: !69)
!241 = !{!242, !242, i64 0}
!242 = !{!"any pointer", !243, i64 0}
!243 = !{!"omnipotent char", !244, i64 0}
!244 = !{!"Simple C/C++ TBAA"}
!245 = !DILocation(line: 110, column: 12, scope: !69)
!246 = !DILocation(line: 105, column: 7, scope: !69)
!247 = !DILocation(line: 112, column: 14, scope: !248)
!248 = distinct !DILexicalBlock(scope: !69, file: !1, line: 112, column: 7)
!249 = !DILocation(line: 112, column: 7, scope: !69)
!250 = !DILocation(line: 115, column: 38, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !1, line: 113, column: 3)
!252 = !DILocation(line: 117, column: 9, scope: !253)
!253 = distinct !DILexicalBlock(scope: !251, file: !1, line: 117, column: 9)
!254 = !DILocation(line: 117, column: 9, scope: !251)
!255 = !DILocation(line: 120, column: 16, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !1, line: 118, column: 5)
!257 = !DILocation(line: 123, column: 36, scope: !256)
!258 = !DILocation(line: 123, column: 19, scope: !256)
!259 = !DILocation(line: 123, column: 34, scope: !256)
!260 = !{!261, !242, i64 0}
!261 = !{!"IOMethod", !242, i64 0, !242, i64 8, !242, i64 16, !242, i64 24, !242, i64 32, !242, i64 40}
!262 = !DILocation(line: 124, column: 19, scope: !256)
!263 = !DILocation(line: 124, column: 34, scope: !256)
!264 = !{!261, !242, i64 8}
!265 = !DILocation(line: 125, column: 19, scope: !256)
!266 = !DILocation(line: 125, column: 34, scope: !256)
!267 = !{!261, !242, i64 16}
!268 = !DILocation(line: 126, column: 19, scope: !256)
!269 = !DILocation(line: 126, column: 34, scope: !256)
!270 = !{!261, !242, i64 24}
!271 = !DILocation(line: 127, column: 19, scope: !256)
!272 = !DILocation(line: 127, column: 34, scope: !256)
!273 = !{!261, !242, i64 32}
!274 = !DILocation(line: 128, column: 19, scope: !256)
!275 = !DILocation(line: 128, column: 34, scope: !256)
!276 = !{!261, !242, i64 40}
!277 = !DILocation(line: 131, column: 18, scope: !256)
!278 = !{!279, !279, i64 0}
!279 = !{!"int", !243, i64 0}
!280 = !DILocation(line: 132, column: 5, scope: !256)
!281 = !DILocation(line: 145, column: 3, scope: !69)
!282 = !DILocation(line: 573, column: 38, scope: !197)
!283 = !DILocation(line: 576, column: 3, scope: !197)
!284 = !DILocation(line: 604, column: 41, scope: !204)
!285 = !DILocation(line: 605, column: 42, scope: !204)
!286 = !DILocation(line: 606, column: 42, scope: !204)
!287 = !DILocation(line: 611, column: 3, scope: !204)
!288 = !DILocation(line: 615, column: 43, scope: !209)
!289 = !DILocation(line: 615, column: 51, scope: !209)
!290 = !DILocation(line: 619, column: 3, scope: !209)
!291 = !DILocation(line: 588, column: 42, scope: !200)
!292 = !DILocation(line: 588, column: 50, scope: !200)
!293 = !DILocation(line: 592, column: 3, scope: !200)
!294 = !DILocation(line: 175, column: 40, scope: !77)
!295 = !DILocation(line: 175, column: 54, scope: !77)
!296 = !DILocation(line: 181, column: 33, scope: !77)
!297 = !DILocation(line: 181, column: 12, scope: !77)
!298 = !DILocation(line: 182, column: 7, scope: !299)
!299 = distinct !DILexicalBlock(scope: !77, file: !1, line: 182, column: 7)
!300 = !DILocation(line: 182, column: 7, scope: !77)
!301 = !DILocation(line: 184, column: 13, scope: !302)
!302 = distinct !DILexicalBlock(scope: !299, file: !1, line: 183, column: 3)
