; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Malloc.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [19 x i8] c"Allocation error! \00", align 1
@totmem = internal unnamed_addr global i64 0, align 8
@pastmem = internal unnamed_addr global i64 0, align 8
@memfileDB = internal global %struct.cHandledData* null, align 8
@.str1 = private unnamed_addr constant [10 x i8] c"ticket_%d\00", align 1
@n_tickets = internal unnamed_addr global i32 0, align 4
@ticketDB = internal global %struct.cHandledData* null, align 8
@.str2 = private unnamed_addr constant [75 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Malloc.c\00", align 1
@.str3 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str4 = private unnamed_addr constant [44 x i8] c"CCTK_MemTicketCash: Cannot find ticket %d \0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !93, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Malloc.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !19, !20, !21, !28}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mallocinfo", file: !1, line: 78, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 71, size: 320, align: 64, elements: !9)
!9 = !{!10, !12, !13, !14, !16}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !8, file: !1, line: 73, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !8, file: !1, line: 74, baseType: !11, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !8, file: !1, line: 75, baseType: !11, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !8, file: !1, line: 76, baseType: !15, size: 32, align: 32, offset: 192)
!15 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !8, file: !1, line: 77, baseType: !17, size: 64, align: 64, offset: 256)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_memhash", file: !1, line: 64, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 59, size: 192, align: 64, elements: !24)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !23, file: !1, line: 61, baseType: !11, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "tsize", scope: !23, file: !1, line: 62, baseType: !11, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !23, file: !1, line: 63, baseType: !17, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_memticket", file: !1, line: 88, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 85, size: 64, align: 64, elements: !31)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !1, line: 87, baseType: !11, size: 64, align: 64)
!33 = !{!34, !37, !51, !61, !71, !80, !87, !90}
!34 = !DISubprogram(name: "CCTKi_version_util_Malloc_c", scope: !1, file: !1, line: 52, type: !35, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_util_Malloc_c, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!17}
!37 = !DISubprogram(name: "CCTKi_Malloc", scope: !1, file: !1, line: 131, type: !38, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i32, i8*)* @CCTKi_Malloc, variables: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!19, !40, !44, !17}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 30, baseType: !42)
!41 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !43, line: 92, baseType: !11)
!43 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !37, file: !1, line: 131, type: !40)
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !37, file: !1, line: 131, type: !44)
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !37, file: !1, line: 131, type: !17)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !37, file: !1, line: 133, type: !6)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !37, file: !1, line: 134, type: !4)
!51 = !DISubprogram(name: "CCTKi_UpdateMemByFile", scope: !1, file: !1, line: 346, type: !52, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i8*)* @CCTKi_UpdateMemByFile, variables: !54)
!52 = !DISubroutineType(types: !53)
!53 = !{!44, !44, !44, !17}
!54 = !{!55, !56, !57, !58, !59, !60}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !51, file: !1, line: 346, type: !44)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !51, file: !1, line: 346, type: !44)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !51, file: !1, line: 346, type: !17)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memfile", scope: !51, file: !1, line: 348, type: !21)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !51, file: !1, line: 349, type: !44)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !51, file: !1, line: 349, type: !44)
!61 = !DISubprogram(name: "CCTK_MemTicketRequest", scope: !1, file: !1, line: 413, type: !62, isLocal: false, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTK_MemTicketRequest, variables: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{!44}
!64 = !{!65, !66, !67}
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_ticket", scope: !61, file: !1, line: 415, type: !44)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmem", scope: !61, file: !1, line: 416, type: !28)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tname", scope: !61, file: !1, line: 417, type: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 20)
!71 = !DISubprogram(name: "CCTK_MemTicketCash", scope: !1, file: !1, line: 459, type: !72, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32)* @CCTK_MemTicketCash, variables: !75)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !44}
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !{!76, !77, !78, !79}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_ticket", arg: 1, scope: !71, file: !1, line: 459, type: !44)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tdiff", scope: !71, file: !1, line: 461, type: !74)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tsize", scope: !71, file: !1, line: 462, type: !11)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmem", scope: !71, file: !1, line: 463, type: !28)
!80 = !DISubprogram(name: "CCTK_MemTicketDelete", scope: !1, file: !1, line: 498, type: !81, isLocal: false, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CCTK_MemTicketDelete, variables: !83)
!81 = !DISubroutineType(types: !82)
!82 = !{!44, !44}
!83 = !{!84, !85, !86}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_ticket", arg: 1, scope: !80, file: !1, line: 498, type: !44)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret_val", scope: !80, file: !1, line: 500, type: !44)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmem", scope: !80, file: !1, line: 501, type: !28)
!87 = !DISubprogram(name: "CCTK_MemStat", scope: !1, file: !1, line: 534, type: !88, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @CCTK_MemStat, variables: !2)
!88 = !DISubroutineType(types: !89)
!89 = !{null}
!90 = !DISubprogram(name: "CCTK_TotalMemory", scope: !1, file: !1, line: 555, type: !91, isLocal: false, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @CCTK_TotalMemory, variables: !2)
!91 = !DISubroutineType(types: !92)
!92 = !{!11}
!93 = !{!94, !95, !96, !97, !113, !114}
!94 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 50, type: !17, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "totmem", scope: !0, file: !1, line: 100, type: !11, isLocal: true, isDefinition: true, variable: i64* @totmem)
!96 = !DIGlobalVariable(name: "pastmem", scope: !0, file: !1, line: 101, type: !11, isLocal: true, isDefinition: true, variable: i64* @pastmem)
!97 = !DIGlobalVariable(name: "memfileDB", scope: !0, file: !1, line: 96, type: !98, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @memfileDB)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !100, line: 28, baseType: !101)
!100 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 23, size: 128, align: 64, elements: !102)
!102 = !{!103, !111, !112}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !101, file: !100, line: 25, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !100, line: 21, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 16, size: 192, align: 64, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !106, file: !100, line: 18, baseType: !15, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !100, line: 19, baseType: !4, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !100, line: 20, baseType: !19, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !101, file: !100, line: 26, baseType: !15, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !101, file: !100, line: 27, baseType: !15, size: 32, align: 32, offset: 96)
!113 = !DIGlobalVariable(name: "n_tickets", scope: !0, file: !1, line: 98, type: !44, isLocal: true, isDefinition: true, variable: i32* @n_tickets)
!114 = !DIGlobalVariable(name: "ticketDB", scope: !0, file: !1, line: 95, type: !98, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @ticketDB)
!115 = !{i32 2, !"Dwarf Version", i32 2}
!116 = !{i32 2, !"Debug Info Version", i32 700000003}
!117 = !{i32 1, !"PIC Level", i32 2}
!118 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!119 = !DILocation(line: 52, column: 1, scope: !34)
!120 = !DIExpression()
!121 = !DILocation(line: 131, column: 27, scope: !37)
!122 = !DILocation(line: 131, column: 37, scope: !37)
!123 = !DILocation(line: 131, column: 55, scope: !37)
!124 = !DILocation(line: 136, column: 28, scope: !37)
!125 = !DILocation(line: 136, column: 17, scope: !37)
!126 = !DILocation(line: 134, column: 9, scope: !37)
!127 = !DILocation(line: 137, column: 7, scope: !128)
!128 = distinct !DILexicalBlock(scope: !37, file: !1, line: 137, column: 6)
!129 = !DILocation(line: 137, column: 6, scope: !37)
!130 = !DILocation(line: 139, column: 13, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !1, line: 138, column: 3)
!132 = !{!133, !133, i64 0}
!133 = !{!"any pointer", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !DILocation(line: 139, column: 5, scope: !131)
!137 = !DILocation(line: 140, column: 3, scope: !131)
!138 = !DILocation(line: 142, column: 9, scope: !37)
!139 = !DILocation(line: 142, column: 14, scope: !37)
!140 = !{!141, !142, i64 0}
!141 = !{!"", !142, i64 0, !142, i64 8, !142, i64 16, !143, i64 24, !133, i64 32}
!142 = !{!"long", !134, i64 0}
!143 = !{!"int", !134, i64 0}
!144 = !DILocation(line: 143, column: 9, scope: !37)
!145 = !DILocation(line: 143, column: 14, scope: !37)
!146 = !{!141, !142, i64 8}
!147 = !DILocation(line: 144, column: 9, scope: !37)
!148 = !DILocation(line: 144, column: 14, scope: !37)
!149 = !{!141, !142, i64 16}
!150 = !DILocation(line: 145, column: 9, scope: !37)
!151 = !DILocation(line: 145, column: 14, scope: !37)
!152 = !{!141, !143, i64 24}
!153 = !DILocation(line: 146, column: 9, scope: !37)
!154 = !DILocation(line: 146, column: 14, scope: !37)
!155 = !{!141, !133, i64 32}
!156 = !DILocation(line: 148, column: 13, scope: !37)
!157 = !{!142, !142, i64 0}
!158 = !DILocation(line: 148, column: 11, scope: !37)
!159 = !DILocation(line: 149, column: 10, scope: !37)
!160 = !DILocation(line: 165, column: 22, scope: !37)
!161 = !DILocation(line: 165, column: 3, scope: !37)
!162 = !DILocation(line: 355, column: 47, scope: !163)
!163 = distinct !DILexicalBlock(scope: !51, file: !1, line: 355, column: 7)
!164 = !DILocation(line: 346, column: 31, scope: !51)
!165 = !DILocation(line: 346, column: 41, scope: !51)
!166 = !DILocation(line: 346, column: 59, scope: !51)
!167 = !DILocation(line: 349, column: 15, scope: !51)
!168 = !DILocation(line: 355, column: 30, scope: !163)
!169 = !DILocation(line: 355, column: 15, scope: !163)
!170 = !DILocation(line: 349, column: 7, scope: !51)
!171 = !DILocation(line: 355, column: 66, scope: !163)
!172 = !DILocation(line: 355, column: 7, scope: !51)
!173 = !DILocation(line: 357, column: 48, scope: !174)
!174 = distinct !DILexicalBlock(scope: !163, file: !1, line: 356, column: 3)
!175 = !DILocation(line: 357, column: 28, scope: !174)
!176 = !DILocation(line: 357, column: 13, scope: !174)
!177 = !DILocation(line: 360, column: 9, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !1, line: 360, column: 9)
!179 = !DILocation(line: 360, column: 9, scope: !174)
!180 = !DILocation(line: 362, column: 23, scope: !181)
!181 = distinct !DILexicalBlock(scope: !178, file: !1, line: 361, column: 5)
!182 = !DILocation(line: 362, column: 21, scope: !181)
!183 = !DILocation(line: 365, column: 5, scope: !181)
