; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/Mapping.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.hslab_mapping_t = type { i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32, i32, void (i8*, i8*, i32, i32, i32)*, %struct.hslab_mapping_t*, %struct.hslab_mapping_t*, %struct.cGroup }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }

@.str = private unnamed_addr constant [78 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/Mapping.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !160, globals: !252, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/Mapping.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !11, !79, !80, !24, !125}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !7, line: 81, baseType: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !7, line: 13, size: 1152, align: 64, elements: !9)
!9 = !{!10, !12, !14, !15, !16, !17, !18, !19, !22, !23, !25, !26, !27, !29, !30, !31, !32, !33, !34, !35, !36, !37, !66, !76}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !8, file: !7, line: 17, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !8, file: !7, line: 18, baseType: !13, size: 32, align: 32, offset: 64)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !8, file: !7, line: 21, baseType: !13, size: 32, align: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !8, file: !7, line: 22, baseType: !13, size: 32, align: 32, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !8, file: !7, line: 23, baseType: !13, size: 32, align: 32, offset: 160)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !8, file: !7, line: 27, baseType: !13, size: 32, align: 32, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !8, file: !7, line: 28, baseType: !13, size: 32, align: 32, offset: 224)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !8, file: !7, line: 29, baseType: !20, size: 64, align: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !8, file: !7, line: 32, baseType: !13, size: 32, align: 32, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !8, file: !7, line: 34, baseType: !24, size: 64, align: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !8, file: !7, line: 35, baseType: !13, size: 32, align: 32, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !8, file: !7, line: 37, baseType: !13, size: 32, align: 32, offset: 480)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !8, file: !7, line: 41, baseType: !28, size: 64, align: 64, offset: 512)
!28 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !8, file: !7, line: 41, baseType: !28, size: 64, align: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !8, file: !7, line: 41, baseType: !28, size: 64, align: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !8, file: !7, line: 41, baseType: !28, size: 64, align: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !8, file: !7, line: 44, baseType: !13, size: 32, align: 32, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !8, file: !7, line: 45, baseType: !13, size: 32, align: 32, offset: 800)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !8, file: !7, line: 46, baseType: !13, size: 32, align: 32, offset: 832)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !8, file: !7, line: 49, baseType: !13, size: 32, align: 32, offset: 864)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !8, file: !7, line: 53, baseType: !13, size: 32, align: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !8, file: !7, line: 76, baseType: !38, size: 64, align: 64, offset: 960)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !41, line: 72, baseType: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !41, line: 37, size: 2368, align: 64, elements: !43)
!43 = !{!44, !45, !46, !47, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !63, !65}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !42, file: !41, line: 39, baseType: !13, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !42, file: !41, line: 41, baseType: !24, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !42, file: !41, line: 44, baseType: !28, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !42, file: !41, line: 45, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !42, file: !41, line: 46, baseType: !48, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !42, file: !41, line: 47, baseType: !24, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !42, file: !41, line: 49, baseType: !24, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !42, file: !41, line: 50, baseType: !13, size: 32, align: 32, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !42, file: !41, line: 51, baseType: !24, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !42, file: !41, line: 52, baseType: !48, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !42, file: !41, line: 55, baseType: !24, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !42, file: !41, line: 56, baseType: !24, size: 64, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !42, file: !41, line: 59, baseType: !24, size: 64, align: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !42, file: !41, line: 60, baseType: !59, size: 512, align: 64, offset: 832)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DISubrange(count: 4)
!62 = !DISubrange(count: 2)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !42, file: !41, line: 64, baseType: !64, size: 512, align: 64, offset: 1344)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, align: 64, elements: !60)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !42, file: !41, line: 68, baseType: !64, size: 512, align: 64, offset: 1856)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !8, file: !7, line: 77, baseType: !67, size: 64, align: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !41, line: 29, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !41, line: 23, size: 256, align: 64, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !70, file: !41, line: 25, baseType: !13, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !70, file: !41, line: 26, baseType: !24, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !70, file: !41, line: 27, baseType: !48, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !70, file: !41, line: 28, baseType: !24, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !8, file: !7, line: 79, baseType: !77, size: 64, align: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "hslab_mapping_t", file: !82, line: 45, baseType: !83)
!82 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/PUGHSlabi.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "hslab_mapping_t", file: !82, line: 24, size: 1280, align: 64, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !109, !111, !112}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !83, file: !82, line: 26, baseType: !13, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "target_proc", scope: !83, file: !82, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "hdim", scope: !83, file: !82, line: 28, baseType: !79, size: 32, align: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "vdim", scope: !83, file: !82, line: 29, baseType: !79, size: 32, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vectors", scope: !83, file: !82, line: 30, baseType: !24, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "local_startpoint", scope: !83, file: !82, line: 31, baseType: !24, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "local_endpoint", scope: !83, file: !82, line: 32, baseType: !24, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "global_startpoint", scope: !83, file: !82, line: 33, baseType: !24, size: 64, align: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "global_endpoint", scope: !83, file: !82, line: 34, baseType: !24, size: 64, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "do_dir", scope: !83, file: !82, line: 35, baseType: !24, size: 64, align: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "downsample", scope: !83, file: !82, line: 36, baseType: !24, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "global_hsize", scope: !83, file: !82, line: 37, baseType: !24, size: 64, align: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "local_hsize", scope: !83, file: !82, line: 38, baseType: !24, size: 64, align: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "totals", scope: !83, file: !82, line: 39, baseType: !79, size: 32, align: 32, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "is_full_hyperslab", scope: !83, file: !82, line: 40, baseType: !13, size: 32, align: 32, offset: 736)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "is_diagonal_in_3D", scope: !83, file: !82, line: 41, baseType: !13, size: 32, align: 32, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "conversion_fn", scope: !83, file: !82, line: 42, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hslabConversionFn", file: !103, line: 21, baseType: !104)
!103 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/PUGHSlab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !11, !13, !13, !13}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !82, line: 43, baseType: !110, size: 64, align: 64, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !82, line: 43, baseType: !110, size: 64, align: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "vinfo", scope: !83, file: !82, line: 44, baseType: !113, size: 256, align: 32, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !114, line: 24, baseType: !115)
!114 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 14, size: 256, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !115, file: !114, line: 16, baseType: !13, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !115, file: !114, line: 17, baseType: !13, size: 32, align: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !115, file: !114, line: 18, baseType: !13, size: 32, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !115, file: !114, line: 19, baseType: !13, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !115, file: !114, line: 20, baseType: !13, size: 32, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !115, file: !114, line: 21, baseType: !13, size: 32, align: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !115, file: !114, line: 22, baseType: !13, size: 32, align: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !115, file: !114, line: 23, baseType: !13, size: 32, align: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !41, line: 126, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !41, line: 96, size: 832, align: 64, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !155, !156, !157, !158}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !41, line: 98, baseType: !77, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !41, line: 99, baseType: !13, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !128, file: !41, line: 100, baseType: !13, size: 32, align: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !128, file: !41, line: 101, baseType: !11, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !41, line: 102, baseType: !11, size: 64, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !128, file: !41, line: 103, baseType: !13, size: 32, align: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !128, file: !41, line: 104, baseType: !13, size: 32, align: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !128, file: !41, line: 106, baseType: !11, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !128, file: !41, line: 114, baseType: !13, size: 32, align: 32, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !128, file: !41, line: 115, baseType: !13, size: 32, align: 32, offset: 416)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !128, file: !41, line: 117, baseType: !39, size: 64, align: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !128, file: !41, line: 118, baseType: !68, size: 64, align: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !128, file: !41, line: 120, baseType: !143, size: 64, align: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !41, line: 94, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !41, line: 74, size: 448, align: 64, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !145, file: !41, line: 77, baseType: !24, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !145, file: !41, line: 78, baseType: !21, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !145, file: !41, line: 79, baseType: !21, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !145, file: !41, line: 80, baseType: !13, size: 32, align: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !145, file: !41, line: 82, baseType: !24, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !145, file: !41, line: 84, baseType: !13, size: 32, align: 32, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !145, file: !41, line: 85, baseType: !13, size: 32, align: 32, offset: 352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !145, file: !41, line: 86, baseType: !13, size: 32, align: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !128, file: !41, line: 121, baseType: !143, size: 64, align: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !128, file: !41, line: 123, baseType: !13, size: 32, align: 32, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !128, file: !41, line: 124, baseType: !13, size: 32, align: 32, offset: 736)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !128, file: !41, line: 125, baseType: !159, size: 64, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!160 = !{!161, !166, !228, !234, !240}
!161 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGHSlab_Mapping_c", scope: !1, file: !1, line: 27, type: !162, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGHSlab_Mapping_c, variables: !2)
!162 = !DISubroutineType(types: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!166 = !DISubprogram(name: "Hyperslab_DefineGlobalMappingByIndex", scope: !1, file: !1, line: 66, type: !167, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32*, i32*, i32*, i32, i32, void (i8*, i8*, i32, i32, i32)*, i32*)* @Hyperslab_DefineGlobalMappingByIndex, variables: !204)
!167 = !DISubroutineType(types: !168)
!168 = !{!13, !169, !13, !13, !202, !202, !202, !202, !13, !13, !102, !24}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !172, line: 75, baseType: !173)
!172 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHSlab/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 24, size: 1216, align: 64, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !173, file: !172, line: 26, baseType: !13, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !173, file: !172, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !173, file: !172, line: 30, baseType: !24, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !173, file: !172, line: 31, baseType: !24, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !173, file: !172, line: 32, baseType: !24, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !173, file: !172, line: 33, baseType: !24, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !173, file: !172, line: 36, baseType: !24, size: 64, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !173, file: !172, line: 39, baseType: !24, size: 64, align: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !173, file: !172, line: 40, baseType: !24, size: 64, align: 64, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !173, file: !172, line: 43, baseType: !28, size: 64, align: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !173, file: !172, line: 44, baseType: !186, size: 64, align: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !173, file: !172, line: 47, baseType: !186, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !173, file: !172, line: 51, baseType: !24, size: 64, align: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !173, file: !172, line: 54, baseType: !24, size: 64, align: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !173, file: !172, line: 57, baseType: !13, size: 32, align: 32, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !173, file: !172, line: 60, baseType: !24, size: 64, align: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !173, file: !172, line: 63, baseType: !28, size: 64, align: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !172, line: 67, baseType: !20, size: 64, align: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !173, file: !172, line: 70, baseType: !21, size: 64, align: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !173, file: !172, line: 73, baseType: !196, size: 64, align: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !172, line: 22, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 18, size: 16, align: 8, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !198, file: !172, line: 20, baseType: !78, size: 8, align: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !198, file: !172, line: 21, baseType: !78, size: 8, align: 8, offset: 8)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !166, file: !1, line: 67, type: !169)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !166, file: !1, line: 68, type: !13)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !166, file: !1, line: 69, type: !13)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 4, scope: !166, file: !1, line: 70, type: !202)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 5, scope: !166, file: !1, line: 71, type: !202)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "extent", arg: 6, scope: !166, file: !1, line: 72, type: !202)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "downsample", arg: 7, scope: !166, file: !1, line: 73, type: !202)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "table_handle", arg: 8, scope: !166, file: !1, line: 74, type: !13)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target_proc", arg: 9, scope: !166, file: !1, line: 75, type: !13)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "conversion_fn", arg: 10, scope: !166, file: !1, line: 76, type: !102)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hsize", arg: 11, scope: !166, file: !1, line: 77, type: !24)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vdim", scope: !166, file: !1, line: 79, type: !79)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hdim", scope: !166, file: !1, line: 79, type: !79)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_dirs", scope: !166, file: !1, line: 79, type: !79)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !166, file: !1, line: 80, type: !13)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagger_index", scope: !166, file: !1, line: 81, type: !13)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !166, file: !1, line: 82, type: !13)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npoints", scope: !166, file: !1, line: 83, type: !13)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !166, file: !1, line: 84, type: !80)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_msg", scope: !166, file: !1, line: 85, type: !164)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !166, file: !1, line: 86, type: !4)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GA", scope: !166, file: !1, line: 87, type: !125)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vinfo", scope: !166, file: !1, line: 88, type: !113)
!228 = !DISubprogram(name: "Hyperslab_FreeMapping", scope: !1, file: !1, line: 502, type: !229, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @Hyperslab_FreeMapping, variables: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{!13, !13}
!231 = !{!232, !233}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapping_handle", arg: 1, scope: !228, file: !1, line: 502, type: !13)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !228, file: !1, line: 504, type: !80)
!234 = !DISubprogram(name: "PUGHSlabi_GetMapping", scope: !1, file: !1, line: 538, type: !235, isLocal: false, isDefinition: true, scopeLine: 539, flags: DIFlagPrototyped, isOptimized: true, function: %struct.hslab_mapping_t* (i32)* @PUGHSlabi_GetMapping, variables: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{!80, !13}
!237 = !{!238, !239}
