; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Misc.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.regmatch_t = type { i32, i32 }
%struct.re_pattern_buffer = type { i8*, i64, i64, i64, i8*, i8*, i64, i8 }

@.str = private unnamed_addr constant [73 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Misc.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [43 x i8] c"CCTK_Equals: First string null (2nd is %s)\00", align 1
@.str3 = private unnamed_addr constant [44 x i8] c"CCTK_Equals: Second string null (1st is %s)\00", align 1
@.str4 = private unnamed_addr constant [31 x i8] c"CCTK_Equals: Both strings null\00", align 1
@.str5 = private unnamed_addr constant [106 x i8] c"Null Terminating a string with length %d !!\0AThis is probably an error in calling a C routine from Fortran\00", align 1
@.str6 = private unnamed_addr constant [50 x i8] c"(\5C[|\5C()?([^]):]*):?([^]):]*)?:?([^]):]*)?(\5C]|\5C))?\00", align 1
@.str7 = private unnamed_addr constant [6 x i8] c"Flesh\00", align 1
@.str8 = private unnamed_addr constant [14 x i8] c"Invalid range\00", align 1
@.str9 = private unnamed_addr constant [5 x i8] c"true\00", align 1
@.str10 = private unnamed_addr constant [2 x i8] c"t\00", align 1

!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Misc.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 30, baseType: !8)
!7 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !9, line: 92, baseType: !10)
!9 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !{!12, !17, !25, !36, !45, !69, !92, !103, !113, !123, !141, !154, !166, !175, !182, !189, !222, !227, !232}
!12 = !DISubprogram(name: "CCTKi_version_util_Misc_c", scope: !1, file: !1, line: 40, type: !13, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_util_Misc_c, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!17 = !DISubprogram(name: "CCTK_Equals", scope: !1, file: !1, line: 116, type: !18, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @CCTK_Equals, variables: !21)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !15, !15}
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !{!22, !23, !24}
!22 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string1", arg: 1, scope: !17, file: !1, line: 116, type: !15)
!23 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string2", arg: 2, scope: !17, file: !1, line: 116, type: !15)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !17, file: !1, line: 118, type: !20)
!25 = !DISubprogram(name: "cctk_equals_", scope: !1, file: !1, line: 153, type: !26, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, i8*, i32)* @cctk_equals_, variables: !30)
!26 = !DISubroutineType(types: !27)
!27 = !{!20, !28, !4, !29}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !{!31, !32, !33, !34, !35}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg1", arg: 1, scope: !25, file: !1, line: 154, type: !28)
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 2, scope: !25, file: !1, line: 154, type: !4)
!33 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 3, scope: !25, file: !1, line: 154, type: !29)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !25, file: !1, line: 156, type: !20)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg2", scope: !25, file: !1, line: 157, type: !4)
!36 = !DISubprogram(name: "Util_NullTerminateString", scope: !1, file: !1, line: 197, type: !37, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @Util_NullTerminateString, variables: !39)
!37 = !DISubroutineType(types: !38)
!38 = !{!4, !15, !29}
!39 = !{!40, !41, !42, !43, !44}
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "instring", arg: 1, scope: !36, file: !1, line: 197, type: !15)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !36, file: !1, line: 197, type: !29)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outstring", scope: !36, file: !1, line: 199, type: !4)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !36, file: !1, line: 200, type: !29)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "position", scope: !36, file: !1, line: 201, type: !29)
!45 = !DISubprogram(name: "Util_InList", scope: !1, file: !1, line: 275, type: !46, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, ...)* @Util_InList, variables: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{!20, !15, !20, null}
!48 = !{!49, !50, !51, !52, !53, !68}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string1", arg: 1, scope: !45, file: !1, line: 275, type: !15)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 2, scope: !45, file: !1, line: 275, type: !20)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !45, file: !1, line: 277, type: !20)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !45, file: !1, line: 278, type: !20)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !45, file: !1, line: 279, type: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !55, line: 30, baseType: !56)
!55 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stdarg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 279, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, align: 64, elements: !66)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 279, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 279, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !63, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !59, file: !1, line: 279, baseType: !29, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !59, file: !1, line: 279, baseType: !29, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !59, file: !1, line: 279, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !59, file: !1, line: 279, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !{!67}
!67 = !DISubrange(count: 1)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !45, file: !1, line: 281, type: !4)
!69 = !DISubprogram(name: "Util_IntInRange", scope: !1, file: !1, line: 340, type: !70, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*)* @Util_IntInRange, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!20, !20, !15}
!72 = !{!73, !74, !75, !76, !87, !88, !89, !90, !91}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inval", arg: 1, scope: !69, file: !1, line: 340, type: !20)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range", arg: 2, scope: !69, file: !1, line: 340, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !69, file: !1, line: 342, type: !20)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmatch", scope: !69, file: !1, line: 343, type: !77)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 384, align: 32, elements: !85)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_t", file: !79, line: 422, baseType: !80)
!79 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/regex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 418, size: 64, align: 32, elements: !81)
!81 = !{!82, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !80, file: !79, line: 420, baseType: !83, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !79, line: 394, baseType: !20)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !80, file: !79, line: 421, baseType: !83, size: 32, align: 32, offset: 32)
!85 = !{!86}
!86 = !DISubrange(count: 6)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_closed", scope: !69, file: !1, line: 344, type: !20)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_closed", scope: !69, file: !1, line: 344, type: !20)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !69, file: !1, line: 345, type: !20)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !69, file: !1, line: 345, type: !20)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !69, file: !1, line: 345, type: !20)
!92 = !DISubprogram(name: "Util_DoubleInRange", scope: !1, file: !1, line: 484, type: !93, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i8*)* @Util_DoubleInRange, variables: !96)
!93 = !DISubroutineType(types: !94)
!94 = !{!20, !95, !15}
!95 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!96 = !{!97, !98, !99, !100, !101, !102}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inval", arg: 1, scope: !92, file: !1, line: 484, type: !95)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range", arg: 2, scope: !92, file: !1, line: 484, type: !15)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !92, file: !1, line: 486, type: !20)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmatch", scope: !92, file: !1, line: 487, type: !77)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !92, file: !1, line: 488, type: !95)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !92, file: !1, line: 488, type: !95)
!103 = !DISubprogram(name: "Util_IntInRangeList", scope: !1, file: !1, line: 643, type: !104, isLocal: false, isDefinition: true, scopeLine: 644, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, ...)* @Util_IntInRangeList, variables: !106)
!104 = !DISubroutineType(types: !105)
!105 = !{!20, !20, !20, null}
!106 = !{!107, !108, !109, !110, !111, !112}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inval", arg: 1, scope: !103, file: !1, line: 643, type: !20)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 2, scope: !103, file: !1, line: 643, type: !20)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !103, file: !1, line: 645, type: !20)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !103, file: !1, line: 646, type: !20)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !103, file: !1, line: 647, type: !54)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !103, file: !1, line: 649, type: !4)
!113 = !DISubprogram(name: "Util_DoubleInRangeList", scope: !1, file: !1, line: 715, type: !114, isLocal: false, isDefinition: true, scopeLine: 716, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i32, ...)* @Util_DoubleInRangeList, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{!20, !95, !20, null}
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inval", arg: 1, scope: !113, file: !1, line: 715, type: !95)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 2, scope: !113, file: !1, line: 715, type: !20)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !113, file: !1, line: 717, type: !20)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !113, file: !1, line: 718, type: !20)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !113, file: !1, line: 719, type: !54)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !113, file: !1, line: 721, type: !4)
!123 = !DISubprogram(name: "CCTK_SetDoubleInRangeList", scope: !1, file: !1, line: 795, type: !124, isLocal: false, isDefinition: true, scopeLine: 797, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double*, i8*, i32, ...)* @CCTK_SetDoubleInRangeList, variables: !127)
!124 = !DISubroutineType(types: !125)
!125 = !{!20, !126, !15, !20, null}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!127 = !{!128, !129, !130, !131, !132, !136, !137, !138, !139, !140}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !123, file: !1, line: 795, type: !126)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !123, file: !1, line: 795, type: !15)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 3, scope: !123, file: !1, line: 796, type: !20)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !123, file: !1, line: 798, type: !20)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !123, file: !1, line: 799, type: !133)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8008, align: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1001)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !123, file: !1, line: 800, type: !29)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !123, file: !1, line: 801, type: !20)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !123, file: !1, line: 802, type: !54)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !123, file: !1, line: 804, type: !4)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inval", scope: !123, file: !1, line: 806, type: !95)
!141 = !DISubprogram(name: "CCTK_SetIntInRangeList", scope: !1, file: !1, line: 897, type: !142, isLocal: false, isDefinition: true, scopeLine: 899, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i8*, i32, ...)* @CCTK_SetIntInRangeList, variables: !145)
!142 = !DISubroutineType(types: !143)
!143 = !{!20, !144, !15, !20, null}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !141, file: !1, line: 897, type: !144)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !141, file: !1, line: 897, type: !15)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 3, scope: !141, file: !1, line: 898, type: !20)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !141, file: !1, line: 900, type: !20)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !141, file: !1, line: 901, type: !20)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !141, file: !1, line: 902, type: !54)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !141, file: !1, line: 904, type: !4)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inval", scope: !141, file: !1, line: 906, type: !20)
!154 = !DISubprogram(name: "CCTK_SetKeywordInRangeList", scope: !1, file: !1, line: 983, type: !155, isLocal: false, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, i8*, i32, ...)* @CCTK_SetKeywordInRangeList, variables: !158)
!155 = !DISubroutineType(types: !156)
!156 = !{!20, !157, !15, !20, null}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!158 = !{!159, !160, !161, !162, !163, !164, !165}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !154, file: !1, line: 983, type: !157)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !154, file: !1, line: 983, type: !15)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 3, scope: !154, file: !1, line: 984, type: !20)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !154, file: !1, line: 986, type: !20)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !154, file: !1, line: 987, type: !20)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !154, file: !1, line: 988, type: !54)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !154, file: !1, line: 990, type: !4)
!166 = !DISubprogram(name: "CCTK_SetStringInRegexList", scope: !1, file: !1, line: 1073, type: !155, isLocal: false, isDefinition: true, scopeLine: 1075, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, i8*, i32, ...)* @CCTK_SetStringInRegexList, variables: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !166, file: !1, line: 1073, type: !157)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !166, file: !1, line: 1073, type: !15)
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_elements", arg: 3, scope: !166, file: !1, line: 1074, type: !20)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !166, file: !1, line: 1076, type: !20)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !166, file: !1, line: 1077, type: !20)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !166, file: !1, line: 1078, type: !54)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !166, file: !1, line: 1080, type: !4)
!175 = !DISubprogram(name: "CCTK_SetString", scope: !1, file: !1, line: 1136, type: !176, isLocal: false, isDefinition: true, scopeLine: 1137, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, i8*)* @CCTK_SetString, variables: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{!20, !157, !15}
!178 = !{!179, !180, !181}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !175, file: !1, line: 1136, type: !157)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !175, file: !1, line: 1136, type: !15)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !175, file: !1, line: 1138, type: !20)
!182 = !DISubprogram(name: "CCTK_SetBoolean", scope: !1, file: !1, line: 1192, type: !183, isLocal: false, isDefinition: true, scopeLine: 1193, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i8*)* @CCTK_SetBoolean, variables: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{!20, !144, !15}
!185 = !{!186, !187, !188}
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !182, file: !1, line: 1192, type: !144)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !182, file: !1, line: 1192, type: !15)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !182, file: !1, line: 1194, type: !20)
!189 = !DISubprogram(name: "CCTK_RegexMatch", scope: !1, file: !1, line: 1266, type: !190, isLocal: false, isDefinition: true, scopeLine: 1270, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i32, %struct.regmatch_t*)* @CCTK_RegexMatch, variables: !194)
!190 = !DISubroutineType(types: !191)
!191 = !{!20, !15, !15, !192, !193}
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!194 = !{!195, !196, !197, !198, !199, !200, !201}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string", arg: 1, scope: !189, file: !1, line: 1266, type: !15)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pattern", arg: 2, scope: !189, file: !1, line: 1267, type: !15)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmatch", arg: 3, scope: !189, file: !1, line: 1268, type: !192)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmatch", arg: 4, scope: !189, file: !1, line: 1269, type: !193)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !189, file: !1, line: 1271, type: !20)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !189, file: !1, line: 1272, type: !20)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "re", scope: !189, file: !1, line: 1273, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !79, line: 391, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !79, line: 323, size: 512, align: 64, elements: !204)
!204 = !{!205, !208, !209, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !203, file: !79, line: 329, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !203, file: !79, line: 332, baseType: !10, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !203, file: !79, line: 335, baseType: !10, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !203, file: !79, line: 338, baseType: !211, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !79, line: 52, baseType: !10)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !203, file: !79, line: 343, baseType: !4, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !203, file: !79, line: 349, baseType: !4, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !203, file: !79, line: 352, baseType: !6, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !203, file: !79, line: 359, baseType: !29, size: 1, align: 32, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !203, file: !79, line: 368, baseType: !29, size: 2, align: 32, offset: 449)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !203, file: !79, line: 372, baseType: !29, size: 1, align: 32, offset: 451)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !203, file: !79, line: 376, baseType: !29, size: 1, align: 32, offset: 452)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !203, file: !79, line: 380, baseType: !29, size: 1, align: 32, offset: 453)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !203, file: !79, line: 383, baseType: !29, size: 1, align: 32, offset: 454)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !203, file: !79, line: 386, baseType: !29, size: 1, align: 32, offset: 455)
!222 = !DISubprogram(name: "CCTK_PrintString", scope: !1, file: !1, line: 1317, type: !223, isLocal: false, isDefinition: true, scopeLine: 1318, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @CCTK_PrintString, variables: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !15}
!225 = !{!226}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !222, file: !1, line: 1317, type: !15)
!227 = !DISubprogram(name: "cctk_printstring_", scope: !1, file: !1, line: 1322, type: !228, isLocal: false, isDefinition: true, scopeLine: 1324, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**)* @cctk_printstring_, variables: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !28}
!230 = !{!231}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg1", arg: 1, scope: !227, file: !1, line: 1323, type: !28)
!232 = !DISubprogram(name: "cctk_fortranstring_", scope: !1, file: !1, line: 1357, type: !233, isLocal: false, isDefinition: true, scopeLine: 1361, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8**, i8*, i32)* @cctk_fortranstring_, variables: !237)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !144, !235, !4, !29}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!237 = !{!238, !239, !240, !241, !242, !243, !244}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nchars", arg: 1, scope: !232, file: !1, line: 1358, type: !144)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c_string", arg: 2, scope: !232, file: !1, line: 1359, type: !235)
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 3, scope: !232, file: !1, line: 1360, type: !4)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 4, scope: !232, file: !1, line: 1360, type: !29)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_strlen", scope: !232, file: !1, line: 1362, type: !6)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fstring", scope: !232, file: !1, line: 1363, type: !4)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fortran_string", scope: !232, file: !1, line: 1364, type: !4)
!245 = !{!246}
!246 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 38, type: !15, isLocal: true, isDefinition: true)
!247 = !{i32 2, !"Dwarf Version", i32 2}
!248 = !{i32 2, !"Debug Info Version", i32 700000003}
!249 = !{i32 1, !"PIC Level", i32 2}
!250 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!251 = !DILocation(line: 40, column: 1, scope: !12)
!252 = !DIExpression()
!253 = !DILocation(line: 116, column: 29, scope: !17)
!254 = !DILocation(line: 116, column: 50, scope: !17)
!255 = !DILocation(line: 118, column: 7, scope: !17)
!256 = !DILocation(line: 123, column: 8, scope: !257)
!257 = distinct !DILexicalBlock(scope: !17, file: !1, line: 123, column: 7)
!258 = !DILocation(line: 123, column: 20, scope: !257)
!259 = !DILocation(line: 123, column: 16, scope: !257)
!260 = !DILocation(line: 126, column: 10, scope: !261)
!261 = distinct !DILexicalBlock(scope: !262, file: !1, line: 126, column: 9)
!262 = distinct !DILexicalBlock(scope: !257, file: !1, line: 124, column: 3)
!263 = !DILocation(line: 126, column: 18, scope: !261)
!264 = !DILocation(line: 128, column: 7, scope: !265)
!265 = distinct !DILexicalBlock(scope: !261, file: !1, line: 127, column: 5)
!266 = !DILocation(line: 131, column: 5, scope: !265)
!267 = !DILocation(line: 132, column: 22, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !1, line: 132, column: 14)
!269 = !DILocation(line: 134, column: 7, scope: !270)
!270 = distinct !DILexicalBlock(scope: !268, file: !1, line: 133, column: 5)
!271 = !DILocation(line: 136, column: 5, scope: !270)
!272 = !DILocation(line: 139, column: 7, scope: !273)
