; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Names.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.T_HASH = type { i32, i32, i32, %struct.T_HASH_ENTRY** }
%struct.T_HASH_ENTRY = type { %struct.T_HASH_ENTRY*, %struct.T_HASH_ENTRY*, i32, i32, i8*, i8* }

@GroupData = internal unnamed_addr global %struct.T_HASH* null, align 8
@VariableData = internal unnamed_addr global %struct.T_HASH* null, align 8
@.str = private unnamed_addr constant [81 x i8] c"$Header: /cactus/Cactus/src/main/Names.c,v 1.4 2001/05/10 12:35:13 goodale Exp $\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_main_Names_c() #0 {
  ret i8* getelementptr inbounds ([81 x i8]* @.str, i64 0, i64 0), !dbg !109
}

; Function Attrs: nounwind optsize ssp uwtable
define i32 @CCTKi_NamesStoreGroup(i8* %gname, i32 %gnum) #1 {
  tail call void @llvm.dbg.value(metadata i8* %gname, i64 0, metadata !27, metadata !110), !dbg !111
  tail call void @llvm.dbg.value(metadata i32 %gnum, i64 0, metadata !28, metadata !110), !dbg !112
  %1 = load %struct.T_HASH** @GroupData, align 8, !dbg !113, !tbaa !115
  %2 = icmp eq %struct.T_HASH* %1, null, !dbg !113
  br i1 %2, label %3, label %5, !dbg !119

; <label>:3                                       ; preds = %0
  %4 = tail call %struct.T_HASH* @Util_HashCreate(i32 64) #6, !dbg !120

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !78, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Names.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "iGroupData", file: !1, line: 33, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "IGroupData", file: !1, line: 30, size: 32, align: 32, elements: !7)
!7 = !{!8}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "gnum", scope: !6, file: !1, line: 32, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "iVariableData", file: !1, line: 39, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "IVariableData", file: !1, line: 35, size: 64, align: 32, elements: !13)
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "vnum", scope: !12, file: !1, line: 37, baseType: !9, size: 32, align: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "gnum", scope: !12, file: !1, line: 38, baseType: !9, size: 32, align: 32, offset: 32)
!16 = !{!17, !23, !33, !43, !53, !63, !72}
!17 = !DISubprogram(name: "CCTKi_version_main_Names_c", scope: !1, file: !1, line: 24, type: !18, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_Names_c, variables: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !DISubprogram(name: "CCTKi_NamesStoreGroup", scope: !1, file: !1, line: 96, type: !24, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @CCTKi_NamesStoreGroup, variables: !26)
!24 = !DISubroutineType(types: !25)
!25 = !{!9, !20, !9}
!26 = !{!27, !28, !29, !30, !32}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 1, scope: !23, file: !1, line: 96, type: !20)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnum", arg: 2, scope: !23, file: !1, line: 96, type: !9)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !23, file: !1, line: 98, type: !9)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !23, file: !1, line: 100, type: !31)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !23, file: !1, line: 102, type: !4)
!33 = !DISubprogram(name: "CCTKi_NamesStoreVariable", scope: !1, file: !1, line: 171, type: !34, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i32)* @CCTKi_NamesStoreVariable, variables: !36)
!34 = !DISubroutineType(types: !35)
!35 = !{!9, !20, !9, !9}
!36 = !{!37, !38, !39, !40, !41, !42}
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !33, file: !1, line: 171, type: !20)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vnum", arg: 2, scope: !33, file: !1, line: 171, type: !9)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnum", arg: 3, scope: !33, file: !1, line: 171, type: !9)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !33, file: !1, line: 173, type: !9)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !33, file: !1, line: 175, type: !31)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !33, file: !1, line: 177, type: !10)
!43 = !DISubprogram(name: "CCTKi_NamesRetrieveGroupNum", scope: !1, file: !1, line: 241, type: !44, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32*)* @CCTKi_NamesRetrieveGroupNum, variables: !47)
!44 = !DISubroutineType(types: !45)
!45 = !{!9, !20, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!47 = !{!48, !49, !50, !51, !52}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 1, scope: !43, file: !1, line: 241, type: !20)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnum", arg: 2, scope: !43, file: !1, line: 241, type: !46)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !43, file: !1, line: 243, type: !9)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !43, file: !1, line: 244, type: !31)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !43, file: !1, line: 246, type: !4)
!53 = !DISubprogram(name: "CCTKi_NamesRetrieveVariableNum", scope: !1, file: !1, line: 313, type: !54, isLocal: false, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32*, i32*)* @CCTKi_NamesRetrieveVariableNum, variables: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{!9, !20, !46, !46}
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !53, file: !1, line: 313, type: !20)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vnum", arg: 2, scope: !53, file: !1, line: 313, type: !46)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnum", arg: 3, scope: !53, file: !1, line: 313, type: !46)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !53, file: !1, line: 315, type: !9)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !53, file: !1, line: 316, type: !31)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !53, file: !1, line: 318, type: !10)
!63 = !DISubprogram(name: "CaseIndependentHash", scope: !1, file: !1, line: 385, type: !64, isLocal: true, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: true, variables: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{!31, !31, !20}
!66 = !{!67, !68, !69, !70, !71}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "klen", arg: 1, scope: !63, file: !1, line: 385, type: !31)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !63, file: !1, line: 386, type: !20)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !63, file: !1, line: 388, type: !31)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !63, file: !1, line: 389, type: !9)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !63, file: !1, line: 390, type: !20)
!72 = !DISubprogram(name: "toupper", scope: !73, file: !73, line: 298, type: !74, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, variables: !76)
!73 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!74 = !DISubroutineType(types: !75)
!75 = !{!9, !9}
!76 = !{!77}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !72, file: !73, line: 298, type: !9)
!78 = !{!79, !80, !104}
!79 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 22, type: !20, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariable(name: "GroupData", scope: !0, file: !1, line: 56, type: !81, isLocal: true, isDefinition: true, variable: %struct.T_HASH** @GroupData)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uHash", file: !83, line: 39, baseType: !84)
!83 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/util_Hash.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_HASH", file: !83, line: 32, size: 192, align: 64, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !83, line: 34, baseType: !31, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !84, file: !83, line: 35, baseType: !31, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !84, file: !83, line: 36, baseType: !31, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !84, file: !83, line: 38, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "iHashEntry", file: !83, line: 30, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_HASH_ENTRY", file: !83, line: 19, size: 320, align: 64, elements: !94)
!94 = !{!95, !97, !98, !99, !100, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !93, file: !83, line: 21, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !83, line: 22, baseType: !96, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !93, file: !83, line: 24, baseType: !31, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "klen", scope: !93, file: !83, line: 26, baseType: !31, size: 32, align: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !93, file: !83, line: 27, baseType: !101, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !83, line: 29, baseType: !103, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!104 = !DIGlobalVariable(name: "VariableData", scope: !0, file: !1, line: 57, type: !81, isLocal: true, isDefinition: true, variable: %struct.T_HASH** @VariableData)
!105 = !{i32 2, !"Dwarf Version", i32 2}
!106 = !{i32 2, !"Debug Info Version", i32 700000003}
!107 = !{i32 1, !"PIC Level", i32 2}
!108 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!109 = !DILocation(line: 24, column: 1, scope: !17)
!110 = !DIExpression()
!111 = !DILocation(line: 96, column: 39, scope: !23)
!112 = !DILocation(line: 96, column: 50, scope: !23)
!113 = !DILocation(line: 105, column: 7, scope: !114)
!114 = distinct !DILexicalBlock(scope: !23, file: !1, line: 105, column: 6)
!115 = !{!116, !116, i64 0}
!116 = !{!"any pointer", !117, i64 0}
!117 = !{!"omnipotent char", !118, i64 0}
!118 = !{!"Simple C/C++ TBAA"}
!119 = !DILocation(line: 105, column: 6, scope: !23)
!120 = !DILocation(line: 107, column: 17, scope: !121)
!121 = distinct !DILexicalBlock(scope: !114, file: !1, line: 106, column: 3)
!122 = !DILocation(line: 107, column: 15, scope: !121)
!123 = !DILocation(line: 108, column: 3, scope: !121)
!124 = !DILocation(line: 111, column: 24, scope: !23)
!125 = !DILocation(line: 114, column: 6, scope: !126)
!126 = distinct !DILexicalBlock(scope: !23, file: !1, line: 114, column: 6)
!127 = !DILocation(line: 114, column: 14, scope: !126)
!128 = !DILocation(line: 114, column: 11, scope: !126)
!129 = !DILocation(line: 116, column: 11, scope: !130)
!130 = distinct !DILexicalBlock(scope: !126, file: !1, line: 115, column: 3)
!131 = !DILocation(line: 116, column: 16, scope: !130)
!132 = !{!133, !134, i64 0}
!133 = !{!"IGroupData", !134, i64 0}
!134 = !{!"int", !117, i64 0}
!135 = !DILocation(line: 118, column: 32, scope: !130)
!136 = !DILocation(line: 385, column: 54, scope: !63, inlinedAt: !137)
!137 = distinct !DILocation(line: 118, column: 12, scope: !130)
!138 = !DILocation(line: 386, column: 53, scope: !63, inlinedAt: !137)
!139 = !DILocation(line: 389, column: 7, scope: !63, inlinedAt: !137)
!140 = !DILocation(line: 390, column: 15, scope: !63, inlinedAt: !137)
!141 = !DILocation(line: 388, column: 16, scope: !63, inlinedAt: !137)
!142 = !DILocation(line: 397, column: 3, scope: !63, inlinedAt: !137)
!143 = !DILocation(line: 118, column: 12, scope: !130)
!144 = !DILocation(line: 397, column: 10, scope: !63, inlinedAt: !137)
!145 = !DILocation(line: 399, column: 16, scope: !146, inlinedAt: !137)
!146 = distinct !DILexicalBlock(scope: !63, file: !1, line: 398, column: 3)
!147 = !DILocation(line: 399, column: 34, scope: !146, inlinedAt: !137)
!148 = !DILocation(line: 399, column: 30, scope: !146, inlinedAt: !137)
!149 = !{!117, !117, i64 0}
!150 = !DILocation(line: 298, column: 13, scope: !72, inlinedAt: !151)
!151 = distinct !DILocation(line: 399, column: 22, scope: !146, inlinedAt: !137)
!152 = !DILocation(line: 300, column: 17, scope: !72, inlinedAt: !151)
!153 = !DILocation(line: 399, column: 20, scope: !146, inlinedAt: !137)
!154 = !DILocation(line: 120, column: 29, scope: !130)
!155 = !DILocation(line: 100, column: 16, scope: !23)
!156 = !DILocation(line: 120, column: 40, scope: !130)
!157 = !DILocation(line: 120, column: 14, scope: !130)
!158 = !DILocation(line: 98, column: 7, scope: !23)
!159 = !DILocation(line: 121, column: 3, scope: !130)
!160 = !DILocation(line: 127, column: 3, scope: !23)
!161 = !DILocation(line: 171, column: 42, scope: !33)
!162 = !DILocation(line: 171, column: 52, scope: !33)
!163 = !DILocation(line: 171, column: 62, scope: !33)
!164 = !DILocation(line: 180, column: 7, scope: !165)
!165 = distinct !DILexicalBlock(scope: !33, file: !1, line: 180, column: 6)
!166 = !DILocation(line: 180, column: 6, scope: !33)
!167 = !DILocation(line: 182, column: 20, scope: !168)
