; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Output2D.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.IOASCIIGH = type { i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i32*, i32*, i32*, %struct.PNamedData*, %struct.PNamedData*, %struct.PNamedData*, i32***, i32** }
%struct.PNamedData = type { %struct.PNamedData*, %struct.PNamedData*, i8*, i8* }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [8 x i8] c"IOASCII\00", align 1
@.str1 = private unnamed_addr constant [78 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Output2D.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !43, globals: !223, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Output2D.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !14, !36}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "asciiioGH", file: !6, line: 55, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/ioASCIIGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOASCIIGH", file: !6, line: 20, size: 1024, align: 64, elements: !8)
!8 = !{!9, !11, !12, !13, !16, !17, !18, !19, !20, !21, !23, !24, !25, !37, !38, !39, !42}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_every", scope: !7, file: !6, line: 23, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_every", scope: !7, file: !6, line: 24, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_every", scope: !7, file: !6, line: 25, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "do_out1D", scope: !7, file: !6, line: 28, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "do_out2D", scope: !7, file: !6, line: 29, baseType: !14, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "do_out3D", scope: !7, file: !6, line: 30, baseType: !14, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "outdir1D", scope: !7, file: !6, line: 33, baseType: !14, size: 64, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outdir2D", scope: !7, file: !6, line: 34, baseType: !14, size: 64, align: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "outdir3D", scope: !7, file: !6, line: 35, baseType: !14, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_last", scope: !7, file: !6, line: 38, baseType: !22, size: 64, align: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_last", scope: !7, file: !6, line: 39, baseType: !22, size: 64, align: 64, offset: 576)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_last", scope: !7, file: !6, line: 40, baseType: !22, size: 64, align: 64, offset: 640)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "filenameList1D", scope: !7, file: !6, line: 43, baseType: !26, size: 64, align: 64, offset: 704)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !28, line: 26, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !28, line: 18, size: 256, align: 64, elements: !30)
!30 = !{!31, !33, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !29, file: !28, line: 20, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !28, line: 21, baseType: !32, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !28, line: 23, baseType: !14, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 25, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_2D", scope: !7, file: !6, line: 44, baseType: !26, size: 64, align: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_3D", scope: !7, file: !6, line: 45, baseType: !26, size: 64, align: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "spxyz", scope: !7, file: !6, line: 49, baseType: !40, size: 64, align: 64, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sp2xyz", scope: !7, file: !6, line: 53, baseType: !41, size: 64, align: 64, offset: 960)
!43 = !{!44, !49, !94, !103, !112, !119, !194, !202}
!44 = !DISubprogram(name: "CCTKi_version_CactusBase_IOASCII_Output2D_c", scope: !1, file: !1, line: 25, type: !45, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOASCII_Output2D_c, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!49 = !DISubprogram(name: "IOASCII_Output2DGH", scope: !1, file: !1, line: 61, type: !50, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @IOASCII_Output2DGH, variables: !88)
!50 = !DISubroutineType(types: !51)
!51 = !{!10, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !55, line: 75, baseType: !56)
!55 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 24, size: 1216, align: 64, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !69, !71, !72, !73, !74, !75, !76, !77, !80, !81}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !56, file: !55, line: 26, baseType: !10, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !56, file: !55, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !56, file: !55, line: 30, baseType: !22, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !56, file: !55, line: 31, baseType: !22, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !56, file: !55, line: 32, baseType: !22, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !56, file: !55, line: 33, baseType: !22, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !56, file: !55, line: 36, baseType: !22, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !56, file: !55, line: 39, baseType: !22, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !56, file: !55, line: 40, baseType: !22, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !56, file: !55, line: 43, baseType: !68, size: 64, align: 64, offset: 512)
!68 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !56, file: !55, line: 44, baseType: !70, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !56, file: !55, line: 47, baseType: !70, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !56, file: !55, line: 51, baseType: !22, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !56, file: !55, line: 54, baseType: !22, size: 64, align: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !56, file: !55, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !56, file: !55, line: 60, baseType: !22, size: 64, align: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !56, file: !55, line: 63, baseType: !68, size: 64, align: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !55, line: 67, baseType: !78, size: 64, align: 64, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !56, file: !55, line: 70, baseType: !79, size: 64, align: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !56, file: !55, line: 73, baseType: !82, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !55, line: 22, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 18, size: 16, align: 8, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !84, file: !55, line: 20, baseType: !15, size: 8, align: 8)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !84, file: !55, line: 21, baseType: !15, size: 8, align: 8, offset: 8)
!88 = !{!89, !90, !91, !92, !93}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !49, file: !1, line: 61, type: !52)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !49, file: !1, line: 63, type: !10)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !49, file: !1, line: 63, type: !10)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !49, file: !1, line: 64, type: !4)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !49, file: !1, line: 65, type: !47)
!94 = !DISubprogram(name: "IOASCII_Output2DVarAs", scope: !1, file: !1, line: 146, type: !95, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*)* @IOASCII_Output2DVarAs, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!10, !52, !47, !47}
!97 = !{!98, !99, !100, !101, !102}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !94, file: !1, line: 146, type: !52)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !94, file: !1, line: 146, type: !47)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !94, file: !1, line: 146, type: !47)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !94, file: !1, line: 148, type: !10)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !94, file: !1, line: 148, type: !10)
!103 = !DISubprogram(name: "IOASCII_TimeFor2D", scope: !1, file: !1, line: 196, type: !104, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOASCII_TimeFor2D, variables: !106)
!104 = !DISubroutineType(types: !105)
!105 = !{!10, !52, !10}
!106 = !{!107, !108, !109, !110, !111}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !103, file: !1, line: 196, type: !52)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !103, file: !1, line: 196, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_type", scope: !103, file: !1, line: 198, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !103, file: !1, line: 199, type: !4)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !103, file: !1, line: 200, type: !14)
!112 = !DISubprogram(name: "IOASCII_TriggerOutput2D", scope: !1, file: !1, line: 265, type: !104, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOASCII_TriggerOutput2D, variables: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !112, file: !1, line: 265, type: !52)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !112, file: !1, line: 265, type: !10)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !112, file: !1, line: 267, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !112, file: !1, line: 268, type: !47)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !112, file: !1, line: 269, type: !4)
!119 = !DISubprogram(name: "CheckSteerableParameters", scope: !1, file: !1, line: 298, type: !120, isLocal: true, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.IOASCIIGH*)* @CheckSteerableParameters, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !4}
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myGH", arg: 1, scope: !119, file: !1, line: 298, type: !4)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !119, file: !1, line: 300, type: !10)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_old", scope: !119, file: !1, line: 300, type: !10)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "times_set", scope: !119, file: !1, line: 300, type: !10)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_vars", scope: !119, file: !1, line: 300, type: !10)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !119, file: !1, line: 301, type: !14)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !119, file: !1, line: 301, type: !14)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_y", scope: !119, file: !1, line: 303, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_z", scope: !119, file: !1, line: 303, type: !131)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_x", scope: !119, file: !1, line: 303, type: !131)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_z", scope: !119, file: !1, line: 303, type: !131)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_x", scope: !119, file: !1, line: 303, type: !131)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_y", scope: !119, file: !1, line: 303, type: !131)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xyplane_z", scope: !119, file: !1, line: 303, type: !131)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xzplane_y", scope: !119, file: !1, line: 303, type: !131)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_yzplane_x", scope: !119, file: !1, line: 303, type: !131)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_style", scope: !119, file: !1, line: 303, type: !47)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_vars", scope: !119, file: !1, line: 303, type: !47)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_style", scope: !119, file: !1, line: 303, type: !47)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_vars", scope: !119, file: !1, line: 303, type: !47)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_style", scope: !119, file: !1, line: 303, type: !47)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_vars", scope: !119, file: !1, line: 303, type: !47)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_format", scope: !119, file: !1, line: 303, type: !47)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_style", scope: !119, file: !1, line: 303, type: !47)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir1D", scope: !119, file: !1, line: 303, type: !47)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir2D", scope: !119, file: !1, line: 303, type: !47)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir3D", scope: !119, file: !1, line: 303, type: !47)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_d", scope: !119, file: !1, line: 303, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_every", scope: !119, file: !1, line: 303, type: !152)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_x", scope: !119, file: !1, line: 303, type: !152)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_yi", scope: !119, file: !1, line: 303, type: !152)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_zi", scope: !119, file: !1, line: 303, type: !152)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_y", scope: !119, file: !1, line: 303, type: !152)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_xi", scope: !119, file: !1, line: 303, type: !152)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_zi", scope: !119, file: !1, line: 303, type: !152)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_z", scope: !119, file: !1, line: 303, type: !152)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_xi", scope: !119, file: !1, line: 303, type: !152)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_yi", scope: !119, file: !1, line: 303, type: !152)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_every", scope: !119, file: !1, line: 303, type: !152)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xyplane_zi", scope: !119, file: !1, line: 303, type: !152)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xzplane_yi", scope: !119, file: !1, line: 303, type: !152)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_yzplane_xi", scope: !119, file: !1, line: 303, type: !152)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_every", scope: !119, file: !1, line: 303, type: !152)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir", scope: !119, file: !1, line: 303, type: !47)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_every", scope: !119, file: !1, line: 303, type: !152)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_y", scope: !119, file: !1, line: 303, type: !131)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_z", scope: !119, file: !1, line: 303, type: !131)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_x", scope: !119, file: !1, line: 303, type: !131)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_z", scope: !119, file: !1, line: 303, type: !131)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_x", scope: !119, file: !1, line: 303, type: !131)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_y", scope: !119, file: !1, line: 303, type: !131)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_yi", scope: !119, file: !1, line: 303, type: !152)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_zi", scope: !119, file: !1, line: 303, type: !152)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_xi", scope: !119, file: !1, line: 303, type: !152)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_zi", scope: !119, file: !1, line: 303, type: !152)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_xi", scope: !119, file: !1, line: 303, type: !152)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_yi", scope: !119, file: !1, line: 303, type: !152)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yzplane_x", scope: !119, file: !1, line: 303, type: !131)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xzplane_y", scope: !119, file: !1, line: 303, type: !131)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xyplane_z", scope: !119, file: !1, line: 303, type: !131)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xyplane_zi", scope: !119, file: !1, line: 303, type: !152)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xzplane_yi", scope: !119, file: !1, line: 303, type: !152)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yzplane_xi", scope: !119, file: !1, line: 303, type: !152)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newverbose", scope: !119, file: !1, line: 303, type: !47)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_filename_scheme", scope: !119, file: !1, line: 303, type: !152)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_fileinfo", scope: !119, file: !1, line: 303, type: !47)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !119, file: !1, line: 303, type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!194 = !DISubprogram(name: "SetOutputFlag", scope: !1, file: !1, line: 408, type: !195, isLocal: true, isDefinition: true, scopeLine: 409, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, i8*)* @SetOutputFlag, variables: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !10, !47, !36}
!197 = !{!198, !199, !200, !201}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 1, scope: !194, file: !1, line: 408, type: !10)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "optstring", arg: 2, scope: !194, file: !1, line: 408, type: !47)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !194, file: !1, line: 408, type: !36)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !194, file: !1, line: 410, type: !14)
!202 = !DISubprogram(name: "CheckOutputVar", scope: !1, file: !1, line: 372, type: !203, isLocal: true, isDefinition: true, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CheckOutputVar, variables: !205)
!203 = !DISubroutineType(types: !204)
!204 = !{!10, !10}
!205 = !{!206, !207, !208, !221, !222}
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 1, scope: !202, file: !1, line: 372, type: !10)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupindex", scope: !202, file: !1, line: 374, type: !10)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupinfo", scope: !202, file: !1, line: 375, type: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !210, line: 24, baseType: !211)
!210 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 14, size: 256, align: 32, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !211, file: !210, line: 16, baseType: !10, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !211, file: !210, line: 17, baseType: !10, size: 32, align: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !211, file: !210, line: 18, baseType: !10, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !211, file: !210, line: 19, baseType: !10, size: 32, align: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !211, file: !210, line: 20, baseType: !10, size: 32, align: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !211, file: !210, line: 21, baseType: !10, size: 32, align: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !211, file: !210, line: 22, baseType: !10, size: 32, align: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !211, file: !210, line: 23, baseType: !10, size: 32, align: 32, offset: 224)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !202, file: !1, line: 376, type: !14)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errormsg", scope: !202, file: !1, line: 377, type: !47)
!223 = !{!224, !225}
!224 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 24, type: !47, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariable(name: "out2D_vars_lastset", scope: !119, file: !1, line: 302, type: !10, isLocal: true, isDefinition: true, variable: i32* @CheckSteerableParameters.out2D_vars_lastset)
!226 = !{i32 2, !"Dwarf Version", i32 2}
!227 = !{i32 2, !"Debug Info Version", i32 700000003}
!228 = !{i32 1, !"PIC Level", i32 2}
!229 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!230 = !DILocation(line: 25, column: 1, scope: !44)
!231 = !DIExpression()
!232 = !DILocation(line: 61, column: 36, scope: !49)
!233 = !DILocation(line: 69, column: 24, scope: !49)
!234 = !DILocation(line: 69, column: 10, scope: !49)
!235 = !DILocation(line: 64, column: 14, scope: !49)
!236 = !DILocation(line: 71, column: 3, scope: !49)
!237 = !DILocation(line: 74, column: 13, scope: !238)
!238 = distinct !DILexicalBlock(scope: !49, file: !1, line: 74, column: 7)
!239 = !{!240, !241, i64 4}
!240 = !{!"IOASCIIGH", !241, i64 0, !241, i64 4, !241, i64 8, !244, i64 16, !244, i64 24, !244, i64 32, !244, i64 40, !244, i64 48, !244, i64 56, !244, i64 64, !244, i64 72, !244, i64 80, !244, i64 88, !244, i64 96, !244, i64 104, !244, i64 112, !244, i64 120}
!241 = !{!"int", !242, i64 0}
!242 = !{!"omnipotent char", !243, i64 0}
!243 = !{!"Simple C/C++ TBAA"}
!244 = !{!"any pointer", !242, i64 0}
!245 = !DILocation(line: 74, column: 25, scope: !238)
!246 = !DILocation(line: 74, column: 7, scope: !49)
!247 = !DILocation(line: 80, column: 38, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !1, line: 80, column: 3)
!249 = distinct !DILexicalBlock(scope: !49, file: !1, line: 80, column: 3)
!250 = !DILocation(line: 80, column: 36, scope: !248)
!251 = !DILocation(line: 80, column: 3, scope: !249)
!252 = !DILocation(line: 104, column: 38, scope: !253)
!253 = distinct !DILexicalBlock(scope: !254, file: !1, line: 102, column: 5)
!254 = distinct !DILexicalBlock(scope: !255, file: !1, line: 101, column: 9)
!255 = distinct !DILexicalBlock(scope: !248, file: !1, line: 81, column: 3)
!256 = !DILocation(line: 104, column: 13, scope: !253)
!257 = !DILocation(line: 84, column: 11, scope: !258)
!258 = distinct !DILexicalBlock(scope: !255, file: !1, line: 84, column: 9)
!259 = !DILocation(line: 84, column: 9, scope: !255)
!260 = !DILocation(line: 90, column: 12, scope: !255)
!261 = !DILocation(line: 65, column: 15, scope: !49)
!262 = !DILocation(line: 101, column: 9, scope: !254)
!263 = !DILocation(line: 101, column: 44, scope: !254)
!264 = !DILocation(line: 101, column: 9, scope: !255)
!265 = !{!266, !241, i64 4}
!266 = !{!"", !241, i64 0, !241, i64 4, !244, i64 8, !244, i64 16, !244, i64 24, !244, i64 32, !244, i64 40, !244, i64 48, !244, i64 56, !267, i64 64, !244, i64 72, !244, i64 80, !244, i64 88, !244, i64 96, !241, i64 104, !244, i64 112, !267, i64 120, !244, i64 128, !244, i64 136, !244, i64 144}
!267 = !{!"double", !242, i64 0}
!268 = !{!240, !244, i64 72}
!269 = !DILocation(line: 104, column: 7, scope: !253)
!270 = !DILocation(line: 104, column: 32, scope: !253)
!271 = !{!241, !241, i64 0}
!272 = !DILocation(line: 105, column: 13, scope: !253)
!273 = !DILocation(line: 63, column: 15, scope: !49)
!274 = !DILocation(line: 106, column: 5, scope: !253)
!275 = !DILocation(line: 110, column: 1, scope: !49)
!276 = !DILocation(line: 298, column: 50, scope: !119)
!277 = !DILocation(line: 303, column: 3, scope: !119)
!278 = !{!279, !244, i64 96}
