; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Output1D.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.IOASCIIGH = type { i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i32*, i32*, i32*, %struct.PNamedData*, %struct.PNamedData*, %struct.PNamedData*, i32***, i32** }
%struct.PNamedData = type { %struct.PNamedData*, %struct.PNamedData*, i8*, i8* }

@.str = private unnamed_addr constant [8 x i8] c"IOASCII\00", align 1
@.str1 = private unnamed_addr constant [78 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Output1D.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !43, globals: !211, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Output1D.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "asciiioGH", file: !6, line: 55, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/ioASCIIGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOASCIIGH", file: !6, line: 20, size: 1024, align: 64, elements: !8)
!8 = !{!9, !11, !12, !13, !16, !17, !18, !19, !20, !21, !23, !24, !25, !37, !38, !39, !42}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_every", scope: !7, file: !6, line: 23, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_every", scope: !7, file: !6, line: 24, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_every", scope: !7, file: !6, line: 25, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "do_out1D", scope: !7, file: !6, line: 28, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "do_out2D", scope: !7, file: !6, line: 29, baseType: !14, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "do_out3D", scope: !7, file: !6, line: 30, baseType: !14, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "outdir1D", scope: !7, file: !6, line: 33, baseType: !14, size: 64, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outdir2D", scope: !7, file: !6, line: 34, baseType: !14, size: 64, align: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "outdir3D", scope: !7, file: !6, line: 35, baseType: !14, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_last", scope: !7, file: !6, line: 38, baseType: !22, size: 64, align: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_last", scope: !7, file: !6, line: 39, baseType: !22, size: 64, align: 64, offset: 576)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_last", scope: !7, file: !6, line: 40, baseType: !22, size: 64, align: 64, offset: 640)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "filenameList1D", scope: !7, file: !6, line: 43, baseType: !26, size: 64, align: 64, offset: 704)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !28, line: 26, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !28, line: 18, size: 256, align: 64, elements: !30)
!30 = !{!31, !33, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !29, file: !28, line: 20, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !28, line: 21, baseType: !32, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !28, line: 23, baseType: !14, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 25, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_2D", scope: !7, file: !6, line: 44, baseType: !26, size: 64, align: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_3D", scope: !7, file: !6, line: 45, baseType: !26, size: 64, align: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "spxyz", scope: !7, file: !6, line: 49, baseType: !40, size: 64, align: 64, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sp2xyz", scope: !7, file: !6, line: 53, baseType: !41, size: 64, align: 64, offset: 960)
!43 = !{!44, !49, !94, !103, !112, !119, !195, !203}
!44 = !DISubprogram(name: "CCTKi_version_CactusBase_IOASCII_Output1D_c", scope: !1, file: !1, line: 25, type: !45, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOASCII_Output1D_c, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!49 = !DISubprogram(name: "IOASCII_Output1DGH", scope: !1, file: !1, line: 61, type: !50, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @IOASCII_Output1DGH, variables: !88)
!50 = !DISubroutineType(types: !51)
!51 = !{!10, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !55, line: 75, baseType: !56)
!55 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 24, size: 1216, align: 64, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !69, !71, !72, !73, !74, !75, !76, !77, !80, !81}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !56, file: !55, line: 26, baseType: !10, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !56, file: !55, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !56, file: !55, line: 30, baseType: !22, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !56, file: !55, line: 31, baseType: !22, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !56, file: !55, line: 32, baseType: !22, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !56, file: !55, line: 33, baseType: !22, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !56, file: !55, line: 36, baseType: !22, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !56, file: !55, line: 39, baseType: !22, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !56, file: !55, line: 40, baseType: !22, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !56, file: !55, line: 43, baseType: !68, size: 64, align: 64, offset: 512)
!68 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !56, file: !55, line: 44, baseType: !70, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !56, file: !55, line: 47, baseType: !70, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !56, file: !55, line: 51, baseType: !22, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !56, file: !55, line: 54, baseType: !22, size: 64, align: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !56, file: !55, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !56, file: !55, line: 60, baseType: !22, size: 64, align: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !56, file: !55, line: 63, baseType: !68, size: 64, align: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !55, line: 67, baseType: !78, size: 64, align: 64, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !56, file: !55, line: 70, baseType: !79, size: 64, align: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !56, file: !55, line: 73, baseType: !82, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !55, line: 22, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 18, size: 16, align: 8, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !84, file: !55, line: 20, baseType: !15, size: 8, align: 8)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !84, file: !55, line: 21, baseType: !15, size: 8, align: 8, offset: 8)
!88 = !{!89, !90, !91, !92, !93}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !49, file: !1, line: 61, type: !52)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !49, file: !1, line: 63, type: !10)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !49, file: !1, line: 63, type: !10)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !49, file: !1, line: 64, type: !4)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !49, file: !1, line: 65, type: !47)
!94 = !DISubprogram(name: "IOASCII_Output1DVarAs", scope: !1, file: !1, line: 145, type: !95, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*)* @IOASCII_Output1DVarAs, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!10, !52, !47, !47}
!97 = !{!98, !99, !100, !101, !102}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !94, file: !1, line: 145, type: !52)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !94, file: !1, line: 145, type: !47)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !94, file: !1, line: 145, type: !47)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !94, file: !1, line: 147, type: !10)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !94, file: !1, line: 147, type: !10)
!103 = !DISubprogram(name: "IOASCII_TimeFor1D", scope: !1, file: !1, line: 195, type: !104, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOASCII_TimeFor1D, variables: !106)
!104 = !DISubroutineType(types: !105)
!105 = !{!10, !52, !10}
!106 = !{!107, !108, !109, !110, !111}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !103, file: !1, line: 195, type: !52)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !103, file: !1, line: 195, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_type", scope: !103, file: !1, line: 197, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !103, file: !1, line: 198, type: !4)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !103, file: !1, line: 199, type: !14)
!112 = !DISubprogram(name: "IOASCII_TriggerOutput1D", scope: !1, file: !1, line: 265, type: !104, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOASCII_TriggerOutput1D, variables: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !112, file: !1, line: 265, type: !52)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !112, file: !1, line: 265, type: !10)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !112, file: !1, line: 267, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var", scope: !112, file: !1, line: 268, type: !47)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !112, file: !1, line: 269, type: !4)
!119 = !DISubprogram(name: "CheckSteerableParameters", scope: !1, file: !1, line: 297, type: !120, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.IOASCIIGH*)* @CheckSteerableParameters, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !4}
