; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/OutputScalar.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32 }
%struct.anon.0 = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.IOBASIC_GH = type { i32, i32, i8, i8*, i8*, i32*, i32*, %struct.IOBASIC_REDUCTIONLIST*, %struct.PNamedData* }
%struct.IOBASIC_REDUCTIONLIST = type { i32, %struct.IOBASIC_REDUCTION* }
%struct.IOBASIC_REDUCTION = type { i32, i8*, i8, double, %struct.IOBASIC_REDUCTION* }
%struct.PNamedData = type { %struct.PNamedData*, %struct.PNamedData*, i8*, i8* }

@.str = private unnamed_addr constant [8 x i8] c"IOBasic\00", align 1
@.str1 = private unnamed_addr constant [82 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/OutputScalar.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !51, globals: !165, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/OutputScalar.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasicGH", file: !6, line: 52, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/iobasicGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_GH", file: !6, line: 29, size: 512, align: 64, elements: !8)
!8 = !{!9, !11, !12, !14, !16, !17, !19, !20, !39}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "outScalar_every", scope: !7, file: !6, line: 32, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "outInfo_every", scope: !7, file: !6, line: 33, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "info_reductions_changed", scope: !7, file: !6, line: 34, baseType: !13, size: 8, align: 8, offset: 64)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "do_outScalar", scope: !7, file: !6, line: 37, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "outdirScalar", scope: !7, file: !6, line: 40, baseType: !15, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "outInfo_last", scope: !7, file: !6, line: 43, baseType: !18, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outScalar_last", scope: !7, file: !6, line: 44, baseType: !18, size: 64, align: 64, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "info_reductions", scope: !7, file: !6, line: 47, baseType: !21, size: 64, align: 64, offset: 384)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasic_reductionlist_t", file: !6, line: 27, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_REDUCTIONLIST", file: !6, line: 23, size: 128, align: 64, elements: !24)
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "num_reductions", scope: !23, file: !6, line: 25, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "reductions", scope: !23, file: !6, line: 26, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasic_reduction_t", file: !6, line: 21, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_REDUCTION", file: !6, line: 14, size: 320, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35, !37}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !30, file: !6, line: 16, baseType: !10, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !6, line: 17, baseType: !15, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !30, file: !6, line: 18, baseType: !13, size: 8, align: 8, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !6, line: 19, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !6, line: 20, baseType: !38, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "filenameListScalar", scope: !7, file: !6, line: 50, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !42, line: 26, baseType: !43)
!42 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !42, line: 18, size: 256, align: 64, elements: !44)
!44 = !{!45, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !43, file: !42, line: 20, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !42, line: 21, baseType: !46, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !42, line: 23, baseType: !15, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !42, line: 25, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !{!52, !57, !102, !111, !120, !127, !157}
!52 = !DISubprogram(name: "CCTKi_version_CactusBase_IOBasic_OutputScalar_c", scope: !1, file: !1, line: 26, type: !53, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOBasic_OutputScalar_c, variables: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!57 = !DISubprogram(name: "IOBasic_ScalarOutputGH", scope: !1, file: !1, line: 59, type: !58, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @IOBasic_ScalarOutputGH, variables: !95)
!58 = !DISubroutineType(types: !59)
!59 = !{!10, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !63, line: 75, baseType: !64)
!63 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 24, size: 1216, align: 64, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !78, !79, !80, !81, !82, !83, !84, !87, !88}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !64, file: !63, line: 26, baseType: !10, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !64, file: !63, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !64, file: !63, line: 30, baseType: !18, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !64, file: !63, line: 31, baseType: !18, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !64, file: !63, line: 32, baseType: !18, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !64, file: !63, line: 33, baseType: !18, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !64, file: !63, line: 36, baseType: !18, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !64, file: !63, line: 39, baseType: !18, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !64, file: !63, line: 40, baseType: !18, size: 64, align: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !64, file: !63, line: 43, baseType: !36, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !64, file: !63, line: 44, baseType: !77, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !64, file: !63, line: 47, baseType: !77, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !64, file: !63, line: 51, baseType: !18, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !64, file: !63, line: 54, baseType: !18, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !64, file: !63, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !64, file: !63, line: 60, baseType: !18, size: 64, align: 64, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !64, file: !63, line: 63, baseType: !36, size: 64, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !63, line: 67, baseType: !85, size: 64, align: 64, offset: 1024)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !64, file: !63, line: 70, baseType: !86, size: 64, align: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !64, file: !63, line: 73, baseType: !89, size: 64, align: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !63, line: 22, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 18, size: 16, align: 8, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !91, file: !63, line: 20, baseType: !13, size: 8, align: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !91, file: !63, line: 21, baseType: !13, size: 8, align: 8, offset: 8)
!95 = !{!96, !97, !98, !99, !100, !101}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !57, file: !1, line: 59, type: !60)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !57, file: !1, line: 61, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !57, file: !1, line: 61, type: !10)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !57, file: !1, line: 61, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !57, file: !1, line: 62, type: !55)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !57, file: !1, line: 63, type: !4)
!102 = !DISubprogram(name: "IOBasic_ScalarOutputVarAs", scope: !1, file: !1, line: 150, type: !103, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i8*)* @IOBasic_ScalarOutputVarAs, variables: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{!10, !60, !55, !55}
!105 = !{!106, !107, !108, !109, !110}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !102, file: !1, line: 150, type: !60)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !102, file: !1, line: 150, type: !55)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !102, file: !1, line: 150, type: !55)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !102, file: !1, line: 152, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !102, file: !1, line: 152, type: !10)
!111 = !DISubprogram(name: "IOBasic_TimeForScalarOutput", scope: !1, file: !1, line: 202, type: !112, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOBasic_TimeForScalarOutput, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!10, !60, !10}
!114 = !{!115, !116, !117, !118, !119}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !111, file: !1, line: 202, type: !60)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !111, file: !1, line: 202, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_type", scope: !111, file: !1, line: 204, type: !10)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !111, file: !1, line: 205, type: !4)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !111, file: !1, line: 206, type: !15)
!120 = !DISubprogram(name: "IOBasic_TriggerScalarOutput", scope: !1, file: !1, line: 272, type: !112, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOBasic_TriggerScalarOutput, variables: !121)
!121 = !{!122, !123, !124, !125, !126}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !120, file: !1, line: 272, type: !60)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !120, file: !1, line: 272, type: !10)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !120, file: !1, line: 274, type: !10)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !120, file: !1, line: 275, type: !55)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !120, file: !1, line: 276, type: !4)
!127 = !DISubprogram(name: "CheckSteerableParameters", scope: !1, file: !1, line: 312, type: !128, isLocal: true, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.IOBASIC_GH*)* @CheckSteerableParameters, variables: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !4}
