; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/OverloadComm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.GROUPDYNAMICDATA = type { i32, i32*, i32*, i32*, i32*, i32*, i32* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@CCTK_SyncGroup = global i32 (%struct.cGH*, i8*)* null, align 8
@CCTK_OverloadSyncGroup.overloaded = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [97 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/CommOverloadables.h\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [59 x i8] c"Overload Macros: Attempted to overload function %s%s twice\00", align 1
@.str3 = private unnamed_addr constant [6 x i8] c"CCTK_\00", align 1
@.str4 = private unnamed_addr constant [10 x i8] c"SyncGroup\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !309, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/OverloadComm.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !58, !62, !66, !70, !74, !85, !89, !93, !102, !111, !115, !135, !146, !155, !176, !179, !183, !187, !191, !195, !199, !202, !205, !208, !211, !215, !219, !223, !229, !234, !239, !242, !245, !251, !258, !263, !272, !279, !286, !293, !300}
!4 = !DISubprogram(name: "CCTKi_version_comm_OverloadComm_c", scope: !1, file: !1, line: 26, type: !5, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_comm_OverloadComm_c, variables: !2)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DISubprogram(name: "CCTK_OverloadSyncGroup", scope: !11, file: !11, line: 46, type: !12, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i8*)*)* @CCTK_OverloadSyncGroup, variables: !55)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/CommOverloadables.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15}
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DISubroutineType(types: !17)
!17 = !{!14, !18, !7}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !20, line: 75, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 24, size: 1216, align: 64, elements: !22)
!22 = !{!23, !24, !25, !27, !28, !29, !30, !31, !32, !33, !35, !37, !38, !39, !40, !41, !42, !43, !47, !48}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !21, file: !20, line: 26, baseType: !14, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !21, file: !20, line: 27, baseType: !14, size: 32, align: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !21, file: !20, line: 30, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !21, file: !20, line: 31, baseType: !26, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !21, file: !20, line: 32, baseType: !26, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !21, file: !20, line: 33, baseType: !26, size: 64, align: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !21, file: !20, line: 36, baseType: !26, size: 64, align: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !21, file: !20, line: 39, baseType: !26, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !21, file: !20, line: 40, baseType: !26, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !21, file: !20, line: 43, baseType: !34, size: 64, align: 64, offset: 512)
!34 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !21, file: !20, line: 44, baseType: !36, size: 64, align: 64, offset: 576)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !21, file: !20, line: 47, baseType: !36, size: 64, align: 64, offset: 640)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !21, file: !20, line: 51, baseType: !26, size: 64, align: 64, offset: 704)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !21, file: !20, line: 54, baseType: !26, size: 64, align: 64, offset: 768)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !21, file: !20, line: 57, baseType: !14, size: 32, align: 32, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !21, file: !20, line: 60, baseType: !26, size: 64, align: 64, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !21, file: !20, line: 63, baseType: !34, size: 64, align: 64, offset: 960)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !20, line: 67, baseType: !44, size: 64, align: 64, offset: 1024)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !21, file: !20, line: 70, baseType: !45, size: 64, align: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !21, file: !20, line: 73, baseType: !49, size: 64, align: 64, offset: 1152)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !20, line: 22, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 18, size: 16, align: 8, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !51, file: !20, line: 20, baseType: !9, size: 8, align: 8)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !51, file: !20, line: 21, baseType: !9, size: 8, align: 8, offset: 8)
!55 = !{!56, !57}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !10, file: !11, line: 46, type: !15)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !10, file: !11, line: 46, type: !14)
!58 = !DISubprogram(name: "CCTK_OverloadEnableGroupStorage", scope: !11, file: !11, line: 48, type: !12, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i8*)*)* @CCTK_OverloadEnableGroupStorage, variables: !59)
!59 = !{!60, !61}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !58, file: !11, line: 48, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !58, file: !11, line: 48, type: !14)
!62 = !DISubprogram(name: "CCTK_OverloadDisableGroupStorage", scope: !11, file: !11, line: 49, type: !12, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i8*)*)* @CCTK_OverloadDisableGroupStorage, variables: !63)
!63 = !{!64, !65}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !62, file: !11, line: 49, type: !15)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !62, file: !11, line: 49, type: !14)
!66 = !DISubprogram(name: "CCTK_OverloadEnableGroupComm", scope: !11, file: !11, line: 51, type: !12, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i8*)*)* @CCTK_OverloadEnableGroupComm, variables: !67)
!67 = !{!68, !69}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !66, file: !11, line: 51, type: !15)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !66, file: !11, line: 51, type: !14)
!70 = !DISubprogram(name: "CCTK_OverloadDisableGroupComm", scope: !11, file: !11, line: 52, type: !12, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i8*)*)* @CCTK_OverloadDisableGroupComm, variables: !71)
!71 = !{!72, !73}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !70, file: !11, line: 52, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !70, file: !11, line: 52, type: !14)
!74 = !DISubprogram(name: "CCTK_OverloadBarrier", scope: !11, file: !11, line: 58, type: !75, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*)*)* @CCTK_OverloadBarrier, variables: !82)
!75 = !DISubroutineType(types: !76)
!76 = !{!14, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!14, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!82 = !{!83, !84}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !74, file: !11, line: 58, type: !77)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !74, file: !11, line: 58, type: !14)
!85 = !DISubprogram(name: "CCTK_OverloadMyProc", scope: !11, file: !11, line: 59, type: !75, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*)*)* @CCTK_OverloadMyProc, variables: !86)
!86 = !{!87, !88}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !85, file: !11, line: 59, type: !77)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !85, file: !11, line: 59, type: !14)
!89 = !DISubprogram(name: "CCTK_OverloadnProcs", scope: !11, file: !11, line: 60, type: !75, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*)*)* @CCTK_OverloadnProcs, variables: !90)
!90 = !{!91, !92}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !89, file: !11, line: 60, type: !77)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !89, file: !11, line: 60, type: !14)
!93 = !DISubprogram(name: "CCTK_OverloadParallelInit", scope: !11, file: !11, line: 66, type: !94, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*)*)* @CCTK_OverloadParallelInit, variables: !99)
!94 = !DISubroutineType(types: !95)
!95 = !{!14, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!14, !18}
!99 = !{!100, !101}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !93, file: !11, line: 66, type: !96)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !93, file: !11, line: 66, type: !14)
!102 = !DISubprogram(name: "CCTK_OverloadExit", scope: !11, file: !11, line: 74, type: !103, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i32)*)* @CCTK_OverloadExit, variables: !108)
!103 = !DISubroutineType(types: !104)
!104 = !{!14, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!14, !18, !14}
!108 = !{!109, !110}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !102, file: !11, line: 74, type: !105)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !102, file: !11, line: 74, type: !14)
!111 = !DISubprogram(name: "CCTK_OverloadAbort", scope: !11, file: !11, line: 75, type: !103, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i32)*)* @CCTK_OverloadAbort, variables: !112)
!112 = !{!113, !114}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !111, file: !11, line: 75, type: !105)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !111, file: !11, line: 75, type: !14)
!115 = !DISubprogram(name: "CCTK_OverloadSetupGH", scope: !11, file: !11, line: 83, type: !116, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH* (%struct.tFleshConfig*, i32)*)* @CCTK_OverloadSetupGH, variables: !132)
!116 = !DISubroutineType(types: !117)
!117 = !{!14, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!18, !121, !14}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !123, line: 28, baseType: !124)
!123 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!124 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 19, size: 192, align: 64, elements: !125)
!125 = !{!126, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !124, file: !123, line: 21, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !124, file: !123, line: 24, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !124, file: !123, line: 25, baseType: !131, size: 32, align: 32, offset: 128)
!131 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!132 = !{!133, !134}
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !115, file: !11, line: 83, type: !118)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !115, file: !11, line: 83, type: !14)
!135 = !DISubprogram(name: "CCTK_OverloadArrayGroupSizeB", scope: !11, file: !11, line: 91, type: !136, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32* (%struct.cGH*, i32, i32, i8*)*)* @CCTK_OverloadArrayGroupSizeB, variables: !143)
!136 = !DISubroutineType(types: !137)
!137 = !{!14, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !80, !14, !14, !7}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!143 = !{!144, !145}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !135, file: !11, line: 91, type: !138)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !135, file: !11, line: 91, type: !14)
!146 = !DISubprogram(name: "CCTK_OverloadQueryGroupStorageB", scope: !11, file: !11, line: 99, type: !147, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i32, i8*)*)* @CCTK_OverloadQueryGroupStorageB, variables: !152)
!147 = !DISubroutineType(types: !148)
!148 = !{!14, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!14, !80, !14, !7}
!152 = !{!153, !154}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !146, file: !11, line: 99, type: !149)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !146, file: !11, line: 99, type: !14)
!155 = !DISubprogram(name: "CCTK_OverloadGroupDynamicData", scope: !11, file: !11, line: 107, type: !156, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.cGH*, i32, %struct.GROUPDYNAMICDATA*)*)* @CCTK_OverloadGroupDynamicData, variables: !173)
!156 = !DISubroutineType(types: !157)
!157 = !{!14, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!14, !80, !14, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroupDynamicData", file: !163, line: 23, baseType: !164)
!163 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_GroupsOnGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "GROUPDYNAMICDATA", file: !163, line: 14, size: 448, align: 64, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !164, file: !163, line: 16, baseType: !14, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "gsh", scope: !164, file: !163, line: 17, baseType: !141, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lsh", scope: !164, file: !163, line: 18, baseType: !141, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lbnd", scope: !164, file: !163, line: 19, baseType: !141, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ubnd", scope: !164, file: !163, line: 20, baseType: !141, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !164, file: !163, line: 21, baseType: !141, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !164, file: !163, line: 22, baseType: !141, size: 64, align: 64, offset: 384)
!173 = !{!174, !175}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !155, file: !11, line: 107, type: !158)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !155, file: !11, line: 107, type: !14)
!176 = !DISubprogram(name: "CCTKi_SetupCommFunctions", scope: !1, file: !1, line: 76, type: !177, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTKi_SetupCommFunctions, variables: !2)
!177 = !DISubroutineType(types: !178)
!178 = !{!14}
!179 = !DISubprogram(name: "CCTKi_DummySyncGroup", scope: !11, file: !11, line: 46, type: !16, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTKi_DummySyncGroup, variables: !180)
!180 = !{!181, !182}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !179, file: !11, line: 46, type: !18)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !179, file: !11, line: 46, type: !7)
!183 = !DISubprogram(name: "CCTKi_DummyEnableGroupStorage", scope: !11, file: !11, line: 48, type: !16, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTKi_DummyEnableGroupStorage, variables: !184)
!184 = !{!185, !186}
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !183, file: !11, line: 48, type: !18)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !183, file: !11, line: 48, type: !7)
!187 = !DISubprogram(name: "CCTKi_DummyDisableGroupStorage", scope: !11, file: !11, line: 49, type: !16, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTKi_DummyDisableGroupStorage, variables: !188)
!188 = !{!189, !190}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !187, file: !11, line: 49, type: !18)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !187, file: !11, line: 49, type: !7)
!191 = !DISubprogram(name: "CCTKi_DummyEnableGroupComm", scope: !11, file: !11, line: 51, type: !16, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTKi_DummyEnableGroupComm, variables: !192)
!192 = !{!193, !194}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !191, file: !11, line: 51, type: !18)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !191, file: !11, line: 51, type: !7)
!195 = !DISubprogram(name: "CCTKi_DummyDisableGroupComm", scope: !11, file: !11, line: 52, type: !16, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @CCTKi_DummyDisableGroupComm, variables: !196)
!196 = !{!197, !198}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !195, file: !11, line: 52, type: !18)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !195, file: !11, line: 52, type: !7)
!199 = !DISubprogram(name: "CCTKi_DummyBarrier", scope: !11, file: !11, line: 58, type: !78, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CCTKi_DummyBarrier, variables: !200)
!200 = !{!201}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !199, file: !11, line: 58, type: !80)
!202 = !DISubprogram(name: "CCTKi_DummyMyProc", scope: !11, file: !11, line: 59, type: !78, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @CCTKi_DummyMyProc, variables: !203)
!203 = !{!204}
