; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/OverloadMain.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@CCTK_Initialise = global i32 (%struct.tFleshConfig*)* null, align 8
@CCTK_OverloadInitialise.overloaded = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [97 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/MainOverloadables.h\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [59 x i8] c"Overload Macros: Attempted to overload function %s%s twice\00", align 1
@.str3 = private unnamed_addr constant [6 x i8] c"CCTK_\00", align 1
@.str4 = private unnamed_addr constant [11 x i8] c"Initialise\00", align 1
@CCTK_Evolve = global i32 (%struct.tFleshConfig*)* null, align 8
@CCTK_OverloadEvolve.overloaded = internal unnamed_addr global i32 0, align 4
@.str5 = private unnamed_addr constant [7 x i8] c"Evolve\00", align 1
@CCTK_Shutdown = global i32 (%struct.tFleshConfig*)* null, align 8
@CCTK_OverloadShutdown.overloaded = internal unnamed_addr global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !96, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/OverloadMain.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !69, !73, !77, !86, !95}
!4 = !DISubprogram(name: "CCTKi_version_main_OverloadMain_c", scope: !1, file: !1, line: 27, type: !5, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_OverloadMain_c, variables: !2)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DISubprogram(name: "CCTK_OverloadInitialise", scope: !11, file: !11, line: 45, type: !12, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.tFleshConfig*)*)* @CCTK_OverloadInitialise, variables: !66)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/MainOverloadables.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15}
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DISubroutineType(types: !17)
!17 = !{!14, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !20, line: 28, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 19, size: 192, align: 64, elements: !22)
!22 = !{!23, !25, !64}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !21, file: !20, line: 21, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !21, file: !20, line: 24, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !29, line: 75, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 24, size: 1216, align: 64, elements: !31)
!31 = !{!32, !33, !34, !36, !37, !38, !39, !40, !41, !42, !44, !46, !47, !48, !49, !50, !51, !52, !56, !57}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !30, file: !29, line: 26, baseType: !14, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !30, file: !29, line: 27, baseType: !14, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !30, file: !29, line: 30, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !30, file: !29, line: 31, baseType: !35, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !30, file: !29, line: 32, baseType: !35, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !30, file: !29, line: 33, baseType: !35, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !30, file: !29, line: 36, baseType: !35, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !30, file: !29, line: 39, baseType: !35, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !30, file: !29, line: 40, baseType: !35, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !30, file: !29, line: 43, baseType: !43, size: 64, align: 64, offset: 512)
!43 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !30, file: !29, line: 44, baseType: !45, size: 64, align: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !30, file: !29, line: 47, baseType: !45, size: 64, align: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !30, file: !29, line: 51, baseType: !35, size: 64, align: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !30, file: !29, line: 54, baseType: !35, size: 64, align: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !30, file: !29, line: 57, baseType: !14, size: 32, align: 32, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !30, file: !29, line: 60, baseType: !35, size: 64, align: 64, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !30, file: !29, line: 63, baseType: !43, size: 64, align: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !29, line: 67, baseType: !53, size: 64, align: 64, offset: 1024)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !30, file: !29, line: 70, baseType: !54, size: 64, align: 64, offset: 1088)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !30, file: !29, line: 73, baseType: !58, size: 64, align: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !29, line: 22, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 18, size: 16, align: 8, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !60, file: !29, line: 20, baseType: !9, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !60, file: !29, line: 21, baseType: !9, size: 8, align: 8, offset: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !21, file: !20, line: 25, baseType: !65, size: 32, align: 32, offset: 128)
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !{!67, !68}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !10, file: !11, line: 45, type: !15)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !10, file: !11, line: 45, type: !14)
!69 = !DISubprogram(name: "CCTK_OverloadEvolve", scope: !11, file: !11, line: 46, type: !12, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.tFleshConfig*)*)* @CCTK_OverloadEvolve, variables: !70)
!70 = !{!71, !72}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !69, file: !11, line: 46, type: !15)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !69, file: !11, line: 46, type: !14)
!73 = !DISubprogram(name: "CCTK_OverloadShutdown", scope: !11, file: !11, line: 47, type: !12, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (%struct.tFleshConfig*)*)* @CCTK_OverloadShutdown, variables: !74)
!74 = !{!75, !76}
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !73, file: !11, line: 47, type: !15)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !73, file: !11, line: 47, type: !14)
!77 = !DISubprogram(name: "CCTK_OverloadMainLoopIndex", scope: !11, file: !11, line: 56, type: !78, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 ()*)* @CCTK_OverloadMainLoopIndex, variables: !83)
!78 = !DISubroutineType(types: !79)
!79 = !{!14, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!14}
!83 = !{!84, !85}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !77, file: !11, line: 56, type: !80)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !77, file: !11, line: 56, type: !14)
!86 = !DISubprogram(name: "CCTK_OverloadSetMainLoopIndex", scope: !11, file: !11, line: 65, type: !87, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (i32)*)* @CCTK_OverloadSetMainLoopIndex, variables: !92)
!87 = !DISubroutineType(types: !88)
!88 = !{!14, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!14, !14}
!92 = !{!93, !94}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !86, file: !11, line: 65, type: !89)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !86, file: !11, line: 65, type: !14)
!95 = !DISubprogram(name: "CCTKi_SetupMainFunctions", scope: !1, file: !1, line: 74, type: !81, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTKi_SetupMainFunctions, variables: !2)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!97 = !DIGlobalVariable(name: "CCTK_Initialise", scope: !0, file: !11, line: 45, type: !15, isLocal: false, isDefinition: true, variable: i32 (%struct.tFleshConfig*)** @CCTK_Initialise)
!98 = !DIGlobalVariable(name: "overloaded", scope: !10, file: !11, line: 45, type: !14, isLocal: true, isDefinition: true, variable: i32* @CCTK_OverloadInitialise.overloaded)
!99 = !DIGlobalVariable(name: "CCTK_Evolve", scope: !0, file: !11, line: 46, type: !15, isLocal: false, isDefinition: true, variable: i32 (%struct.tFleshConfig*)** @CCTK_Evolve)
!100 = !DIGlobalVariable(name: "overloaded", scope: !69, file: !11, line: 46, type: !14, isLocal: true, isDefinition: true, variable: i32* @CCTK_OverloadEvolve.overloaded)
