; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Parameters.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.PARAM = type { %struct.PARAM_PROPS*, i8* }
%struct.PARAM_PROPS = type { i8*, i8*, i32, i8*, i8*, i32, %struct.RANGE*, i32, i32 }
%struct.RANGE = type { %struct.RANGE*, %struct.RANGE*, i8*, i8*, i32, i8* }
%struct.T_SKTREE = type { %struct.T_SKTREE*, %struct.T_SKTREE*, %struct.T_SKTREE*, %struct.T_SKTREE*, i8*, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.PARAMTREENODE = type { %struct.PARAMLIST* }
%struct.PARAMLIST = type { %struct.PARAM*, %struct.PARAMLIST*, %struct.PARAMLIST* }
%struct.regmatch_t = type { i32, i32 }

@cctk_parameter_set_mask = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [79 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Parameters.c\00", align 1
@.str1 = private unnamed_addr constant [7 x i8] c"Cactus\00", align 1
@.str2 = private unnamed_addr constant [65 x i8] c"CCTK_ParameterSet: Cannot set parameter '%s::%s' (non-steerable)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !68, globals: !358, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/Parameters.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !7, !8, !9, !11, !12, !14, !19, !20, !41, !30, !35, !65, !25, !48, !66, !67}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!11 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 30, baseType: !16)
!15 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !17, line: 92, baseType: !18)
!17 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_paramtreenode", file: !1, line: 64, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "PARAMTREENODE", file: !1, line: 61, size: 64, align: 64, elements: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "paramlist", scope: !22, file: !1, line: 63, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_paramlist", file: !1, line: 56, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "PARAMLIST", file: !1, line: 51, size: 192, align: 64, elements: !28)
!28 = !{!29, !62, !64}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !27, file: !1, line: 53, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_param", file: !1, line: 46, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "PARAM", file: !1, line: 42, size: 128, align: 64, elements: !33)
!33 = !{!34, !61}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !32, file: !1, line: 44, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "cParamData", file: !37, line: 112, baseType: !38)
!37 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Parameter.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "PARAM_PROPS", file: !37, line: 97, size: 512, align: 64, elements: !39)
!39 = !{!40, !42, !43, !44, !45, !46, !47, !59, !60}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 99, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !38, file: !37, line: 100, baseType: !41, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !38, file: !37, line: 101, baseType: !8, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !38, file: !37, line: 103, baseType: !41, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !38, file: !37, line: 104, baseType: !41, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !37, line: 106, baseType: !8, size: 32, align: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !38, file: !37, line: 107, baseType: !48, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_range", file: !37, line: 82, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "RANGE", file: !37, line: 74, size: 384, align: 64, elements: !51)
!51 = !{!52, !54, !55, !56, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !50, file: !37, line: 76, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !50, file: !37, line: 77, baseType: !53, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !50, file: !37, line: 78, baseType: !41, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !50, file: !37, line: 79, baseType: !41, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !50, file: !37, line: 80, baseType: !8, size: 32, align: 32, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !50, file: !37, line: 81, baseType: !41, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n_set", scope: !38, file: !37, line: 109, baseType: !8, size: 32, align: 32, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "steerable", scope: !38, file: !37, line: 110, baseType: !8, size: 32, align: 32, offset: 480)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !32, file: !1, line: 45, baseType: !19, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !27, file: !1, line: 54, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !1, line: 55, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!68 = !{!69, !72, !106, !131, !140, !151, !160, !173, !192, !217, !226, !231, !240, !249, !262, !268, !279, !287, !291, !297, !310, !317, !325, !331, !337, !344, !353}
!69 = !DISubprogram(name: "CCTKi_version_main_Parameters_c", scope: !1, file: !1, line: 29, type: !70, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_Parameters_c, variables: !2)
!70 = !DISubroutineType(types: !71)
!71 = !{!4}
!72 = !DISubprogram(name: "CCTKi_ParameterCreate", scope: !1, file: !1, line: 213, type: !73, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, ...)* @CCTKi_ParameterCreate, variables: !75)
!73 = !DISubroutineType(types: !74)
!74 = !{!8, !4, !4, !4, !4, !8, !4, !4, !19, !8, null}
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !104, !105}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !72, file: !1, line: 213, type: !4)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !72, file: !1, line: 214, type: !4)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !72, file: !1, line: 215, type: !4)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scope", arg: 4, scope: !72, file: !1, line: 216, type: !4)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "steerable", arg: 5, scope: !72, file: !1, line: 217, type: !8)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "description", arg: 6, scope: !72, file: !1, line: 218, type: !4)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "defval", arg: 7, scope: !72, file: !1, line: 219, type: !4)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 8, scope: !72, file: !1, line: 220, type: !19)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_ranges", arg: 9, scope: !72, file: !1, line: 221, type: !8)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !72, file: !1, line: 224, type: !8)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !72, file: !1, line: 224, type: !8)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !72, file: !1, line: 225, type: !30)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ranges", scope: !72, file: !1, line: 226, type: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !90, line: 31, baseType: !91)
!90 = !DIFile(filename: "/usr/include/sys/_types/_va_list.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !17, line: 98, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 226, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, align: 64, elements: !102)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 226, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 226, size: 192, align: 64, elements: !96)
!96 = !{!97, !99, !100, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !95, file: !1, line: 226, baseType: !98, size: 32, align: 32)
!98 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !95, file: !1, line: 226, baseType: !98, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !95, file: !1, line: 226, baseType: !19, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !95, file: !1, line: 226, baseType: !19, size: 64, align: 64, offset: 128)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rangeval", scope: !72, file: !1, line: 227, type: !4)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rangedesc", scope: !72, file: !1, line: 227, type: !4)
!106 = !DISubprogram(name: "CCTKi_ParameterAddRange", scope: !1, file: !1, line: 305, type: !107, isLocal: false, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, i8*, i8*)* @CCTKi_ParameterAddRange, variables: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{!8, !4, !4, !4, !4, !4}
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !130}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "implementation", arg: 1, scope: !106, file: !1, line: 305, type: !4)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !106, file: !1, line: 306, type: !4)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range_origin", arg: 3, scope: !106, file: !1, line: 307, type: !4)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range", arg: 4, scope: !106, file: !1, line: 308, type: !4)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range_description", arg: 5, scope: !106, file: !1, line: 309, type: !4)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !106, file: !1, line: 311, type: !8)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !106, file: !1, line: 312, type: !30)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thornlist", scope: !106, file: !1, line: 314, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sktree", file: !120, line: 23, baseType: !121)
!120 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/SKBinTree.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_SKTREE", file: !120, line: 14, size: 384, align: 64, elements: !122)
!122 = !{!123, !125, !126, !127, !128, !129}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !121, file: !120, line: 16, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !121, file: !120, line: 17, baseType: !124, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !120, line: 18, baseType: !124, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !121, file: !120, line: 19, baseType: !124, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !121, file: !120, line: 20, baseType: !41, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !120, line: 22, baseType: !19, size: 64, align: 64, offset: 320)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !106, file: !1, line: 314, type: !118)
!131 = !DISubprogram(name: "CCTK_ParameterSet", scope: !1, file: !1, line: 375, type: !132, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*)* @CCTK_ParameterSet, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{!8, !4, !4, !4}
!134 = !{!135, !136, !137, !138, !139}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !131, file: !1, line: 375, type: !4)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !131, file: !1, line: 375, type: !4)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !131, file: !1, line: 375, type: !4)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !131, file: !1, line: 377, type: !8)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !131, file: !1, line: 378, type: !30)
!140 = !DISubprogram(name: "CCTK_ParameterGet", scope: !1, file: !1, line: 465, type: !141, isLocal: false, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*, i32*)* @CCTK_ParameterGet, variables: !145)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !4, !4, !66}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!145 = !{!146, !147, !148, !149, !150}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !140, file: !1, line: 465, type: !4)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !140, file: !1, line: 465, type: !4)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !140, file: !1, line: 465, type: !66)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !140, file: !1, line: 467, type: !143)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !140, file: !1, line: 468, type: !30)
!151 = !DISubprogram(name: "CCTK_ParameterQueryTimesSet", scope: !1, file: !1, line: 514, type: !152, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @CCTK_ParameterQueryTimesSet, variables: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{!8, !4, !4}
!154 = !{!155, !156, !157}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !151, file: !1, line: 514, type: !4)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !151, file: !1, line: 514, type: !4)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param", scope: !151, file: !1, line: 516, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!160 = !DISubprogram(name: "CCTK_ParameterValString", scope: !1, file: !1, line: 552, type: !161, isLocal: false, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @CCTK_ParameterValString, variables: !163)
!161 = !DISubroutineType(types: !162)
!162 = !{!41, !4, !4}
!163 = !{!164, !165, !166, !167, !168, !169}
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param_name", arg: 1, scope: !160, file: !1, line: 552, type: !4)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !160, file: !1, line: 552, type: !4)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param_type", scope: !160, file: !1, line: 554, type: !8)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "param_data", scope: !160, file: !1, line: 555, type: !143)
