; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ParseFile.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@lineno = internal unnamed_addr global i32 1, align 4
@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [45 x i8] c"Parse error at line %d.  No value supplied.\0A\00", align 1
@.str1 = private unnamed_addr constant [8 x i8] c"%s%s%s\0A\00", align 1
@.str2 = private unnamed_addr constant [26 x i8] c"WARNING: Multiple string \00", align 1
@.str3 = private unnamed_addr constant [26 x i8] c"tokens not supported for \00", align 1
@.str4 = private unnamed_addr constant [22 x i8] c"This is a fatal error\00", align 1
@.str5 = private unnamed_addr constant [58 x i8] c"%sWarning:%s Quoted string contains newline for token %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !178, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ParseFile.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !{!7, !12, !164, !170}
!7 = !DISubprogram(name: "CCTKi_version_util_ParseFile_c", scope: !1, file: !1, line: 32, type: !8, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_util_ParseFile_c, variables: !2)
!8 = !DISubroutineType(types: !9)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!12 = !DISubprogram(name: "ParseFile", scope: !1, file: !1, line: 125, type: !13, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i32 (i8*, i8*, i32)*, %struct.tFleshConfig*)* @ParseFile, variables: !124)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !75, !78}
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 153, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !18, line: 122, size: 1216, align: 64, elements: !20)
!20 = !{!21, !24, !25, !26, !28, !29, !34, !35, !37, !41, !45, !55, !59, !60, !63, !64, !68, !72, !73, !74}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !19, file: !18, line: 123, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !19, file: !18, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !19, file: !18, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !18, line: 126, baseType: !27, size: 16, align: 16, offset: 128)
!27 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !19, file: !18, line: 127, baseType: !27, size: 16, align: 16, offset: 144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !19, file: !18, line: 128, baseType: !30, size: 128, align: 64, offset: 192)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !18, line: 88, size: 128, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !30, file: !18, line: 89, baseType: !22, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !30, file: !18, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !19, file: !18, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !19, file: !18, line: 132, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !19, file: !18, line: 133, baseType: !38, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!15, !36}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !19, file: !18, line: 134, baseType: !42, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!15, !36, !4, !15}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !19, file: !18, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !36, !49, !15}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !18, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !19, file: !18, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!15, !36, !10, !15}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !19, file: !18, line: 139, baseType: !30, size: 128, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !19, file: !18, line: 140, baseType: !61, size: 64, align: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !18, line: 94, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !19, file: !18, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !19, file: !18, line: 144, baseType: !65, size: 24, align: 8, offset: 928)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 24, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !19, file: !18, line: 145, baseType: !69, size: 8, align: 8, offset: 952)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !19, file: !18, line: 148, baseType: !30, size: 128, align: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !19, file: !18, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !18, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!15, !10, !10, !15}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !80, line: 28, baseType: !81)
!80 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!81 = !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 19, size: 192, align: 64, elements: !82)
!82 = !{!83, !84, !122}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !81, file: !80, line: 21, baseType: !4, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !81, file: !80, line: 24, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !88, line: 75, baseType: !89)
!88 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 24, size: 1216, align: 64, elements: !90)
!90 = !{!91, !92, !93, !95, !96, !97, !98, !99, !100, !101, !103, !105, !106, !107, !108, !109, !110, !111, !114, !115}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !89, file: !88, line: 26, baseType: !15, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !89, file: !88, line: 27, baseType: !15, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !89, file: !88, line: 30, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !89, file: !88, line: 31, baseType: !94, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !89, file: !88, line: 32, baseType: !94, size: 64, align: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !89, file: !88, line: 33, baseType: !94, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !89, file: !88, line: 36, baseType: !94, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !89, file: !88, line: 39, baseType: !94, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !89, file: !88, line: 40, baseType: !94, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !89, file: !88, line: 43, baseType: !102, size: 64, align: 64, offset: 512)
!102 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !89, file: !88, line: 44, baseType: !104, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !89, file: !88, line: 47, baseType: !104, size: 64, align: 64, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !89, file: !88, line: 51, baseType: !94, size: 64, align: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !89, file: !88, line: 54, baseType: !94, size: 64, align: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !89, file: !88, line: 57, baseType: !15, size: 32, align: 32, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !89, file: !88, line: 60, baseType: !94, size: 64, align: 64, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !89, file: !88, line: 63, baseType: !102, size: 64, align: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !88, line: 67, baseType: !112, size: 64, align: 64, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !89, file: !88, line: 70, baseType: !113, size: 64, align: 64, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !89, file: !88, line: 73, baseType: !116, size: 64, align: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !88, line: 22, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 18, size: 16, align: 8, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !118, file: !88, line: 20, baseType: !5, size: 8, align: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !118, file: !88, line: 21, baseType: !5, size: 8, align: 8, offset: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !81, file: !80, line: 25, baseType: !123, size: 32, align: 32, offset: 128)
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !143, !146, !152, !153, !154, !155, !157, !160, !161, !162, !163}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ifp", arg: 1, scope: !12, file: !1, line: 125, type: !16)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set_function", arg: 2, scope: !12, file: !1, line: 126, type: !75)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ConfigData", arg: 3, scope: !12, file: !1, line: 127, type: !78)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tokens", scope: !12, file: !1, line: 130, type: !4)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !12, file: !1, line: 130, type: !4)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subtoken", scope: !12, file: !1, line: 131, type: !4)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subvalue", scope: !12, file: !1, line: 131, type: !4)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntokens", scope: !12, file: !1, line: 133, type: !15)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intoken", scope: !12, file: !1, line: 135, type: !15)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inval", scope: !12, file: !1, line: 135, type: !15)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !12, file: !1, line: 139, type: !15)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_errors", scope: !12, file: !1, line: 140, type: !15)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ll", scope: !138, file: !1, line: 217, type: !123)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 216, column: 7)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 215, column: 11)
!140 = distinct !DILexicalBlock(scope: !141, file: !1, line: 214, column: 5)
!141 = distinct !DILexicalBlock(scope: !142, file: !1, line: 213, column: 9)
!142 = distinct !DILexicalBlock(scope: !12, file: !1, line: 156, column: 3)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !144, file: !1, line: 251, type: !15)
!144 = distinct !DILexicalBlock(scope: !145, file: !1, line: 249, column: 9)
!145 = distinct !DILexicalBlock(scope: !138, file: !1, line: 248, column: 13)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !147, file: !1, line: 295, type: !149)
!147 = distinct !DILexicalBlock(scope: !148, file: !1, line: 292, column: 9)
!148 = distinct !DILexicalBlock(scope: !145, file: !1, line: 291, column: 18)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 4000, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 500)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !147, file: !1, line: 296, type: !4)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !147, file: !1, line: 297, type: !4)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lpar", scope: !147, file: !1, line: 298, type: !15)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !156, file: !1, line: 322, type: !15)
!156 = distinct !DILexicalBlock(scope: !148, file: !1, line: 320, column: 9)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncommas", scope: !158, file: !1, line: 359, type: !15)
!158 = distinct !DILexicalBlock(scope: !159, file: !1, line: 357, column: 11)
!159 = distinct !DILexicalBlock(scope: !156, file: !1, line: 324, column: 15)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !158, file: !1, line: 360, type: !15)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !158, file: !1, line: 360, type: !15)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt", scope: !158, file: !1, line: 361, type: !15)
