; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ProcessCommandLine.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.tFleshConfig = type { i8*, %struct.cGH**, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@argc = internal unnamed_addr global i32 0, align 4
@argv = internal unnamed_addr global i8** null, align 8
@.str = private unnamed_addr constant [5 x i8] c"help\00", align 1
@.str1 = private unnamed_addr constant [24 x i8] c"describe-all-parameters\00", align 1
@.str2 = private unnamed_addr constant [19 x i8] c"describe-parameter\00", align 1
@.str3 = private unnamed_addr constant [16 x i8] c"test-parameters\00", align 1
@.str4 = private unnamed_addr constant [14 x i8] c"warning-level\00", align 1
@.str5 = private unnamed_addr constant [12 x i8] c"error-level\00", align 1
@.str6 = private unnamed_addr constant [16 x i8] c"parameter-level\00", align 1
@.str7 = private unnamed_addr constant [16 x i8] c"redirect-stdout\00", align 1
@.str8 = private unnamed_addr constant [12 x i8] c"list-thorns\00", align 1
@.str9 = private unnamed_addr constant [20 x i8] c"test-thorn-compiled\00", align 1
@.str10 = private unnamed_addr constant [8 x i8] c"version\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !105, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ProcessCommandLine.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !85, !90, !98}
!4 = !DISubprogram(name: "CCTKi_version_main_ProcessCommandLine_c", scope: !1, file: !1, line: 26, type: !5, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_ProcessCommandLine_c, variables: !2)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DISubprogram(name: "CCTKi_ProcessCommandLine", scope: !1, file: !1, line: 97, type: !11, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i8***, %struct.tFleshConfig*)* @CCTKi_ProcessCommandLine, variables: !64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !15, !18}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "tFleshConfig", file: !20, line: 28, baseType: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Flesh.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 19, size: 192, align: 64, elements: !22)
!22 = !{!23, !24, !62}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_file_name", scope: !21, file: !20, line: 21, baseType: !17, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !21, file: !20, line: 24, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !28, line: 75, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 24, size: 1216, align: 64, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !42, !44, !45, !46, !47, !48, !49, !50, !54, !55}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !29, file: !28, line: 26, baseType: !13, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !29, file: !28, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !29, file: !28, line: 30, baseType: !14, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !29, file: !28, line: 31, baseType: !14, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !29, file: !28, line: 32, baseType: !14, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !29, file: !28, line: 33, baseType: !14, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !29, file: !28, line: 36, baseType: !14, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !29, file: !28, line: 39, baseType: !14, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !29, file: !28, line: 40, baseType: !14, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !29, file: !28, line: 43, baseType: !41, size: 64, align: 64, offset: 512)
!41 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !29, file: !28, line: 44, baseType: !43, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !29, file: !28, line: 47, baseType: !43, size: 64, align: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !29, file: !28, line: 51, baseType: !14, size: 64, align: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !29, file: !28, line: 54, baseType: !14, size: 64, align: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !29, file: !28, line: 57, baseType: !13, size: 32, align: 32, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !29, file: !28, line: 60, baseType: !14, size: 64, align: 64, offset: 896)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !29, file: !28, line: 63, baseType: !41, size: 64, align: 64, offset: 960)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 67, baseType: !51, size: 64, align: 64, offset: 1024)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !29, file: !28, line: 70, baseType: !52, size: 64, align: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !29, file: !28, line: 73, baseType: !56, size: 64, align: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !28, line: 22, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 18, size: 16, align: 8, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !58, file: !28, line: 20, baseType: !9, size: 8, align: 8)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !58, file: !28, line: 21, baseType: !9, size: 8, align: 8, offset: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nGHs", scope: !21, file: !20, line: 25, baseType: !63, size: 32, align: 32, offset: 128)
!63 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!64 = !{!65, !66, !67, !68, !69, !70, !71}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inargc", arg: 1, scope: !10, file: !1, line: 97, type: !14)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inargv", arg: 2, scope: !10, file: !1, line: 97, type: !15)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ConfigData", arg: 3, scope: !10, file: !1, line: 97, type: !18)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "option_index", scope: !10, file: !1, line: 100, type: !13)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !10, file: !1, line: 101, type: !13)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ignore", scope: !10, file: !1, line: 102, type: !13)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "long_options", scope: !72, file: !1, line: 117, type: !75)
!72 = distinct !DILexicalBlock(scope: !73, file: !1, line: 116, column: 5)
!73 = distinct !DILexicalBlock(scope: !74, file: !1, line: 114, column: 3)
!74 = distinct !DILexicalBlock(scope: !10, file: !1, line: 113, column: 6)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 3328, align: 64, elements: !83)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !77, line: 83, size: 256, align: 64, elements: !78)
!77 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/getopt.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !{!79, !80, !81, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !77, line: 86, baseType: !7, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !76, file: !77, line: 92, baseType: !13, size: 32, align: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !76, file: !77, line: 93, baseType: !14, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !76, file: !77, line: 94, baseType: !13, size: 32, align: 32, offset: 192)
!83 = !{!84}
!84 = !DISubrange(count: 13)
!85 = !DISubprogram(name: "CCTK_CommandLine", scope: !1, file: !1, line: 214, type: !86, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8***)* @CCTK_CommandLine, variables: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{!13, !15}
!88 = !{!89}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outargv", arg: 1, scope: !85, file: !1, line: 214, type: !15)
!90 = !DISubprogram(name: "CCTK_ParameterFilename", scope: !1, file: !1, line: 255, type: !91, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*)* @CCTK_ParameterFilename, variables: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!13, !13, !17}
!93 = !{!94, !95, !96, !97}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 1, scope: !90, file: !1, line: 255, type: !13)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !90, file: !1, line: 255, type: !17)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !90, file: !1, line: 257, type: !13)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy_string", scope: !90, file: !1, line: 258, type: !7)
!98 = !DISubprogram(name: "cctk_parameterfilename_", scope: !1, file: !1, line: 279, type: !99, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i8*)* @cctk_parameterfilename_, variables: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !14, !14, !17}
!101 = !{!102, !103, !104}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 1, scope: !98, file: !1, line: 280, type: !14)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !98, file: !1, line: 280, type: !14)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !98, file: !1, line: 280, type: !17)
!105 = !{!106, !107, !108, !109}
!106 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 24, type: !7, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariable(name: "argc", scope: !0, file: !1, line: 49, type: !13, isLocal: true, isDefinition: true, variable: i32* @argc)
!108 = !DIGlobalVariable(name: "argv", scope: !0, file: !1, line: 51, type: !16, isLocal: true, isDefinition: true, variable: i8*** @argv)
!109 = !DIGlobalVariable(name: "parameter_file_name", scope: !0, file: !1, line: 47, type: !17, isLocal: true, isDefinition: true, variable: i8** @parameter_file_name)
!110 = !{i32 2, !"Dwarf Version", i32 2}
!111 = !{i32 2, !"Debug Info Version", i32 700000003}
!112 = !{i32 1, !"PIC Level", i32 2}
!113 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!114 = !DILocation(line: 26, column: 1, scope: !4)
!115 = !DIExpression()
!116 = !DILocation(line: 97, column: 35, scope: !10)
!117 = !DILocation(line: 97, column: 51, scope: !10)
!118 = !DILocation(line: 97, column: 73, scope: !10)
!119 = !DILocation(line: 100, column: 7, scope: !10)
!120 = !{!121, !121, i64 0}
!121 = !{!"int", !122, i64 0}
!122 = !{!"omnipotent char", !123, i64 0}
!123 = !{!"Simple C/C++ TBAA"}
!124 = !DILocation(line: 105, column: 10, scope: !10)
!125 = !DILocation(line: 105, column: 8, scope: !10)
!126 = !DILocation(line: 107, column: 10, scope: !10)
!127 = !{!128, !128, i64 0}
!128 = !{!"any pointer", !122, i64 0}
!129 = !DILocation(line: 107, column: 8, scope: !10)
!130 = !DILocation(line: 102, column: 7, scope: !10)
!131 = !DILocation(line: 113, column: 10, scope: !74)
!132 = !DILocation(line: 113, column: 6, scope: !10)
!133 = !DILocation(line: 117, column: 7, scope: !72)
!134 = !DILocation(line: 117, column: 21, scope: !72)
!135 = !DILocation(line: 135, column: 29, scope: !72)
!136 = !DILocation(line: 134, column: 11, scope: !72)
!137 = !DILocation(line: 101, column: 7, scope: !10)
