; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/PUGH_private.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@pughpriv_ = common global %struct.anon zeroinitializer, align 8

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!54, !55, !56}
!llvm.ident = !{!57}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !2, globals: !3, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CactusBindings/PUGH_private.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIGlobalVariable(name: "pughpriv_", scope: !0, file: !1, line: 59, type: !5, isLocal: false, isDefinition: true, variable: %struct.anon* @pughpriv_)
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 13, size: 1792, align: 64, elements: !6)
!6 = !{!7, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !5, file: !1, line: 15, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "initialize_memory", scope: !5, file: !1, line: 16, baseType: !8, size: 64, align: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !5, file: !1, line: 17, baseType: !8, size: 64, align: 64, offset: 128)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "partition_1d_x", scope: !5, file: !1, line: 18, baseType: !8, size: 64, align: 64, offset: 192)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "partition_2d_x", scope: !5, file: !1, line: 19, baseType: !8, size: 64, align: 64, offset: 256)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "partition_2d_y", scope: !5, file: !1, line: 20, baseType: !8, size: 64, align: 64, offset: 320)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "partition_3d_x", scope: !5, file: !1, line: 21, baseType: !8, size: 64, align: 64, offset: 384)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "partition_3d_y", scope: !5, file: !1, line: 22, baseType: !8, size: 64, align: 64, offset: 448)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "partition_3d_z", scope: !5, file: !1, line: 23, baseType: !8, size: 64, align: 64, offset: 512)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology", scope: !5, file: !1, line: 24, baseType: !8, size: 64, align: 64, offset: 576)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "storage_verbose", scope: !5, file: !1, line: 25, baseType: !8, size: 64, align: 64, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cacheline_mult", scope: !5, file: !1, line: 26, baseType: !21, size: 32, align: 32, offset: 704)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "enable_all_storage", scope: !5, file: !1, line: 27, baseType: !21, size: 32, align: 32, offset: 736)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "local_nsize", scope: !5, file: !1, line: 28, baseType: !21, size: 32, align: 32, offset: 768)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "local_nx", scope: !5, file: !1, line: 29, baseType: !21, size: 32, align: 32, offset: 800)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "local_ny", scope: !5, file: !1, line: 30, baseType: !21, size: 32, align: 32, offset: 832)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "local_nz", scope: !5, file: !1, line: 31, baseType: !21, size: 32, align: 32, offset: 864)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "overloadabort", scope: !5, file: !1, line: 32, baseType: !21, size: 32, align: 32, offset: 896)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "overloadarraygroupsizeb", scope: !5, file: !1, line: 33, baseType: !21, size: 32, align: 32, offset: 928)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "overloadbarrier", scope: !5, file: !1, line: 34, baseType: !21, size: 32, align: 32, offset: 960)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "overloaddisablegroupcomm", scope: !5, file: !1, line: 35, baseType: !21, size: 32, align: 32, offset: 992)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "overloaddisablegroupstorage", scope: !5, file: !1, line: 36, baseType: !21, size: 32, align: 32, offset: 1024)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "overloadenablegroupcomm", scope: !5, file: !1, line: 37, baseType: !21, size: 32, align: 32, offset: 1056)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "overloadenablegroupstorage", scope: !5, file: !1, line: 38, baseType: !21, size: 32, align: 32, offset: 1088)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "overloadevolve", scope: !5, file: !1, line: 39, baseType: !21, size: 32, align: 32, offset: 1120)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "overloadexit", scope: !5, file: !1, line: 40, baseType: !21, size: 32, align: 32, offset: 1152)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "overloadgroupdynamicdata", scope: !5, file: !1, line: 41, baseType: !21, size: 32, align: 32, offset: 1184)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "overloadmyproc", scope: !5, file: !1, line: 42, baseType: !21, size: 32, align: 32, offset: 1216)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "overloadnprocs", scope: !5, file: !1, line: 43, baseType: !21, size: 32, align: 32, offset: 1248)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "overloadparallelinit", scope: !5, file: !1, line: 44, baseType: !21, size: 32, align: 32, offset: 1280)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "overloadquerygroupstorageb", scope: !5, file: !1, line: 45, baseType: !21, size: 32, align: 32, offset: 1312)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "overloadsyncgroup", scope: !5, file: !1, line: 46, baseType: !21, size: 32, align: 32, offset: 1344)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "padding_active", scope: !5, file: !1, line: 47, baseType: !21, size: 32, align: 32, offset: 1376)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "padding_address_spacing", scope: !5, file: !1, line: 48, baseType: !21, size: 32, align: 32, offset: 1408)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "padding_cacheline_bits", scope: !5, file: !1, line: 49, baseType: !21, size: 32, align: 32, offset: 1440)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "padding_size", scope: !5, file: !1, line: 50, baseType: !21, size: 32, align: 32, offset: 1472)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology_1d_x", scope: !5, file: !1, line: 51, baseType: !21, size: 32, align: 32, offset: 1504)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology_2d_x", scope: !5, file: !1, line: 52, baseType: !21, size: 32, align: 32, offset: 1536)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology_2d_y", scope: !5, file: !1, line: 53, baseType: !21, size: 32, align: 32, offset: 1568)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology_3d_x", scope: !5, file: !1, line: 54, baseType: !21, size: 32, align: 32, offset: 1600)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology_3d_y", scope: !5, file: !1, line: 55, baseType: !21, size: 32, align: 32, offset: 1632)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "processor_topology_3d_z", scope: !5, file: !1, line: 56, baseType: !21, size: 32, align: 32, offset: 1664)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "storage_report_every", scope: !5, file: !1, line: 57, baseType: !21, size: 32, align: 32, offset: 1696)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "timer_output", scope: !5, file: !1, line: 58, baseType: !21, size: 32, align: 32, offset: 1728)
!54 = !{i32 2, !"Dwarf Version", i32 2}
!55 = !{i32 2, !"Debug Info Version", i32 700000003}
!56 = !{i32 1, !"PIC Level", i32 2}
!57 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
