; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/PughUtils.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon.0 = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }

@pughpriv_ = external global %struct.anon.0
@.str = private unnamed_addr constant [5 x i8] c"PUGH\00", align 1
@.str1 = private unnamed_addr constant [27 x i8] c"Single processor evolution\00", align 1
@.str2 = private unnamed_addr constant [30 x i8] c"%d-dimensional grid functions\00", align 1
@.str3 = private unnamed_addr constant [8 x i8] c"  Size:\00", align 1
@.str4 = private unnamed_addr constant [6 x i8] c"%s %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !78, globals: !288, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/PughUtils.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !10, line: 81, baseType: !11)
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !10, line: 13, size: 1152, align: 64, elements: !12)
!12 = !{!13, !15, !16, !17, !18, !19, !20, !21, !24, !25, !26, !27, !28, !30, !31, !32, !33, !34, !35, !36, !37, !38, !67, !77}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !11, file: !10, line: 17, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !11, file: !10, line: 18, baseType: !5, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !11, file: !10, line: 21, baseType: !5, size: 32, align: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !11, file: !10, line: 22, baseType: !5, size: 32, align: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !11, file: !10, line: 23, baseType: !5, size: 32, align: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !11, file: !10, line: 27, baseType: !5, size: 32, align: 32, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !11, file: !10, line: 28, baseType: !5, size: 32, align: 32, offset: 224)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !11, file: !10, line: 29, baseType: !22, size: 64, align: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !11, file: !10, line: 32, baseType: !5, size: 32, align: 32, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !11, file: !10, line: 34, baseType: !4, size: 64, align: 64, offset: 384)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !11, file: !10, line: 35, baseType: !5, size: 32, align: 32, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !11, file: !10, line: 37, baseType: !5, size: 32, align: 32, offset: 480)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !11, file: !10, line: 41, baseType: !29, size: 64, align: 64, offset: 512)
!29 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !11, file: !10, line: 41, baseType: !29, size: 64, align: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !11, file: !10, line: 41, baseType: !29, size: 64, align: 64, offset: 640)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !11, file: !10, line: 41, baseType: !29, size: 64, align: 64, offset: 704)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !11, file: !10, line: 44, baseType: !5, size: 32, align: 32, offset: 768)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !11, file: !10, line: 45, baseType: !5, size: 32, align: 32, offset: 800)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !11, file: !10, line: 46, baseType: !5, size: 32, align: 32, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !11, file: !10, line: 49, baseType: !5, size: 32, align: 32, offset: 864)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !11, file: !10, line: 53, baseType: !5, size: 32, align: 32, offset: 896)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !11, file: !10, line: 76, baseType: !39, size: 64, align: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !42, line: 72, baseType: !43)
!42 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !42, line: 37, size: 2368, align: 64, elements: !44)
!44 = !{!45, !46, !47, !48, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !64, !66}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !43, file: !42, line: 39, baseType: !5, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !43, file: !42, line: 41, baseType: !4, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !43, file: !42, line: 44, baseType: !29, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !43, file: !42, line: 45, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !43, file: !42, line: 46, baseType: !49, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !43, file: !42, line: 47, baseType: !4, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !43, file: !42, line: 49, baseType: !4, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !43, file: !42, line: 50, baseType: !5, size: 32, align: 32, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !43, file: !42, line: 51, baseType: !4, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !43, file: !42, line: 52, baseType: !49, size: 64, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !43, file: !42, line: 55, baseType: !4, size: 64, align: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !43, file: !42, line: 56, baseType: !4, size: 64, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !43, file: !42, line: 59, baseType: !4, size: 64, align: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !43, file: !42, line: 60, baseType: !60, size: 512, align: 64, offset: 832)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DISubrange(count: 4)
!63 = !DISubrange(count: 2)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !43, file: !42, line: 64, baseType: !65, size: 512, align: 64, offset: 1344)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 512, align: 64, elements: !61)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !43, file: !42, line: 68, baseType: !65, size: 512, align: 64, offset: 1856)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !11, file: !10, line: 77, baseType: !68, size: 64, align: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !42, line: 29, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !42, line: 23, size: 256, align: 64, elements: !72)
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !71, file: !42, line: 25, baseType: !5, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !71, file: !42, line: 26, baseType: !4, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !71, file: !42, line: 27, baseType: !49, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !71, file: !42, line: 28, baseType: !4, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !11, file: !10, line: 79, baseType: !6, size: 64, align: 64, offset: 1088)
!78 = !{!79, !84, !126, !202, !207, !272, !275, !285}
!79 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_PughUtils_c", scope: !1, file: !1, line: 24, type: !80, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_PughUtils_c, variables: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!84 = !DISubprogram(name: "PUGH_Topology", scope: !1, file: !1, line: 57, type: !85, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct.cGH*, i32)* @PUGH_Topology, variables: !122)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !89, !5}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !92, line: 75, baseType: !93)
!92 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 24, size: 1216, align: 64, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !93, file: !92, line: 26, baseType: !5, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !93, file: !92, line: 27, baseType: !5, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !93, file: !92, line: 30, baseType: !4, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !93, file: !92, line: 31, baseType: !4, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !93, file: !92, line: 32, baseType: !4, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !93, file: !92, line: 33, baseType: !4, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !93, file: !92, line: 36, baseType: !4, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !93, file: !92, line: 39, baseType: !4, size: 64, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !93, file: !92, line: 40, baseType: !4, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !93, file: !92, line: 43, baseType: !29, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !93, file: !92, line: 44, baseType: !106, size: 64, align: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !93, file: !92, line: 47, baseType: !106, size: 64, align: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !93, file: !92, line: 51, baseType: !4, size: 64, align: 64, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !93, file: !92, line: 54, baseType: !4, size: 64, align: 64, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !93, file: !92, line: 57, baseType: !5, size: 32, align: 32, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !93, file: !92, line: 60, baseType: !4, size: 64, align: 64, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !93, file: !92, line: 63, baseType: !29, size: 64, align: 64, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !92, line: 67, baseType: !22, size: 64, align: 64, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !93, file: !92, line: 70, baseType: !23, size: 64, align: 64, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !93, file: !92, line: 73, baseType: !116, size: 64, align: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !92, line: 22, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 18, size: 16, align: 8, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !118, file: !92, line: 20, baseType: !7, size: 8, align: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !118, file: !92, line: 21, baseType: !7, size: 8, align: 8, offset: 8)
!122 = !{!123, !124, !125}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !84, file: !1, line: 57, type: !89)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !84, file: !1, line: 57, type: !5)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !84, file: !1, line: 59, type: !8)
!126 = !DISubprogram(name: "PUGH_Report", scope: !1, file: !1, line: 74, type: !127, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cGH*)* @PUGH_Report, variables: !129)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !89}
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !196, !197, !198, !199}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !126, file: !1, line: 74, type: !89)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !126, file: !1, line: 76, type: !8)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !126, file: !1, line: 77, type: !5)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gi", scope: !126, file: !1, line: 77, type: !5)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !126, file: !1, line: 77, type: !5)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "havedims", scope: !126, file: !1, line: 78, type: !4)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mess", scope: !126, file: !1, line: 79, type: !6)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !126, file: !1, line: 83, type: !88)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !126, file: !1, line: 83, type: !88)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !126, file: !1, line: 83, type: !88)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !126, file: !1, line: 83, type: !88)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !126, file: !1, line: 83, type: !88)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !126, file: !1, line: 83, type: !88)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !126, file: !1, line: 83, type: !88)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !126, file: !1, line: 83, type: !88)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !126, file: !1, line: 83, type: !88)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !126, file: !1, line: 83, type: !88)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !126, file: !1, line: 83, type: !88)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !126, file: !1, line: 83, type: !88)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !126, file: !1, line: 83, type: !82)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !126, file: !1, line: 83, type: !82)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !126, file: !1, line: 83, type: !82)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !126, file: !1, line: 83, type: !82)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !126, file: !1, line: 83, type: !82)
