; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/RadiationBoundary.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@.str = private unnamed_addr constant [88 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/RadiationBoundary.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"Boundary\00", align 1
@.str2 = private unnamed_addr constant [56 x i8] c"Invalid group indices %d and/or %d in BndRadiativeDirGI\00", align 1
@.str3 = private unnamed_addr constant [53 x i8] c"Invalid group indices %d and/or %d in BndRadiativeGI\00", align 1
@.str4 = private unnamed_addr constant [58 x i8] c"Invalid group names '%s' and/or '%s' in BndRadiativeDirGN\00", align 1
@.str5 = private unnamed_addr constant [55 x i8] c"Invalid group names '%s' and/or '%s' in BndRadiativeGN\00", align 1
@.str6 = private unnamed_addr constant [59 x i8] c"Invalid variable indices %d and/or %d in BndRadiativeDirVI\00", align 1
@.str7 = private unnamed_addr constant [56 x i8] c"Invalid variable indices %d and/or %d in BndRadiativeVI\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !27, globals: !1848, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/RadiationBoundary.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !13, !14, !11, !12, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymmetryGHex", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/Symmetry.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symmetry", file: !6, line: 27, size: 64, align: 64, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "GFSym", scope: !7, file: !6, line: 34, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_CHAR", file: !15, line: 57, baseType: !16)
!15 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!27 = !{!28, !34, !83, !99, !112, !123, !137, !155, !168, !183, !194, !204, !214, !223, !236, !250, !262, !275}
!28 = !DISubprogram(name: "CCTKi_version_CactusBase_Boundary_RadiationBoundary_c", scope: !1, file: !1, line: 85, type: !29, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_Boundary_RadiationBoundary_c, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DISubprogram(name: "BndRadiativeDirGI", scope: !1, file: !1, line: 224, type: !35, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, double, double, i32, i32)* @BndRadiativeDirGI, variables: !72)
!35 = !DISubroutineType(types: !36)
!36 = !{!12, !37, !12, !12, !18, !18, !12, !12}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !40, line: 75, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 24, size: 1216, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !64, !65}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !41, file: !40, line: 26, baseType: !12, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !41, file: !40, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !41, file: !40, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !41, file: !40, line: 31, baseType: !11, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !41, file: !40, line: 32, baseType: !11, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !41, file: !40, line: 33, baseType: !11, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !41, file: !40, line: 36, baseType: !11, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !41, file: !40, line: 39, baseType: !11, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !41, file: !40, line: 40, baseType: !11, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !41, file: !40, line: 43, baseType: !18, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !41, file: !40, line: 44, baseType: !17, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !41, file: !40, line: 47, baseType: !17, size: 64, align: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !41, file: !40, line: 51, baseType: !11, size: 64, align: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !41, file: !40, line: 54, baseType: !11, size: 64, align: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !41, file: !40, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !41, file: !40, line: 60, baseType: !11, size: 64, align: 64, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !41, file: !40, line: 63, baseType: !18, size: 64, align: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !40, line: 67, baseType: !61, size: 64, align: 64, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !41, file: !40, line: 70, baseType: !62, size: 64, align: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !41, file: !40, line: 73, baseType: !66, size: 64, align: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !40, line: 22, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 18, size: 16, align: 8, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !68, file: !40, line: 20, baseType: !33, size: 8, align: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !68, file: !40, line: 21, baseType: !33, size: 8, align: 8, offset: 8)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !34, file: !1, line: 224, type: !37)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 2, scope: !34, file: !1, line: 225, type: !12)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 3, scope: !34, file: !1, line: 226, type: !12)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var0", arg: 4, scope: !34, file: !1, line: 227, type: !18)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "speed", arg: 5, scope: !34, file: !1, line: 228, type: !18)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi_to", arg: 6, scope: !34, file: !1, line: 229, type: !12)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi_from", arg: 7, scope: !34, file: !1, line: 230, type: !12)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_vi_to", scope: !34, file: !1, line: 232, type: !12)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_vi_from", scope: !34, file: !1, line: 232, type: !12)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !34, file: !1, line: 232, type: !12)
!83 = !DISubprogram(name: "bndradiativedirgi_", scope: !1, file: !1, line: 254, type: !84, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, double*, double*, i32*, i32*)* @bndradiativedirgi_, variables: !90)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !11, !37, !86, !86, !88, !88, !86, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !83, file: !1, line: 255, type: !11)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !83, file: !1, line: 256, type: !37)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 3, scope: !83, file: !1, line: 257, type: !86)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !83, file: !1, line: 258, type: !86)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var0", arg: 5, scope: !83, file: !1, line: 259, type: !88)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "speed", arg: 6, scope: !83, file: !1, line: 260, type: !88)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi_to", arg: 7, scope: !83, file: !1, line: 261, type: !86)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi_from", arg: 8, scope: !83, file: !1, line: 262, type: !86)
!99 = !DISubprogram(name: "BndRadiativeGI", scope: !1, file: !1, line: 315, type: !100, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, double, double, i32, i32)* @BndRadiativeGI, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!12, !37, !86, !18, !18, !12, !12}
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !99, file: !1, line: 315, type: !37)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 2, scope: !99, file: !1, line: 316, type: !86)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var0", arg: 3, scope: !99, file: !1, line: 317, type: !18)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "speed", arg: 4, scope: !99, file: !1, line: 318, type: !18)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi_to", arg: 5, scope: !99, file: !1, line: 319, type: !12)
