; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/ReductionNorm1.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.CCTK_COMPLEX16 = type { double, double }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }

@.str = private unnamed_addr constant [61 x i8] c"$Id: ReductionNorm1.c,v 1.4 2001/05/14 17:06:20 tradke Exp $\00", align 1
@.str1 = private unnamed_addr constant [87 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/ReductionNorm1.c\00", align 1
@.str2 = private unnamed_addr constant [11 x i8] c"PUGHReduce\00", align 1
@.str3 = private unnamed_addr constant [43 x i8] c"PUGH_ReductionNorm1: Unknown variable type\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_CactusPUGH_PUGHReduce_ReductionNorm1_c() #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !26, globals: !253, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/ReductionNorm1.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !8, !9, !11, !13, !15, !16, !18, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_BYTE", file: !6, line: 59, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_COMPLEX16", file: !6, line: 44, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 40, size: 128, align: 64, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !22, file: !6, line: 42, baseType: !8, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !22, file: !6, line: 43, baseType: !8, size: 64, align: 64, offset: 64)
!26 = !{!27, !33, !81, !92}
!27 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGHReduce_ReductionNorm1_c", scope: !1, file: !1, line: 23, type: !28, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGHReduce_ReductionNorm1_c, variables: !2)
!28 = !DISubroutineType(types: !29)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !DISubprogram(name: "PUGH_ReductionNorm1Arrays", scope: !1, file: !1, line: 111, type: !34, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32, i8**, i32, i32, i8*, i32)* @PUGH_ReductionNorm1Arrays, variables: !70)
!34 = !DISubroutineType(types: !35)
!35 = !{!10, !36, !10, !10, !9, !10, !60, !10, !10, !61, !10}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !38, line: 75, baseType: !39)
!38 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 24, size: 1216, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !62, !63}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !39, file: !38, line: 26, baseType: !10, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !39, file: !38, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !39, file: !38, line: 30, baseType: !9, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !39, file: !38, line: 31, baseType: !9, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !39, file: !38, line: 32, baseType: !9, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !39, file: !38, line: 33, baseType: !9, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !39, file: !38, line: 36, baseType: !9, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !39, file: !38, line: 39, baseType: !9, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !39, file: !38, line: 40, baseType: !9, size: 64, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !39, file: !38, line: 43, baseType: !8, size: 64, align: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !39, file: !38, line: 44, baseType: !15, size: 64, align: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !39, file: !38, line: 47, baseType: !15, size: 64, align: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !39, file: !38, line: 51, baseType: !9, size: 64, align: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !39, file: !38, line: 54, baseType: !9, size: 64, align: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !39, file: !38, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !39, file: !38, line: 60, baseType: !9, size: 64, align: 64, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !39, file: !38, line: 63, baseType: !8, size: 64, align: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !39, file: !38, line: 67, baseType: !59, size: 64, align: 64, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !39, file: !38, line: 70, baseType: !60, size: 64, align: 64, offset: 1088)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !39, file: !38, line: 73, baseType: !64, size: 64, align: 64, offset: 1152)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !38, line: 22, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 18, size: 16, align: 8, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !66, file: !38, line: 20, baseType: !32, size: 8, align: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !66, file: !38, line: 21, baseType: !32, size: 8, align: 8, offset: 8)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !33, file: !1, line: 111, type: !36)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !33, file: !1, line: 112, type: !10)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 3, scope: !33, file: !1, line: 113, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dims", arg: 4, scope: !33, file: !1, line: 114, type: !9)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_inarrays", arg: 5, scope: !33, file: !1, line: 115, type: !10)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inarrays", arg: 6, scope: !33, file: !1, line: 116, type: !60)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intype", arg: 7, scope: !33, file: !1, line: 117, type: !10)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_outvals", arg: 8, scope: !33, file: !1, line: 118, type: !10)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outvals", arg: 9, scope: !33, file: !1, line: 119, type: !61)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outtype", arg: 10, scope: !33, file: !1, line: 120, type: !10)
!81 = !DISubprogram(name: "PUGH_ReductionNorm1GVs", scope: !1, file: !1, line: 179, type: !82, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i8*, i32, i32*)* @PUGH_ReductionNorm1GVs, variables: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !36, !10, !10, !10, !61, !10, !9}
!84 = !{!85, !86, !87, !88, !89, !90, !91}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !81, file: !1, line: 179, type: !36)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !81, file: !1, line: 180, type: !10)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_outvals", arg: 3, scope: !81, file: !1, line: 181, type: !10)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outtype", arg: 4, scope: !81, file: !1, line: 182, type: !10)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outvals", arg: 5, scope: !81, file: !1, line: 183, type: !61)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_invars", arg: 6, scope: !81, file: !1, line: 184, type: !10)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invars", arg: 7, scope: !81, file: !1, line: 185, type: !9)
!92 = !DISubprogram(name: "PUGH_ReductionNorm1", scope: !1, file: !1, line: 207, type: !93, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32*, i32*, i32*, i32, i32, i32*, i8**, i32, double*)* @PUGH_ReductionNorm1, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{!10, !36, !10, !10, !9, !9, !9, !9, !10, !10, !9, !60, !10, !15}
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !179, !185, !186, !187, !188, !189, !190, !192, !193, !194, !195, !196, !197, !199, !200, !201, !202, !203, !204, !206, !207, !208, !209, !210, !211, !213, !214, !215, !216, !217, !218, !220, !221, !222, !223, !224, !225, !227, !228, !229, !230, !231, !232, !234, !235, !236, !237, !238, !239, !241, !242, !243, !244, !245, !246, !248, !249, !250, !251, !252}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !92, file: !1, line: 207, type: !36)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !92, file: !1, line: 208, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 3, scope: !92, file: !1, line: 209, type: !10)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from", arg: 4, scope: !92, file: !1, line: 210, type: !9)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "to", arg: 5, scope: !92, file: !1, line: 211, type: !9)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterator", arg: 6, scope: !92, file: !1, line: 212, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "points_per_dim", arg: 7, scope: !92, file: !1, line: 213, type: !9)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_points", arg: 8, scope: !92, file: !1, line: 214, type: !10)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_inarrays", arg: 9, scope: !92, file: !1, line: 215, type: !10)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intypes", arg: 10, scope: !92, file: !1, line: 216, type: !9)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inarrays", arg: 11, scope: !92, file: !1, line: 217, type: !60)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_outvals", arg: 12, scope: !92, file: !1, line: 218, type: !10)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outvals", arg: 13, scope: !92, file: !1, line: 219, type: !15)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !92, file: !1, line: 221, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total_outvals", scope: !92, file: !1, line: 221, type: !10)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !92, file: !1, line: 222, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !114, line: 81, baseType: !115)
!114 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !114, line: 13, size: 1152, align: 64, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !167, !177}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !115, file: !114, line: 17, baseType: !61, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !115, file: !114, line: 18, baseType: !10, size: 32, align: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !115, file: !114, line: 21, baseType: !10, size: 32, align: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !115, file: !114, line: 22, baseType: !10, size: 32, align: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !115, file: !114, line: 23, baseType: !10, size: 32, align: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !115, file: !114, line: 27, baseType: !10, size: 32, align: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !115, file: !114, line: 28, baseType: !10, size: 32, align: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !115, file: !114, line: 29, baseType: !59, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !115, file: !114, line: 32, baseType: !10, size: 32, align: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !115, file: !114, line: 34, baseType: !9, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !115, file: !114, line: 35, baseType: !10, size: 32, align: 32, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !115, file: !114, line: 37, baseType: !10, size: 32, align: 32, offset: 480)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !115, file: !114, line: 41, baseType: !8, size: 64, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !115, file: !114, line: 41, baseType: !8, size: 64, align: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !115, file: !114, line: 41, baseType: !8, size: 64, align: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !115, file: !114, line: 41, baseType: !8, size: 64, align: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !115, file: !114, line: 44, baseType: !10, size: 32, align: 32, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !115, file: !114, line: 45, baseType: !10, size: 32, align: 32, offset: 800)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !115, file: !114, line: 46, baseType: !10, size: 32, align: 32, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !115, file: !114, line: 49, baseType: !10, size: 32, align: 32, offset: 864)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !115, file: !114, line: 53, baseType: !10, size: 32, align: 32, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !115, file: !114, line: 76, baseType: !139, size: 64, align: 64, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !142, line: 72, baseType: !143)
!142 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !142, line: 37, size: 2368, align: 64, elements: !144)
!144 = !{!145, !146, !147, !148, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !164, !166}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !143, file: !142, line: 39, baseType: !10, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !143, file: !142, line: 41, baseType: !9, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !143, file: !142, line: 44, baseType: !8, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !143, file: !142, line: 45, baseType: !149, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !143, file: !142, line: 46, baseType: !149, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !143, file: !142, line: 47, baseType: !9, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !143, file: !142, line: 49, baseType: !9, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !143, file: !142, line: 50, baseType: !10, size: 32, align: 32, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !143, file: !142, line: 51, baseType: !9, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !143, file: !142, line: 52, baseType: !149, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !143, file: !142, line: 55, baseType: !9, size: 64, align: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !143, file: !142, line: 56, baseType: !9, size: 64, align: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !143, file: !142, line: 59, baseType: !9, size: 64, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !143, file: !142, line: 60, baseType: !160, size: 512, align: 64, offset: 832)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DISubrange(count: 4)
!163 = !DISubrange(count: 2)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !143, file: !142, line: 64, baseType: !165, size: 512, align: 64, offset: 1344)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 512, align: 64, elements: !161)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !143, file: !142, line: 68, baseType: !165, size: 512, align: 64, offset: 1856)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !115, file: !114, line: 77, baseType: !168, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !142, line: 29, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !142, line: 23, size: 256, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !171, file: !142, line: 25, baseType: !10, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !171, file: !142, line: 26, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !171, file: !142, line: 27, baseType: !149, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !171, file: !142, line: 28, baseType: !9, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !115, file: !114, line: 79, baseType: !178, size: 64, align: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_i", scope: !180, file: !1, line: 242, type: !10)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 242, column: 9)
!181 = distinct !DILexicalBlock(scope: !182, file: !1, line: 239, column: 5)
!182 = distinct !DILexicalBlock(scope: !183, file: !1, line: 237, column: 3)
!183 = distinct !DILexicalBlock(scope: !184, file: !1, line: 236, column: 3)
!184 = distinct !DILexicalBlock(scope: !92, file: !1, line: 236, column: 3)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_j", scope: !180, file: !1, line: 242, type: !10)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_dim", scope: !180, file: !1, line: 242, type: !10)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_vindex", scope: !180, file: !1, line: 242, type: !10)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !180, file: !1, line: 242, type: !4)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_outval", scope: !180, file: !1, line: 242, type: !5)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_i", scope: !191, file: !1, line: 250, type: !10)
!191 = distinct !DILexicalBlock(scope: !181, file: !1, line: 250, column: 9)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_j", scope: !191, file: !1, line: 250, type: !10)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_dim", scope: !191, file: !1, line: 250, type: !10)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_vindex", scope: !191, file: !1, line: 250, type: !10)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !191, file: !1, line: 250, type: !9)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_outval", scope: !191, file: !1, line: 250, type: !10)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_i", scope: !198, file: !1, line: 257, type: !10)
!198 = distinct !DILexicalBlock(scope: !181, file: !1, line: 257, column: 9)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_j", scope: !198, file: !1, line: 257, type: !10)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_dim", scope: !198, file: !1, line: 257, type: !10)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_vindex", scope: !198, file: !1, line: 257, type: !10)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !198, file: !1, line: 257, type: !11)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_outval", scope: !198, file: !1, line: 257, type: !12)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_i", scope: !205, file: !1, line: 265, type: !10)
!205 = distinct !DILexicalBlock(scope: !181, file: !1, line: 265, column: 9)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_j", scope: !205, file: !1, line: 265, type: !10)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_dim", scope: !205, file: !1, line: 265, type: !10)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_vindex", scope: !205, file: !1, line: 265, type: !10)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_vdata", scope: !205, file: !1, line: 265, type: !9)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_outval", scope: !205, file: !1, line: 265, type: !10)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_i", scope: !212, file: !1, line: 273, type: !10)
!212 = distinct !DILexicalBlock(scope: !181, file: !1, line: 273, column: 9)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_j", scope: !212, file: !1, line: 273, type: !10)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_dim", scope: !212, file: !1, line: 273, type: !10)
