; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/ReductionSum.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@.str = private unnamed_addr constant [59 x i8] c"$Id: ReductionSum.c,v 1.6 2001/11/05 15:04:13 tradke Exp $\00", align 1
@.str1 = private unnamed_addr constant [85 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/ReductionSum.c\00", align 1
@.str2 = private unnamed_addr constant [11 x i8] c"PUGHReduce\00", align 1
@.str3 = private unnamed_addr constant [78 x i8] c"PUGH_ReductionSum: Don't know how to compute the sum of complex variables !!!\00", align 1
@.str4 = private unnamed_addr constant [41 x i8] c"PUGH_ReductionSum: Unknown variable type\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_CactusPUGH_PUGHReduce_ReductionSum_c() #0 {
  ret i8* getelementptr inbounds ([59 x i8]* @.str, i64 0, i64 0), !dbg !178
}

; Function Attrs: nounwind optsize ssp uwtable
define i32 @PUGH_ReductionSumArrays(%struct.cGH* %GH, i32 %proc, i32 %num_dims, i32* %dims, i32 %num_inarrays, i8** %inarrays, i32 %intype, i32 %num_outvals, i8* %outvals, i32 %outtype) #1 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !20, globals: !172, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/ReductionSum.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !8, !9, !11, !13, !15, !16, !18}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_BYTE", file: !6, line: 59, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!20 = !{!21, !27, !75, !86}
!21 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGHReduce_ReductionSum_c", scope: !1, file: !1, line: 22, type: !22, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGHReduce_ReductionSum_c, variables: !2)
!22 = !DISubroutineType(types: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !DISubprogram(name: "PUGH_ReductionSumArrays", scope: !1, file: !1, line: 107, type: !28, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32, i8**, i32, i32, i8*, i32)* @PUGH_ReductionSumArrays, variables: !64)
!28 = !DISubroutineType(types: !29)
!29 = !{!10, !30, !10, !10, !9, !10, !54, !10, !10, !55, !10}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !32, line: 75, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 24, size: 1216, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !56, !57}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !33, file: !32, line: 26, baseType: !10, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !33, file: !32, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !33, file: !32, line: 30, baseType: !9, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !33, file: !32, line: 31, baseType: !9, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !33, file: !32, line: 32, baseType: !9, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !33, file: !32, line: 33, baseType: !9, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !33, file: !32, line: 36, baseType: !9, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !33, file: !32, line: 39, baseType: !9, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !33, file: !32, line: 40, baseType: !9, size: 64, align: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !33, file: !32, line: 43, baseType: !8, size: 64, align: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !33, file: !32, line: 44, baseType: !15, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !33, file: !32, line: 47, baseType: !15, size: 64, align: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !33, file: !32, line: 51, baseType: !9, size: 64, align: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !33, file: !32, line: 54, baseType: !9, size: 64, align: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !33, file: !32, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !33, file: !32, line: 60, baseType: !9, size: 64, align: 64, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !33, file: !32, line: 63, baseType: !8, size: 64, align: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !32, line: 67, baseType: !53, size: 64, align: 64, offset: 1024)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !33, file: !32, line: 70, baseType: !54, size: 64, align: 64, offset: 1088)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !33, file: !32, line: 73, baseType: !58, size: 64, align: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !32, line: 22, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 18, size: 16, align: 8, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !60, file: !32, line: 20, baseType: !26, size: 8, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !60, file: !32, line: 21, baseType: !26, size: 8, align: 8, offset: 8)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !27, file: !1, line: 107, type: !30)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !27, file: !1, line: 108, type: !10)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 3, scope: !27, file: !1, line: 109, type: !10)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dims", arg: 4, scope: !27, file: !1, line: 110, type: !9)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_inarrays", arg: 5, scope: !27, file: !1, line: 111, type: !10)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inarrays", arg: 6, scope: !27, file: !1, line: 112, type: !54)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intype", arg: 7, scope: !27, file: !1, line: 113, type: !10)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_outvals", arg: 8, scope: !27, file: !1, line: 114, type: !10)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outvals", arg: 9, scope: !27, file: !1, line: 115, type: !55)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outtype", arg: 10, scope: !27, file: !1, line: 116, type: !10)
!75 = !DISubprogram(name: "PUGH_ReductionSumGVs", scope: !1, file: !1, line: 177, type: !76, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32, i8*, i32, i32*)* @PUGH_ReductionSumGVs, variables: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{!10, !30, !10, !10, !10, !55, !10, !9}
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !75, file: !1, line: 177, type: !30)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !75, file: !1, line: 178, type: !10)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_outvals", arg: 3, scope: !75, file: !1, line: 179, type: !10)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outtype", arg: 4, scope: !75, file: !1, line: 180, type: !10)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outvals", arg: 5, scope: !75, file: !1, line: 181, type: !55)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_invars", arg: 6, scope: !75, file: !1, line: 182, type: !10)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invars", arg: 7, scope: !75, file: !1, line: 183, type: !9)
!86 = !DISubprogram(name: "PUGH_ReductionSum", scope: !1, file: !1, line: 203, type: !87, isLocal: true, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32*, i32*, i32*, i32, i32, i32*, i8**, i32, double*)* @PUGH_ReductionSum, variables: !89)
!87 = !DISubroutineType(types: !88)
!88 = !{!10, !30, !10, !10, !9, !9, !9, !9, !10, !10, !9, !54, !10, !15}
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !111, !112, !113, !114, !115, !116, !118, !119, !120, !121, !122, !123, !125, !126, !127, !128, !129, !130, !132, !133, !134, !135, !136, !137, !139, !140, !141, !142, !143, !144, !146, !147, !148, !149, !150, !151, !153, !154, !155, !156, !157, !158, !160, !161, !162, !163, !164, !165, !167, !168, !169, !170, !171}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !86, file: !1, line: 203, type: !30)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !86, file: !1, line: 204, type: !10)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 3, scope: !86, file: !1, line: 205, type: !10)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from", arg: 4, scope: !86, file: !1, line: 206, type: !9)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "to", arg: 5, scope: !86, file: !1, line: 207, type: !9)
