; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/Reduction.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }

@.str = private unnamed_addr constant [82 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/Reduction.c\00", align 1
@.str1 = private unnamed_addr constant [11 x i8] c"PUGHReduce\00", align 1
@.str2 = private unnamed_addr constant [121 x i8] c"PUGH_ReductionArrays: Don't know how to reduce a %d-dimensional array with %d elements to an output array of %d elements\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !97, globals: !256, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/Reduction.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !8, !10, !83, !84, !88, !5, !89, !90, !91, !92, !7, !93, !94, !95, !96}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !14, line: 126, baseType: !15)
!14 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !14, line: 96, size: 832, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !22, !23, !24, !25, !26, !27, !28, !55, !64, !78, !79, !80, !81}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !15, file: !14, line: 98, baseType: !8, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !15, file: !14, line: 99, baseType: !5, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !15, file: !14, line: 100, baseType: !5, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !15, file: !14, line: 101, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !15, file: !14, line: 102, baseType: !21, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !15, file: !14, line: 103, baseType: !5, size: 32, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !15, file: !14, line: 104, baseType: !5, size: 32, align: 32, offset: 288)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !15, file: !14, line: 106, baseType: !21, size: 64, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !15, file: !14, line: 114, baseType: !5, size: 32, align: 32, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !15, file: !14, line: 115, baseType: !5, size: 32, align: 32, offset: 416)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !15, file: !14, line: 117, baseType: !29, size: 64, align: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !14, line: 72, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !14, line: 37, size: 2368, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !52, !54}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !31, file: !14, line: 39, baseType: !5, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !31, file: !14, line: 41, baseType: !4, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !31, file: !14, line: 44, baseType: !7, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !31, file: !14, line: 45, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !31, file: !14, line: 46, baseType: !37, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !31, file: !14, line: 47, baseType: !4, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !31, file: !14, line: 49, baseType: !4, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !31, file: !14, line: 50, baseType: !5, size: 32, align: 32, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !31, file: !14, line: 51, baseType: !4, size: 64, align: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !31, file: !14, line: 52, baseType: !37, size: 64, align: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !31, file: !14, line: 55, baseType: !4, size: 64, align: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !31, file: !14, line: 56, baseType: !4, size: 64, align: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !31, file: !14, line: 59, baseType: !4, size: 64, align: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !31, file: !14, line: 60, baseType: !48, size: 512, align: 64, offset: 832)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DISubrange(count: 4)
!51 = !DISubrange(count: 2)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !31, file: !14, line: 64, baseType: !53, size: 512, align: 64, offset: 1344)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, align: 64, elements: !49)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !31, file: !14, line: 68, baseType: !53, size: 512, align: 64, offset: 1856)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !15, file: !14, line: 118, baseType: !56, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !14, line: 29, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !14, line: 23, size: 256, align: 64, elements: !59)
!59 = !{!60, !61, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !58, file: !14, line: 25, baseType: !5, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !58, file: !14, line: 26, baseType: !4, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !58, file: !14, line: 27, baseType: !37, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !58, file: !14, line: 28, baseType: !4, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !15, file: !14, line: 120, baseType: !65, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !14, line: 94, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !14, line: 74, size: 448, align: 64, elements: !68)
!68 = !{!69, !70, !72, !73, !74, !75, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !67, file: !14, line: 77, baseType: !4, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !67, file: !14, line: 78, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !67, file: !14, line: 79, baseType: !71, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !67, file: !14, line: 80, baseType: !5, size: 32, align: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !67, file: !14, line: 82, baseType: !4, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !67, file: !14, line: 84, baseType: !5, size: 32, align: 32, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !67, file: !14, line: 85, baseType: !5, size: 32, align: 32, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !67, file: !14, line: 86, baseType: !5, size: 32, align: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !15, file: !14, line: 121, baseType: !65, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !15, file: !14, line: 123, baseType: !5, size: 32, align: 32, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !15, file: !14, line: 124, baseType: !5, size: 32, align: 32, offset: 736)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !15, file: !14, line: 125, baseType: !82, size: 64, align: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_CHAR", file: !86, line: 57, baseType: !87)
!86 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_BYTE", file: !86, line: 59, baseType: !87)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!97 = !{!98, !103, !166, !184, !203, !218}
!98 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGHReduce_Reduction_c", scope: !1, file: !1, line: 20, type: !99, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGHReduce_Reduction_c, variables: !2)
!99 = !DISubroutineType(types: !100)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!103 = !DISubprogram(name: "PUGH_ReductionArrays", scope: !1, file: !1, line: 119, type: !104, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32, i32, i8**, i32, i32, i8*, i32 (%struct.cGH*, i32, i32, i32*, i32*, i32*, i32*, i32, i32, i32*, i8**, i32, double*)*)* @PUGH_ReductionArrays, variables: !142)
!104 = !DISubroutineType(types: !105)
!105 = !{!5, !106, !5, !5, !4, !5, !5, !71, !5, !5, !21, !137}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !108, line: 75, baseType: !109)
!108 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!109 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 24, size: 1216, align: 64, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !109, file: !108, line: 26, baseType: !5, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !109, file: !108, line: 27, baseType: !5, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !109, file: !108, line: 30, baseType: !4, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !109, file: !108, line: 31, baseType: !4, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !109, file: !108, line: 32, baseType: !4, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !109, file: !108, line: 33, baseType: !4, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !109, file: !108, line: 36, baseType: !4, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !109, file: !108, line: 39, baseType: !4, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !109, file: !108, line: 40, baseType: !4, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !109, file: !108, line: 43, baseType: !7, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !109, file: !108, line: 44, baseType: !6, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !109, file: !108, line: 47, baseType: !6, size: 64, align: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !109, file: !108, line: 51, baseType: !4, size: 64, align: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !109, file: !108, line: 54, baseType: !4, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !109, file: !108, line: 57, baseType: !5, size: 32, align: 32, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !109, file: !108, line: 60, baseType: !4, size: 64, align: 64, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !109, file: !108, line: 63, baseType: !7, size: 64, align: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !108, line: 67, baseType: !83, size: 64, align: 64, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !109, file: !108, line: 70, baseType: !71, size: 64, align: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !109, file: !108, line: 73, baseType: !131, size: 64, align: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !108, line: 22, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 18, size: 16, align: 8, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !133, file: !108, line: 20, baseType: !9, size: 8, align: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !133, file: !108, line: 21, baseType: !9, size: 8, align: 8, offset: 8)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "reduction_fn_t", file: !138, line: 150, baseType: !139)
!138 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGHReduce/../include/pugh_reductions.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!5, !106, !5, !5, !4, !4, !4, !4, !5, !5, !4, !71, !5, !6}
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !161, !162, !163, !164, !165}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !103, file: !1, line: 119, type: !106)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 2, scope: !103, file: !1, line: 120, type: !5)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 3, scope: !103, file: !1, line: 121, type: !5)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dims", arg: 4, scope: !103, file: !1, line: 122, type: !4)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intype", arg: 5, scope: !103, file: !1, line: 123, type: !5)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_inarrays", arg: 6, scope: !103, file: !1, line: 124, type: !5)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inarrays", arg: 7, scope: !103, file: !1, line: 125, type: !71)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outtype", arg: 8, scope: !103, file: !1, line: 126, type: !5)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_outvals", arg: 9, scope: !103, file: !1, line: 127, type: !5)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outvals", arg: 10, scope: !103, file: !1, line: 128, type: !21)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reduction_fn", arg: 11, scope: !103, file: !1, line: 129, type: !137)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !103, file: !1, line: 131, type: !5)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_points", scope: !103, file: !1, line: 131, type: !5)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !103, file: !1, line: 131, type: !5)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "from", scope: !103, file: !1, line: 132, type: !158)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, align: 32, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 1)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "to", scope: !103, file: !1, line: 132, type: !158)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterator", scope: !103, file: !1, line: 132, type: !158)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "points_per_dim", scope: !103, file: !1, line: 132, type: !158)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intypes", scope: !103, file: !1, line: 133, type: !4)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !103, file: !1, line: 134, type: !6)
!166 = !DISubprogram(name: "PUGH_ReductionGVs", scope: !1, file: !1, line: 264, type: !167, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, i32*, i32, i32, i8*, i32 (%struct.cGH*, i32, i32, i32*, i32*, i32*, i32*, i32, i32, i32*, i8**, i32, double*)*)* @PUGH_ReductionGVs, variables: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!5, !106, !5, !5, !4, !5, !5, !21, !137}
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !166, file: !1, line: 264, type: !106)
