; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/RobinBoundary.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@.str = private unnamed_addr constant [84 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/RobinBoundary.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"Boundary\00", align 1
@.str2 = private unnamed_addr constant [36 x i8] c"Invalid group index %d in BndFlatGI\00", align 1
@.str3 = private unnamed_addr constant [38 x i8] c"Invalid group name '%s' in BndRobinGN\00", align 1
@.str4 = private unnamed_addr constant [38 x i8] c"BndRobinVI: Invalid variable index %d\00", align 1
@.str5 = private unnamed_addr constant [41 x i8] c"Invalid variable name '%s' in BndRobinVN\00", align 1
@.str6 = private unnamed_addr constant [96 x i8] c"$Header: /cactus/CactusBase/Boundary/src/RobinBoundary.c,v 1.23 2001/12/13 16:18:05 allen Exp $\00", align 1
@.str7 = private unnamed_addr constant [54 x i8] c"ApplyBndRobin: Variable dimension of %d not supported\00", align 1
@.str8 = private unnamed_addr constant [59 x i8] c"ApplyBndRobin: NULL pointer passed for stencil width array\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !27, globals: !550, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/RobinBoundary.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !13, !14, !15, !11, !12, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymmetryGHex", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/Symmetry.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symmetry", file: !6, line: 27, size: 64, align: 64, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "GFSym", scope: !7, file: !6, line: 34, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_CHAR", file: !16, line: 57, baseType: !17)
!16 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!27 = !{!28, !34, !82, !94, !105, !119, !127, !135, !144, !154}
!28 = !DISubprogram(name: "CCTKi_version_CactusBase_Boundary_RobinBoundary_c", scope: !1, file: !1, line: 32, type: !29, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_Boundary_RobinBoundary_c, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DISubprogram(name: "BndRobinGI", scope: !1, file: !1, line: 122, type: !35, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, double, i32, i32)* @BndRobinGI, variables: !74)
!35 = !DISubroutineType(types: !36)
!36 = !{!12, !37, !72, !13, !12, !12}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !40, line: 75, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 24, size: 1216, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !64, !65}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !41, file: !40, line: 26, baseType: !12, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !41, file: !40, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !41, file: !40, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !41, file: !40, line: 31, baseType: !11, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !41, file: !40, line: 32, baseType: !11, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !41, file: !40, line: 33, baseType: !11, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !41, file: !40, line: 36, baseType: !11, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !41, file: !40, line: 39, baseType: !11, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !41, file: !40, line: 40, baseType: !11, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !41, file: !40, line: 43, baseType: !13, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !41, file: !40, line: 44, baseType: !18, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !41, file: !40, line: 47, baseType: !18, size: 64, align: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !41, file: !40, line: 51, baseType: !11, size: 64, align: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !41, file: !40, line: 54, baseType: !11, size: 64, align: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !41, file: !40, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !41, file: !40, line: 60, baseType: !11, size: 64, align: 64, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !41, file: !40, line: 63, baseType: !13, size: 64, align: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !40, line: 67, baseType: !61, size: 64, align: 64, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !41, file: !40, line: 70, baseType: !62, size: 64, align: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !41, file: !40, line: 73, baseType: !66, size: 64, align: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !40, line: 22, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 18, size: 16, align: 8, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !68, file: !40, line: 20, baseType: !33, size: 8, align: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !68, file: !40, line: 21, baseType: !33, size: 8, align: 8, offset: 8)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!74 = !{!75, !76, !77, !78, !79, !80, !81}
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !34, file: !1, line: 122, type: !37)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 2, scope: !34, file: !1, line: 123, type: !72)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "finf", arg: 3, scope: !34, file: !1, line: 124, type: !13)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npow", arg: 4, scope: !34, file: !1, line: 125, type: !12)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 5, scope: !34, file: !1, line: 126, type: !12)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_vi", scope: !34, file: !1, line: 128, type: !12)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !34, file: !1, line: 128, type: !12)
!82 = !DISubprogram(name: "bndrobingi_", scope: !1, file: !1, line: 147, type: !83, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, double*, i32*, i32*)* @bndrobingi_, variables: !87)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !11, !37, !72, !85, !72, !72}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !82, file: !1, line: 148, type: !11)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !82, file: !1, line: 149, type: !37)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 3, scope: !82, file: !1, line: 150, type: !72)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "finf", arg: 4, scope: !82, file: !1, line: 151, type: !85)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npow", arg: 5, scope: !82, file: !1, line: 152, type: !72)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 6, scope: !82, file: !1, line: 153, type: !72)
!94 = !DISubprogram(name: "BndRobinGN", scope: !1, file: !1, line: 200, type: !95, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, double, i32, i8*)* @BndRobinGN, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!12, !37, !72, !13, !12, !31}
!97 = !{!98, !99, !100, !101, !102, !103, !104}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !94, file: !1, line: 200, type: !37)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 2, scope: !94, file: !1, line: 201, type: !72)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "finf", arg: 3, scope: !94, file: !1, line: 202, type: !13)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "npow", arg: 4, scope: !94, file: !1, line: 203, type: !12)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 5, scope: !94, file: !1, line: 204, type: !31)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gi", scope: !94, file: !1, line: 206, type: !12)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !94, file: !1, line: 206, type: !12)
!105 = !DISubprogram(name: "bndrobingn_", scope: !1, file: !1, line: 224, type: !106, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, double*, i32*, i8*, i32)* @bndrobingn_, variables: !110)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !11, !37, !72, !85, !72, !108, !109}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
