; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/ScalarBoundary.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.CCTK_COMPLEX16 = type { double, double }

@.str = private unnamed_addr constant [85 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/ScalarBoundary.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"Boundary\00", align 1
@.str2 = private unnamed_addr constant [44 x i8] c"Invalid variable index %d in BndScalarDirVI\00", align 1
@.str3 = private unnamed_addr constant [44 x i8] c"Invalid variable index %d in ApplyBndScalar\00", align 1
@.str4 = private unnamed_addr constant [41 x i8] c"Invalid group index %d in BndScalarDirGI\00", align 1
@.str5 = private unnamed_addr constant [38 x i8] c"Invalid group index %d in BndScalarGI\00", align 1
@.str6 = private unnamed_addr constant [42 x i8] c"Invalid group name '%s' in BndScalarDirGN\00", align 1
@.str7 = private unnamed_addr constant [39 x i8] c"Invalid group name '%s' in BndScalarGN\00", align 1
@.str8 = private unnamed_addr constant [45 x i8] c"Invalid variable name '%s' in BndScalarDirVN\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !1200, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/ScalarBoundary.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !13, !16, !12, !11, !17, !18, !19, !25, !26, !27, !28, !29, !30, !31, !32}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymmetryGHex", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/Symmetry.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symmetry", file: !6, line: 27, size: 64, align: 64, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "GFSym", scope: !7, file: !6, line: 34, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_CHAR", file: !14, line: 57, baseType: !15)
!14 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!17 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_COMPLEX16", file: !14, line: 44, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 40, size: 128, align: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !21, file: !14, line: 42, baseType: !17, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !21, file: !14, line: 43, baseType: !17, size: 64, align: 64, offset: 64)
!25 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!29 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!31 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!33 = !{!34, !40, !85, !99, !108, !117, !126, !134, !142, !149, !160, !174, !184, !195, !204, !214, !222, !231}
!34 = !DISubprogram(name: "CCTKi_version_CactusBase_Boundary_ScalarBoundary_c", scope: !1, file: !1, line: 31, type: !35, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_Boundary_ScalarBoundary_c, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DISubprogram(name: "BndScalarDirVI", scope: !1, file: !1, line: 146, type: !41, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32, double, i32)* @BndScalarDirVI, variables: !78)
!41 = !DISubroutineType(types: !42)
!42 = !{!12, !43, !12, !12, !17, !12}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !46, line: 75, baseType: !47)
!46 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Boundary/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 24, size: 1216, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !70, !71}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !47, file: !46, line: 26, baseType: !12, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !47, file: !46, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !47, file: !46, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !47, file: !46, line: 31, baseType: !11, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !47, file: !46, line: 32, baseType: !11, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !47, file: !46, line: 33, baseType: !11, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !47, file: !46, line: 36, baseType: !11, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !47, file: !46, line: 39, baseType: !11, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !47, file: !46, line: 40, baseType: !11, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !47, file: !46, line: 43, baseType: !17, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !47, file: !46, line: 44, baseType: !18, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !47, file: !46, line: 47, baseType: !18, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !47, file: !46, line: 51, baseType: !11, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !47, file: !46, line: 54, baseType: !11, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !47, file: !46, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !47, file: !46, line: 60, baseType: !11, size: 64, align: 64, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !47, file: !46, line: 63, baseType: !17, size: 64, align: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !47, file: !46, line: 67, baseType: !67, size: 64, align: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !47, file: !46, line: 70, baseType: !68, size: 64, align: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !47, file: !46, line: 73, baseType: !72, size: 64, align: 64, offset: 1152)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !46, line: 22, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 18, size: 16, align: 8, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !74, file: !46, line: 20, baseType: !39, size: 8, align: 8)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !74, file: !46, line: 21, baseType: !39, size: 8, align: 8, offset: 8)
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !40, file: !1, line: 146, type: !43)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 2, scope: !40, file: !1, line: 147, type: !12)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 3, scope: !40, file: !1, line: 148, type: !12)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scalar", arg: 4, scope: !40, file: !1, line: 149, type: !17)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi", arg: 5, scope: !40, file: !1, line: 150, type: !12)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !40, file: !1, line: 152, type: !12)
!85 = !DISubprogram(name: "bndscalardirvi_", scope: !1, file: !1, line: 169, type: !86, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, i32*, double*, i32*)* @bndscalardirvi_, variables: !92)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !11, !43, !88, !88, !90, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !85, file: !1, line: 170, type: !11)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !85, file: !1, line: 171, type: !43)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil_size", arg: 3, scope: !85, file: !1, line: 172, type: !88)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !85, file: !1, line: 173, type: !88)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scalar", arg: 5, scope: !85, file: !1, line: 174, type: !90)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi", arg: 6, scope: !85, file: !1, line: 175, type: !88)
!99 = !DISubprogram(name: "BndScalarVI", scope: !1, file: !1, line: 217, type: !100, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32*, double, i32)* @BndScalarVI, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!12, !43, !88, !17, !12}
!102 = !{!103, !104, !105, !106, !107}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !99, file: !1, line: 217, type: !43)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 2, scope: !99, file: !1, line: 218, type: !88)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scalar", arg: 3, scope: !99, file: !1, line: 219, type: !17)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vi", arg: 4, scope: !99, file: !1, line: 220, type: !12)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !99, file: !1, line: 222, type: !12)
!108 = !DISubprogram(name: "bndscalarvi_", scope: !1, file: !1, line: 239, type: !109, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.cGH*, i32*, double*, i32*)* @bndscalarvi_, variables: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !11, !43, !88, !90, !88}
!111 = !{!112, !113, !114, !115, !116}
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ierr", arg: 1, scope: !108, file: !1, line: 240, type: !11)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !108, file: !1, line: 241, type: !43)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stencil", arg: 3, scope: !108, file: !1, line: 242, type: !88)
