; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleCreater.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.T_SCHED_MODIFIER = type { %struct.T_SCHED_MODIFIER*, i32, i8* }
%struct.t_sched_item = type { i8*, i32, i8*, i32, i32, i8**, i8*, %struct.T_SCHED_MODIFIER* }
%struct.t_sched_group = type { i8*, i32*, i32, %struct.t_sched_item* }

@schedule_groups = internal global %struct.cHandledData* null, align 8
@n_schedule_groups = internal unnamed_addr global i32 0, align 4
@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [66 x i8] c"Error while sorting group '%s' - %d remaining unsorted routines.\0A\00", align 1
@.str1 = private unnamed_addr constant [96 x i8] c"$Header: /cactus/Cactus/src/schedule/ScheduleCreater.c,v 1.11 2001/05/10 12:35:18 goodale Exp $\00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"before\00", align 1
@.str3 = private unnamed_addr constant [6 x i8] c"after\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !54, globals: !186, imports: !60)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleCreater.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 17, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctki_Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "sched_mod_none", value: 0)
!7 = !DIEnumerator(name: "sched_before", value: 1)
!8 = !DIEnumerator(name: "sched_after", value: 2)
!9 = !DIEnumerator(name: "sched_while", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 45, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "sched_item_none", value: 0)
!14 = !DIEnumerator(name: "sched_group", value: 1)
!15 = !DIEnumerator(name: "sched_function", value: 2)
!16 = !{!17, !26, !28, !30, !29, !40, !51}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_modifier", file: !4, line: 27, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_SCHED_MODIFIER", file: !4, line: 19, size: 192, align: 64, elements: !20)
!20 = !{!21, !23, !25}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !4, line: 21, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, file: !4, line: 23, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_modifier_type", file: !4, line: 17, baseType: !3)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !19, file: !4, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_group", file: !11, line: 73, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 64, size: 256, align: 64, elements: !33)
!33 = !{!34, !35, !38, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !11, line: 66, baseType: !26, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !32, file: !11, line: 67, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "n_scheditems", scope: !32, file: !11, line: 69, baseType: !37, size: 32, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "scheditems", scope: !32, file: !11, line: 71, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_item", file: !11, line: 62, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 47, size: 448, align: 64, elements: !43)
!43 = !{!44, !45, !47, !48, !49, !50, !52, !53}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !11, line: 49, baseType: !26, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !11, line: 51, baseType: !46, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_item_type", file: !11, line: 45, baseType: !10)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !42, file: !11, line: 53, baseType: !29, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !42, file: !11, line: 54, baseType: !37, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "n_whiles", scope: !42, file: !11, line: 56, baseType: !37, size: 32, align: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "whiles", scope: !42, file: !11, line: 57, baseType: !51, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !42, file: !11, line: 59, baseType: !29, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !42, file: !11, line: 61, baseType: !17, size: 64, align: 64, offset: 384)
!54 = !{!55, !61, !69, !82, !95, !103, !122, !130, !138, !146, !155, !161, !178}
!55 = !DISubprogram(name: "CCTKi_version_schedule_ScheduleCreater_c", scope: !1, file: !1, line: 26, type: !56, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_schedule_ScheduleCreater_c, variables: !60)
!56 = !DISubroutineType(types: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!60 = !{}
!61 = !DISubprogram(name: "CCTKi_ScheduleAddModifier", scope: !1, file: !1, line: 107, type: !62, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: %struct.T_SCHED_MODIFIER* (%struct.T_SCHED_MODIFIER*, i8*, i8*)* @CCTKi_ScheduleAddModifier, variables: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{!17, !17, !58, !58}
!64 = !{!65, !66, !67, !68}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig", arg: 1, scope: !61, file: !1, line: 107, type: !17)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifier", arg: 2, scope: !61, file: !1, line: 108, type: !58)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argument", arg: 3, scope: !61, file: !1, line: 109, type: !58)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !61, file: !1, line: 111, type: !17)
!69 = !DISubprogram(name: "CCTKi_DoScheduleFunction", scope: !1, file: !1, line: 186, type: !70, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, %struct.T_SCHED_MODIFIER*, i8*)* @CCTKi_DoScheduleFunction, variables: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!37, !58, !58, !29, !17, !29}
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 1, scope: !69, file: !1, line: 186, type: !58)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 2, scope: !69, file: !1, line: 187, type: !58)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 3, scope: !69, file: !1, line: 188, type: !29)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifiers", arg: 4, scope: !69, file: !1, line: 189, type: !17)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attributes", arg: 5, scope: !69, file: !1, line: 190, type: !29)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !69, file: !1, line: 192, type: !37)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !69, file: !1, line: 193, type: !37)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_group", scope: !69, file: !1, line: 194, type: !30)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newitem", scope: !69, file: !1, line: 195, type: !40)
!82 = !DISubprogram(name: "CCTKi_DoScheduleGroup", scope: !1, file: !1, line: 270, type: !83, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, %struct.T_SCHED_MODIFIER*, i8*)* @CCTKi_DoScheduleGroup, variables: !85)
!83 = !DISubroutineType(types: !84)
!84 = !{!37, !58, !58, !17, !29}
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gname", arg: 1, scope: !82, file: !1, line: 270, type: !58)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thisname", arg: 2, scope: !82, file: !1, line: 271, type: !58)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifiers", arg: 3, scope: !82, file: !1, line: 272, type: !17)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attributes", arg: 4, scope: !82, file: !1, line: 273, type: !29)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !82, file: !1, line: 275, type: !37)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !82, file: !1, line: 276, type: !37)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thishandle", scope: !82, file: !1, line: 277, type: !37)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_group", scope: !82, file: !1, line: 278, type: !30)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newitem", scope: !82, file: !1, line: 279, type: !40)
!95 = !DISubprogram(name: "CCTKi_DoScheduleSortAllGroups", scope: !1, file: !1, line: 339, type: !96, isLocal: false, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @CCTKi_DoScheduleSortAllGroups, variables: !98)
!96 = !DISubroutineType(types: !97)
!97 = !{!37}
!98 = !{!99, !100, !101, !102}
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !95, file: !1, line: 341, type: !37)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gdata", scope: !95, file: !1, line: 342, type: !30)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errcode", scope: !95, file: !1, line: 343, type: !37)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_errors", scope: !95, file: !1, line: 344, type: !37)
!103 = !DISubprogram(name: "CCTKi_DoScheduleGetGroups", scope: !1, file: !1, line: 387, type: !104, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: true, function: %struct.cHandledData* ()* @CCTKi_DoScheduleGetGroups, variables: !60)
!104 = !DISubroutineType(types: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !108, line: 28, baseType: !109)
!108 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!109 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 23, size: 128, align: 64, elements: !110)
!110 = !{!111, !120, !121}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !109, file: !108, line: 25, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !108, line: 21, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 16, size: 192, align: 64, elements: !115)
!115 = !{!116, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !114, file: !108, line: 18, baseType: !117, size: 32, align: 32)
!117 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !108, line: 19, baseType: !26, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !108, line: 20, baseType: !29, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !109, file: !108, line: 26, baseType: !117, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !109, file: !108, line: 27, baseType: !117, size: 32, align: 32, offset: 96)
!122 = !DISubprogram(name: "ScheduleCreateGroup", scope: !1, file: !1, line: 423, type: !123, isLocal: true, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @ScheduleCreateGroup, variables: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{!37, !58}
!125 = !{!126, !127, !128, !129}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !122, file: !1, line: 423, type: !58)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !122, file: !1, line: 425, type: !37)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !122, file: !1, line: 426, type: !37)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_group", scope: !122, file: !1, line: 428, type: !30)
!130 = !DISubprogram(name: "ScheduleCreateItem", scope: !1, file: !1, line: 510, type: !131, isLocal: true, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_sched_item* (i8*, %struct.T_SCHED_MODIFIER*, i8*)* @ScheduleCreateItem, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!40, !58, !17, !29}
!133 = !{!134, !135, !136, !137}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !130, file: !1, line: 510, type: !58)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifiers", arg: 2, scope: !130, file: !1, line: 510, type: !17)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attributes", arg: 3, scope: !130, file: !1, line: 510, type: !29)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !130, file: !1, line: 512, type: !40)
!138 = !DISubprogram(name: "ScheduleSetupWhiles", scope: !1, file: !1, line: 910, type: !139, isLocal: true, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, variables: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!37, !40}
!141 = !{!142, !143, !144, !145}
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !138, file: !1, line: 910, type: !40)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !138, file: !1, line: 912, type: !37)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modifier", scope: !138, file: !1, line: 913, type: !17)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !138, file: !1, line: 914, type: !51)
!146 = !DISubprogram(name: "ScheduleAddItem", scope: !1, file: !1, line: 584, type: !147, isLocal: true, isDefinition: true, scopeLine: 585, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_sched_item*)* @ScheduleAddItem, variables: !149)
!147 = !DISubroutineType(types: !148)
!148 = !{!37, !37, !40}
!149 = !{!150, !151, !152, !153, !154}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghandle", arg: 1, scope: !146, file: !1, line: 584, type: !37)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !146, file: !1, line: 584, type: !40)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !146, file: !1, line: 586, type: !37)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_group", scope: !146, file: !1, line: 587, type: !30)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !146, file: !1, line: 588, type: !40)
!155 = !DISubprogram(name: "ScheduleTranslateModifierType", scope: !1, file: !1, line: 645, type: !156, isLocal: true, isDefinition: true, scopeLine: 646, flags: DIFlagPrototyped, isOptimized: true, variables: !158)
!156 = !DISubroutineType(types: !157)
!157 = !{!24, !58}
!158 = !{!159, !160}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifier", arg: 1, scope: !155, file: !1, line: 645, type: !58)
