; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleInterface.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.cTimerData = type { i32, %struct.cTimerVal* }
%struct.cTimerVal = type { i32, i8*, i8*, %union.anon }
%union.anon = type { i64 }
%struct.cFunctionData = type { i32, i32 (%struct.cGH*, i8*)*, i32, i32, i32*, i32, i32, i32*, i8*, i8*, i8* }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.t_attribute = type { i8*, i8*, i32, %struct.cFunctionData, i32, i32*, i32, i32*, i32, i32*, i32*, i32 }
%struct.T_SCHED_MODIFIER = type { %struct.T_SCHED_MODIFIER*, i32, i8* }
%struct.t_sched_data = type { %struct.cGH*, i32, %struct.cTimerData*, %struct.cTimerData*, i32, i32, i32 (i8*, %struct.cFunctionData*, i8*)* }

@.str = private unnamed_addr constant [86 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleInterface.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !37, subprograms: !133, globals: !482, imports: !139)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleInterface.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !14, !19, !26, !30}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "LangNone", value: 0)
!7 = !DIEnumerator(name: "LangC", value: 1)
!8 = !DIEnumerator(name: "LangFortran", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !10)
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "FunctionNoArgs", value: 0)
!12 = !DIEnumerator(name: "FunctionOneArg", value: 1)
!13 = !DIEnumerator(name: "FunctionStandard", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 47, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "sched_none", value: 0)
!17 = !DIEnumerator(name: "sched_group", value: 1)
!18 = !DIEnumerator(name: "sched_function", value: 2)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 17, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctki_Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "sched_mod_none", value: 0)
!23 = !DIEnumerator(name: "sched_before", value: 1)
!24 = !DIEnumerator(name: "sched_after", value: 2)
!25 = !DIEnumerator(name: "sched_while", value: 3)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 48, size: 32, align: 32, elements: !27)
!27 = !{!28, !29}
!28 = !DIEnumerator(name: "schedpoint_misc", value: 0)
!29 = !DIEnumerator(name: "schedpoint_analysis", value: 1)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 16, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctk_Timers.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "val_none", value: 0)
!34 = !DIEnumerator(name: "val_int", value: 1)
!35 = !DIEnumerator(name: "val_long", value: 2)
!36 = !DIEnumerator(name: "val_double", value: 3)
!37 = !{!38, !42, !46, !45, !49, !50, !86, !89, !94, !97, !93, !112}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!41}
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!41, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !45}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !52, line: 75, baseType: !53)
!52 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 24, size: 1216, align: 64, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !66, !68, !69, !70, !71, !72, !73, !74, !77, !78}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !53, file: !52, line: 26, baseType: !41, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !53, file: !52, line: 27, baseType: !41, size: 32, align: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !53, file: !52, line: 30, baseType: !49, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !53, file: !52, line: 31, baseType: !49, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !53, file: !52, line: 32, baseType: !49, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !53, file: !52, line: 33, baseType: !49, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !53, file: !52, line: 36, baseType: !49, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !53, file: !52, line: 39, baseType: !49, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !53, file: !52, line: 40, baseType: !49, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !53, file: !52, line: 43, baseType: !65, size: 64, align: 64, offset: 512)
!65 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !53, file: !52, line: 44, baseType: !67, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !53, file: !52, line: 47, baseType: !67, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !53, file: !52, line: 51, baseType: !49, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !53, file: !52, line: 54, baseType: !49, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !53, file: !52, line: 57, baseType: !41, size: 32, align: 32, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !53, file: !52, line: 60, baseType: !49, size: 64, align: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !53, file: !52, line: 63, baseType: !65, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !52, line: 67, baseType: !75, size: 64, align: 64, offset: 1024)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !53, file: !52, line: 70, baseType: !76, size: 64, align: 64, offset: 1088)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !53, file: !52, line: 73, baseType: !79, size: 64, align: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !52, line: 22, baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 18, size: 16, align: 8, elements: !82)
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !81, file: !52, line: 20, baseType: !84, size: 8, align: 8)
!84 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !52, line: 21, baseType: !84, size: 8, align: 8, offset: 8)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!41, !45, !45}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!41, !41, !92, !45, !45, !41}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!41, !45, !45, !45}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_attribute", file: !1, line: 78, baseType: !99)
!99 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 50, size: 1280, align: 64, elements: !100)
!100 = !{!101, !102, !103, !105, !125, !126, !127, !128, !129, !130, !131, !132}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !99, file: !1, line: 53, baseType: !93, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !99, file: !1, line: 56, baseType: !93, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !1, line: 58, baseType: !104, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "iSchedType", file: !1, line: 47, baseType: !14)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "FunctionData", scope: !99, file: !1, line: 60, baseType: !106, size: 576, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "cFunctionData", file: !4, line: 43, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 18, size: 576, align: 64, elements: !108)
!108 = !{!109, !111, !115, !117, !118, !119, !120, !121, !122, !123, !124}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !107, file: !4, line: 20, baseType: !110, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "cLanguage", file: !4, line: 14, baseType: !3)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "FortranCaller", scope: !107, file: !4, line: 22, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!41, !50, !45}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !4, line: 24, baseType: !116, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "cFunctionType", file: !4, line: 16, baseType: !9)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_SyncGroups", scope: !107, file: !4, line: 26, baseType: !41, size: 32, align: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "SyncGroups", scope: !107, file: !4, line: 28, baseType: !49, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !107, file: !4, line: 32, baseType: !41, size: 32, align: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "n_TriggerGroups", scope: !107, file: !4, line: 37, baseType: !41, size: 32, align: 32, offset: 288)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TriggerGroups", scope: !107, file: !4, line: 38, baseType: !49, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !107, file: !4, line: 39, baseType: !93, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !107, file: !4, line: 40, baseType: !93, size: 64, align: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !107, file: !4, line: 41, baseType: !93, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "n_mem_groups", scope: !99, file: !1, line: 62, baseType: !41, size: 32, align: 32, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mem_groups", scope: !99, file: !1, line: 63, baseType: !49, size: 64, align: 64, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "n_comm_groups", scope: !99, file: !1, line: 65, baseType: !41, size: 32, align: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "comm_groups", scope: !99, file: !1, line: 66, baseType: !49, size: 64, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "timer_handle", scope: !99, file: !1, line: 70, baseType: !41, size: 32, align: 32, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CommOnEntry", scope: !99, file: !1, line: 73, baseType: !49, size: 64, align: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "StorageOnEntry", scope: !99, file: !1, line: 74, baseType: !49, size: 64, align: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "done_entry", scope: !99, file: !1, line: 76, baseType: !41, size: 32, align: 32, offset: 1216)
!133 = !{!134, !140, !151, !197, !218, !224, !228, !240, !244, !247, !283, !289, !297, !308, !313, !323, !330, !341, !360, !369, !374, !383, !389, !398, !408, !416, !421, !425, !429, !437, !442, !451, !456, !462, !472}
!134 = !DISubprogram(name: "CCTKi_version_main_ScheduleInterface_c", scope: !1, file: !1, line: 40, type: !135, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_main_ScheduleInterface_c, variables: !139)
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!139 = !{}
!140 = !DISubprogram(name: "CCTK_CallFunction", scope: !1, file: !1, line: 233, type: !141, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.cFunctionData*, i8*)* @CCTK_CallFunction, variables: !144)
!141 = !DISubroutineType(types: !142)
!142 = !{!41, !45, !143, !45}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!144 = !{!145, !146, !147, !148, !149, !150}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function", arg: 1, scope: !140, file: !1, line: 233, type: !45)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fdata", arg: 2, scope: !140, file: !1, line: 234, type: !143)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 3, scope: !140, file: !1, line: 235, type: !45)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "standardfunc", scope: !140, file: !1, line: 237, type: !46)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "noargsfunc", scope: !140, file: !1, line: 239, type: !38)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oneargfunc", scope: !140, file: !1, line: 241, type: !42)
!151 = !DISubprogram(name: "CCTKi_ScheduleFunction", scope: !1, file: !1, line: 373, type: !152, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, ...)* @CCTKi_ScheduleFunction, variables: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{!41, !45, !137, !137, !137, !137, !137, !137, !41, !41, !41, !41, !41, !41, !41, !41, null}
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !182}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function", arg: 1, scope: !151, file: !1, line: 373, type: !45)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !151, file: !1, line: 374, type: !137)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 3, scope: !151, file: !1, line: 375, type: !137)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "implementation", arg: 4, scope: !151, file: !1, line: 376, type: !137)
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "description", arg: 5, scope: !151, file: !1, line: 377, type: !137)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 6, scope: !151, file: !1, line: 378, type: !137)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "language", arg: 7, scope: !151, file: !1, line: 379, type: !137)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_mem_groups", arg: 8, scope: !151, file: !1, line: 380, type: !41)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_comm_groups", arg: 9, scope: !151, file: !1, line: 381, type: !41)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_trigger_groups", arg: 10, scope: !151, file: !1, line: 382, type: !41)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_sync_groups", arg: 11, scope: !151, file: !1, line: 383, type: !41)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_options", arg: 12, scope: !151, file: !1, line: 384, type: !41)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_before", arg: 13, scope: !151, file: !1, line: 385, type: !41)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_after", arg: 14, scope: !151, file: !1, line: 386, type: !41)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_while", arg: 15, scope: !151, file: !1, line: 387, type: !41)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !151, file: !1, line: 391, type: !41)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attribute", scope: !151, file: !1, line: 392, type: !97)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modifier", scope: !151, file: !1, line: 393, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_modifier", file: !20, line: 27, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_SCHED_MODIFIER", file: !20, line: 19, size: 192, align: 64, elements: !176)
!176 = !{!177, !179, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !20, line: 21, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !20, line: 23, baseType: !180, size: 32, align: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_modifier_type", file: !20, line: 17, baseType: !19)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !175, file: !20, line: 25, baseType: !93, size: 64, align: 64, offset: 128)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !151, file: !1, line: 394, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !184, line: 30, baseType: !185)
!184 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stdarg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 394, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 192, align: 64, elements: !195)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 394, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 394, size: 192, align: 64, elements: !189)
!189 = !{!190, !192, !193, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !188, file: !1, line: 394, baseType: !191, size: 32, align: 32)
!191 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !188, file: !1, line: 394, baseType: !191, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !188, file: !1, line: 394, baseType: !45, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !188, file: !1, line: 394, baseType: !45, size: 64, align: 64, offset: 128)
!195 = !{!196}
!196 = !DISubrange(count: 1)
!197 = !DISubprogram(name: "CCTKi_ScheduleGroup", scope: !1, file: !1, line: 513, type: !198, isLocal: false, isDefinition: true, scopeLine: 528, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, ...)* @CCTKi_ScheduleGroup, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!41, !137, !137, !137, !137, !137, !41, !41, !41, !41, !41, !41, !41, !41, null}
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !197, file: !1, line: 513, type: !137)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "thorn", arg: 2, scope: !197, file: !1, line: 514, type: !137)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "implementation", arg: 3, scope: !197, file: !1, line: 515, type: !137)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "description", arg: 4, scope: !197, file: !1, line: 516, type: !137)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 5, scope: !197, file: !1, line: 517, type: !137)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_mem_groups", arg: 6, scope: !197, file: !1, line: 518, type: !41)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_comm_groups", arg: 7, scope: !197, file: !1, line: 519, type: !41)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_trigger_groups", arg: 8, scope: !197, file: !1, line: 520, type: !41)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_sync_groups", arg: 9, scope: !197, file: !1, line: 521, type: !41)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_options", arg: 10, scope: !197, file: !1, line: 522, type: !41)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_before", arg: 11, scope: !197, file: !1, line: 523, type: !41)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_after", arg: 12, scope: !197, file: !1, line: 524, type: !41)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_while", arg: 13, scope: !197, file: !1, line: 525, type: !41)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !197, file: !1, line: 529, type: !41)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attribute", scope: !197, file: !1, line: 530, type: !97)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modifier", scope: !197, file: !1, line: 531, type: !173)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !197, file: !1, line: 532, type: !183)
!218 = !DISubprogram(name: "CCTKi_ScheduleGroupStorage", scope: !1, file: !1, line: 585, type: !219, isLocal: false, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTKi_ScheduleGroupStorage, variables: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{!41, !137}
!221 = !{!222, !223}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !218, file: !1, line: 585, type: !137)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !218, file: !1, line: 587, type: !49)
!224 = !DISubprogram(name: "CCTKi_ScheduleGroupComm", scope: !1, file: !1, line: 621, type: !219, isLocal: false, isDefinition: true, scopeLine: 622, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTKi_ScheduleGroupComm, variables: !225)
!225 = !{!226, !227}
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 1, scope: !224, file: !1, line: 621, type: !137)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !224, file: !1, line: 623, type: !49)
!228 = !DISubprogram(name: "CCTK_ScheduleTraverse", scope: !1, file: !1, line: 670, type: !229, isLocal: false, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i32 (i8*, %struct.cFunctionData*, i8*)*)* @CCTK_ScheduleTraverse, variables: !232)
!229 = !DISubroutineType(types: !230)
!230 = !{!41, !137, !45, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!232 = !{!233, !234, !235, !236, !237, !238, !239}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 1, scope: !228, file: !1, line: 670, type: !137)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !228, file: !1, line: 671, type: !45)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "CallFunction", arg: 3, scope: !228, file: !1, line: 672, type: !231)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !228, file: !1, line: 674, type: !41)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "special", scope: !228, file: !1, line: 676, type: !41)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !228, file: !1, line: 677, type: !137)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !228, file: !1, line: 681, type: !93)
!240 = !DISubprogram(name: "CCTKi_ScheduleGHInit", scope: !1, file: !1, line: 754, type: !43, isLocal: false, isDefinition: true, scopeLine: 755, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTKi_ScheduleGHInit, variables: !241)
!241 = !{!242, !243}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !240, file: !1, line: 754, type: !45)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !240, file: !1, line: 756, type: !41)
!244 = !DISubprogram(name: "CCTK_SchedulePrint", scope: !1, file: !1, line: 805, type: !219, isLocal: false, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_SchedulePrint, variables: !245)
!245 = !{!246}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 1, scope: !244, file: !1, line: 805, type: !137)
!247 = !DISubprogram(name: "CCTK_SchedulePrintTimes", scope: !1, file: !1, line: 908, type: !219, isLocal: false, isDefinition: true, scopeLine: 909, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_SchedulePrintTimes, variables: !248)
!248 = !{!249, !250}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 1, scope: !247, file: !1, line: 908, type: !137)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !247, file: !1, line: 910, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_data", file: !1, line: 94, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 80, size: 384, align: 64, elements: !253)
!253 = !{!254, !255, !257, !279, !280, !281, !282}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "GH", scope: !252, file: !1, line: 82, baseType: !50, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "schedpoint", scope: !252, file: !1, line: 83, baseType: !256, size: 32, align: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "iSchedPoint", file: !1, line: 48, baseType: !26)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !252, file: !1, line: 85, baseType: !258, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerData", file: !31, line: 35, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 31, size: 128, align: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "n_vals", scope: !260, file: !31, line: 33, baseType: !41, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !260, file: !31, line: 34, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerVal", file: !31, line: 29, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 18, size: 256, align: 64, elements: !267)
!267 = !{!268, !270, !271, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !31, line: 20, baseType: !269, size: 32, align: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerValType", file: !31, line: 16, baseType: !30)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "heading", scope: !266, file: !31, line: 21, baseType: !137, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !266, file: !31, line: 22, baseType: !137, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !266, file: !31, line: 28, baseType: !273, size: 64, align: 64, offset: 192)
!273 = !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !31, line: 23, size: 64, align: 64, elements: !274)
!274 = !{!275, !276, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !273, file: !31, line: 25, baseType: !41, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !273, file: !31, line: 26, baseType: !277, size: 64, align: 64)
!277 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !273, file: !31, line: 27, baseType: !65, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "total_time", scope: !252, file: !1, line: 86, baseType: !258, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "print_headers", scope: !252, file: !1, line: 87, baseType: !41, size: 32, align: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "synchronised", scope: !252, file: !1, line: 88, baseType: !41, size: 32, align: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CallFunction", scope: !252, file: !1, line: 92, baseType: !231, size: 64, align: 64, offset: 320)
!283 = !DISubprogram(name: "CCTK_TranslateLanguage", scope: !1, file: !1, line: 1006, type: !284, isLocal: false, isDefinition: true, scopeLine: 1007, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @CCTK_TranslateLanguage, variables: !286)
!284 = !DISubroutineType(types: !285)
!285 = !{!110, !137}
!286 = !{!287, !288}
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sval", arg: 1, scope: !283, file: !1, line: 1006, type: !137)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !283, file: !1, line: 1008, type: !110)
!289 = !DISubprogram(name: "ValidateModifiers", scope: !1, file: !1, line: 1331, type: !290, isLocal: false, isDefinition: true, scopeLine: 1332, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.T_SCHED_MODIFIER*)* @ValidateModifiers, variables: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{!41, !173}
!292 = !{!293, !294, !295, !296}
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifier", arg: 1, scope: !289, file: !1, line: 1331, type: !173)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !289, file: !1, line: 1333, type: !41)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vindex", scope: !289, file: !1, line: 1334, type: !41)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !289, file: !1, line: 1335, type: !41)
!297 = !DISubprogram(name: "ScheduleTraverse", scope: !1, file: !1, line: 1064, type: !229, isLocal: true, isDefinition: true, scopeLine: 1067, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, i32 (i8*, %struct.cFunctionData*, i8*)*)* @ScheduleTraverse, variables: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 1, scope: !297, file: !1, line: 1064, type: !137)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 2, scope: !297, file: !1, line: 1065, type: !45)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "CallFunction", arg: 3, scope: !297, file: !1, line: 1066, type: !231)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !297, file: !1, line: 1068, type: !251)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "calling_function", scope: !297, file: !1, line: 1069, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!41, !45, !97, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!308 = !DISubprogram(name: "CCTKi_ScheduleCallFunction", scope: !1, file: !1, line: 2220, type: !305, isLocal: true, isDefinition: true, scopeLine: 2223, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.t_attribute*, %struct.t_sched_data*)* @CCTKi_ScheduleCallFunction, variables: !309)
!309 = !{!310, !311, !312}
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function", arg: 1, scope: !308, file: !1, line: 2220, type: !45)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribute", arg: 2, scope: !308, file: !1, line: 2221, type: !97)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 3, scope: !308, file: !1, line: 2222, type: !307)
!313 = !DISubprogram(name: "CCTKi_ScheduleCallEntry", scope: !1, file: !1, line: 1984, type: !314, isLocal: true, isDefinition: true, scopeLine: 1986, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_attribute*, %struct.t_sched_data*)* @CCTKi_ScheduleCallEntry, variables: !316)
!314 = !DISubroutineType(types: !315)
!315 = !{!41, !97, !307}
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribute", arg: 1, scope: !313, file: !1, line: 1984, type: !97)
