; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleTraverse.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_sched_group = type { i8*, i32*, i32, %struct.t_sched_item* }
%struct.t_sched_item = type { i8*, i32, i8*, i32, i32, i8**, i8*, %struct.T_SCHED_MODIFIER* }
%struct.T_SCHED_MODIFIER = type { %struct.T_SCHED_MODIFIER*, i32, i8* }
%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }

@.str = private unnamed_addr constant [96 x i8] c"$Header: /cactus/Cactus/src/schedule/ScheduleTraverse.c,v 1.8 2001/05/10 12:35:19 goodale Exp $\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str1 = private unnamed_addr constant [31 x i8] c"Unknown schedule item type %d\0A\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_schedule_ScheduleTraverse_c() #0 {
  ret i8* getelementptr inbounds ([96 x i8]* @.str, i64 0, i64 0), !dbg !138
}

; Function Attrs: nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !53, globals: !132, imports: !59)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/ScheduleTraverse.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 45, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "sched_item_none", value: 0)
!7 = !DIEnumerator(name: "sched_group", value: 1)
!8 = !DIEnumerator(name: "sched_function", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 17, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/cctki_Schedule.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "sched_mod_none", value: 0)
!13 = !DIEnumerator(name: "sched_before", value: 1)
!14 = !DIEnumerator(name: "sched_after", value: 2)
!15 = !DIEnumerator(name: "sched_while", value: 3)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_group", file: !4, line: 73, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 64, size: 256, align: 64, elements: !21)
!21 = !{!22, !25, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !4, line: 66, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !20, file: !4, line: 67, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "n_scheditems", scope: !20, file: !4, line: 69, baseType: !27, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "scheditems", scope: !20, file: !4, line: 71, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_item", file: !4, line: 62, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 47, size: 448, align: 64, elements: !33)
!33 = !{!34, !35, !37, !38, !39, !40, !42, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !4, line: 49, baseType: !23, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !4, line: 51, baseType: !36, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_item_type", file: !4, line: 45, baseType: !3)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !32, file: !4, line: 53, baseType: !17, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !32, file: !4, line: 54, baseType: !27, size: 32, align: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "n_whiles", scope: !32, file: !4, line: 56, baseType: !27, size: 32, align: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "whiles", scope: !32, file: !4, line: 57, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !32, file: !4, line: 59, baseType: !17, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !32, file: !4, line: 61, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_modifier", file: !10, line: 27, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "T_SCHED_MODIFIER", file: !10, line: 19, size: 192, align: 64, elements: !47)
!47 = !{!48, !50, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !10, line: 21, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !10, line: 23, baseType: !51, size: 32, align: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sched_modifier_type", file: !10, line: 17, baseType: !9)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !46, file: !10, line: 25, baseType: !23, size: 64, align: 64, offset: 128)
!53 = !{!54, !60, !99, !117}
!54 = !DISubprogram(name: "CCTKi_version_schedule_ScheduleTraverse_c", scope: !1, file: !1, line: 25, type: !55, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_schedule_ScheduleTraverse_c, variables: !59)
!55 = !DISubroutineType(types: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!59 = !{}
!60 = !DISubprogram(name: "CCTKi_DoScheduleTraverse", scope: !1, file: !1, line: 129, type: !61, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, i32 (i32, i8**, i8*, i8*, i32)*, i32 (i8*, i8*, i8*)*, i8*)* @CCTKi_DoScheduleTraverse, variables: !72)
!61 = !DISubroutineType(types: !62)
!62 = !{!27, !57, !63, !63, !66, !69, !17}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!27, !17, !17}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!27, !27, !41, !17, !17, !27}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!27, !17, !17, !17}
!72 = !{!73, !74, !75, !76, !77, !78, !79, !96, !97, !98}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group_name", arg: 1, scope: !60, file: !1, line: 129, type: !57)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item_entry", arg: 2, scope: !60, file: !1, line: 130, type: !63)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item_exit", arg: 3, scope: !60, file: !1, line: 131, type: !63)
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "while_check", arg: 4, scope: !60, file: !1, line: 132, type: !66)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_process", arg: 5, scope: !60, file: !1, line: 133, type: !69)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 6, scope: !60, file: !1, line: 134, type: !17)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "schedule_groups", scope: !60, file: !1, line: 136, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !82, line: 28, baseType: !83)
!82 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Cactus/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 23, size: 128, align: 64, elements: !84)
!84 = !{!85, !94, !95}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !83, file: !82, line: 25, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !82, line: 21, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 16, size: 192, align: 64, elements: !89)
!89 = !{!90, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !88, file: !82, line: 18, baseType: !91, size: 32, align: 32)
!91 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !82, line: 19, baseType: !23, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !82, line: 20, baseType: !17, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !83, file: !82, line: 26, baseType: !91, size: 32, align: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !83, file: !82, line: 27, baseType: !91, size: 32, align: 32, offset: 96)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !60, file: !1, line: 137, type: !18)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !60, file: !1, line: 138, type: !27)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !60, file: !1, line: 139, type: !27)
!99 = !DISubprogram(name: "ScheduleTraverseGroup", scope: !1, file: !1, line: 258, type: !100, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cHandledData*, %struct.t_sched_group*, i8*, i32, i8**, i32 (i8*, i8*)*, i32 (i8*, i8*)*, i32 (i32, i8**, i8*, i8*, i32)*, i32 (i8*, i8*, i8*)*, i8*)* @ScheduleTraverseGroup, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!27, !80, !18, !17, !27, !41, !63, !63, !66, !69, !17}
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "schedule_groups", arg: 1, scope: !99, file: !1, line: 258, type: !80)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !99, file: !1, line: 259, type: !18)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attributes", arg: 3, scope: !99, file: !1, line: 260, type: !17)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_whiles", arg: 4, scope: !99, file: !1, line: 261, type: !27)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "whiles", arg: 5, scope: !99, file: !1, line: 262, type: !41)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item_entry", arg: 6, scope: !99, file: !1, line: 263, type: !63)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item_exit", arg: 7, scope: !99, file: !1, line: 264, type: !63)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "while_check", arg: 8, scope: !99, file: !1, line: 265, type: !66)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_process", arg: 9, scope: !99, file: !1, line: 266, type: !69)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 10, scope: !99, file: !1, line: 267, type: !17)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !99, file: !1, line: 269, type: !27)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doit", scope: !99, file: !1, line: 270, type: !27)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "called_item_entry", scope: !99, file: !1, line: 271, type: !27)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newgroup", scope: !99, file: !1, line: 272, type: !18)
!117 = !DISubprogram(name: "ScheduleTraverseFunction", scope: !1, file: !1, line: 445, type: !118, isLocal: true, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: true, variables: !120)
!118 = !DISubroutineType(types: !119)
!119 = !{!27, !17, !17, !27, !41, !63, !63, !66, !69, !17}
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function", arg: 1, scope: !117, file: !1, line: 445, type: !17)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attributes", arg: 2, scope: !117, file: !1, line: 446, type: !17)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_whiles", arg: 3, scope: !117, file: !1, line: 447, type: !27)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "whiles", arg: 4, scope: !117, file: !1, line: 448, type: !41)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item_entry", arg: 5, scope: !117, file: !1, line: 449, type: !63)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item_exit", arg: 6, scope: !117, file: !1, line: 450, type: !63)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "while_check", arg: 7, scope: !117, file: !1, line: 451, type: !66)
