; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupPGV.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }

@.str = private unnamed_addr constant [75 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupPGV.c\00", align 1
@.str1 = private unnamed_addr constant [5 x i8] c"PUGH\00", align 1
@.str2 = private unnamed_addr constant [27 x i8] c"Inconsistent PUGH topology\00", align 1
@.str3 = private unnamed_addr constant [89 x i8] c"$Header: /cactus/CactusPUGH/PUGH/src/SetupPGV.c,v 1.41 2001/11/02 16:18:03 goodale Exp $\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_CactusPUGH_PUGH_SetupPGV_c() #0 {
  ret i8* getelementptr inbounds ([89 x i8]* @.str3, i64 0, i64 0), !dbg !373
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !82, globals: !367, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupPGV.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !34, !12, !16, !42, !48, !49, !56, !61, !80}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !6, line: 72, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !6, line: 37, size: 2368, align: 64, elements: !8)
!8 = !{!9, !11, !13, !15, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !31, !33}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !7, file: !6, line: 39, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !7, file: !6, line: 41, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !7, file: !6, line: 44, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !7, file: !6, line: 45, baseType: !16, size: 64, align: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !7, file: !6, line: 46, baseType: !16, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !7, file: !6, line: 47, baseType: !12, size: 64, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !7, file: !6, line: 49, baseType: !12, size: 64, align: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !7, file: !6, line: 50, baseType: !10, size: 32, align: 32, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !7, file: !6, line: 51, baseType: !12, size: 64, align: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !7, file: !6, line: 52, baseType: !16, size: 64, align: 64, offset: 576)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !7, file: !6, line: 55, baseType: !12, size: 64, align: 64, offset: 640)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !7, file: !6, line: 56, baseType: !12, size: 64, align: 64, offset: 704)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !7, file: !6, line: 59, baseType: !12, size: 64, align: 64, offset: 768)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !7, file: !6, line: 60, baseType: !27, size: 512, align: 64, offset: 832)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 512, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DISubrange(count: 4)
!30 = !DISubrange(count: 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !7, file: !6, line: 64, baseType: !32, size: 512, align: 64, offset: 1344)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 64, elements: !28)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !7, file: !6, line: 68, baseType: !32, size: 512, align: 64, offset: 1856)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !6, line: 29, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !6, line: 23, size: 256, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !36, file: !6, line: 25, baseType: !10, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !36, file: !6, line: 26, baseType: !12, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !36, file: !6, line: 27, baseType: !16, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !36, file: !6, line: 28, baseType: !12, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !6, line: 94, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !6, line: 74, size: 448, align: 64, elements: !45)
!45 = !{!46, !47, !50, !51, !52, !53, !54, !55}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !44, file: !6, line: 77, baseType: !12, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !44, file: !6, line: 78, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !44, file: !6, line: 79, baseType: !48, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !44, file: !6, line: 80, baseType: !10, size: 32, align: 32, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !44, file: !6, line: 82, baseType: !12, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !44, file: !6, line: 84, baseType: !10, size: 32, align: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !44, file: !6, line: 85, baseType: !10, size: 32, align: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !44, file: !6, line: 86, baseType: !10, size: 32, align: 32, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !6, line: 126, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !6, line: 96, size: 832, align: 64, elements: !59)
!59 = !{!60, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !6, line: 98, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !58, file: !6, line: 99, baseType: !10, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !58, file: !6, line: 100, baseType: !10, size: 32, align: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !58, file: !6, line: 101, baseType: !49, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !6, line: 102, baseType: !49, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !58, file: !6, line: 103, baseType: !10, size: 32, align: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !58, file: !6, line: 104, baseType: !10, size: 32, align: 32, offset: 288)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !58, file: !6, line: 106, baseType: !49, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !58, file: !6, line: 114, baseType: !10, size: 32, align: 32, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !58, file: !6, line: 115, baseType: !10, size: 32, align: 32, offset: 416)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !58, file: !6, line: 117, baseType: !4, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !58, file: !6, line: 118, baseType: !34, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !58, file: !6, line: 120, baseType: !42, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !58, file: !6, line: 121, baseType: !42, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !58, file: !6, line: 123, baseType: !10, size: 32, align: 32, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !58, file: !6, line: 124, baseType: !10, size: 32, align: 32, offset: 736)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !58, file: !6, line: 125, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!82 = !{!83, !88, !102, !112, !122, !128, !145, !159, !168, !177, !189, !207, !223, !239, !255, !267, !310, !320, !326, !344, !350, !359}
!83 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_SetupPGV_c", scope: !1, file: !1, line: 27, type: !84, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_SetupPGV_c, variables: !2)
!84 = !DISubroutineType(types: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!88 = !DISubprogram(name: "PUGH_SetupPGExtras", scope: !1, file: !1, line: 68, type: !89, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PGExtras* (i32, i32*, i32, i32*, i32*, i32, i32*, i32)* @PUGH_SetupPGExtras, variables: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!4, !10, !12, !10, !12, !12, !10, !12, !10}
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !88, file: !1, line: 68, type: !10)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !88, file: !1, line: 69, type: !12)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stagger", arg: 3, scope: !88, file: !1, line: 70, type: !10)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !88, file: !1, line: 71, type: !12)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghosts", arg: 5, scope: !88, file: !1, line: 72, type: !12)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 6, scope: !88, file: !1, line: 73, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 7, scope: !88, file: !1, line: 74, type: !12)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_proc", arg: 8, scope: !88, file: !1, line: 75, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !88, file: !1, line: 77, type: !10)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !88, file: !1, line: 78, type: !4)
!102 = !DISubprogram(name: "PUGH_DestroyPGExtras", scope: !1, file: !1, line: 122, type: !103, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PGExtras**)* @PUGH_DestroyPGExtras, variables: !106)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!106 = !{!107, !108, !111}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "PGExtras", arg: 1, scope: !102, file: !1, line: 122, type: !105)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !109, file: !1, line: 126, type: !10)
!109 = distinct !DILexicalBlock(scope: !110, file: !1, line: 125, column: 3)
!110 = distinct !DILexicalBlock(scope: !102, file: !1, line: 124, column: 6)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !109, file: !1, line: 126, type: !10)
!112 = !DISubprogram(name: "PUGH_SetupConnectivity", scope: !1, file: !1, line: 175, type: !113, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PConnectivity* (i32, i32, i32*, i32*)* @PUGH_SetupConnectivity, variables: !115)
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !10, !10, !12, !12}
!115 = !{!116, !117, !118, !119, !120, !121}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !112, file: !1, line: 175, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 2, scope: !112, file: !1, line: 176, type: !10)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 3, scope: !112, file: !1, line: 177, type: !12)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 4, scope: !112, file: !1, line: 178, type: !12)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !112, file: !1, line: 180, type: !34)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !112, file: !1, line: 182, type: !10)
!122 = !DISubprogram(name: "PUGH_DestroyConnectivity", scope: !1, file: !1, line: 263, type: !123, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PConnectivity**)* @PUGH_DestroyConnectivity, variables: !126)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!126 = !{!127}
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "conn", arg: 1, scope: !122, file: !1, line: 263, type: !125)
!128 = !DISubprogram(name: "PUGH_GenerateTopology", scope: !1, file: !1, line: 295, type: !129, isLocal: false, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*)* @PUGH_GenerateTopology, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!10, !10, !10, !12}
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !143, !144}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !128, file: !1, line: 295, type: !10)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 2, scope: !128, file: !1, line: 295, type: !10)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 3, scope: !128, file: !1, line: 295, type: !12)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !128, file: !1, line: 297, type: !10)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "used_procs", scope: !128, file: !1, line: 298, type: !10)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "free_procs", scope: !128, file: !1, line: 299, type: !10)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !128, file: !1, line: 300, type: !10)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "free_dims", scope: !128, file: !1, line: 301, type: !10)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "working", scope: !141, file: !1, line: 342, type: !12)
!141 = distinct !DILexicalBlock(scope: !142, file: !1, line: 337, column: 3)
!142 = distinct !DILexicalBlock(scope: !128, file: !1, line: 336, column: 6)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "root", scope: !141, file: !1, line: 343, type: !10)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "place", scope: !141, file: !1, line: 344, type: !10)
!145 = !DISubprogram(name: "PUGH_GenerateNeighbours", scope: !1, file: !1, line: 407, type: !146, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*, i32**, i32*)* @PUGH_GenerateNeighbours, variables: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{!10, !10, !10, !12, !16, !12}
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !145, file: !1, line: 407, type: !10)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 2, scope: !145, file: !1, line: 408, type: !10)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 3, scope: !145, file: !1, line: 409, type: !12)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "neighbours", arg: 4, scope: !145, file: !1, line: 410, type: !16)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 5, scope: !145, file: !1, line: 411, type: !12)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !145, file: !1, line: 413, type: !10)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !145, file: !1, line: 414, type: !10)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idim", scope: !145, file: !1, line: 416, type: !10)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !145, file: !1, line: 417, type: !12)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !145, file: !1, line: 418, type: !10)
!159 = !DISubprogram(name: "PUGH_DecomposeIJK", scope: !1, file: !1, line: 517, type: !160, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*, i32*)* @PUGH_DecomposeIJK, variables: !162)
!160 = !DISubroutineType(types: !161)
!161 = !{!10, !10, !10, !12, !12}
!162 = !{!163, !164, !165, !166, !167}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !159, file: !1, line: 517, type: !10)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ijk", arg: 2, scope: !159, file: !1, line: 517, type: !10)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 3, scope: !159, file: !1, line: 517, type: !12)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 4, scope: !159, file: !1, line: 517, type: !12)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idim", scope: !159, file: !1, line: 519, type: !10)
!168 = !DISubprogram(name: "PUGH_ComposeIJK", scope: !1, file: !1, line: 553, type: !169, isLocal: false, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32*)* @PUGH_ComposeIJK, variables: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!10, !10, !12, !12}
!171 = !{!172, !173, !174, !175, !176}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !168, file: !1, line: 553, type: !10)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 2, scope: !168, file: !1, line: 554, type: !12)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 3, scope: !168, file: !1, line: 555, type: !12)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ijk", scope: !168, file: !1, line: 557, type: !10)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idim", scope: !168, file: !1, line: 558, type: !10)
!177 = !DISubprogram(name: "PUGH_SetupPGExtrasMemory", scope: !1, file: !1, line: 589, type: !178, isLocal: false, isDefinition: true, scopeLine: 593, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*, %struct.PGExtras*)* @PUGH_SetupPGExtrasMemory, variables: !180)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !10, !10, !12, !4}
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !177, file: !1, line: 589, type: !10)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 2, scope: !177, file: !1, line: 590, type: !10)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 3, scope: !177, file: !1, line: 591, type: !12)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 4, scope: !177, file: !1, line: 592, type: !4)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retcode", scope: !177, file: !1, line: 594, type: !10)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !177, file: !1, line: 595, type: !10)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !177, file: !1, line: 595, type: !10)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !177, file: !1, line: 595, type: !10)
!189 = !DISubprogram(name: "PUGH_SetupPGExtrasSizes", scope: !1, file: !1, line: 846, type: !190, isLocal: false, isDefinition: true, scopeLine: 855, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32, i32*, i32*, i32, i32*, i32, %struct.PGExtras*)* @PUGH_SetupPGExtrasSizes, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{!10, !10, !12, !10, !12, !12, !10, !12, !10, !4}
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !189, file: !1, line: 846, type: !10)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !189, file: !1, line: 847, type: !12)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stagger", arg: 3, scope: !189, file: !1, line: 848, type: !10)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !189, file: !1, line: 849, type: !12)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghosts", arg: 5, scope: !189, file: !1, line: 850, type: !12)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 6, scope: !189, file: !1, line: 851, type: !10)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 7, scope: !189, file: !1, line: 852, type: !12)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_proc", arg: 8, scope: !189, file: !1, line: 853, type: !10)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 9, scope: !189, file: !1, line: 854, type: !4)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !189, file: !1, line: 856, type: !10)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxpoints", scope: !189, file: !1, line: 857, type: !10)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minpoints", scope: !189, file: !1, line: 857, type: !10)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avgpoints", scope: !189, file: !1, line: 857, type: !10)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proc", scope: !189, file: !1, line: 857, type: !10)
!207 = !DISubprogram(name: "PUGH_SetupPGExtrasOwnership", scope: !1, file: !1, line: 953, type: !190, isLocal: false, isDefinition: true, scopeLine: 962, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32, i32*, i32*, i32, i32*, i32, %struct.PGExtras*)* @PUGH_SetupPGExtrasOwnership, variables: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !207, file: !1, line: 953, type: !10)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !207, file: !1, line: 954, type: !12)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stagger", arg: 3, scope: !207, file: !1, line: 955, type: !10)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !207, file: !1, line: 956, type: !12)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghosts", arg: 5, scope: !207, file: !1, line: 957, type: !12)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 6, scope: !207, file: !1, line: 958, type: !10)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 7, scope: !207, file: !1, line: 959, type: !12)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_proc", arg: 8, scope: !207, file: !1, line: 960, type: !10)
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 9, scope: !207, file: !1, line: 961, type: !4)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !207, file: !1, line: 963, type: !10)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !207, file: !1, line: 964, type: !10)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idir", scope: !207, file: !1, line: 964, type: !10)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istart", scope: !207, file: !1, line: 965, type: !10)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iend", scope: !207, file: !1, line: 965, type: !10)
!223 = !DISubprogram(name: "PUGH_SetupPGExtrasStaggering", scope: !1, file: !1, line: 1081, type: !190, isLocal: false, isDefinition: true, scopeLine: 1090, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32, i32*, i32*, i32, i32*, i32, %struct.PGExtras*)* @PUGH_SetupPGExtrasStaggering, variables: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !223, file: !1, line: 1081, type: !10)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !223, file: !1, line: 1082, type: !12)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stagger", arg: 3, scope: !223, file: !1, line: 1083, type: !10)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !223, file: !1, line: 1084, type: !12)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghosts", arg: 5, scope: !223, file: !1, line: 1085, type: !12)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 6, scope: !223, file: !1, line: 1086, type: !10)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 7, scope: !223, file: !1, line: 1087, type: !12)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_proc", arg: 8, scope: !223, file: !1, line: 1088, type: !10)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 9, scope: !223, file: !1, line: 1089, type: !4)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !223, file: !1, line: 1091, type: !10)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !223, file: !1, line: 1091, type: !10)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !223, file: !1, line: 1091, type: !10)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !223, file: !1, line: 1091, type: !10)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upperbnd", scope: !223, file: !1, line: 1092, type: !12)
!239 = !DISubprogram(name: "PUGH_SetupBoundingBox", scope: !1, file: !1, line: 1158, type: !240, isLocal: false, isDefinition: true, scopeLine: 1166, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32, i32*, i32*, i32, i32*, %struct.PGExtras*)* @PUGH_SetupBoundingBox, variables: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{!10, !10, !12, !10, !12, !12, !10, !12, !4}
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !239, file: !1, line: 1158, type: !10)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !239, file: !1, line: 1159, type: !12)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stagger", arg: 3, scope: !239, file: !1, line: 1160, type: !10)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !239, file: !1, line: 1161, type: !12)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghosts", arg: 5, scope: !239, file: !1, line: 1162, type: !12)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 6, scope: !239, file: !1, line: 1163, type: !10)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 7, scope: !239, file: !1, line: 1164, type: !12)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 8, scope: !239, file: !1, line: 1165, type: !4)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pnum", scope: !239, file: !1, line: 1167, type: !10)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !239, file: !1, line: 1167, type: !10)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bounds", scope: !239, file: !1, line: 1169, type: !16)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !239, file: !1, line: 1170, type: !12)
!255 = !DISubprogram(name: "PUGH_SetupRemoteSizes", scope: !1, file: !1, line: 1258, type: !240, isLocal: false, isDefinition: true, scopeLine: 1266, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32, i32*, i32*, i32, i32*, %struct.PGExtras*)* @PUGH_SetupRemoteSizes, variables: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !255, file: !1, line: 1258, type: !10)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 2, scope: !255, file: !1, line: 1259, type: !12)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stagger", arg: 3, scope: !255, file: !1, line: 1260, type: !10)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sh", arg: 4, scope: !255, file: !1, line: 1261, type: !12)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghosts", arg: 5, scope: !255, file: !1, line: 1262, type: !12)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "total_procs", arg: 6, scope: !255, file: !1, line: 1263, type: !10)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 7, scope: !255, file: !1, line: 1264, type: !12)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this", arg: 8, scope: !255, file: !1, line: 1265, type: !4)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pnum", scope: !255, file: !1, line: 1267, type: !10)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !255, file: !1, line: 1268, type: !10)
!267 = !DISubprogram(name: "PUGH_SetupGArrayGroupComm", scope: !1, file: !1, line: 1300, type: !268, isLocal: false, isDefinition: true, scopeLine: 1307, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PComm* (%struct.PGH*, i32, i32, i32, i32, i32, %struct.PGExtras*)* @PUGH_SetupGArrayGroupComm, variables: !300)
!268 = !DISubroutineType(types: !269)
!269 = !{!42, !270, !10, !10, !10, !10, !10, !4}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !272, line: 81, baseType: !273)
!272 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !272, line: 13, size: 1152, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !273, file: !272, line: 17, baseType: !49, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !273, file: !272, line: 18, baseType: !10, size: 32, align: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !273, file: !272, line: 21, baseType: !10, size: 32, align: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !273, file: !272, line: 22, baseType: !10, size: 32, align: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !273, file: !272, line: 23, baseType: !10, size: 32, align: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !273, file: !272, line: 27, baseType: !10, size: 32, align: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !273, file: !272, line: 28, baseType: !10, size: 32, align: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !273, file: !272, line: 29, baseType: !283, size: 64, align: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !273, file: !272, line: 32, baseType: !10, size: 32, align: 32, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !273, file: !272, line: 34, baseType: !12, size: 64, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !273, file: !272, line: 35, baseType: !10, size: 32, align: 32, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !273, file: !272, line: 37, baseType: !10, size: 32, align: 32, offset: 480)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !273, file: !272, line: 41, baseType: !14, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !273, file: !272, line: 41, baseType: !14, size: 64, align: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !273, file: !272, line: 41, baseType: !14, size: 64, align: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !273, file: !272, line: 41, baseType: !14, size: 64, align: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !273, file: !272, line: 44, baseType: !10, size: 32, align: 32, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !273, file: !272, line: 45, baseType: !10, size: 32, align: 32, offset: 800)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !273, file: !272, line: 46, baseType: !10, size: 32, align: 32, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !273, file: !272, line: 49, baseType: !10, size: 32, align: 32, offset: 864)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !273, file: !272, line: 53, baseType: !10, size: 32, align: 32, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !273, file: !272, line: 76, baseType: !105, size: 64, align: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !273, file: !272, line: 77, baseType: !125, size: 64, align: 64, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !273, file: !272, line: 79, baseType: !61, size: 64, align: 64, offset: 1088)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309}
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pughGH", arg: 1, scope: !267, file: !1, line: 1300, type: !270)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !267, file: !1, line: 1301, type: !10)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "first_var", arg: 3, scope: !267, file: !1, line: 1302, type: !10)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_vars", arg: 4, scope: !267, file: !1, line: 1303, type: !10)
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sync_timelevel", arg: 5, scope: !267, file: !1, line: 1304, type: !10)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vartype", arg: 6, scope: !267, file: !1, line: 1305, type: !10)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "extras", arg: 7, scope: !267, file: !1, line: 1306, type: !4)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !267, file: !1, line: 1308, type: !10)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this", scope: !267, file: !1, line: 1309, type: !42)
!310 = !DISubprogram(name: "PUGH_SetupGArrayComm", scope: !1, file: !1, line: 1427, type: !311, isLocal: false, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PComm* (%struct.PGH*, i32, i32, i32, i32, %struct.PGExtras*)* @PUGH_SetupGArrayComm, variables: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{!42, !270, !10, !10, !10, !10, !4}
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pughGH", arg: 1, scope: !310, file: !1, line: 1427, type: !270)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !310, file: !1, line: 1428, type: !10)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "var", arg: 3, scope: !310, file: !1, line: 1429, type: !10)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sync_timelevel", arg: 4, scope: !310, file: !1, line: 1430, type: !10)
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vartype", arg: 5, scope: !310, file: !1, line: 1431, type: !10)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "extras", arg: 6, scope: !310, file: !1, line: 1432, type: !4)
!320 = !DISubprogram(name: "PUGH_DestroyComm", scope: !1, file: !1, line: 1457, type: !321, isLocal: false, isDefinition: true, scopeLine: 1458, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PComm**)* @PUGH_DestroyComm, variables: !324)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!324 = !{!325}
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "comm", arg: 1, scope: !320, file: !1, line: 1457, type: !323)
!326 = !DISubprogram(name: "PUGH_SetupGArray", scope: !1, file: !1, line: 1488, type: !327, isLocal: false, isDefinition: true, scopeLine: 1501, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PGA* (i8*, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, i8*, i32, i32, i32, i32, i32, i32, i32, %struct.PGA*)* @PUGH_SetupGArray, variables: !329)
!327 = !DISubroutineType(types: !328)
!328 = !{!56, !49, !4, !34, !42, !86, !10, !10, !10, !10, !10, !10, !10, !56}
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parent", arg: 1, scope: !326, file: !1, line: 1488, type: !49)
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "extras", arg: 2, scope: !326, file: !1, line: 1489, type: !4)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "connectivity", arg: 3, scope: !326, file: !1, line: 1490, type: !34)
