; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupPGH.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon.0 = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }

@pughpriv_ = external global %struct.anon.0

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !114, globals: !363, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupPGH.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !37, !66, !23, !78, !112}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !6, line: 81, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !6, line: 13, size: 1152, align: 64, elements: !8)
!8 = !{!9, !11, !13, !14, !15, !16, !17, !18, !21, !22, !24, !25, !26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !65, !75}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !7, file: !6, line: 17, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !7, file: !6, line: 18, baseType: !12, size: 32, align: 32, offset: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !7, file: !6, line: 21, baseType: !12, size: 32, align: 32, offset: 96)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !7, file: !6, line: 22, baseType: !12, size: 32, align: 32, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !7, file: !6, line: 23, baseType: !12, size: 32, align: 32, offset: 160)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !7, file: !6, line: 27, baseType: !12, size: 32, align: 32, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !7, file: !6, line: 28, baseType: !12, size: 32, align: 32, offset: 224)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !7, file: !6, line: 29, baseType: !19, size: 64, align: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !7, file: !6, line: 32, baseType: !12, size: 32, align: 32, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !7, file: !6, line: 34, baseType: !23, size: 64, align: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !7, file: !6, line: 35, baseType: !12, size: 32, align: 32, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !7, file: !6, line: 37, baseType: !12, size: 32, align: 32, offset: 480)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !7, file: !6, line: 41, baseType: !27, size: 64, align: 64, offset: 512)
!27 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !7, file: !6, line: 41, baseType: !27, size: 64, align: 64, offset: 576)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !7, file: !6, line: 41, baseType: !27, size: 64, align: 64, offset: 640)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !7, file: !6, line: 41, baseType: !27, size: 64, align: 64, offset: 704)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !7, file: !6, line: 44, baseType: !12, size: 32, align: 32, offset: 768)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !7, file: !6, line: 45, baseType: !12, size: 32, align: 32, offset: 800)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !7, file: !6, line: 46, baseType: !12, size: 32, align: 32, offset: 832)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !7, file: !6, line: 49, baseType: !12, size: 32, align: 32, offset: 864)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !7, file: !6, line: 53, baseType: !12, size: 32, align: 32, offset: 896)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !7, file: !6, line: 76, baseType: !37, size: 64, align: 64, offset: 960)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !40, line: 72, baseType: !41)
!40 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !40, line: 37, size: 2368, align: 64, elements: !42)
!42 = !{!43, !44, !45, !46, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !62, !64}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !41, file: !40, line: 39, baseType: !12, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !41, file: !40, line: 41, baseType: !23, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !41, file: !40, line: 44, baseType: !27, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !41, file: !40, line: 45, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !41, file: !40, line: 46, baseType: !47, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !41, file: !40, line: 47, baseType: !23, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !41, file: !40, line: 49, baseType: !23, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !41, file: !40, line: 50, baseType: !12, size: 32, align: 32, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !41, file: !40, line: 51, baseType: !23, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !41, file: !40, line: 52, baseType: !47, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !41, file: !40, line: 55, baseType: !23, size: 64, align: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !41, file: !40, line: 56, baseType: !23, size: 64, align: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !41, file: !40, line: 59, baseType: !23, size: 64, align: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !41, file: !40, line: 60, baseType: !58, size: 512, align: 64, offset: 832)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DISubrange(count: 4)
!61 = !DISubrange(count: 2)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !41, file: !40, line: 64, baseType: !63, size: 512, align: 64, offset: 1344)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, align: 64, elements: !59)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !41, file: !40, line: 68, baseType: !63, size: 512, align: 64, offset: 1856)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !7, file: !6, line: 77, baseType: !66, size: 64, align: 64, offset: 1024)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !40, line: 29, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !40, line: 23, size: 256, align: 64, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !69, file: !40, line: 25, baseType: !12, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !69, file: !40, line: 26, baseType: !23, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !69, file: !40, line: 27, baseType: !47, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !69, file: !40, line: 28, baseType: !23, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !7, file: !6, line: 79, baseType: !76, size: 64, align: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !40, line: 126, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !40, line: 96, size: 832, align: 64, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !107, !108, !109, !110}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !40, line: 98, baseType: !76, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !40, line: 99, baseType: !12, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !80, file: !40, line: 100, baseType: !12, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !80, file: !40, line: 101, baseType: !10, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !40, line: 102, baseType: !10, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !80, file: !40, line: 103, baseType: !12, size: 32, align: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !80, file: !40, line: 104, baseType: !12, size: 32, align: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !80, file: !40, line: 106, baseType: !10, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !80, file: !40, line: 114, baseType: !12, size: 32, align: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !80, file: !40, line: 115, baseType: !12, size: 32, align: 32, offset: 416)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !80, file: !40, line: 117, baseType: !38, size: 64, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !80, file: !40, line: 118, baseType: !67, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !80, file: !40, line: 120, baseType: !95, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !40, line: 94, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !40, line: 74, size: 448, align: 64, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !97, file: !40, line: 77, baseType: !23, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !97, file: !40, line: 78, baseType: !20, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !97, file: !40, line: 79, baseType: !20, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !97, file: !40, line: 80, baseType: !12, size: 32, align: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !97, file: !40, line: 82, baseType: !23, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !97, file: !40, line: 84, baseType: !12, size: 32, align: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !97, file: !40, line: 85, baseType: !12, size: 32, align: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !97, file: !40, line: 86, baseType: !12, size: 32, align: 32, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !80, file: !40, line: 121, baseType: !95, size: 64, align: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !80, file: !40, line: 123, baseType: !12, size: 32, align: 32, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !80, file: !40, line: 124, baseType: !12, size: 32, align: 32, offset: 736)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !80, file: !40, line: 125, baseType: !111, size: 64, align: 64, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!114 = !{!115, !120, !200, !238, !263, !332, !335, !341, !345, !353, !357}
!115 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_SetupPGH_c", scope: !1, file: !1, line: 31, type: !116, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_SetupPGH_c, variables: !2)
!116 = !DISubroutineType(types: !117)
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!120 = !DISubprogram(name: "PUGH_SetupPGH", scope: !1, file: !1, line: 87, type: !121, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PGH* (i8*, i32, i32*, i32*, i32, i32*)* @PUGH_SetupPGH, variables: !123)
!121 = !DISubroutineType(types: !122)
!122 = !{!4, !10, !12, !23, !23, !12, !23}
!123 = !{!124, !125, !126, !127, !128, !129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !190, !191, !192, !193, !196, !197, !198, !199}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callerid", arg: 1, scope: !120, file: !1, line: 87, type: !10)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 2, scope: !120, file: !1, line: 88, type: !12)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsize", arg: 3, scope: !120, file: !1, line: 89, type: !23)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghostzones", arg: 4, scope: !120, file: !1, line: 90, type: !23)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "staggertype", arg: 5, scope: !120, file: !1, line: 91, type: !12)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "perme", arg: 6, scope: !120, file: !1, line: 92, type: !23)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !120, file: !1, line: 94, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !120, file: !1, line: 94, type: !131)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !120, file: !1, line: 94, type: !131)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !120, file: !1, line: 94, type: !131)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !120, file: !1, line: 94, type: !131)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !120, file: !1, line: 94, type: !131)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !120, file: !1, line: 94, type: !131)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !120, file: !1, line: 94, type: !131)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !120, file: !1, line: 94, type: !131)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !120, file: !1, line: 94, type: !131)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !120, file: !1, line: 94, type: !131)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !120, file: !1, line: 94, type: !131)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !120, file: !1, line: 94, type: !118)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !120, file: !1, line: 94, type: !118)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !120, file: !1, line: 94, type: !118)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !120, file: !1, line: 94, type: !118)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !120, file: !1, line: 94, type: !118)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !120, file: !1, line: 94, type: !118)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !120, file: !1, line: 94, type: !118)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !120, file: !1, line: 94, type: !118)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !120, file: !1, line: 94, type: !118)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !120, file: !1, line: 94, type: !118)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !120, file: !1, line: 94, type: !118)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !120, file: !1, line: 94, type: !131)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !120, file: !1, line: 94, type: !131)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !120, file: !1, line: 94, type: !131)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !120, file: !1, line: 94, type: !131)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !120, file: !1, line: 94, type: !131)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !120, file: !1, line: 94, type: !131)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !120, file: !1, line: 94, type: !131)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !120, file: !1, line: 94, type: !131)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !120, file: !1, line: 94, type: !131)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !120, file: !1, line: 94, type: !131)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !120, file: !1, line: 94, type: !131)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !120, file: !1, line: 94, type: !131)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !120, file: !1, line: 94, type: !131)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !120, file: !1, line: 94, type: !131)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !120, file: !1, line: 94, type: !131)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !120, file: !1, line: 94, type: !131)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !120, file: !1, line: 94, type: !131)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !120, file: !1, line: 94, type: !131)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !120, file: !1, line: 94, type: !131)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !120, file: !1, line: 94, type: !131)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !120, file: !1, line: 94, type: !131)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !120, file: !1, line: 94, type: !131)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !120, file: !1, line: 94, type: !131)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !120, file: !1, line: 94, type: !131)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !120, file: !1, line: 94, type: !131)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !120, file: !1, line: 94, type: !131)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !120, file: !1, line: 94, type: !131)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !120, file: !1, line: 94, type: !131)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !120, file: !1, line: 94, type: !131)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !120, file: !1, line: 94, type: !131)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !120, file: !1, line: 94, type: !131)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !120, file: !1, line: 94, type: !131)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !120, file: !1, line: 94, type: !131)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !120, file: !1, line: 94, type: !118)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !120, file: !1, line: 94, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !120, file: !1, line: 94, type: !189)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !120, file: !1, line: 94, type: !131)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !120, file: !1, line: 94, type: !131)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !120, file: !1, line: 94, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !120, file: !1, line: 95, type: !4)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !120, file: !1, line: 96, type: !12)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idim", scope: !120, file: !1, line: 96, type: !12)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprocs", scope: !120, file: !1, line: 97, type: !23)
!200 = !DISubprogram(name: "PUGH_Terminate", scope: !1, file: !1, line: 178, type: !201, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*)* @PUGH_Terminate, variables: !235)
!201 = !DISubroutineType(types: !202)
!202 = !{!12, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !205, line: 75, baseType: !206)
!205 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 24, size: 1216, align: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !206, file: !205, line: 26, baseType: !12, size: 32, align: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !206, file: !205, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !206, file: !205, line: 30, baseType: !23, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !206, file: !205, line: 31, baseType: !23, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !206, file: !205, line: 32, baseType: !23, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !206, file: !205, line: 33, baseType: !23, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !206, file: !205, line: 36, baseType: !23, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !206, file: !205, line: 39, baseType: !23, size: 64, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !206, file: !205, line: 40, baseType: !23, size: 64, align: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !206, file: !205, line: 43, baseType: !27, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !206, file: !205, line: 44, baseType: !219, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !206, file: !205, line: 47, baseType: !219, size: 64, align: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !206, file: !205, line: 51, baseType: !23, size: 64, align: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !206, file: !205, line: 54, baseType: !23, size: 64, align: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !206, file: !205, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !206, file: !205, line: 60, baseType: !23, size: 64, align: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !206, file: !205, line: 63, baseType: !27, size: 64, align: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !205, line: 67, baseType: !19, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !206, file: !205, line: 70, baseType: !20, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !206, file: !205, line: 73, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !205, line: 22, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, file: !205, line: 18, size: 16, align: 8, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !231, file: !205, line: 20, baseType: !77, size: 8, align: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !231, file: !205, line: 21, baseType: !77, size: 8, align: 8, offset: 8)
!235 = !{!236, !237}
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !200, file: !1, line: 178, type: !203)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !200, file: !1, line: 180, type: !4)
!238 = !DISubprogram(name: "PUGH_DestroyPGH", scope: !1, file: !1, line: 202, type: !239, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PGH**)* @PUGH_DestroyPGH, variables: !242)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!242 = !{!243, !244, !245, !246, !259, !260, !261, !262}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GHin", arg: 1, scope: !238, file: !1, line: 202, type: !241)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GH", scope: !238, file: !1, line: 204, type: !4)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GA", scope: !238, file: !1, line: 205, type: !78)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pgroup", scope: !238, file: !1, line: 206, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !248, line: 24, baseType: !249)
!248 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !248, line: 14, size: 256, align: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !249, file: !248, line: 16, baseType: !12, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !249, file: !248, line: 17, baseType: !12, size: 32, align: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !249, file: !248, line: 18, baseType: !12, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !249, file: !248, line: 19, baseType: !12, size: 32, align: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !249, file: !248, line: 20, baseType: !12, size: 32, align: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !249, file: !248, line: 21, baseType: !12, size: 32, align: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !249, file: !248, line: 22, baseType: !12, size: 32, align: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !249, file: !248, line: 23, baseType: !12, size: 32, align: 32, offset: 224)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !238, file: !1, line: 207, type: !12)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable", scope: !238, file: !1, line: 208, type: !12)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !238, file: !1, line: 209, type: !12)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "this_var", scope: !238, file: !1, line: 210, type: !12)
!263 = !DISubprogram(name: "PUGH_SetupDefaultTopology", scope: !1, file: !1, line: 333, type: !264, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*)* @PUGH_SetupDefaultTopology, variables: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!12, !12, !23}
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 1, scope: !263, file: !1, line: 333, type: !12)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 2, scope: !263, file: !1, line: 333, type: !23)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !263, file: !1, line: 335, type: !131)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !263, file: !1, line: 335, type: !131)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !263, file: !1, line: 335, type: !131)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !263, file: !1, line: 335, type: !131)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !263, file: !1, line: 335, type: !131)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !263, file: !1, line: 335, type: !131)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !263, file: !1, line: 335, type: !131)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !263, file: !1, line: 335, type: !131)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !263, file: !1, line: 335, type: !131)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !263, file: !1, line: 335, type: !131)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !263, file: !1, line: 335, type: !131)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !263, file: !1, line: 335, type: !131)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !263, file: !1, line: 335, type: !118)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !263, file: !1, line: 335, type: !118)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !263, file: !1, line: 335, type: !118)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !263, file: !1, line: 335, type: !118)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !263, file: !1, line: 335, type: !118)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !263, file: !1, line: 335, type: !118)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !263, file: !1, line: 335, type: !118)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !263, file: !1, line: 335, type: !118)
