; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupGroup.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }

@.str = private unnamed_addr constant [77 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupGroup.c\00", align 1
@.str1 = private unnamed_addr constant [5 x i8] c"PUGH\00", align 1
@.str2 = private unnamed_addr constant [38 x i8] c"Unknown group type in PUGH_SetupGroup\00", align 1
@.str3 = private unnamed_addr constant [91 x i8] c"$Header: /cactus/CactusPUGH/PUGH/src/SetupGroup.c,v 1.45 2001/10/07 10:06:31 goodale Exp $\00", align 1
@.str4 = private unnamed_addr constant [49 x i8] c"Memory allocation error in PUGH_SetupScalarGroup\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !11, globals: !214, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/SetupGroup.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !7, !9, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !{!12, !17, !99, !179}
!12 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_SetupGroup_c", scope: !1, file: !1, line: 23, type: !13, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_SetupGroup_c, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!17 = !DISubprogram(name: "PUGH_SetupGroup", scope: !1, file: !1, line: 441, type: !18, isLocal: false, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PGH*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32)* @PUGH_SetupGroup, variables: !87)
!18 = !DISubroutineType(types: !19)
!19 = !{!10, !20, !9, !9, !10, !10, !10, !10, !10, !10, !10}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !22, line: 81, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !22, line: 13, size: 1152, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !39, !40, !41, !42, !43, !44, !45, !46, !47, !76, !86}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !23, file: !22, line: 17, baseType: !6, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !23, file: !22, line: 18, baseType: !10, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !23, file: !22, line: 21, baseType: !10, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !23, file: !22, line: 22, baseType: !10, size: 32, align: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !23, file: !22, line: 23, baseType: !10, size: 32, align: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !23, file: !22, line: 27, baseType: !10, size: 32, align: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !23, file: !22, line: 28, baseType: !10, size: 32, align: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !23, file: !22, line: 29, baseType: !4, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !23, file: !22, line: 32, baseType: !10, size: 32, align: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !23, file: !22, line: 34, baseType: !9, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !23, file: !22, line: 35, baseType: !10, size: 32, align: 32, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !23, file: !22, line: 37, baseType: !10, size: 32, align: 32, offset: 480)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !23, file: !22, line: 41, baseType: !38, size: 64, align: 64, offset: 512)
!38 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !23, file: !22, line: 41, baseType: !38, size: 64, align: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !23, file: !22, line: 41, baseType: !38, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !23, file: !22, line: 41, baseType: !38, size: 64, align: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !23, file: !22, line: 44, baseType: !10, size: 32, align: 32, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !23, file: !22, line: 45, baseType: !10, size: 32, align: 32, offset: 800)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !23, file: !22, line: 46, baseType: !10, size: 32, align: 32, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !23, file: !22, line: 49, baseType: !10, size: 32, align: 32, offset: 864)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !23, file: !22, line: 53, baseType: !10, size: 32, align: 32, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !23, file: !22, line: 76, baseType: !48, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !51, line: 72, baseType: !52)
!51 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !51, line: 37, size: 2368, align: 64, elements: !53)
!53 = !{!54, !55, !56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !73, !75}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !52, file: !51, line: 39, baseType: !10, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !52, file: !51, line: 41, baseType: !9, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !52, file: !51, line: 44, baseType: !38, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !52, file: !51, line: 45, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !52, file: !51, line: 46, baseType: !58, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !52, file: !51, line: 47, baseType: !9, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !52, file: !51, line: 49, baseType: !9, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !52, file: !51, line: 50, baseType: !10, size: 32, align: 32, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !52, file: !51, line: 51, baseType: !9, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !52, file: !51, line: 52, baseType: !58, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !52, file: !51, line: 55, baseType: !9, size: 64, align: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !52, file: !51, line: 56, baseType: !9, size: 64, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !52, file: !51, line: 59, baseType: !9, size: 64, align: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !52, file: !51, line: 60, baseType: !69, size: 512, align: 64, offset: 832)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 64, elements: !70)
!70 = !{!71, !72}
!71 = !DISubrange(count: 4)
!72 = !DISubrange(count: 2)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !52, file: !51, line: 64, baseType: !74, size: 512, align: 64, offset: 1344)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 512, align: 64, elements: !70)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !52, file: !51, line: 68, baseType: !74, size: 512, align: 64, offset: 1856)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !23, file: !22, line: 77, baseType: !77, size: 64, align: 64, offset: 1024)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !51, line: 29, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !51, line: 23, size: 256, align: 64, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !80, file: !51, line: 25, baseType: !10, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !80, file: !51, line: 26, baseType: !9, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !80, file: !51, line: 27, baseType: !58, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !80, file: !51, line: 28, baseType: !9, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !23, file: !22, line: 79, baseType: !7, size: 64, align: 64, offset: 1088)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newGH", arg: 1, scope: !17, file: !1, line: 441, type: !20)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsize", arg: 2, scope: !17, file: !1, line: 442, type: !9)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nghostsize", arg: 3, scope: !17, file: !1, line: 443, type: !9)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gtype", arg: 4, scope: !17, file: !1, line: 444, type: !10)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtype", arg: 5, scope: !17, file: !1, line: 445, type: !10)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 6, scope: !17, file: !1, line: 446, type: !10)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_variables", arg: 7, scope: !17, file: !1, line: 447, type: !10)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "staggercode", arg: 8, scope: !17, file: !1, line: 448, type: !10)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_timelevels", arg: 9, scope: !17, file: !1, line: 449, type: !10)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vectorgroup", arg: 10, scope: !17, file: !1, line: 450, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !17, file: !1, line: 452, type: !10)
!99 = !DISubprogram(name: "PUGH_SetupScalarGroup", scope: !1, file: !1, line: 92, type: !100, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{!10, !20, !10, !10, !10, !10}
!102 = !{!103, !104, !105, !106, !107, !108, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !171, !174, !175, !176, !177, !178}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newGH", arg: 1, scope: !99, file: !1, line: 92, type: !20)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtype", arg: 2, scope: !99, file: !1, line: 93, type: !10)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_variables", arg: 3, scope: !99, file: !1, line: 94, type: !10)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_timelevels", arg: 4, scope: !99, file: !1, line: 95, type: !10)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vectorgroup", arg: 5, scope: !99, file: !1, line: 96, type: !10)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !99, file: !1, line: 98, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !99, file: !1, line: 98, type: !109)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !99, file: !1, line: 98, type: !109)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !99, file: !1, line: 98, type: !109)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !99, file: !1, line: 98, type: !109)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !99, file: !1, line: 98, type: !109)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !99, file: !1, line: 98, type: !109)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !99, file: !1, line: 98, type: !109)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !99, file: !1, line: 98, type: !109)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !99, file: !1, line: 98, type: !109)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !99, file: !1, line: 98, type: !109)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !99, file: !1, line: 98, type: !109)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !99, file: !1, line: 98, type: !15)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !99, file: !1, line: 98, type: !15)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !99, file: !1, line: 98, type: !15)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !99, file: !1, line: 98, type: !15)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !99, file: !1, line: 98, type: !15)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !99, file: !1, line: 98, type: !15)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !99, file: !1, line: 98, type: !15)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !99, file: !1, line: 98, type: !15)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !99, file: !1, line: 98, type: !15)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !99, file: !1, line: 98, type: !15)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !99, file: !1, line: 98, type: !15)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !99, file: !1, line: 98, type: !109)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !99, file: !1, line: 98, type: !109)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !99, file: !1, line: 98, type: !109)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !99, file: !1, line: 98, type: !109)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !99, file: !1, line: 98, type: !109)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !99, file: !1, line: 98, type: !109)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !99, file: !1, line: 98, type: !109)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !99, file: !1, line: 98, type: !109)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !99, file: !1, line: 98, type: !109)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !99, file: !1, line: 98, type: !109)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !99, file: !1, line: 98, type: !109)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !99, file: !1, line: 98, type: !109)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !99, file: !1, line: 98, type: !109)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !99, file: !1, line: 98, type: !109)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !99, file: !1, line: 98, type: !109)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !99, file: !1, line: 98, type: !109)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !99, file: !1, line: 98, type: !109)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !99, file: !1, line: 98, type: !109)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !99, file: !1, line: 98, type: !109)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !99, file: !1, line: 98, type: !109)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !99, file: !1, line: 98, type: !109)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !99, file: !1, line: 98, type: !109)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !99, file: !1, line: 98, type: !109)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !99, file: !1, line: 98, type: !109)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !99, file: !1, line: 98, type: !109)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !99, file: !1, line: 98, type: !109)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !99, file: !1, line: 98, type: !109)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !99, file: !1, line: 98, type: !109)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !99, file: !1, line: 98, type: !109)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !99, file: !1, line: 98, type: !109)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !99, file: !1, line: 98, type: !109)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !99, file: !1, line: 98, type: !109)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !99, file: !1, line: 98, type: !109)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !99, file: !1, line: 98, type: !15)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !99, file: !1, line: 98, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !99, file: !1, line: 98, type: !167)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !99, file: !1, line: 98, type: !109)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !99, file: !1, line: 98, type: !109)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !99, file: !1, line: 98, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable", scope: !99, file: !1, line: 99, type: !10)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !99, file: !1, line: 99, type: !10)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtypesize", scope: !99, file: !1, line: 99, type: !10)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !99, file: !1, line: 99, type: !10)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !99, file: !1, line: 100, type: !6)
!179 = !DISubprogram(name: "PUGH_SetupGAGroup", scope: !1, file: !1, line: 231, type: !18, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, variables: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !212, !213}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newGH", arg: 1, scope: !179, file: !1, line: 231, type: !20)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsize", arg: 2, scope: !179, file: !1, line: 232, type: !9)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghostsize", arg: 3, scope: !179, file: !1, line: 233, type: !9)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gtype", arg: 4, scope: !179, file: !1, line: 234, type: !10)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vtype", arg: 5, scope: !179, file: !1, line: 235, type: !10)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 6, scope: !179, file: !1, line: 236, type: !10)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_variables", arg: 7, scope: !179, file: !1, line: 237, type: !10)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "staggercode", arg: 8, scope: !179, file: !1, line: 238, type: !10)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_timelevels", arg: 9, scope: !179, file: !1, line: 239, type: !10)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vectorgroup", arg: 10, scope: !179, file: !1, line: 240, type: !10)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !179, file: !1, line: 242, type: !10)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "variable", scope: !179, file: !1, line: 243, type: !10)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "var_size", scope: !179, file: !1, line: 244, type: !10)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !179, file: !1, line: 245, type: !10)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !179, file: !1, line: 246, type: !10)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !179, file: !1, line: 247, type: !4)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "connectivity", scope: !179, file: !1, line: 248, type: !78)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extras", scope: !179, file: !1, line: 249, type: !49)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupcomm", scope: !179, file: !1, line: 250, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !51, line: 94, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !51, line: 74, size: 448, align: 64, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !202, file: !51, line: 77, baseType: !9, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !202, file: !51, line: 78, baseType: !5, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !202, file: !51, line: 79, baseType: !5, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !202, file: !51, line: 80, baseType: !10, size: 32, align: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !202, file: !51, line: 82, baseType: !9, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !202, file: !51, line: 84, baseType: !10, size: 32, align: 32, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !202, file: !51, line: 85, baseType: !10, size: 32, align: 32, offset: 352)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !202, file: !51, line: 86, baseType: !10, size: 32, align: 32, offset: 384)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perme", scope: !179, file: !1, line: 251, type: !9)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nprocs", scope: !179, file: !1, line: 252, type: !9)
!214 = !{!215}
!215 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 22, type: !15, isLocal: true, isDefinition: true)
!216 = !{i32 2, !"Dwarf Version", i32 2}
!217 = !{i32 2, !"Debug Info Version", i32 700000003}
!218 = !{i32 1, !"PIC Level", i32 2}
!219 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!220 = !DILocation(line: 23, column: 1, scope: !12)
!221 = !DIExpression()
!222 = !DILocation(line: 441, column: 27, scope: !17)
!223 = !DILocation(line: 442, column: 27, scope: !17)
!224 = !DILocation(line: 443, column: 27, scope: !17)
!225 = !DILocation(line: 444, column: 27, scope: !17)
!226 = !DILocation(line: 445, column: 27, scope: !17)
!227 = !DILocation(line: 446, column: 27, scope: !17)
!228 = !DILocation(line: 447, column: 27, scope: !17)
!229 = !DILocation(line: 448, column: 27, scope: !17)
!230 = !DILocation(line: 449, column: 27, scope: !17)
!231 = !DILocation(line: 450, column: 27, scope: !17)
!232 = !DILocation(line: 454, column: 13, scope: !233)
!233 = distinct !DILexicalBlock(scope: !17, file: !1, line: 454, column: 7)
!234 = !DILocation(line: 454, column: 7, scope: !17)
!235 = !DILocation(line: 96, column: 39, scope: !99, inlinedAt: !236)
!236 = distinct !DILocation(line: 456, column: 14, scope: !237)
!237 = distinct !DILexicalBlock(scope: !233, file: !1, line: 455, column: 3)
!238 = !DILocation(line: 99, column: 35, scope: !99, inlinedAt: !236)
!239 = !DILocation(line: 105, column: 26, scope: !99, inlinedAt: !236)
!240 = !{!241, !242, i64 32}
!241 = !{!"PGH", !242, i64 0, !245, i64 8, !245, i64 12, !245, i64 16, !245, i64 20, !245, i64 24, !245, i64 28, !242, i64 32, !245, i64 40, !242, i64 48, !245, i64 56, !245, i64 60, !246, i64 64, !246, i64 72, !246, i64 80, !246, i64 88, !245, i64 96, !245, i64 100, !245, i64 104, !245, i64 108, !245, i64 112, !242, i64 120, !242, i64 128, !242, i64 136}
!242 = !{!"any pointer", !243, i64 0}
!243 = !{!"omnipotent char", !244, i64 0}
!244 = !{!"Simple C/C++ TBAA"}
!245 = !{!"int", !243, i64 0}
!246 = !{!"double", !243, i64 0}
!247 = !DILocation(line: 106, column: 27, scope: !99, inlinedAt: !236)
!248 = !{!241, !245, i64 24}
!249 = !DILocation(line: 106, column: 38, scope: !99, inlinedAt: !236)
!250 = !DILocation(line: 106, column: 19, scope: !99, inlinedAt: !236)
!251 = !DILocation(line: 106, column: 53, scope: !99, inlinedAt: !236)
!252 = !DILocation(line: 105, column: 10, scope: !99, inlinedAt: !236)
!253 = !DILocation(line: 100, column: 9, scope: !99, inlinedAt: !236)
!254 = !DILocation(line: 107, column: 7, scope: !255, inlinedAt: !236)
!255 = distinct !DILexicalBlock(scope: !99, file: !1, line: 107, column: 7)
!256 = !DILocation(line: 107, column: 7, scope: !99, inlinedAt: !236)
!257 = !DILocation(line: 109, column: 22, scope: !258, inlinedAt: !236)
!258 = distinct !DILexicalBlock(scope: !255, file: !1, line: 108, column: 3)
!259 = !DILocation(line: 110, column: 17, scope: !258, inlinedAt: !236)
!260 = !DILocation(line: 99, column: 24, scope: !99, inlinedAt: !236)
!261 = !DILocation(line: 99, column: 7, scope: !99, inlinedAt: !236)
!262 = !DILocation(line: 112, column: 33, scope: !263, inlinedAt: !236)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 112, column: 5)
!264 = distinct !DILexicalBlock(scope: !258, file: !1, line: 112, column: 5)
!265 = !DILocation(line: 112, column: 47, scope: !263, inlinedAt: !236)
!266 = !DILocation(line: 149, column: 23, scope: !267, inlinedAt: !236)
!267 = distinct !DILexicalBlock(scope: !268, file: !1, line: 148, column: 3)
!268 = distinct !DILexicalBlock(scope: !99, file: !1, line: 147, column: 7)
!269 = !DILocation(line: 114, column: 22, scope: !270, inlinedAt: !236)
