; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/ShiftInits.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@.str = private unnamed_addr constant [15 x i8] c"Einstein::detg\00", align 1
@.str1 = private unnamed_addr constant [14 x i8] c"Einstein::gpp\00", align 1
@.str2 = private unnamed_addr constant [14 x i8] c"Einstein::gqp\00", align 1
@.str3 = private unnamed_addr constant [14 x i8] c"Einstein::gqq\00", align 1
@.str4 = private unnamed_addr constant [14 x i8] c"Einstein::grp\00", align 1
@.str5 = private unnamed_addr constant [14 x i8] c"Einstein::grq\00", align 1
@.str6 = private unnamed_addr constant [14 x i8] c"Einstein::grr\00", align 1
@.str7 = private unnamed_addr constant [14 x i8] c"Einstein::kpp\00", align 1
@.str8 = private unnamed_addr constant [14 x i8] c"Einstein::kqp\00", align 1
@.str9 = private unnamed_addr constant [14 x i8] c"Einstein::kqq\00", align 1
@.str10 = private unnamed_addr constant [14 x i8] c"Einstein::krp\00", align 1
@.str11 = private unnamed_addr constant [14 x i8] c"Einstein::krq\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !10, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/ShiftInits.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !6, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!10 = !{!11, !131}
!11 = !DISubprogram(name: "ShiftZero", scope: !1, file: !1, line: 27, type: !12, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cGH*)* @ShiftZero, variables: !49)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !16, line: 75, baseType: !17)
!16 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!17 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 24, size: 1216, align: 64, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !40, !41}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !17, file: !16, line: 26, baseType: !7, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !17, file: !16, line: 27, baseType: !7, size: 32, align: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !17, file: !16, line: 30, baseType: !6, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !17, file: !16, line: 31, baseType: !6, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !17, file: !16, line: 32, baseType: !6, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !17, file: !16, line: 33, baseType: !6, size: 64, align: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !17, file: !16, line: 36, baseType: !6, size: 64, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !17, file: !16, line: 39, baseType: !6, size: 64, align: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !17, file: !16, line: 40, baseType: !6, size: 64, align: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !17, file: !16, line: 43, baseType: !5, size: 64, align: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !17, file: !16, line: 44, baseType: !4, size: 64, align: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !17, file: !16, line: 47, baseType: !4, size: 64, align: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !17, file: !16, line: 51, baseType: !6, size: 64, align: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !17, file: !16, line: 54, baseType: !6, size: 64, align: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !17, file: !16, line: 57, baseType: !7, size: 32, align: 32, offset: 832)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !17, file: !16, line: 60, baseType: !6, size: 64, align: 64, offset: 896)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !17, file: !16, line: 63, baseType: !5, size: 64, align: 64, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !16, line: 67, baseType: !37, size: 64, align: 64, offset: 1024)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !17, file: !16, line: 70, baseType: !38, size: 64, align: 64, offset: 1088)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !17, file: !16, line: 73, baseType: !42, size: 64, align: 64, offset: 1152)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !16, line: 22, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 18, size: 16, align: 8, elements: !45)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !44, file: !16, line: 20, baseType: !47, size: 8, align: 8)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !44, file: !16, line: 21, baseType: !47, size: 8, align: 8, offset: 8)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctkGH", arg: 1, scope: !11, file: !1, line: 27, type: !14)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_dim", scope: !11, file: !1, line: 30, type: !7)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_gsh", scope: !11, file: !1, line: 30, type: !6)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_lsh", scope: !11, file: !1, line: 30, type: !6)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_lbnd", scope: !11, file: !1, line: 30, type: !6)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_ubnd", scope: !11, file: !1, line: 30, type: !6)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_lssh", scope: !11, file: !1, line: 30, type: !6)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_from", scope: !11, file: !1, line: 30, type: !6)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_to", scope: !11, file: !1, line: 30, type: !6)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_bbox", scope: !11, file: !1, line: 30, type: !6)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_delta_time", scope: !11, file: !1, line: 30, type: !5)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_time", scope: !11, file: !1, line: 30, type: !5)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_delta_space", scope: !11, file: !1, line: 30, type: !4)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_origin_space", scope: !11, file: !1, line: 30, type: !4)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_levfac", scope: !11, file: !1, line: 30, type: !6)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_convlevel", scope: !11, file: !1, line: 30, type: !7)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_nghostzones", scope: !11, file: !1, line: 30, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_iteration", scope: !11, file: !1, line: 30, type: !7)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_dummy_pointer", scope: !11, file: !1, line: 30, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "detg", scope: !11, file: !1, line: 30, type: !4)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gpp", scope: !11, file: !1, line: 30, type: !4)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gqp", scope: !11, file: !1, line: 30, type: !4)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gqq", scope: !11, file: !1, line: 30, type: !4)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grp", scope: !11, file: !1, line: 30, type: !4)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grq", scope: !11, file: !1, line: 30, type: !4)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grr", scope: !11, file: !1, line: 30, type: !4)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kpp", scope: !11, file: !1, line: 30, type: !4)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kqp", scope: !11, file: !1, line: 30, type: !4)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kqq", scope: !11, file: !1, line: 30, type: !4)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "krp", scope: !11, file: !1, line: 30, type: !4)
