; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/Slicing.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cHandledData = type { %struct.cHandleStorage*, i32, i32 }
%struct.cHandleStorage = type { i32, i8*, i8* }
%struct.anon = type { double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }

@Eslicings = internal global %struct.cHandledData* null, align 8
@num_slicings = internal unnamed_addr global i32 0, align 4
@.str = private unnamed_addr constant [78 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/Slicing.c\00", align 1
@.str1 = private unnamed_addr constant [9 x i8] c"Einstein\00", align 1
@.str2 = private unnamed_addr constant [39 x i8] c"cannot allocate memory for new slicing\00", align 1
@.str3 = private unnamed_addr constant [34 x i8] c"New handle %s (%d) already in use\00", align 1
@.str4 = private unnamed_addr constant [49 x i8] c"Could not obtain slicing structure for handle %d\00", align 1
@einsteinrest_ = external global %struct.anon
@.str5 = private unnamed_addr constant [32 x i8] c"Einstein::active_slicing_handle\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !54, globals: !183, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/Slicing.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !9, !25, !45}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DICompositeType(tag: DW_TAG_structure_type, name: "Einstein_slicing", file: !6, line: 31, size: 192, align: 64, elements: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/../include/Slicing.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !{!8, !11, !13}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5, file: !6, line: 32, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "param_active", scope: !5, file: !6, line: 33, baseType: !12, size: 32, align: 32, offset: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "timetoslice", scope: !5, file: !6, line: 34, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{!12, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !19, line: 75, baseType: !20)
!19 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 24, size: 1216, align: 64, elements: !21)
!21 = !{!22, !23, !24, !26, !27, !28, !29, !30, !31, !32, !34, !36, !37, !38, !39, !40, !41, !42, !46, !47}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !20, file: !19, line: 26, baseType: !12, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !20, file: !19, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !20, file: !19, line: 30, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !20, file: !19, line: 31, baseType: !25, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !20, file: !19, line: 32, baseType: !25, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !20, file: !19, line: 33, baseType: !25, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !20, file: !19, line: 36, baseType: !25, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !20, file: !19, line: 39, baseType: !25, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !20, file: !19, line: 40, baseType: !25, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !20, file: !19, line: 43, baseType: !33, size: 64, align: 64, offset: 512)
!33 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !20, file: !19, line: 44, baseType: !35, size: 64, align: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !20, file: !19, line: 47, baseType: !35, size: 64, align: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !20, file: !19, line: 51, baseType: !25, size: 64, align: 64, offset: 704)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !20, file: !19, line: 54, baseType: !25, size: 64, align: 64, offset: 768)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !20, file: !19, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !20, file: !19, line: 60, baseType: !25, size: 64, align: 64, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !20, file: !19, line: 63, baseType: !33, size: 64, align: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !19, line: 67, baseType: !43, size: 64, align: 64, offset: 1024)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !20, file: !19, line: 70, baseType: !44, size: 64, align: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !20, file: !19, line: 73, baseType: !48, size: 64, align: 64, offset: 1152)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !19, line: 22, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 18, size: 16, align: 8, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !50, file: !19, line: 20, baseType: !10, size: 8, align: 8)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !50, file: !19, line: 21, baseType: !10, size: 8, align: 8, offset: 8)
!54 = !{!55, !60, !67, !76, !84, !132, !136, !142}
!55 = !DISubprogram(name: "CCTKi_version_CactusEinstein_Einstein_Slicing_c", scope: !1, file: !1, line: 41, type: !56, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusEinstein_Einstein_Slicing_c, variables: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!60 = !DISubprogram(name: "Einstein_RegisterSlicing", scope: !1, file: !1, line: 71, type: !61, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @Einstein_RegisterSlicing, variables: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{!12, !58}
!63 = !{!64, !65, !66}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slice_name", arg: 1, scope: !60, file: !1, line: 71, type: !58)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !60, file: !1, line: 73, type: !12)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_slicing", scope: !60, file: !1, line: 75, type: !4)
!67 = !DISubprogram(name: "einstein_registerslicing_", scope: !1, file: !1, line: 150, type: !68, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @einstein_registerslicing_, variables: !71)
!68 = !DISubroutineType(types: !69)
!69 = !{!12, !9, !70}
!70 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 1, scope: !67, file: !1, line: 150, type: !9)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 2, scope: !67, file: !1, line: 150, type: !70)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !67, file: !1, line: 152, type: !12)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !67, file: !1, line: 153, type: !9)
!76 = !DISubprogram(name: "Einstein_RegisterTimeToSlice", scope: !1, file: !1, line: 180, type: !77, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (%struct.cGH*)*)* @Einstein_RegisterTimeToSlice, variables: !79)
!77 = !DISubroutineType(types: !78)
!78 = !{!12, !12, !14}
!79 = !{!80, !81, !82, !83}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handle", arg: 1, scope: !76, file: !1, line: 180, type: !12)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !76, file: !1, line: 180, type: !14)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_code", scope: !76, file: !1, line: 182, type: !12)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicing", scope: !76, file: !1, line: 183, type: !4)
!84 = !DISubprogram(name: "Einstein_ActivateSlicing", scope: !1, file: !1, line: 229, type: !85, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cGH*)* @Einstein_ActivateSlicing, variables: !87)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !17}
!87 = !{!88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !84, file: !1, line: 229, type: !17)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gaussian_amplitude", scope: !84, file: !1, line: 232, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gaussian_sigma2", scope: !84, file: !1, line: 232, type: !90)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "psiminustwo_cut", scope: !84, file: !1, line: 232, type: !90)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rot_shift_att_sigma", scope: !84, file: !1, line: 232, type: !90)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rotation_omega", scope: !84, file: !1, line: 232, type: !90)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "advection", scope: !84, file: !1, line: 232, type: !58)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evolution_system", scope: !84, file: !1, line: 232, type: !58)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_data", scope: !84, file: !1, line: 232, type: !58)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_lapse", scope: !84, file: !1, line: 232, type: !58)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_shift", scope: !84, file: !1, line: 232, type: !58)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mixed_slicing", scope: !84, file: !1, line: 232, type: !58)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !84, file: !1, line: 232, type: !58)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicing", scope: !84, file: !1, line: 232, type: !58)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicing_verbose", scope: !84, file: !1, line: 232, type: !58)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "einstein_register_slicing", scope: !84, file: !1, line: 232, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rot_shift_att", scope: !84, file: !1, line: 232, type: !105)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rot_shift_att_pow", scope: !84, file: !1, line: 232, type: !105)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rotation_psipower", scope: !84, file: !1, line: 232, type: !105)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_conformal", scope: !84, file: !1, line: 232, type: !105)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_conformal_derivs", scope: !84, file: !1, line: 232, type: !105)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_mask", scope: !84, file: !1, line: 232, type: !105)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtfac", scope: !84, file: !1, line: 232, type: !90)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gauge_speed", scope: !84, file: !1, line: 232, type: !90)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wavecalc", scope: !84, file: !1, line: 232, type: !58)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "conformal_storage_all", scope: !84, file: !1, line: 232, type: !105)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsquared_in_sphm", scope: !84, file: !1, line: 232, type: !105)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !84, file: !1, line: 232, type: !58)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timestep_method", scope: !84, file: !1, line: 232, type: !58)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !84, file: !1, line: 232, type: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slic", scope: !84, file: !1, line: 234, type: !4)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "active_slicing_handle", scope: !84, file: !1, line: 235, type: !25)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !84, file: !1, line: 237, type: !12)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "priority", scope: !84, file: !1, line: 237, type: !12)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !84, file: !1, line: 237, type: !12)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle2", scope: !84, file: !1, line: 238, type: !12)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !84, file: !1, line: 239, type: !9)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "split_string", scope: !84, file: !1, line: 239, type: !9)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !84, file: !1, line: 240, type: !9)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "after", scope: !84, file: !1, line: 240, type: !9)
!132 = !DISubprogram(name: "Einstein_GetSlicingHandle", scope: !1, file: !1, line: 420, type: !61, isLocal: false, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @Einstein_GetSlicingHandle, variables: !133)
!133 = !{!134, !135}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !132, file: !1, line: 420, type: !58)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !132, file: !1, line: 422, type: !12)
!136 = !DISubprogram(name: "einstein_getslicinghandle_", scope: !1, file: !1, line: 434, type: !68, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @einstein_getslicinghandle_, variables: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_str1", arg: 1, scope: !136, file: !1, line: 434, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cctk_strlen1", arg: 2, scope: !136, file: !1, line: 434, type: !70)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !136, file: !1, line: 436, type: !12)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !136, file: !1, line: 437, type: !9)
!142 = !DISubprogram(name: "Einstein_SetNextSlicing", scope: !1, file: !1, line: 462, type: !85, isLocal: false, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cGH*)* @Einstein_SetNextSlicing, variables: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !142, file: !1, line: 462, type: !17)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gaussian_amplitude", scope: !142, file: !1, line: 464, type: !90)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gaussian_sigma2", scope: !142, file: !1, line: 464, type: !90)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "psiminustwo_cut", scope: !142, file: !1, line: 464, type: !90)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rot_shift_att_sigma", scope: !142, file: !1, line: 464, type: !90)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rotation_omega", scope: !142, file: !1, line: 464, type: !90)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "advection", scope: !142, file: !1, line: 464, type: !58)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evolution_system", scope: !142, file: !1, line: 464, type: !58)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_data", scope: !142, file: !1, line: 464, type: !58)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_lapse", scope: !142, file: !1, line: 464, type: !58)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_shift", scope: !142, file: !1, line: 464, type: !58)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mixed_slicing", scope: !142, file: !1, line: 464, type: !58)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !142, file: !1, line: 464, type: !58)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicing", scope: !142, file: !1, line: 464, type: !58)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicing_verbose", scope: !142, file: !1, line: 464, type: !58)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "einstein_register_slicing", scope: !142, file: !1, line: 464, type: !105)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rot_shift_att", scope: !142, file: !1, line: 464, type: !105)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rot_shift_att_pow", scope: !142, file: !1, line: 464, type: !105)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rotation_psipower", scope: !142, file: !1, line: 464, type: !105)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_conformal", scope: !142, file: !1, line: 464, type: !105)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_conformal_derivs", scope: !142, file: !1, line: 464, type: !105)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_mask", scope: !142, file: !1, line: 464, type: !105)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtfac", scope: !142, file: !1, line: 464, type: !90)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gauge_speed", scope: !142, file: !1, line: 464, type: !90)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wavecalc", scope: !142, file: !1, line: 464, type: !58)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "conformal_storage_all", scope: !142, file: !1, line: 464, type: !105)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rsquared_in_sphm", scope: !142, file: !1, line: 464, type: !105)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !142, file: !1, line: 464, type: !58)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timestep_method", scope: !142, file: !1, line: 464, type: !58)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !142, file: !1, line: 464, type: !120)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slic", scope: !142, file: !1, line: 466, type: !4)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "active_slicing_handle", scope: !142, file: !1, line: 467, type: !25)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !142, file: !1, line: 468, type: !12)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !142, file: !1, line: 469, type: !9)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !142, file: !1, line: 471, type: !12)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doicare", scope: !142, file: !1, line: 471, type: !12)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h_yes", scope: !142, file: !1, line: 472, type: !12)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h_no", scope: !142, file: !1, line: 473, type: !12)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h_egal", scope: !142, file: !1, line: 474, type: !12)
!183 = !{!184, !185, !201}
!184 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 39, type: !58, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariable(name: "Eslicings", scope: !0, file: !1, line: 50, type: !186, isLocal: true, isDefinition: true, variable: %struct.cHandledData** @Eslicings)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandledData", file: !188, line: 28, baseType: !189)
!188 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/Einstein/../include/StoreHandledData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 23, size: 128, align: 64, elements: !190)
!190 = !{!191, !199, !200}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !189, file: !188, line: 25, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "cHandleStorage", file: !188, line: 21, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 16, size: 192, align: 64, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !194, file: !188, line: 18, baseType: !70, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !188, line: 19, baseType: !9, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !188, line: 20, baseType: !45, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "array_size", scope: !189, file: !188, line: 26, baseType: !70, size: 32, align: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused", scope: !189, file: !188, line: 27, baseType: !70, size: 32, align: 32, offset: 96)
!201 = !DIGlobalVariable(name: "num_slicings", scope: !0, file: !1, line: 49, type: !12, isLocal: true, isDefinition: true, variable: i32* @num_slicings)
!202 = !{i32 2, !"Dwarf Version", i32 2}
!203 = !{i32 2, !"Debug Info Version", i32 700000003}
!204 = !{i32 1, !"PIC Level", i32 2}
!205 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!206 = !DILocation(line: 41, column: 1, scope: !55)
!207 = !DIExpression()
!208 = !DILocation(line: 71, column: 42, scope: !60)
!209 = !DILocation(line: 78, column: 27, scope: !60)
!210 = !{!211, !211, i64 0}
!211 = !{!"any pointer", !212, i64 0}
!212 = !{!"omnipotent char", !213, i64 0}
!213 = !{!"Simple C/C++ TBAA"}
!214 = !DILocation(line: 78, column: 12, scope: !60)
!215 = !DILocation(line: 73, column: 7, scope: !60)
!216 = !DILocation(line: 80, column: 13, scope: !217)
!217 = distinct !DILexicalBlock(scope: !60, file: !1, line: 80, column: 7)
!218 = !DILocation(line: 80, column: 7, scope: !60)
!219 = !DILocation(line: 84, column: 7, scope: !220)
!220 = distinct !DILexicalBlock(scope: !217, file: !1, line: 81, column: 3)
!221 = !DILocation(line: 86, column: 9, scope: !222)
!222 = distinct !DILexicalBlock(scope: !220, file: !1, line: 86, column: 9)
!223 = !DILocation(line: 86, column: 9, scope: !220)
!224 = !DILocation(line: 90, column: 16, scope: !225)
!225 = distinct !DILexicalBlock(scope: !222, file: !1, line: 87, column: 5)
!226 = !DILocation(line: 99, column: 20, scope: !225)
!227 = !DILocation(line: 99, column: 25, scope: !225)
!228 = !{!229, !211, i64 0}
!229 = !{!"Einstein_slicing", !211, i64 0, !230, i64 8, !211, i64 16}
!230 = !{!"int", !212, i64 0}
!231 = !DILocation(line: 104, column: 20, scope: !225)
!232 = !DILocation(line: 104, column: 32, scope: !225)
!233 = !{!229, !211, i64 16}
!234 = !DILocation(line: 107, column: 20, scope: !225)
!235 = !DILocation(line: 107, column: 33, scope: !225)
!236 = !{!229, !230, i64 8}
!237 = !DILocation(line: 110, column: 19, scope: !225)
!238 = !{!230, !230, i64 0}
!239 = !DILocation(line: 112, column: 5, scope: !225)
!240 = !DILocation(line: 116, column: 7, scope: !241)
!241 = distinct !DILexicalBlock(scope: !222, file: !1, line: 114, column: 5)
!242 = !DILocation(line: 123, column: 5, scope: !243)
!243 = distinct !DILexicalBlock(scope: !217, file: !1, line: 121, column: 3)
!244 = !DILocation(line: 129, column: 3, scope: !60)
!245 = !DILocation(line: 150, column: 42, scope: !67)
!246 = !DILocation(line: 153, column: 3, scope: !67)
!247 = !DILocation(line: 154, column: 12, scope: !67)
!248 = !DILocation(line: 152, column: 7, scope: !67)
!249 = !DILocation(line: 155, column: 3, scope: !67)
!250 = !DILocation(line: 156, column: 3, scope: !67)
!251 = !DILocation(line: 180, column: 38, scope: !76)
!252 = !DILocation(line: 180, column: 52, scope: !76)
!253 = !DILocation(line: 182, column: 7, scope: !76)
!254 = !DILocation(line: 185, column: 33, scope: !76)
!255 = !DILocation(line: 185, column: 13, scope: !76)
!256 = !DILocation(line: 187, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !76, file: !1, line: 187, column: 7)
!258 = !DILocation(line: 187, column: 7, scope: !76)
!259 = !DILocation(line: 189, column: 14, scope: !260)
!260 = distinct !DILexicalBlock(scope: !257, file: !1, line: 188, column: 3)
!261 = !DILocation(line: 189, column: 25, scope: !260)
!262 = !DILocation(line: 191, column: 3, scope: !260)
!263 = !DILocation(line: 195, column: 5, scope: !264)
!264 = distinct !DILexicalBlock(scope: !257, file: !1, line: 193, column: 3)
!265 = !DILocation(line: 205, column: 3, scope: !76)
!266 = !DILocation(line: 229, column: 36, scope: !84)
!267 = !DILocation(line: 232, column: 3, scope: !84)
!268 = !{!269, !211, i64 80}
