; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Storage.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon.0 = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.PGH = type { i8*, i32, i32, i32, i32, i32, i32, i8***, i32, i32*, i32, i32, double, double, double, double, i32, i32, i32, i32, i32, %struct.PGExtras**, %struct.PConnectivity**, i8* }
%struct.PGExtras = type { i32, i32*, double, i32**, i32**, i32*, i32*, i32, i32*, i32**, i32*, i32*, i32*, [4 x [2 x i32*]], [4 x [2 x i32**]], [4 x [2 x i32**]] }
%struct.PConnectivity = type { i32, i32*, i32**, i32* }
%struct.PGA = type { i8*, i32, i32, i8*, i8*, i32, i32, i8*, i32, i32, %struct.PGExtras*, %struct.PConnectivity*, %struct.PComm*, %struct.PComm*, i32, i32, %struct.PGA* }
%struct.PComm = type { i32*, i8**, i8**, i32, i32*, i32, i32, i32 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [74 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Storage.c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !116, globals: !526, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/Storage.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !10, !80, !81, !16, !83}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGA", file: !6, line: 126, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGV.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGA", file: !6, line: 96, size: 832, align: 64, elements: !8)
!8 = !{!9, !12, !14, !15, !17, !18, !19, !20, !21, !22, !23, !52, !61, !75, !76, !77, !78}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !7, file: !6, line: 98, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !7, file: !6, line: 99, baseType: !13, size: 32, align: 32, offset: 64)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "arrayid", scope: !7, file: !6, line: 100, baseType: !13, size: 32, align: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "padddata", scope: !7, file: !6, line: 101, baseType: !16, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !7, file: !6, line: 102, baseType: !16, size: 64, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !7, file: !6, line: 103, baseType: !13, size: 32, align: 32, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "stagger", scope: !7, file: !6, line: 104, baseType: !13, size: 32, align: 32, offset: 288)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !7, file: !6, line: 106, baseType: !16, size: 64, align: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "varsize", scope: !7, file: !6, line: 114, baseType: !13, size: 32, align: 32, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "vtype", scope: !7, file: !6, line: 115, baseType: !13, size: 32, align: 32, offset: 416)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "extras", scope: !7, file: !6, line: 117, baseType: !24, size: 64, align: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGExtras", file: !6, line: 72, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGExtras", file: !6, line: 37, size: 2368, align: 64, elements: !27)
!27 = !{!28, !29, !31, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !49, !51}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !26, file: !6, line: 39, baseType: !13, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nsize", scope: !26, file: !6, line: 41, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "maxskew", scope: !26, file: !6, line: 44, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !26, file: !6, line: 45, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ub", scope: !26, file: !6, line: 46, baseType: !34, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !26, file: !6, line: 47, baseType: !30, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lnsize", scope: !26, file: !6, line: 49, baseType: !30, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !26, file: !6, line: 50, baseType: !13, size: 32, align: 32, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rnpoints", scope: !26, file: !6, line: 51, baseType: !30, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rnsize", scope: !26, file: !6, line: 52, baseType: !34, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iterator", scope: !26, file: !6, line: 55, baseType: !30, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hyper_volume", scope: !26, file: !6, line: 56, baseType: !30, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nghostzones", scope: !26, file: !6, line: 59, baseType: !30, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ownership", scope: !26, file: !6, line: 60, baseType: !45, size: 512, align: 64, offset: 832)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DISubrange(count: 4)
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ghosts", scope: !26, file: !6, line: 64, baseType: !50, size: 512, align: 64, offset: 1344)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, align: 64, elements: !46)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !26, file: !6, line: 68, baseType: !50, size: 512, align: 64, offset: 1856)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "connectivity", scope: !7, file: !6, line: 118, baseType: !53, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "pConnectivity", file: !6, line: 29, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "PConnectivity", file: !6, line: 23, size: 256, align: 64, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !55, file: !6, line: 25, baseType: !13, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !55, file: !6, line: 26, baseType: !30, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "neighbours", scope: !55, file: !6, line: 27, baseType: !34, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !55, file: !6, line: 28, baseType: !30, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !7, file: !6, line: 120, baseType: !62, size: 64, align: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "pComm", file: !6, line: 94, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "PComm", file: !6, line: 74, size: 448, align: 64, elements: !65)
!65 = !{!66, !67, !69, !70, !71, !72, !73, !74}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_sz", scope: !64, file: !6, line: 77, baseType: !30, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !64, file: !6, line: 78, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !64, file: !6, line: 79, baseType: !68, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "commflag", scope: !64, file: !6, line: 80, baseType: !13, size: 32, align: 32, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "docomm", scope: !64, file: !6, line: 82, baseType: !30, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "first_var", scope: !64, file: !6, line: 84, baseType: !13, size: 32, align: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "n_vars", scope: !64, file: !6, line: 85, baseType: !13, size: 32, align: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sync_timelevel", scope: !64, file: !6, line: 86, baseType: !13, size: 32, align: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "groupcomm", scope: !7, file: !6, line: 121, baseType: !62, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "vector_size", scope: !7, file: !6, line: 123, baseType: !13, size: 32, align: 32, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vector_entry", scope: !7, file: !6, line: 124, baseType: !13, size: 32, align: 32, offset: 736)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vector_base", scope: !7, file: !6, line: 125, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!80 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !85, line: 75, baseType: !86)
!85 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 24, size: 1216, align: 64, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !100, !101, !102, !103, !104, !105, !106, !108, !109}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !86, file: !85, line: 26, baseType: !13, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !86, file: !85, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !86, file: !85, line: 30, baseType: !30, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !86, file: !85, line: 31, baseType: !30, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !86, file: !85, line: 32, baseType: !30, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !86, file: !85, line: 33, baseType: !30, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !86, file: !85, line: 36, baseType: !30, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !86, file: !85, line: 39, baseType: !30, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !86, file: !85, line: 40, baseType: !30, size: 64, align: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !86, file: !85, line: 43, baseType: !32, size: 64, align: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !86, file: !85, line: 44, baseType: !99, size: 64, align: 64, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !86, file: !85, line: 47, baseType: !99, size: 64, align: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !86, file: !85, line: 51, baseType: !30, size: 64, align: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !86, file: !85, line: 54, baseType: !30, size: 64, align: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !86, file: !85, line: 57, baseType: !13, size: 32, align: 32, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !86, file: !85, line: 60, baseType: !30, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !86, file: !85, line: 63, baseType: !32, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !85, line: 67, baseType: !107, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !86, file: !85, line: 70, baseType: !68, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !86, file: !85, line: 73, baseType: !110, size: 64, align: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !85, line: 22, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 18, size: 16, align: 8, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !112, file: !85, line: 20, baseType: !11, size: 8, align: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !112, file: !85, line: 21, baseType: !11, size: 8, align: 8, offset: 8)
!116 = !{!117, !122, !137, !181, !270, !346, !358, !364, !367, !443, !517}
!117 = !DISubprogram(name: "CCTKi_version_CactusPUGH_PUGH_Storage_c", scope: !1, file: !1, line: 25, type: !118, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusPUGH_PUGH_Storage_c, variables: !2)
!118 = !DISubroutineType(types: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!122 = !DISubprogram(name: "PUGH_ArrayGroupSize", scope: !1, file: !1, line: 102, type: !123, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct.cGH*, i32, i32, i8*)* @PUGH_ArrayGroupSize, variables: !129)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !127, !13, !13, !120}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !122, file: !1, line: 102, type: !127)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 2, scope: !122, file: !1, line: 103, type: !13)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 3, scope: !122, file: !1, line: 104, type: !13)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 4, scope: !122, file: !1, line: 105, type: !120)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_var", scope: !122, file: !1, line: 107, type: !13)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GA", scope: !122, file: !1, line: 108, type: !4)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !122, file: !1, line: 109, type: !125)
!137 = !DISubprogram(name: "PUGH_QueryGroupStorage", scope: !1, file: !1, line: 198, type: !138, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i8*)* @PUGH_QueryGroupStorage, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{!13, !127, !13, !120}
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !137, file: !1, line: 198, type: !127)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group", arg: 2, scope: !137, file: !1, line: 198, type: !13)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 3, scope: !137, file: !1, line: 198, type: !120)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_var", scope: !137, file: !1, line: 200, type: !13)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage", scope: !137, file: !1, line: 201, type: !13)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grouptype", scope: !137, file: !1, line: 202, type: !13)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtypesize", scope: !137, file: !1, line: 203, type: !13)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !137, file: !1, line: 204, type: !13)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !137, file: !1, line: 205, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "pGH", file: !152, line: 81, baseType: !153)
!152 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/pGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "PGH", file: !152, line: 13, size: 1152, align: 64, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !180}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "callerid", scope: !153, file: !152, line: 17, baseType: !16, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !153, file: !152, line: 18, baseType: !13, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !153, file: !152, line: 21, baseType: !13, size: 32, align: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "myproc", scope: !153, file: !152, line: 22, baseType: !13, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "commmodel", scope: !153, file: !152, line: 23, baseType: !13, size: 32, align: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nvariables", scope: !153, file: !152, line: 27, baseType: !13, size: 32, align: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "narrays", scope: !153, file: !152, line: 28, baseType: !13, size: 32, align: 32, offset: 224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !153, file: !152, line: 29, baseType: !107, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "timelevel", scope: !153, file: !152, line: 32, baseType: !13, size: 32, align: 32, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "perme", scope: !153, file: !152, line: 34, baseType: !30, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !153, file: !152, line: 35, baseType: !13, size: 32, align: 32, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "forceSync", scope: !153, file: !152, line: 37, baseType: !13, size: 32, align: 32, offset: 480)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dx0", scope: !153, file: !152, line: 41, baseType: !32, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "dy0", scope: !153, file: !152, line: 41, baseType: !32, size: 64, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dz0", scope: !153, file: !152, line: 41, baseType: !32, size: 64, align: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dt0", scope: !153, file: !152, line: 41, baseType: !32, size: 64, align: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !153, file: !152, line: 44, baseType: !13, size: 32, align: 32, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mglevel", scope: !153, file: !152, line: 45, baseType: !13, size: 32, align: 32, offset: 800)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "convlevel", scope: !153, file: !152, line: 46, baseType: !13, size: 32, align: 32, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !153, file: !152, line: 49, baseType: !13, size: 32, align: 32, offset: 864)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "comm_time", scope: !153, file: !152, line: 53, baseType: !13, size: 32, align: 32, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "GFExtras", scope: !153, file: !152, line: 76, baseType: !177, size: 64, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Connectivity", scope: !153, file: !152, line: 77, baseType: !179, size: 64, align: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "identity_string", scope: !153, file: !152, line: 79, baseType: !10, size: 64, align: 64, offset: 1088)
!181 = !DISubprogram(name: "PUGH_EnableGroupStorage", scope: !1, file: !1, line: 304, type: !182, isLocal: false, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @PUGH_EnableGroupStorage, variables: !184)
!182 = !DISubroutineType(types: !183)
!183 = !{!13, !83, !120}
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !246, !247, !248, !249, !252, !253, !254, !267, !268, !269}
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !181, file: !1, line: 304, type: !83)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 2, scope: !181, file: !1, line: 304, type: !120)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !181, file: !1, line: 306, type: !126)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !181, file: !1, line: 306, type: !126)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !181, file: !1, line: 306, type: !126)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !181, file: !1, line: 306, type: !126)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !181, file: !1, line: 306, type: !126)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !181, file: !1, line: 306, type: !126)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !181, file: !1, line: 306, type: !126)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !181, file: !1, line: 306, type: !126)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !181, file: !1, line: 306, type: !126)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !181, file: !1, line: 306, type: !126)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !181, file: !1, line: 306, type: !126)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !181, file: !1, line: 306, type: !126)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !181, file: !1, line: 306, type: !120)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !181, file: !1, line: 306, type: !120)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !181, file: !1, line: 306, type: !120)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !181, file: !1, line: 306, type: !120)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !181, file: !1, line: 306, type: !120)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !181, file: !1, line: 306, type: !120)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !181, file: !1, line: 306, type: !120)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !181, file: !1, line: 306, type: !120)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !181, file: !1, line: 306, type: !120)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology", scope: !181, file: !1, line: 306, type: !120)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_verbose", scope: !181, file: !1, line: 306, type: !120)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cacheline_mult", scope: !181, file: !1, line: 306, type: !126)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enable_all_storage", scope: !181, file: !1, line: 306, type: !126)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nsize", scope: !181, file: !1, line: 306, type: !126)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nx", scope: !181, file: !1, line: 306, type: !126)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_ny", scope: !181, file: !1, line: 306, type: !126)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_nz", scope: !181, file: !1, line: 306, type: !126)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadabort", scope: !181, file: !1, line: 306, type: !126)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadarraygroupsizeb", scope: !181, file: !1, line: 306, type: !126)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadbarrier", scope: !181, file: !1, line: 306, type: !126)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupcomm", scope: !181, file: !1, line: 306, type: !126)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloaddisablegroupstorage", scope: !181, file: !1, line: 306, type: !126)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupcomm", scope: !181, file: !1, line: 306, type: !126)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadenablegroupstorage", scope: !181, file: !1, line: 306, type: !126)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadevolve", scope: !181, file: !1, line: 306, type: !126)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadexit", scope: !181, file: !1, line: 306, type: !126)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadgroupdynamicdata", scope: !181, file: !1, line: 306, type: !126)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadmyproc", scope: !181, file: !1, line: 306, type: !126)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadnprocs", scope: !181, file: !1, line: 306, type: !126)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadparallelinit", scope: !181, file: !1, line: 306, type: !126)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadquerygroupstorageb", scope: !181, file: !1, line: 306, type: !126)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overloadsyncgroup", scope: !181, file: !1, line: 306, type: !126)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_active", scope: !181, file: !1, line: 306, type: !126)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_address_spacing", scope: !181, file: !1, line: 306, type: !126)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_cacheline_bits", scope: !181, file: !1, line: 306, type: !126)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "padding_size", scope: !181, file: !1, line: 306, type: !126)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_1d_x", scope: !181, file: !1, line: 306, type: !126)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_x", scope: !181, file: !1, line: 306, type: !126)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_2d_y", scope: !181, file: !1, line: 306, type: !126)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_x", scope: !181, file: !1, line: 306, type: !126)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_y", scope: !181, file: !1, line: 306, type: !126)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "processor_topology_3d_z", scope: !181, file: !1, line: 306, type: !126)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storage_report_every", scope: !181, file: !1, line: 306, type: !126)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer_output", scope: !181, file: !1, line: 306, type: !126)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate", scope: !181, file: !1, line: 306, type: !120)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_initial_time", scope: !181, file: !1, line: 306, type: !245)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_final_time", scope: !181, file: !1, line: 306, type: !245)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_itlast", scope: !181, file: !1, line: 306, type: !126)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminate_next", scope: !181, file: !1, line: 306, type: !126)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !181, file: !1, line: 306, type: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group", scope: !181, file: !1, line: 307, type: !13)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first_var", scope: !181, file: !1, line: 308, type: !13)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pgroup", scope: !181, file: !1, line: 309, type: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !256, line: 24, baseType: !257)
!256 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/PUGH/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!257 = !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 14, size: 256, align: 32, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !257, file: !256, line: 16, baseType: !13, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !257, file: !256, line: 17, baseType: !13, size: 32, align: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !257, file: !256, line: 18, baseType: !13, size: 32, align: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !257, file: !256, line: 19, baseType: !13, size: 32, align: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !257, file: !256, line: 20, baseType: !13, size: 32, align: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !257, file: !256, line: 21, baseType: !13, size: 32, align: 32, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !257, file: !256, line: 22, baseType: !13, size: 32, align: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !257, file: !256, line: 23, baseType: !13, size: 32, align: 32, offset: 224)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !181, file: !1, line: 310, type: !13)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GA", scope: !181, file: !1, line: 311, type: !4)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pughGH", scope: !181, file: !1, line: 312, type: !150)
!270 = !DISubprogram(name: "PUGH_DisableGroupStorage", scope: !1, file: !1, line: 433, type: !182, isLocal: false, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*)* @PUGH_DisableGroupStorage, variables: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !270, file: !1, line: 433, type: !83)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupname", arg: 2, scope: !270, file: !1, line: 433, type: !120)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size", scope: !270, file: !1, line: 435, type: !126)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_x", scope: !270, file: !1, line: 435, type: !126)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_y", scope: !270, file: !1, line: 435, type: !126)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ghost_size_z", scope: !270, file: !1, line: 435, type: !126)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nsize", scope: !270, file: !1, line: 435, type: !126)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nx", scope: !270, file: !1, line: 435, type: !126)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_ny", scope: !270, file: !1, line: 435, type: !126)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "global_nz", scope: !270, file: !1, line: 435, type: !126)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic", scope: !270, file: !1, line: 435, type: !126)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_x", scope: !270, file: !1, line: 435, type: !126)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_y", scope: !270, file: !1, line: 435, type: !126)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "periodic_z", scope: !270, file: !1, line: 435, type: !126)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !270, file: !1, line: 435, type: !120)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initialize_memory", scope: !270, file: !1, line: 435, type: !120)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !270, file: !1, line: 435, type: !120)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_1d_x", scope: !270, file: !1, line: 435, type: !120)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_x", scope: !270, file: !1, line: 435, type: !120)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_2d_y", scope: !270, file: !1, line: 435, type: !120)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_x", scope: !270, file: !1, line: 435, type: !120)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_y", scope: !270, file: !1, line: 435, type: !120)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition_3d_z", scope: !270, file: !1, line: 435, type: !120)
