; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CartGrid3D/SymmetryWrappers.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.Symmetry = type { i32** }

@gridrest_ = external global %struct.anon
@cartgrid3dpriv_ = external global %struct.anon.0
@.str = private unnamed_addr constant [89 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CartGrid3D/SymmetryWrappers.c\00", align 1
@.str1 = private unnamed_addr constant [11 x i8] c"CartGrid3D\00", align 1
@.str2 = private unnamed_addr constant [37 x i8] c"CartSymGI: Cannot find group %d (%s)\00", align 1
@.str3 = private unnamed_addr constant [9 x i8] c"Symmetry\00", align 1
@.str4 = private unnamed_addr constant [30 x i8] c"Symmetries unspecified for %s\00", align 1
@.str5 = private unnamed_addr constant [30 x i8] c"No Symmetries for GF of dim>3\00", align 1
@.str6 = private unnamed_addr constant [32 x i8] c"CartSymGN: Cannot find group %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !13, globals: !207, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CartGrid3D/SymmetryWrappers.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymmetryGHex", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CartGrid3D/../include/Symmetry.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Symmetry", file: !6, line: 27, size: 64, align: 64, elements: !8)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "GFSym", scope: !7, file: !6, line: 34, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !{!14, !20, !114, !121, !129, !140, !189, !194, !200}
!14 = !DISubprogram(name: "CCTKi_version_CactusBase_CartGrid3D_SymmetryWrappers_c", scope: !1, file: !1, line: 54, type: !15, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_CartGrid3D_SymmetryWrappers_c, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DISubprogram(name: "CartSymGI", scope: !1, file: !1, line: 74, type: !21, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @CartSymGI, variables: !59)
!21 = !DISubroutineType(types: !22)
!22 = !{!12, !23, !12}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !25, line: 75, baseType: !26)
!25 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/CartGrid3D/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 24, size: 1216, align: 64, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !39, !41, !42, !43, !44, !45, !46, !47, !51, !52}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !26, file: !25, line: 26, baseType: !12, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !26, file: !25, line: 27, baseType: !12, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !26, file: !25, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !26, file: !25, line: 31, baseType: !11, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !26, file: !25, line: 32, baseType: !11, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !26, file: !25, line: 33, baseType: !11, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !26, file: !25, line: 36, baseType: !11, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !26, file: !25, line: 39, baseType: !11, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !26, file: !25, line: 40, baseType: !11, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !26, file: !25, line: 43, baseType: !38, size: 64, align: 64, offset: 512)
!38 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !26, file: !25, line: 44, baseType: !40, size: 64, align: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !26, file: !25, line: 47, baseType: !40, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !26, file: !25, line: 51, baseType: !11, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !26, file: !25, line: 54, baseType: !11, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !26, file: !25, line: 57, baseType: !12, size: 32, align: 32, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !26, file: !25, line: 60, baseType: !11, size: 64, align: 64, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !26, file: !25, line: 63, baseType: !38, size: 64, align: 64, offset: 960)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !26, file: !25, line: 67, baseType: !48, size: 64, align: 64, offset: 1024)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !26, file: !25, line: 70, baseType: !49, size: 64, align: 64, offset: 1088)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !26, file: !25, line: 73, baseType: !53, size: 64, align: 64, offset: 1152)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !25, line: 22, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 18, size: 16, align: 8, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !55, file: !25, line: 20, baseType: !19, size: 8, align: 8)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !55, file: !25, line: 21, baseType: !19, size: 8, align: 8, offset: 8)
!59 = !{!60, !61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !20, file: !1, line: 74, type: !23)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gi", arg: 2, scope: !20, file: !1, line: 74, type: !12)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !20, file: !1, line: 76, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dxyz", scope: !20, file: !1, line: 76, type: !63)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !20, file: !1, line: 76, type: !63)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dz", scope: !20, file: !1, line: 76, type: !63)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmax", scope: !20, file: !1, line: 76, type: !63)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xmin", scope: !20, file: !1, line: 76, type: !63)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xyzmax", scope: !20, file: !1, line: 76, type: !63)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xyzmin", scope: !20, file: !1, line: 76, type: !63)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ymax", scope: !20, file: !1, line: 76, type: !63)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ymin", scope: !20, file: !1, line: 76, type: !63)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zmax", scope: !20, file: !1, line: 76, type: !63)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zmin", scope: !20, file: !1, line: 76, type: !63)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitant_plane", scope: !20, file: !1, line: 76, type: !17)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !20, file: !1, line: 76, type: !17)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quadrant_direction", scope: !20, file: !1, line: 76, type: !17)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !20, file: !1, line: 76, type: !17)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symmetry_xmax", scope: !20, file: !1, line: 76, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symmetry_xmin", scope: !20, file: !1, line: 76, type: !80)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symmetry_ymax", scope: !20, file: !1, line: 76, type: !80)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symmetry_ymin", scope: !20, file: !1, line: 76, type: !80)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symmetry_zmax", scope: !20, file: !1, line: 76, type: !80)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symmetry_zmin", scope: !20, file: !1, line: 76, type: !80)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avoid_origin", scope: !20, file: !1, line: 76, type: !80)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avoid_originx", scope: !20, file: !1, line: 76, type: !80)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avoid_originy", scope: !20, file: !1, line: 76, type: !80)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avoid_originz", scope: !20, file: !1, line: 76, type: !80)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_origin", scope: !20, file: !1, line: 76, type: !80)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_originx", scope: !20, file: !1, line: 76, type: !80)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_originy", scope: !20, file: !1, line: 76, type: !80)
