; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOUtil/Utils.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cTimerData = type { i32, %struct.cTimerVal* }
%struct.cTimerVal = type { i32, i8*, i8*, %union.anon }
%union.anon = type { i64 }

@.str = private unnamed_addr constant [8 x i8] c"cart%dd\00", align 1
@.str1 = private unnamed_addr constant [74 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOUtil/Utils.c\00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"IOUtil\00", align 1
@.str3 = private unnamed_addr constant [80 x i8] c"IOUtil_1DLines: Could not get ranges for %c-direction of coordinate system '%s'\00", align 1
@.str4 = private unnamed_addr constant [126 x i8] c"IOUtil_1DLines: Cartesian coordinate system '%s' not found - no slice center set up for output of 1D lines from %dD variables\00", align 1
@.str5 = private unnamed_addr constant [122 x i8] c"IOUtil_1DLines: %c-coordinate for slice center of 1D lines in %c-direction (%f) is out of grid coordinates range (%f, %f)\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !14, globals: !144, imports: !21)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOUtil/Utils.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 16, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOUtil/../include/cctk_Timers.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "val_none", value: 0)
!7 = !DIEnumerator(name: "val_int", value: 1)
!8 = !DIEnumerator(name: "val_long", value: 2)
!9 = !DIEnumerator(name: "val_double", value: 3)
!10 = !{!11, !12, !13}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !{!15, !22, !82, !99, !134}
!15 = !DISubprogram(name: "CCTKi_version_CactusBase_IOUtil_Utils_c", scope: !1, file: !1, line: 26, type: !16, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOUtil_Utils_c, variables: !21)
!16 = !DISubroutineType(types: !17)
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !{}
!22 = !DISubprogram(name: "IOUtil_1DLines", scope: !1, file: !1, line: 80, type: !23, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32**, double**, i32**)* @IOUtil_1DLines, variables: !67)
!23 = !DISubroutineType(types: !24)
!24 = !{!13, !25, !13, !61, !64, !62}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !28, line: 75, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOUtil/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 24, size: 1216, align: 64, elements: !30)
!30 = !{!31, !32, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !53, !54}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !29, file: !28, line: 26, baseType: !13, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !29, file: !28, line: 27, baseType: !13, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !29, file: !28, line: 30, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !29, file: !28, line: 31, baseType: !34, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !29, file: !28, line: 32, baseType: !34, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !29, file: !28, line: 33, baseType: !34, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !29, file: !28, line: 36, baseType: !34, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !29, file: !28, line: 39, baseType: !34, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !29, file: !28, line: 40, baseType: !34, size: 64, align: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !29, file: !28, line: 43, baseType: !12, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !29, file: !28, line: 44, baseType: !11, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !29, file: !28, line: 47, baseType: !11, size: 64, align: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !29, file: !28, line: 51, baseType: !34, size: 64, align: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !29, file: !28, line: 54, baseType: !34, size: 64, align: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !29, file: !28, line: 57, baseType: !13, size: 32, align: 32, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !29, file: !28, line: 60, baseType: !34, size: 64, align: 64, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !29, file: !28, line: 63, baseType: !12, size: 64, align: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 67, baseType: !50, size: 64, align: 64, offset: 1024)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !29, file: !28, line: 70, baseType: !51, size: 64, align: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !29, file: !28, line: 73, baseType: !55, size: 64, align: 64, offset: 1152)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !28, line: 22, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 18, size: 16, align: 8, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !57, file: !28, line: 20, baseType: !20, size: 8, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !57, file: !28, line: 21, baseType: !20, size: 8, align: 8, offset: 8)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !79, !80, !81}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !22, file: !1, line: 80, type: !25)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 2, scope: !22, file: !1, line: 81, type: !13)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin_index", arg: 3, scope: !22, file: !1, line: 82, type: !61)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin_phys", arg: 4, scope: !22, file: !1, line: 83, type: !64)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slice_center", arg: 5, scope: !22, file: !1, line: 84, type: !62)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !22, file: !1, line: 86, type: !13)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !22, file: !1, line: 86, type: !13)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system_name", scope: !22, file: !1, line: 87, type: !76)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, align: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 20)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lower_range", scope: !22, file: !1, line: 88, type: !11)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upper_range", scope: !22, file: !1, line: 88, type: !11)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !22, file: !1, line: 89, type: !13)
!82 = !DISubprogram(name: "IOUtil_2DPlanes", scope: !1, file: !1, line: 232, type: !83, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i32*, double*, i32*)* @IOUtil_2DPlanes, variables: !89)
!83 = !DISubroutineType(types: !84)
!84 = !{!13, !25, !13, !85, !87, !34}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !82, file: !1, line: 232, type: !25)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_dims", arg: 2, scope: !82, file: !1, line: 233, type: !13)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin_index", arg: 3, scope: !82, file: !1, line: 234, type: !85)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin_phys", arg: 4, scope: !82, file: !1, line: 235, type: !87)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slice_center", arg: 5, scope: !82, file: !1, line: 236, type: !34)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !82, file: !1, line: 238, type: !13)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system_name", scope: !82, file: !1, line: 239, type: !76)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lower_range", scope: !82, file: !1, line: 240, type: !11)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upper_range", scope: !82, file: !1, line: 240, type: !11)
!99 = !DISubprogram(name: "IOUtil_PrintTimings", scope: !1, file: !1, line: 347, type: !100, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32*, i8**)* @IOUtil_PrintTimings, variables: !105)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !18, !13, !85, !102}
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!105 = !{!106, !107, !108, !109, !110, !111, !112}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "description", arg: 1, scope: !99, file: !1, line: 347, type: !18)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ntimers", arg: 2, scope: !99, file: !1, line: 348, type: !13)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timers", arg: 3, scope: !99, file: !1, line: 349, type: !85)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timer_descriptions", arg: 4, scope: !99, file: !1, line: 350, type: !102)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !99, file: !1, line: 352, type: !13)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !99, file: !1, line: 352, type: !13)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !99, file: !1, line: 353, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerData", file: !4, line: 35, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 31, size: 128, align: 64, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_vals", scope: !115, file: !4, line: 33, baseType: !13, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !115, file: !4, line: 34, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerVal", file: !4, line: 29, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 18, size: 256, align: 64, elements: !122)
!122 = !{!123, !125, !126, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !4, line: 20, baseType: !124, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "cTimerValType", file: !4, line: 16, baseType: !3)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "heading", scope: !121, file: !4, line: 21, baseType: !18, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !121, file: !4, line: 22, baseType: !18, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !4, line: 28, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !4, line: 23, size: 64, align: 64, elements: !129)
!129 = !{!130, !131, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !128, file: !4, line: 25, baseType: !13, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !128, file: !4, line: 26, baseType: !132, size: 64, align: 64)
!132 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !128, file: !4, line: 27, baseType: !12, size: 64, align: 64)
!134 = !DISubprogram(name: "IOUtil_CreateDirectory", scope: !1, file: !1, line: 451, type: !135, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i8*, i32, i32)* @IOUtil_CreateDirectory, variables: !137)
!135 = !DISubroutineType(types: !136)
!136 = !{!13, !25, !18, !13, !13}
!137 = !{!138, !139, !140, !141, !142, !143}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !134, file: !1, line: 451, type: !25)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dirname", arg: 2, scope: !134, file: !1, line: 451, type: !18)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "multiple_io_procs", arg: 3, scope: !134, file: !1, line: 452, type: !13)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ioproc", arg: 4, scope: !134, file: !1, line: 452, type: !13)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !134, file: !1, line: 454, type: !13)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !134, file: !1, line: 454, type: !13)
!144 = !{!145}
!145 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 25, type: !18, isLocal: true, isDefinition: true)
!146 = !{i32 2, !"Dwarf Version", i32 2}
!147 = !{i32 2, !"Debug Info Version", i32 700000003}
!148 = !{i32 1, !"PIC Level", i32 2}
!149 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!150 = !DILocation(line: 26, column: 1, scope: !15)
!151 = !DIExpression()
!152 = !DILocation(line: 80, column: 32, scope: !22)
!153 = !DILocation(line: 81, column: 25, scope: !22)
!154 = !DILocation(line: 82, column: 39, scope: !22)
!155 = !DILocation(line: 83, column: 45, scope: !22)
!156 = !DILocation(line: 84, column: 33, scope: !22)
!157 = !DILocation(line: 87, column: 8, scope: !22)
!158 = !DILocation(line: 89, column: 7, scope: !22)
!159 = !DILocation(line: 94, column: 41, scope: !22)
!160 = !DILocation(line: 94, column: 39, scope: !22)
!161 = !DILocation(line: 94, column: 31, scope: !22)
!162 = !DILocation(line: 94, column: 17, scope: !22)
!163 = !DILocation(line: 88, column: 14, scope: !22)
!164 = !DILocation(line: 95, column: 29, scope: !22)
!165 = !DILocation(line: 98, column: 3, scope: !22)
!166 = !DILocation(line: 99, column: 7, scope: !167)
!167 = distinct !DILexicalBlock(scope: !22, file: !1, line: 99, column: 7)
!168 = !DILocation(line: 99, column: 50, scope: !167)
!169 = !DILocation(line: 99, column: 7, scope: !22)
!170 = !DILocation(line: 102, column: 23, scope: !171)
!171 = distinct !DILexicalBlock(scope: !172, file: !1, line: 102, column: 5)
!172 = distinct !DILexicalBlock(scope: !173, file: !1, line: 102, column: 5)
!173 = distinct !DILexicalBlock(scope: !167, file: !1, line: 100, column: 3)
!174 = !DILocation(line: 102, column: 5, scope: !172)
!175 = !DILocation(line: 136, column: 5, scope: !176)
!176 = distinct !DILexicalBlock(scope: !177, file: !1, line: 136, column: 5)
!177 = distinct !DILexicalBlock(scope: !178, file: !1, line: 135, column: 3)
!178 = distinct !DILexicalBlock(scope: !22, file: !1, line: 134, column: 7)
!179 = !DILocation(line: 145, column: 18, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 145, column: 18)
