; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Write2D.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct.cGroup = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ioAdvertisedFileDesc = type { i8*, i8*, i8*, i8*, i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.PNamedData = type { %struct.PNamedData*, %struct.PNamedData*, i8*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !125, globals: !342, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/Write2D.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !43, !44, !36, !14, !105, !106, !10, !110, !112, !114, !116, !119, !122}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "asciiioGH", file: !6, line: 55, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/ioASCIIGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOASCIIGH", file: !6, line: 20, size: 1024, align: 64, elements: !8)
!8 = !{!9, !11, !12, !13, !16, !17, !18, !19, !20, !21, !23, !24, !25, !37, !38, !39, !42}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_every", scope: !7, file: !6, line: 23, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_every", scope: !7, file: !6, line: 24, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_every", scope: !7, file: !6, line: 25, baseType: !10, size: 32, align: 32, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "do_out1D", scope: !7, file: !6, line: 28, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "do_out2D", scope: !7, file: !6, line: 29, baseType: !14, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "do_out3D", scope: !7, file: !6, line: 30, baseType: !14, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "outdir1D", scope: !7, file: !6, line: 33, baseType: !14, size: 64, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outdir2D", scope: !7, file: !6, line: 34, baseType: !14, size: 64, align: 64, offset: 384)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "outdir3D", scope: !7, file: !6, line: 35, baseType: !14, size: 64, align: 64, offset: 448)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "out1D_last", scope: !7, file: !6, line: 38, baseType: !22, size: 64, align: 64, offset: 512)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "out2D_last", scope: !7, file: !6, line: 39, baseType: !22, size: 64, align: 64, offset: 576)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "out3D_last", scope: !7, file: !6, line: 40, baseType: !22, size: 64, align: 64, offset: 640)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "filenameList1D", scope: !7, file: !6, line: 43, baseType: !26, size: 64, align: 64, offset: 704)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !28, line: 26, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !28, line: 18, size: 256, align: 64, elements: !30)
!30 = !{!31, !33, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !29, file: !28, line: 20, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !28, line: 21, baseType: !32, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !28, line: 23, baseType: !14, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !29, file: !28, line: 25, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_2D", scope: !7, file: !6, line: 44, baseType: !26, size: 64, align: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fileList_3D", scope: !7, file: !6, line: 45, baseType: !26, size: 64, align: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "spxyz", scope: !7, file: !6, line: 49, baseType: !40, size: 64, align: 64, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sp2xyz", scope: !7, file: !6, line: 53, baseType: !41, size: 64, align: 64, offset: 960)
!43 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !47, line: 153, baseType: !48)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !47, line: 122, size: 1216, align: 64, elements: !49)
!49 = !{!50, !53, !54, !55, !57, !58, !63, !64, !65, !69, !73, !83, !89, !90, !93, !94, !98, !102, !103, !104}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !48, file: !47, line: 123, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !48, file: !47, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !48, file: !47, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !47, line: 126, baseType: !56, size: 16, align: 16, offset: 128)
!56 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !48, file: !47, line: 127, baseType: !56, size: 16, align: 16, offset: 144)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !48, file: !47, line: 128, baseType: !59, size: 128, align: 64, offset: 192)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !47, line: 88, size: 128, align: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !59, file: !47, line: 89, baseType: !51, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !59, file: !47, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !48, file: !47, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !48, file: !47, line: 132, baseType: !36, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !48, file: !47, line: 133, baseType: !66, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!10, !36}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !48, file: !47, line: 134, baseType: !70, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!10, !36, !14, !10}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !48, file: !47, line: 135, baseType: !74, size: 64, align: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !36, !77, !10}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !47, line: 77, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !79, line: 71, baseType: !80)
!79 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!82 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !48, file: !47, line: 136, baseType: !84, size: 64, align: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !36, !87, !10}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !48, file: !47, line: 139, baseType: !59, size: 128, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !48, file: !47, line: 140, baseType: !91, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !47, line: 94, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !48, file: !47, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !48, file: !47, line: 144, baseType: !95, size: 24, align: 8, offset: 928)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !48, file: !47, line: 145, baseType: !99, size: 8, align: 8, offset: 952)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !48, file: !47, line: 148, baseType: !59, size: 128, align: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !48, file: !47, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !47, line: 152, baseType: !77, size: 64, align: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_BYTE", file: !109, line: 59, baseType: !52)
!109 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!125 = !{!126, !129}
!126 = !DISubprogram(name: "CCTKi_version_CactusBase_IOASCII_Write2D_c", scope: !1, file: !1, line: 27, type: !127, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOASCII_Write2D_c, variables: !2)
!127 = !DISubroutineType(types: !128)
!128 = !{!87}
!129 = !DISubprogram(name: "IOASCII_Write2D", scope: !1, file: !1, line: 124, type: !130, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i8*)* @IOASCII_Write2D, variables: !166)
!130 = !DISubroutineType(types: !131)
!131 = !{!10, !132, !10, !87}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !135, line: 75, baseType: !136)
!135 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 24, size: 1216, align: 64, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !150, !151, !152, !153, !154, !155, !156, !158, !159}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !136, file: !135, line: 26, baseType: !10, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !136, file: !135, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !136, file: !135, line: 30, baseType: !22, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !136, file: !135, line: 31, baseType: !22, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !136, file: !135, line: 32, baseType: !22, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !136, file: !135, line: 33, baseType: !22, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !136, file: !135, line: 36, baseType: !22, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !136, file: !135, line: 39, baseType: !22, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !136, file: !135, line: 40, baseType: !22, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !136, file: !135, line: 43, baseType: !43, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !136, file: !135, line: 44, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !136, file: !135, line: 47, baseType: !149, size: 64, align: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !136, file: !135, line: 51, baseType: !22, size: 64, align: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !136, file: !135, line: 54, baseType: !22, size: 64, align: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !136, file: !135, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !136, file: !135, line: 60, baseType: !22, size: 64, align: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !136, file: !135, line: 63, baseType: !43, size: 64, align: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !135, line: 67, baseType: !157, size: 64, align: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !136, file: !135, line: 70, baseType: !105, size: 64, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !136, file: !135, line: 73, baseType: !160, size: 64, align: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !135, line: 22, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 18, size: 16, align: 8, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !162, file: !135, line: 20, baseType: !15, size: 8, align: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !162, file: !135, line: 21, baseType: !15, size: 8, align: 8, offset: 8)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !232, !233, !234, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !260, !261, !263, !265, !269, !270, !271, !272, !273, !274, !284, !288, !292, !293, !294, !298, !299, !300, !301, !304, !305, !308, !309, !310, !312, !313, !314, !316, !317, !318, !320, !321, !322, !324, !325, !326, !328, !329, !330, !332, !333, !334, !336, !337, !338, !340, !341}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !129, file: !1, line: 124, type: !132)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !129, file: !1, line: 124, type: !10)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !129, file: !1, line: 124, type: !87)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_y", scope: !129, file: !1, line: 126, type: !113)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_z", scope: !129, file: !1, line: 126, type: !113)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_x", scope: !129, file: !1, line: 126, type: !113)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_z", scope: !129, file: !1, line: 126, type: !113)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_x", scope: !129, file: !1, line: 126, type: !113)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_y", scope: !129, file: !1, line: 126, type: !113)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xyplane_z", scope: !129, file: !1, line: 126, type: !113)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xzplane_y", scope: !129, file: !1, line: 126, type: !113)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_yzplane_x", scope: !129, file: !1, line: 126, type: !113)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_style", scope: !129, file: !1, line: 126, type: !87)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_vars", scope: !129, file: !1, line: 126, type: !87)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_style", scope: !129, file: !1, line: 126, type: !87)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_vars", scope: !129, file: !1, line: 126, type: !87)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_style", scope: !129, file: !1, line: 126, type: !87)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_vars", scope: !129, file: !1, line: 126, type: !87)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_format", scope: !129, file: !1, line: 126, type: !87)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_style", scope: !129, file: !1, line: 126, type: !87)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir1D", scope: !129, file: !1, line: 126, type: !87)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir2D", scope: !129, file: !1, line: 126, type: !87)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir3D", scope: !129, file: !1, line: 126, type: !87)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_d", scope: !129, file: !1, line: 126, type: !111)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_every", scope: !129, file: !1, line: 126, type: !111)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_x", scope: !129, file: !1, line: 126, type: !111)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_yi", scope: !129, file: !1, line: 126, type: !111)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_xline_zi", scope: !129, file: !1, line: 126, type: !111)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_y", scope: !129, file: !1, line: 126, type: !111)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_xi", scope: !129, file: !1, line: 126, type: !111)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_yline_zi", scope: !129, file: !1, line: 126, type: !111)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_z", scope: !129, file: !1, line: 126, type: !111)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_xi", scope: !129, file: !1, line: 126, type: !111)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out1D_zline_yi", scope: !129, file: !1, line: 126, type: !111)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_every", scope: !129, file: !1, line: 126, type: !111)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xyplane_zi", scope: !129, file: !1, line: 126, type: !111)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_xzplane_yi", scope: !129, file: !1, line: 126, type: !111)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out2D_yzplane_xi", scope: !129, file: !1, line: 126, type: !111)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out3D_every", scope: !129, file: !1, line: 126, type: !111)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir", scope: !129, file: !1, line: 126, type: !87)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_every", scope: !129, file: !1, line: 126, type: !111)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_y", scope: !129, file: !1, line: 126, type: !113)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_z", scope: !129, file: !1, line: 126, type: !113)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_x", scope: !129, file: !1, line: 126, type: !113)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_z", scope: !129, file: !1, line: 126, type: !113)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_x", scope: !129, file: !1, line: 126, type: !113)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_y", scope: !129, file: !1, line: 126, type: !113)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_yi", scope: !129, file: !1, line: 126, type: !111)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xline_zi", scope: !129, file: !1, line: 126, type: !111)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_xi", scope: !129, file: !1, line: 126, type: !111)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yline_zi", scope: !129, file: !1, line: 126, type: !111)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_xi", scope: !129, file: !1, line: 126, type: !111)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_zline_yi", scope: !129, file: !1, line: 126, type: !111)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yzplane_x", scope: !129, file: !1, line: 126, type: !113)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xzplane_y", scope: !129, file: !1, line: 126, type: !113)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xyplane_z", scope: !129, file: !1, line: 126, type: !113)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xyplane_zi", scope: !129, file: !1, line: 126, type: !111)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_xzplane_yi", scope: !129, file: !1, line: 126, type: !111)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_yzplane_xi", scope: !129, file: !1, line: 126, type: !111)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newverbose", scope: !129, file: !1, line: 126, type: !87)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_filename_scheme", scope: !129, file: !1, line: 126, type: !111)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_fileinfo", scope: !129, file: !1, line: 126, type: !87)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !129, file: !1, line: 126, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myproc", scope: !129, file: !1, line: 127, type: !10)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !129, file: !1, line: 128, type: !4)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header_fmt_string", scope: !129, file: !1, line: 129, type: !235)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, align: 8, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 30)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zlabel_fmt_string", scope: !129, file: !1, line: 130, type: !235)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_real_format", scope: !129, file: !1, line: 131, type: !235)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time_fmt_string", scope: !129, file: !1, line: 132, type: !235)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_fmt_string_int", scope: !129, file: !1, line: 133, type: !235)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_fmt_string_real", scope: !129, file: !1, line: 134, type: !235)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !129, file: !1, line: 135, type: !10)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxdir", scope: !129, file: !1, line: 135, type: !10)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupindex", scope: !129, file: !1, line: 136, type: !10)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "have_coords", scope: !129, file: !1, line: 137, type: !10)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "groupinfo", scope: !129, file: !1, line: 138, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGroup", file: !249, line: 24, baseType: !250)
!249 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/cctk_Groups.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!250 = !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 14, size: 256, align: 32, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "grouptype", scope: !250, file: !249, line: 16, baseType: !10, size: 32, align: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vartype", scope: !250, file: !249, line: 17, baseType: !10, size: 32, align: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "disttype", scope: !250, file: !249, line: 18, baseType: !10, size: 32, align: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "stagtype", scope: !250, file: !249, line: 19, baseType: !10, size: 32, align: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !250, file: !249, line: 20, baseType: !10, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "numvars", scope: !250, file: !249, line: 21, baseType: !10, size: 32, align: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "numtimelevels", scope: !250, file: !249, line: 22, baseType: !10, size: 32, align: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vectorgroup", scope: !250, file: !249, line: 23, baseType: !10, size: 32, align: 32, offset: 224)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fdset_2D", scope: !129, file: !1, line: 139, type: !44)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_index", scope: !129, file: !1, line: 140, type: !262)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, align: 32, elements: !96)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_lower", scope: !129, file: !1, line: 141, type: !264)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 192, align: 64, elements: !96)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_system", scope: !129, file: !1, line: 142, type: !266)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, align: 8, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 20)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !129, file: !1, line: 143, type: !262)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !129, file: !1, line: 144, type: !43)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !129, file: !1, line: 145, type: !14)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !129, file: !1, line: 146, type: !14)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicename", scope: !129, file: !1, line: 147, type: !266)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "advertised_file", scope: !129, file: !1, line: 148, type: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioAdvertisedFileDesc", file: !276, line: 36, baseType: !277)
!276 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOASCII/../include/ioutil_AdvertisedFiles.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!277 = !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 29, size: 320, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !277, file: !276, line: 31, baseType: !87, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !277, file: !276, line: 32, baseType: !87, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mimetype", scope: !277, file: !276, line: 33, baseType: !87, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !277, file: !276, line: 34, baseType: !87, size: 64, align: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !277, file: !276, line: 35, baseType: !87, size: 64, align: 64, offset: 256)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !129, file: !1, line: 149, type: !285)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, align: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 128)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir_i", scope: !289, file: !1, line: 372, type: !10)
!289 = distinct !DILexicalBlock(scope: !290, file: !1, line: 371, column: 3)
!290 = distinct !DILexicalBlock(scope: !291, file: !1, line: 370, column: 3)
!291 = distinct !DILexicalBlock(scope: !129, file: !1, line: 370, column: 3)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir_j", scope: !289, file: !1, line: 372, type: !10)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "directions", scope: !289, file: !1, line: 373, type: !262)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hsize", scope: !289, file: !1, line: 376, type: !295)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, align: 32, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 2)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_data_i", scope: !289, file: !1, line: 377, type: !149)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord_data_j", scope: !289, file: !1, line: 377, type: !149)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !289, file: !1, line: 378, type: !36)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagger_offset_i", scope: !302, file: !1, line: 457, type: !43)
!302 = distinct !DILexicalBlock(scope: !303, file: !1, line: 456, column: 5)
!303 = distinct !DILexicalBlock(scope: !289, file: !1, line: 455, column: 9)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stagger_offset_j", scope: !302, file: !1, line: 457, type: !43)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !306, file: !1, line: 472, type: !10)
!306 = distinct !DILexicalBlock(scope: !307, file: !1, line: 472, column: 11)
!307 = distinct !DILexicalBlock(scope: !302, file: !1, line: 470, column: 7)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !306, file: !1, line: 472, type: !10)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_data", scope: !306, file: !1, line: 472, type: !106)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !311, file: !1, line: 478, type: !10)
!311 = distinct !DILexicalBlock(scope: !307, file: !1, line: 478, column: 11)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !311, file: !1, line: 478, type: !10)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_data", scope: !311, file: !1, line: 478, type: !110)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !315, file: !1, line: 485, type: !10)
!315 = distinct !DILexicalBlock(scope: !307, file: !1, line: 485, column: 11)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !315, file: !1, line: 485, type: !10)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_data", scope: !315, file: !1, line: 485, type: !112)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !319, file: !1, line: 493, type: !10)
!319 = distinct !DILexicalBlock(scope: !307, file: !1, line: 493, column: 11)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !319, file: !1, line: 493, type: !10)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typed_data", scope: !319, file: !1, line: 493, type: !114)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !323, file: !1, line: 501, type: !10)
!323 = distinct !DILexicalBlock(scope: !307, file: !1, line: 501, column: 11)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !323, file: !1, line: 501, type: !10)
