; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/WriteInfo.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%union.anon = type { %struct.cGH* }
%struct.IOBASIC_REDUCTIONLIST = type { i32, %struct.IOBASIC_REDUCTION* }
%struct.IOBASIC_REDUCTION = type { i32, i8*, i8, double, %struct.IOBASIC_REDUCTION* }

@.str = private unnamed_addr constant [8 x i8] c"IOBasic\00", align 1
@.str1 = private unnamed_addr constant [79 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/WriteInfo.c\00", align 1
@.str2 = private unnamed_addr constant [56 x i8] c"IOBasic_WriteInfo: No info output for '%s' (no storage)\00", align 1
@.str3 = private unnamed_addr constant [41 x i8] c"IOBasic_WriteInfo: Unsupported data type\00", align 1
@.str4 = private unnamed_addr constant [52 x i8] c"IOBasic_WriteInfo: Internal error in reduction '%s'\00", align 1
@.str5 = private unnamed_addr constant [92 x i8] c"$Header: /cactus/CactusBase/IOBasic/src/WriteInfo.c,v 1.16 2001/12/28 21:22:52 tradke Exp $\00", align 1

; Function Attrs: nounwind optsize readnone ssp uwtable
define i8* @CCTKi_version_CactusBase_IOBasic_WriteInfo_c() #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !64, globals: !121, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/WriteInfo.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !36, !51, !18, !55, !56, !58, !60, !62}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasicGH", file: !6, line: 52, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/iobasicGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_GH", file: !6, line: 29, size: 512, align: 64, elements: !8)
!8 = !{!9, !11, !12, !14, !16, !17, !19, !20, !39}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "outScalar_every", scope: !7, file: !6, line: 32, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "outInfo_every", scope: !7, file: !6, line: 33, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "info_reductions_changed", scope: !7, file: !6, line: 34, baseType: !13, size: 8, align: 8, offset: 64)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "do_outScalar", scope: !7, file: !6, line: 37, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "outdirScalar", scope: !7, file: !6, line: 40, baseType: !15, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "outInfo_last", scope: !7, file: !6, line: 43, baseType: !18, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outScalar_last", scope: !7, file: !6, line: 44, baseType: !18, size: 64, align: 64, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "info_reductions", scope: !7, file: !6, line: 47, baseType: !21, size: 64, align: 64, offset: 384)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasic_reductionlist_t", file: !6, line: 27, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_REDUCTIONLIST", file: !6, line: 23, size: 128, align: 64, elements: !24)
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "num_reductions", scope: !23, file: !6, line: 25, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "reductions", scope: !23, file: !6, line: 26, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasic_reduction_t", file: !6, line: 21, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_REDUCTION", file: !6, line: 14, size: 320, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35, !37}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !30, file: !6, line: 16, baseType: !10, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !6, line: 17, baseType: !15, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !30, file: !6, line: 18, baseType: !13, size: 8, align: 8, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !6, line: 19, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !6, line: 20, baseType: !38, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "filenameListScalar", scope: !7, file: !6, line: 50, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !42, line: 26, baseType: !43)
!42 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !42, line: 18, size: 256, align: 64, elements: !44)
!44 = !{!45, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !43, file: !42, line: 20, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !42, line: 21, baseType: !46, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !42, line: 23, baseType: !15, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !42, line: 25, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCTK_CHAR", file: !53, line: 57, baseType: !54)
!53 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/cctk_Types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!64 = !{!65, !70}
!65 = !DISubprogram(name: "CCTKi_version_CactusBase_IOBasic_WriteInfo_c", scope: !1, file: !1, line: 21, type: !66, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOBasic_WriteInfo_c, variables: !2)
!66 = !DISubroutineType(types: !67)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!70 = !DISubprogram(name: "IOBasic_WriteInfo", scope: !1, file: !1, line: 60, type: !71, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32)* @IOBasic_WriteInfo, variables: !107)
!71 = !DISubroutineType(types: !72)
!72 = !{!10, !73, !10}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !76, line: 75, baseType: !77)
!76 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 24, size: 1216, align: 64, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !99, !100}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !77, file: !76, line: 26, baseType: !10, size: 32, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !77, file: !76, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !77, file: !76, line: 30, baseType: !18, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !77, file: !76, line: 31, baseType: !18, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !77, file: !76, line: 32, baseType: !18, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !77, file: !76, line: 33, baseType: !18, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !77, file: !76, line: 36, baseType: !18, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !77, file: !76, line: 39, baseType: !18, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !77, file: !76, line: 40, baseType: !18, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !77, file: !76, line: 43, baseType: !36, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !77, file: !76, line: 44, baseType: !55, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !77, file: !76, line: 47, baseType: !55, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !77, file: !76, line: 51, baseType: !18, size: 64, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !77, file: !76, line: 54, baseType: !18, size: 64, align: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !77, file: !76, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !77, file: !76, line: 60, baseType: !18, size: 64, align: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !77, file: !76, line: 63, baseType: !36, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !76, line: 67, baseType: !97, size: 64, align: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !77, file: !76, line: 70, baseType: !98, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !77, file: !76, line: 73, baseType: !101, size: 64, align: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !76, line: 22, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 18, size: 16, align: 8, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !103, file: !76, line: 20, baseType: !13, size: 8, align: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !103, file: !76, line: 21, baseType: !13, size: 8, align: 8, offset: 8)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !70, file: !1, line: 60, type: !73)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !70, file: !1, line: 60, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vtype", scope: !70, file: !1, line: 62, type: !10)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !70, file: !1, line: 63, type: !15)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !70, file: !1, line: 64, type: !4)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !70, file: !1, line: 65, type: !50)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reduction", scope: !70, file: !1, line: 66, type: !28)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GH_fake_const", scope: !70, file: !1, line: 72, type: !116)
!116 = !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !1, line: 68, size: 64, align: 64, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "const_ptr", scope: !116, file: !1, line: 70, baseType: !73, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "non_const_ptr", scope: !116, file: !1, line: 71, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!121 = !{!122}
!122 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 20, type: !68, isLocal: true, isDefinition: true)
!123 = !{i32 2, !"Dwarf Version", i32 2}
!124 = !{i32 2, !"Debug Info Version", i32 700000003}
!125 = !{i32 1, !"PIC Level", i32 2}
!126 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!127 = !DILocation(line: 21, column: 1, scope: !65)
!128 = !DIExpression()
!129 = !DILocation(line: 60, column: 35, scope: !70)
!130 = !DILocation(line: 60, column: 43, scope: !70)
!131 = !DILocation(line: 72, column: 5, scope: !70)
!132 = !DILocation(line: 78, column: 24, scope: !70)
!133 = !DILocation(line: 79, column: 15, scope: !70)
!134 = !DILocation(line: 79, column: 21, scope: !70)
!135 = !{!136, !140, i64 48}
!136 = !{!"IOBASIC_GH", !137, i64 0, !137, i64 4, !138, i64 8, !140, i64 16, !140, i64 24, !140, i64 32, !140, i64 40, !140, i64 48, !140, i64 56}
!137 = !{!"int", !138, i64 0}
!138 = !{!"omnipotent char", !139, i64 0}
!139 = !{!"Simple C/C++ TBAA"}
!140 = !{!"any pointer", !138, i64 0}
!141 = !DILocation(line: 79, column: 45, scope: !70)
!142 = !{!143, !140, i64 8}
!143 = !{!"IOBASIC_REDUCTIONLIST", !137, i64 0, !140, i64 8}
!144 = !DILocation(line: 66, column: 24, scope: !70)
!145 = !DILocation(line: 82, column: 38, scope: !146)
!146 = distinct !DILexicalBlock(scope: !70, file: !1, line: 82, column: 7)
!147 = !DILocation(line: 82, column: 9, scope: !146)
!148 = !DILocation(line: 82, column: 7, scope: !70)
!149 = !DILocation(line: 84, column: 16, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !1, line: 83, column: 3)
!151 = !DILocation(line: 63, column: 9, scope: !70)
!152 = !DILocation(line: 85, column: 5, scope: !150)
!153 = !DILocation(line: 88, column: 5, scope: !150)
!154 = !DILocation(line: 90, column: 5, scope: !150)
!155 = !DILocation(line: 92, column: 18, scope: !156)
!156 = distinct !DILexicalBlock(scope: !150, file: !1, line: 91, column: 5)
!157 = !DILocation(line: 92, column: 27, scope: !156)
!158 = !{!159, !138, i64 16}
!159 = !{!"IOBASIC_REDUCTION", !137, i64 0, !140, i64 8, !138, i64 16, !160, i64 24, !140, i64 32}
!160 = !{!"double", !138, i64 0}
!161 = !DILocation(line: 93, column: 30, scope: !156)
!162 = !{!159, !140, i64 32}
!163 = !DILocation(line: 99, column: 7, scope: !164)
!164 = distinct !DILexicalBlock(scope: !70, file: !1, line: 99, column: 7)
!165 = !DILocation(line: 99, column: 39, scope: !164)
