; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/WriteScalar.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.anon = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32 }
%struct.anon.1 = type { double, double, double, double, double, double, double, double, double, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cGH = type { i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double, double*, double*, i32*, i32*, i32, i32*, double, i8***, i8**, %struct.cGHGroupData* }
%struct.cGHGroupData = type { i8, i8 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%union.anon = type { i8* }
%union.anon.0 = type { %struct.cGH* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !52, globals: !351, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/WriteScalar.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !15, !10, !36, !51, !18, !50}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasicGH", file: !6, line: 52, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/iobasicGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_GH", file: !6, line: 29, size: 512, align: 64, elements: !8)
!8 = !{!9, !11, !12, !14, !16, !17, !19, !20, !39}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "outScalar_every", scope: !7, file: !6, line: 32, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "outInfo_every", scope: !7, file: !6, line: 33, baseType: !10, size: 32, align: 32, offset: 32)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "info_reductions_changed", scope: !7, file: !6, line: 34, baseType: !13, size: 8, align: 8, offset: 64)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "do_outScalar", scope: !7, file: !6, line: 37, baseType: !15, size: 64, align: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "outdirScalar", scope: !7, file: !6, line: 40, baseType: !15, size: 64, align: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "outInfo_last", scope: !7, file: !6, line: 43, baseType: !18, size: 64, align: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "outScalar_last", scope: !7, file: !6, line: 44, baseType: !18, size: 64, align: 64, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "info_reductions", scope: !7, file: !6, line: 47, baseType: !21, size: 64, align: 64, offset: 384)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasic_reductionlist_t", file: !6, line: 27, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_REDUCTIONLIST", file: !6, line: 23, size: 128, align: 64, elements: !24)
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "num_reductions", scope: !23, file: !6, line: 25, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "reductions", scope: !23, file: !6, line: 26, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobasic_reduction_t", file: !6, line: 21, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "IOBASIC_REDUCTION", file: !6, line: 14, size: 320, align: 64, elements: !31)
!31 = !{!32, !33, !34, !35, !37}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !30, file: !6, line: 16, baseType: !10, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !6, line: 17, baseType: !15, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !30, file: !6, line: 18, baseType: !13, size: 8, align: 8, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !6, line: 19, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !6, line: 20, baseType: !38, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "filenameListScalar", scope: !7, file: !6, line: 50, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "pNamedData", file: !42, line: 26, baseType: !43)
!42 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/StoreNamedData.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "PNamedData", file: !42, line: 18, size: 256, align: 64, elements: !44)
!44 = !{!45, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !43, file: !42, line: 20, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !42, line: 21, baseType: !46, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !42, line: 23, baseType: !15, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !42, line: 25, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!52 = !{!53, !58, !201, !229, !235, !243, !246}
!53 = !DISubprogram(name: "CCTKi_version_CactusBase_IOBasic_WriteScalar_c", scope: !1, file: !1, line: 27, type: !54, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @CCTKi_version_CactusBase_IOBasic_WriteScalar_c, variables: !2)
!54 = !DISubroutineType(types: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!58 = !DISubprogram(name: "IOBasic_WriteScalarGA", scope: !1, file: !1, line: 75, type: !59, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i8*)* @IOBasic_WriteScalarGA, variables: !95)
!59 = !DISubroutineType(types: !60)
!60 = !{!10, !61, !10, !56}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGH", file: !64, line: 75, baseType: !65)
!64 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/cGH.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 24, size: 1216, align: 64, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !88}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_dim", scope: !65, file: !64, line: 26, baseType: !10, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_iteration", scope: !65, file: !64, line: 27, baseType: !10, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_gsh", scope: !65, file: !64, line: 30, baseType: !18, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lsh", scope: !65, file: !64, line: 31, baseType: !18, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lbnd", scope: !65, file: !64, line: 32, baseType: !18, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_ubnd", scope: !65, file: !64, line: 33, baseType: !18, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_lssh", scope: !65, file: !64, line: 36, baseType: !18, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_to", scope: !65, file: !64, line: 39, baseType: !18, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_from", scope: !65, file: !64, line: 40, baseType: !18, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_time", scope: !65, file: !64, line: 43, baseType: !36, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_delta_space", scope: !65, file: !64, line: 44, baseType: !51, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_origin_space", scope: !65, file: !64, line: 47, baseType: !51, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_bbox", scope: !65, file: !64, line: 51, baseType: !18, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_levfac", scope: !65, file: !64, line: 54, baseType: !18, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_convlevel", scope: !65, file: !64, line: 57, baseType: !10, size: 32, align: 32, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_nghostzones", scope: !65, file: !64, line: 60, baseType: !18, size: 64, align: 64, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cctk_time", scope: !65, file: !64, line: 63, baseType: !36, size: 64, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !64, line: 67, baseType: !85, size: 64, align: 64, offset: 1024)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !65, file: !64, line: 70, baseType: !86, size: 64, align: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "GroupData", scope: !65, file: !64, line: 73, baseType: !89, size: 64, align: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "cGHGroupData", file: !64, line: 22, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 18, size: 16, align: 8, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !91, file: !64, line: 20, baseType: !13, size: 8, align: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !91, file: !64, line: 21, baseType: !13, size: 8, align: 8, offset: 8)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !161, !162, !163, !164, !165, !169, !170, !171, !172, !177, !183, !184, !185, !186, !187, !188, !189, !190, !192, !193, !194, !195, !196, !197, !198}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !58, file: !1, line: 75, type: !61)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !58, file: !1, line: 75, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !58, file: !1, line: 75, type: !56)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ierr", scope: !58, file: !1, line: 77, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reduction_handle", scope: !58, file: !1, line: 78, type: !10)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !58, file: !1, line: 79, type: !4)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !58, file: !1, line: 80, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !105, line: 153, baseType: !106)
!105 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !105, line: 122, size: 1216, align: 64, elements: !107)
!107 = !{!108, !111, !112, !113, !115, !116, !121, !122, !123, !127, !131, !141, !145, !146, !149, !150, !154, !158, !159, !160}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !106, file: !105, line: 123, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !106, file: !105, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !106, file: !105, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !106, file: !105, line: 126, baseType: !114, size: 16, align: 16, offset: 128)
!114 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !106, file: !105, line: 127, baseType: !114, size: 16, align: 16, offset: 144)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !106, file: !105, line: 128, baseType: !117, size: 128, align: 64, offset: 192)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !105, line: 88, size: 128, align: 64, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !117, file: !105, line: 89, baseType: !109, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !117, file: !105, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !106, file: !105, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !106, file: !105, line: 132, baseType: !50, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !106, file: !105, line: 133, baseType: !124, size: 64, align: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!10, !50}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !106, file: !105, line: 134, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!10, !50, !15, !10}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !106, file: !105, line: 135, baseType: !132, size: 64, align: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !50, !135, !10}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !105, line: 77, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !137, line: 71, baseType: !138)
!137 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !139, line: 46, baseType: !140)
!139 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!140 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !106, file: !105, line: 136, baseType: !142, size: 64, align: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!10, !50, !56, !10}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !106, file: !105, line: 139, baseType: !117, size: 128, align: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !106, file: !105, line: 140, baseType: !147, size: 64, align: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !105, line: 94, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !106, file: !105, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !106, file: !105, line: 144, baseType: !151, size: 24, align: 8, offset: 928)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 24, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !106, file: !105, line: 145, baseType: !155, size: 8, align: 8, offset: 952)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 1)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !106, file: !105, line: 148, baseType: !117, size: 128, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !106, file: !105, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !106, file: !105, line: 152, baseType: !135, size: 64, align: 64, offset: 1152)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !58, file: !1, line: 81, type: !15)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reduction_op", scope: !58, file: !1, line: 82, type: !15)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string_start", scope: !58, file: !1, line: 83, type: !15)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string_end", scope: !58, file: !1, line: 84, type: !15)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_str", scope: !58, file: !1, line: 85, type: !166)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 120, align: 8, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 15)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_extension", scope: !58, file: !1, line: 86, type: !56)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !58, file: !1, line: 87, type: !15)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reduction_value", scope: !58, file: !1, line: 88, type: !36)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reductions", scope: !58, file: !1, line: 93, type: !173)
!173 = !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !1, line: 89, size: 64, align: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "non_const_ptr", scope: !173, file: !1, line: 91, baseType: !15, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "const_ptr", scope: !173, file: !1, line: 92, baseType: !56, size: 64, align: 64)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GH_fake_const", scope: !58, file: !1, line: 99, type: !178)
!178 = !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !1, line: 95, size: 64, align: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "const_ptr", scope: !178, file: !1, line: 97, baseType: !61, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "non_const_ptr", scope: !178, file: !1, line: 98, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_reductions", scope: !58, file: !1, line: 100, type: !56)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_vars", scope: !58, file: !1, line: 100, type: !56)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_reductions", scope: !58, file: !1, line: 100, type: !56)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_style", scope: !58, file: !1, line: 100, type: !56)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_vars", scope: !58, file: !1, line: 100, type: !56)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_format", scope: !58, file: !1, line: 100, type: !56)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdirScalar", scope: !58, file: !1, line: 100, type: !56)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_every", scope: !58, file: !1, line: 100, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_every", scope: !58, file: !1, line: 100, type: !191)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir", scope: !58, file: !1, line: 100, type: !56)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_every", scope: !58, file: !1, line: 100, type: !191)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newverbose", scope: !58, file: !1, line: 100, type: !56)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_filename_scheme", scope: !58, file: !1, line: 100, type: !191)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_fileinfo", scope: !58, file: !1, line: 100, type: !56)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !58, file: !1, line: 100, type: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!201 = !DISubprogram(name: "IOBasic_WriteScalarGS", scope: !1, file: !1, line: 277, type: !59, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cGH*, i32, i8*)* @IOBasic_WriteScalarGS, variables: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !201, file: !1, line: 277, type: !61)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !201, file: !1, line: 277, type: !10)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alias", arg: 3, scope: !201, file: !1, line: 277, type: !56)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_reductions", scope: !201, file: !1, line: 279, type: !56)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_vars", scope: !201, file: !1, line: 279, type: !56)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_reductions", scope: !201, file: !1, line: 279, type: !56)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_style", scope: !201, file: !1, line: 279, type: !56)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_vars", scope: !201, file: !1, line: 279, type: !56)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_format", scope: !201, file: !1, line: 279, type: !56)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdirScalar", scope: !201, file: !1, line: 279, type: !56)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_every", scope: !201, file: !1, line: 279, type: !191)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_every", scope: !201, file: !1, line: 279, type: !191)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir", scope: !201, file: !1, line: 279, type: !56)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_every", scope: !201, file: !1, line: 279, type: !191)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newverbose", scope: !201, file: !1, line: 279, type: !56)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_filename_scheme", scope: !201, file: !1, line: 279, type: !191)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_fileinfo", scope: !201, file: !1, line: 279, type: !56)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !201, file: !1, line: 279, type: !199)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !201, file: !1, line: 280, type: !103)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !201, file: !1, line: 281, type: !50)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !201, file: !1, line: 282, type: !4)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !201, file: !1, line: 283, type: !15)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !201, file: !1, line: 283, type: !15)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_extension", scope: !201, file: !1, line: 284, type: !56)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_str_real", scope: !201, file: !1, line: 285, type: !166)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_str_int", scope: !201, file: !1, line: 285, type: !166)
!229 = !DISubprogram(name: "isspace", scope: !230, file: !230, line: 267, type: !231, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, variables: !233)
!230 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!231 = !DISubroutineType(types: !232)
!232 = !{!10, !10}
!233 = !{!234}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !229, file: !230, line: 267, type: !10)
!235 = !DISubprogram(name: "__istype", scope: !230, file: !230, line: 153, type: !236, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !240)
!236 = !DISubroutineType(types: !237)
!237 = !{!10, !238, !239}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !139, line: 70, baseType: !10)
!239 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!240 = !{!241, !242}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !235, file: !230, line: 153, type: !238)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !235, file: !230, line: 153, type: !239)
!243 = !DISubprogram(name: "isascii", scope: !230, file: !230, line: 135, type: !231, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, variables: !244)
!244 = !{!245}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !243, file: !230, line: 135, type: !10)
!246 = !DISubprogram(name: "OpenScalarFile", scope: !1, file: !1, line: 366, type: !247, isLocal: true, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true, function: %struct.__sFILE* (%struct.cGH*, i32, i8*, i8*, i8*, i8*)* @OpenScalarFile, variables: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{!103, !61, !10, !56, !56, !56, !56}
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !277, !287, !288, !289, !290}
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GH", arg: 1, scope: !246, file: !1, line: 366, type: !61)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vindex", arg: 2, scope: !246, file: !1, line: 367, type: !10)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 3, scope: !246, file: !1, line: 368, type: !56)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slicename", arg: 4, scope: !246, file: !1, line: 369, type: !56)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "description", arg: 5, scope: !246, file: !1, line: 370, type: !56)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "aliasname", arg: 6, scope: !246, file: !1, line: 371, type: !56)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_reductions", scope: !246, file: !1, line: 373, type: !56)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_vars", scope: !246, file: !1, line: 373, type: !56)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_reductions", scope: !246, file: !1, line: 373, type: !56)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_style", scope: !246, file: !1, line: 373, type: !56)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_vars", scope: !246, file: !1, line: 373, type: !56)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_format", scope: !246, file: !1, line: 373, type: !56)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdirScalar", scope: !246, file: !1, line: 373, type: !56)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outInfo_every", scope: !246, file: !1, line: 373, type: !191)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outScalar_every", scope: !246, file: !1, line: 373, type: !191)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outdir", scope: !246, file: !1, line: 373, type: !56)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_every", scope: !246, file: !1, line: 373, type: !191)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newverbose", scope: !246, file: !1, line: 373, type: !56)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_filename_scheme", scope: !246, file: !1, line: 373, type: !191)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_fileinfo", scope: !246, file: !1, line: 373, type: !56)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cctk_pdummy_pointer", scope: !246, file: !1, line: 373, type: !199)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !246, file: !1, line: 374, type: !103)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comment_char", scope: !246, file: !1, line: 375, type: !13)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !246, file: !1, line: 375, type: !274)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, align: 8, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 128)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "advertised_file", scope: !246, file: !1, line: 376, type: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioAdvertisedFileDesc", file: !279, line: 36, baseType: !280)
!279 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/436.cactusADM/src/IOBasic/../include/ioutil_AdvertisedFiles.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!280 = !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 29, size: 320, align: 64, elements: !281)
!281 = !{!282, !283, !284, !285, !286}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "thorn", scope: !280, file: !279, line: 31, baseType: !56, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "varname", scope: !280, file: !279, line: 32, baseType: !56, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mimetype", scope: !280, file: !279, line: 33, baseType: !56, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !280, file: !279, line: 34, baseType: !56, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !280, file: !279, line: 35, baseType: !56, size: 64, align: 64, offset: 256)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "myGH", scope: !246, file: !1, line: 377, type: !4)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "openmode", scope: !246, file: !1, line: 378, type: !15)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !246, file: !1, line: 378, type: !15)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileinfo", scope: !246, file: !1, line: 379, type: !291)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !292, line: 182, size: 1152, align: 64, elements: !293)
!292 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!293 = !{!294, !299, !305, !308, !312, !317, !321, !322, !330, !331, !332, !333, !336, !340, !344, !345, !346, !347}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !291, file: !292, line: 182, baseType: !295, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !296, line: 30, baseType: !297)
!296 = !DIFile(filename: "/usr/include/sys/_types/_dev_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !137, line: 57, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !139, line: 44, baseType: !10)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !291, file: !292, line: 182, baseType: !300, size: 16, align: 16, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !301, line: 30, baseType: !302)
!301 = !DIFile(filename: "/usr/include/sys/_types/_mode_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !137, line: 70, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !139, line: 43, baseType: !304)
!304 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !291, file: !292, line: 182, baseType: !306, size: 16, align: 16, offset: 48)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !307, line: 30, baseType: !303)
!307 = !DIFile(filename: "/usr/include/sys/_types/_nlink_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !291, file: !292, line: 182, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !137, line: 62, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !139, line: 47, baseType: !311)
!311 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !291, file: !292, line: 182, baseType: !313, size: 32, align: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !314, line: 30, baseType: !315)
!314 = !DIFile(filename: "/usr/include/sys/_types/_uid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !137, line: 75, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !139, line: 45, baseType: !26)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !291, file: !292, line: 182, baseType: !318, size: 32, align: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !319, line: 30, baseType: !320)
!319 = !DIFile(filename: "/usr/include/sys/_types/_gid_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !137, line: 60, baseType: !316)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !291, file: !292, line: 182, baseType: !295, size: 32, align: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !291, file: !292, line: 182, baseType: !323, size: 128, align: 64, offset: 256)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !324, line: 30, size: 128, align: 64, elements: !325)
!324 = !DIFile(filename: "/usr/include/sys/_types/_timespec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!325 = !{!326, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !323, file: !324, line: 32, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !139, line: 120, baseType: !328)
!328 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !323, file: !324, line: 33, baseType: !328, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !291, file: !292, line: 182, baseType: !323, size: 128, align: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !291, file: !292, line: 182, baseType: !323, size: 128, align: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !291, file: !292, line: 182, baseType: !323, size: 128, align: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !291, file: !292, line: 182, baseType: !334, size: 64, align: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !335, line: 30, baseType: !136)
!335 = !DIFile(filename: "/usr/include/sys/_types/_off_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !291, file: !292, line: 182, baseType: !337, size: 64, align: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !338, line: 30, baseType: !339)
!338 = !DIFile(filename: "/usr/include/sys/_types/_blkcnt_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !137, line: 55, baseType: !138)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !291, file: !292, line: 182, baseType: !341, size: 32, align: 32, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !342, line: 30, baseType: !343)
!342 = !DIFile(filename: "/usr/include/sys/_types/_blksize_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !137, line: 56, baseType: !298)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !291, file: !292, line: 182, baseType: !316, size: 32, align: 32, offset: 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !291, file: !292, line: 182, baseType: !316, size: 32, align: 32, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !291, file: !292, line: 182, baseType: !298, size: 32, align: 32, offset: 992)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !291, file: !292, line: 182, baseType: !348, size: 128, align: 64, offset: 1024)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, align: 64, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 2)
!351 = !{!352}
!352 = !DIGlobalVariable(name: "rcsid", scope: !0, file: !1, line: 25, type: !56, isLocal: true, isDefinition: true)
!353 = !{i32 2, !"Dwarf Version", i32 2}
!354 = !{i32 2, !"Debug Info Version", i32 700000003}
!355 = !{i32 1, !"PIC Level", i32 2}
!356 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!357 = !DILocation(line: 27, column: 1, scope: !53)
!358 = !DIExpression()
!359 = !DILocation(line: 75, column: 39, scope: !58)
!360 = !DILocation(line: 75, column: 47, scope: !58)
!361 = !DILocation(line: 75, column: 67, scope: !58)
!362 = !DILocation(line: 85, column: 8, scope: !58)
!363 = !DILocation(line: 93, column: 5, scope: !58)
!364 = !DILocation(line: 99, column: 5, scope: !58)
!365 = !DILocation(line: 100, column: 3, scope: !58)
!366 = !{!367, !368, i64 16}
!367 = !{!"", !368, i64 0, !368, i64 8, !368, i64 16, !368, i64 24, !368, i64 32, !368, i64 40, !368, i64 48, !371, i64 56, !371, i64 60}
!368 = !{!"any pointer", !369, i64 0}
!369 = !{!"omnipotent char", !370, i64 0}
!370 = !{!"Simple C/C++ TBAA"}
!371 = !{!"int", !369, i64 0}
!372 = !{!367, !368, i64 24}
!373 = !{!367, !368, i64 40}
!374 = !{!375, !371, i64 204}
!375 = !{!"", !376, i64 0, !376, i64 8, !376, i64 16, !376, i64 24, !376, i64 32, !376, i64 40, !376, i64 48, !376, i64 56, !376, i64 64, !368, i64 72, !368, i64 80, !368, i64 88, !368, i64 96, !368, i64 104, !368, i64 112, !368, i64 120, !368, i64 128, !368, i64 136, !368, i64 144, !368, i64 152, !368, i64 160, !368, i64 168, !368, i64 176, !371, i64 184, !371, i64 188, !371, i64 192, !371, i64 196, !371, i64 200, !371, i64 204, !371, i64 208, !371, i64 212, !371, i64 216, !371, i64 220, !371, i64 224, !371, i64 228, !371, i64 232, !371, i64 236, !371, i64 240, !371, i64 244, !371, i64 248, !371, i64 252, !371, i64 256, !371, i64 260, !371, i64 264, !371, i64 268, !371, i64 272, !371, i64 276, !371, i64 280, !371, i64 284, !371, i64 288, !371, i64 292}
!376 = !{!"double", !369, i64 0}
!377 = !DILocation(line: 109, column: 38, scope: !378)
!378 = distinct !DILexicalBlock(scope: !58, file: !1, line: 109, column: 7)
!379 = !DILocation(line: 109, column: 9, scope: !378)
!380 = !DILocation(line: 109, column: 7, scope: !58)
!381 = !DILocation(line: 111, column: 16, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !1, line: 110, column: 3)
!383 = !DILocation(line: 87, column: 9, scope: !58)
!384 = !DILocation(line: 112, column: 5, scope: !382)
!385 = !DILocation(line: 115, column: 5, scope: !382)
!386 = !DILocation(line: 116, column: 5, scope: !382)
!387 = !DILocation(line: 120, column: 3, scope: !58)
!388 = !DILocation(line: 123, column: 20, scope: !58)
!389 = !DILocation(line: 86, column: 15, scope: !58)
!390 = !DILocation(line: 126, column: 24, scope: !58)
!391 = !DILocation(line: 129, column: 35, scope: !58)
!392 = !DILocation(line: 129, column: 65, scope: !58)
!393 = !DILocation(line: 129, column: 27, scope: !58)
!394 = !DILocation(line: 82, column: 9, scope: !58)
!395 = !DILocation(line: 83, column: 9, scope: !58)
!396 = !DILocation(line: 133, column: 10, scope: !58)
!397 = !DILocation(line: 133, column: 23, scope: !58)
!398 = !DILocation(line: 153, column: 5, scope: !399)
!399 = distinct !DILexicalBlock(scope: !58, file: !1, line: 134, column: 3)
!400 = !DILocation(line: 169, column: 45, scope: !399)
!401 = !DILocation(line: 175, column: 11, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !1, line: 175, column: 11)
!403 = distinct !DILexicalBlock(scope: !404, file: !1, line: 173, column: 5)
!404 = distinct !DILexicalBlock(scope: !399, file: !1, line: 172, column: 9)
!405 = !DILocation(line: 209, column: 51, scope: !406)
!406 = distinct !DILexicalBlock(scope: !402, file: !1, line: 185, column: 7)
