; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/403.gcc/src/md5.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [128 x i8] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@fillbuf = internal constant [64 x i8] c"\80\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 16

; Function Attrs: nounwind optsize ssp uwtable
define void @md5_init_ctx(%struct.md5_ctx* nocapture %ctx) #0 {
  tail call void @llvm.dbg.value(metadata %struct.md5_ctx* %ctx, i64 0, metadata !32, metadata !183), !dbg !184
  %1 = getelementptr inbounds %struct.md5_ctx* %ctx, i64 0, i32 0, !dbg !185
  store i32 1732584193, i32* %1, align 4, !dbg !186, !tbaa !187
  %2 = getelementptr inbounds %struct.md5_ctx* %ctx, i64 0, i32 1, !dbg !192
  store i32 -271733879, i32* %2, align 4, !dbg !193, !tbaa !194
  %3 = getelementptr inbounds %struct.md5_ctx* %ctx, i64 0, i32 2, !dbg !195
  store i32 -1732584194, i32* %3, align 4, !dbg !196, !tbaa !197

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !11, globals: !173, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/403.gcc/src/md5.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !7, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "md5_uint32", file: !5, line: 53, baseType: !6)
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/403.gcc/src/md5.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !{!12, !33, !42, !55, !128, !136, !149}
!12 = !DISubprogram(name: "md5_init_ctx", scope: !1, file: !1, line: 63, type: !13, isLocal: false, isDefinition: true, scopeLine: 65, isOptimized: true, function: void (%struct.md5_ctx*)* @md5_init_ctx, variables: !31)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !5, line: 77, size: 1248, align: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !26, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !16, file: !5, line: 79, baseType: !4, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !16, file: !5, line: 80, baseType: !4, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !16, file: !5, line: 81, baseType: !4, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !16, file: !5, line: 82, baseType: !4, size: 32, align: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !16, file: !5, line: 84, baseType: !23, size: 64, align: 32, offset: 128)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 32, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 2)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !16, file: !5, line: 85, baseType: !4, size: 32, align: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !16, file: !5, line: 86, baseType: !28, size: 1024, align: 8, offset: 224)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 128)
!31 = !{!32}
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !12, file: !1, line: 64, type: !15)
!33 = !DISubprogram(name: "md5_read_ctx", scope: !1, file: !1, line: 81, type: !34, isLocal: false, isDefinition: true, scopeLine: 84, isOptimized: true, function: i8* (%struct.md5_ctx*, i8*)* @md5_read_ctx, variables: !39)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !37, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!39 = !{!40, !41}
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !33, file: !1, line: 82, type: !37)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resbuf", arg: 2, scope: !33, file: !1, line: 83, type: !36)
!42 = !DISubprogram(name: "md5_finish_ctx", scope: !1, file: !1, line: 99, type: !43, isLocal: false, isDefinition: true, scopeLine: 102, isOptimized: true, function: i8* (%struct.md5_ctx*, i8*)* @md5_finish_ctx, variables: !45)
!43 = !DISubroutineType(types: !44)
!44 = !{!36, !15, !36}
!45 = !{!46, !47, !48, !49}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !42, file: !1, line: 100, type: !15)
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resbuf", arg: 2, scope: !42, file: !1, line: 101, type: !36)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !42, file: !1, line: 104, type: !4)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pad", scope: !42, file: !1, line: 105, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 30, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !53, line: 92, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!55 = !DISubprogram(name: "md5_stream", scope: !1, file: !1, line: 130, type: !56, isLocal: false, isDefinition: true, scopeLine: 133, isOptimized: true, function: i32 (%struct.__sFILE*, i8*)* @md5_stream, variables: !117)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !59, !36}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !61, line: 153, baseType: !62)
!61 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !61, line: 122, size: 1216, align: 64, elements: !63)
!63 = !{!64, !67, !68, !69, !71, !72, !77, !78, !79, !83, !88, !97, !101, !102, !105, !106, !110, !114, !115, !116}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !62, file: !61, line: 123, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !62, file: !61, line: 124, baseType: !58, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !62, file: !61, line: 125, baseType: !58, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !62, file: !61, line: 126, baseType: !70, size: 16, align: 16, offset: 128)
!70 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !62, file: !61, line: 127, baseType: !70, size: 16, align: 16, offset: 144)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !62, file: !61, line: 128, baseType: !73, size: 128, align: 64, offset: 192)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !61, line: 88, size: 128, align: 64, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !73, file: !61, line: 89, baseType: !65, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !73, file: !61, line: 90, baseType: !58, size: 32, align: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !62, file: !61, line: 129, baseType: !58, size: 32, align: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !62, file: !61, line: 132, baseType: !36, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !62, file: !61, line: 133, baseType: !80, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!58, !36}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !62, file: !61, line: 134, baseType: !84, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!58, !36, !87, !58}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !62, file: !61, line: 135, baseType: !89, size: 64, align: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !36, !92, !58}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !61, line: 77, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !94, line: 71, baseType: !95)
!94 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !96)
!96 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !62, file: !61, line: 136, baseType: !98, size: 64, align: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!58, !36, !8, !58}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !62, file: !61, line: 139, baseType: !73, size: 128, align: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !62, file: !61, line: 140, baseType: !103, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !61, line: 94, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !62, file: !61, line: 141, baseType: !58, size: 32, align: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !62, file: !61, line: 144, baseType: !107, size: 24, align: 8, offset: 928)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 24, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 3)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !62, file: !61, line: 145, baseType: !111, size: 8, align: 8, offset: 952)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 8, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !62, file: !61, line: 148, baseType: !73, size: 128, align: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !62, file: !61, line: 151, baseType: !58, size: 32, align: 32, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !62, file: !61, line: 152, baseType: !92, size: 64, align: 64, offset: 1152)
!117 = !{!118, !119, !120, !121, !125, !126}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 1, scope: !55, file: !1, line: 131, type: !59)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resblock", arg: 2, scope: !55, file: !1, line: 132, type: !36)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !55, file: !1, line: 136, type: !16)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !55, file: !1, line: 137, type: !122)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 33344, align: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 4168)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !55, file: !1, line: 138, type: !50)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !127, file: !1, line: 149, type: !50)
!127 = distinct !DILexicalBlock(scope: !55, file: !1, line: 145, column: 5)
!128 = !DISubprogram(name: "md5_buffer", scope: !1, file: !1, line: 187, type: !129, isLocal: false, isDefinition: true, scopeLine: 191, isOptimized: true, function: i8* (i8*, i64, i8*)* @md5_buffer, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!36, !8, !50, !36}
!131 = !{!132, !133, !134, !135}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 1, scope: !128, file: !1, line: 188, type: !8)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !128, file: !1, line: 189, type: !50)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resblock", arg: 3, scope: !128, file: !1, line: 190, type: !36)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !128, file: !1, line: 192, type: !16)
!136 = !DISubprogram(name: "md5_process_bytes", scope: !1, file: !1, line: 206, type: !137, isLocal: false, isDefinition: true, scopeLine: 210, isOptimized: true, function: void (i8*, i64, %struct.md5_ctx*)* @md5_process_bytes, variables: !141)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !139, !50, !15}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!141 = !{!142, !143, !144, !145, !148}
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 1, scope: !136, file: !1, line: 207, type: !139)
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !136, file: !1, line: 208, type: !50)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !136, file: !1, line: 209, type: !15)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_over", scope: !146, file: !1, line: 215, type: !50)
!146 = distinct !DILexicalBlock(scope: !147, file: !1, line: 214, column: 5)
!147 = distinct !DILexicalBlock(scope: !136, file: !1, line: 213, column: 7)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "add", scope: !146, file: !1, line: 216, type: !50)
!149 = !DISubprogram(name: "md5_process_block", scope: !1, file: !1, line: 264, type: !137, isLocal: false, isDefinition: true, scopeLine: 268, isOptimized: true, function: void (i8*, i64, %struct.md5_ctx*)* @md5_process_block, variables: !150)
!150 = !{!151, !152, !153, !154, !158, !161, !162, !163, !164, !165, !166, !167, !169, !170, !171, !172}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 1, scope: !149, file: !1, line: 265, type: !139)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !149, file: !1, line: 266, type: !50)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !149, file: !1, line: 267, type: !15)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "correct_words", scope: !149, file: !1, line: 269, type: !155)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 32, elements: !156)
