; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/403.gcc/src/obstack.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.fooalign = type { i8, double }

@obstack_alloc_failed_handler = global void ()* @print_and_abort, align 8
@obstack_exit_failure = global i32 1, align 4
@_obstack = common global %struct.obstack* null, align 8
@.str = private unnamed_addr constant [18 x i8] c"memory exhausted\0A\00", align 1
@__stderrp = external global %struct.__sFILE*

; Function Attrs: noreturn nounwind optsize ssp uwtable
define internal void @print_and_abort() #0 {
  %1 = load %struct.__sFILE** @__stderrp, align 8, !dbg !145, !tbaa !146
  %2 = tail call i32 @"\01_fputs"(i8* getelementptr inbounds ([18 x i8]* @.str, i64 0, i64 0), %struct.__sFILE* %1) #6, !dbg !150
  %3 = load i32* @obstack_exit_failure, align 4, !dbg !151, !tbaa !152
  tail call void @exit(i32 %3) #7, !dbg !154

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !38, globals: !136, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/403.gcc/src/obstack.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !8, !14, !28, !31, !34, !35, !27}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "fooalign", file: !1, line: 60, size: 128, align: 64, elements: !10)
!10 = !{!11, !12}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !9, file: !1, line: 60, baseType: !7, size: 8, align: 8)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !9, file: !1, line: 60, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !27, !5}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !19, line: 161, size: 192, align: 64, elements: !20)
!19 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/403.gcc/src/obstack.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!20 = !{!21, !22, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !18, file: !19, line: 163, baseType: !6, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !18, file: !19, line: 164, baseType: !17, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !18, file: !19, line: 165, baseType: !24, size: 32, align: 8, offset: 128)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, align: 8, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 4)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !27, !17}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!17, !5}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !27}
!38 = !{!39, !72, !92, !104, !112, !120, !126, !133}
!39 = !DISubprogram(name: "_obstack_begin", scope: !1, file: !1, line: 149, type: !40, isLocal: false, isDefinition: true, scopeLine: 160, isOptimized: true, function: i32 (%struct.obstack*, i32, i32, i8* (i64)*, void (i8*)*)* @_obstack_begin, variables: !62)
!40 = !DISubroutineType(types: !41)
!41 = !{!4, !42, !4, !4, !59, !35}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !19, line: 168, size: 704, align: 64, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !57, !58}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !43, file: !19, line: 170, baseType: !5, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !43, file: !19, line: 171, baseType: !17, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !43, file: !19, line: 172, baseType: !6, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !43, file: !19, line: 173, baseType: !6, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !43, file: !19, line: 174, baseType: !6, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !43, file: !19, line: 175, baseType: !5, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !43, file: !19, line: 176, baseType: !4, size: 32, align: 32, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !43, file: !19, line: 181, baseType: !14, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !43, file: !19, line: 182, baseType: !28, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !43, file: !19, line: 183, baseType: !27, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !43, file: !19, line: 189, baseType: !56, size: 1, align: 32, offset: 640)
!56 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !43, file: !19, line: 190, baseType: !56, size: 1, align: 32, offset: 641)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !43, file: !19, line: 194, baseType: !56, size: 1, align: 32, offset: 642)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!27, !5}
!62 = !{!63, !64, !65, !66, !67, !68, !69}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !39, file: !1, line: 150, type: !42)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !39, file: !1, line: 151, type: !4)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alignment", arg: 3, scope: !39, file: !1, line: 152, type: !4)
!66 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chunkfun", arg: 4, scope: !39, file: !1, line: 154, type: !59)
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "freefun", arg: 5, scope: !39, file: !1, line: 155, type: !35)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunk", scope: !39, file: !1, line: 161, type: !17)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extra", scope: !70, file: !1, line: 176, type: !4)
!70 = distinct !DILexicalBlock(scope: !71, file: !1, line: 167, column: 5)
!71 = distinct !DILexicalBlock(scope: !39, file: !1, line: 165, column: 7)
!72 = !DISubprogram(name: "_obstack_begin_1", scope: !1, file: !1, line: 207, type: !73, isLocal: false, isDefinition: true, scopeLine: 219, isOptimized: true, function: i32 (%struct.obstack*, i32, i32, i8* (i8*, i64)*, void (i8*, i8*)*, i8*)* @_obstack_begin_1, variables: !81)
!73 = !DISubroutineType(types: !74)
!74 = !{!4, !42, !4, !4, !75, !78, !27}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!27, !27, !5}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !27, !27}
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !72, file: !1, line: 208, type: !42)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !72, file: !1, line: 209, type: !4)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alignment", arg: 3, scope: !72, file: !1, line: 210, type: !4)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chunkfun", arg: 4, scope: !72, file: !1, line: 212, type: !75)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "freefun", arg: 5, scope: !72, file: !1, line: 213, type: !78)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 6, scope: !72, file: !1, line: 218, type: !27)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunk", scope: !72, file: !1, line: 220, type: !17)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extra", scope: !90, file: !1, line: 235, type: !4)
!90 = distinct !DILexicalBlock(scope: !91, file: !1, line: 226, column: 5)
!91 = distinct !DILexicalBlock(scope: !72, file: !1, line: 224, column: 7)
!92 = !DISubprogram(name: "_obstack_newchunk", scope: !1, file: !1, line: 273, type: !93, isLocal: false, isDefinition: true, scopeLine: 276, isOptimized: true, function: void (%struct.obstack*, i32)* @_obstack_newchunk, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !42, !4}
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 1, scope: !92, file: !1, line: 274, type: !42)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !92, file: !1, line: 275, type: !4)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_chunk", scope: !92, file: !1, line: 277, type: !17)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_chunk", scope: !92, file: !1, line: 278, type: !17)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_size", scope: !92, file: !1, line: 279, type: !5)
