; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/implicit.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i64, %struct.node*, %struct.node*, i32, %struct.arc*, %struct.arc*, i64, i64 }

@__func__.resize_prob = private unnamed_addr constant [12 x i8] c"resize_prob\00", align 1
@.str = private unnamed_addr constant [64 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/implicit.c\00", align 1
@.str1 = private unnamed_addr constant [20 x i8] c"net->max_new_m >= 3\00", align 1
@.str2 = private unnamed_addr constant [31 x i8] c"network %s: not enough memory\0A\00", align 1
@__stdoutp = external global %struct.__sFILE*


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !47, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/implicit.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !41, !46, !31, !10, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !6, line: 102, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !6, line: 126, size: 512, align: 64, elements: !8)
!8 = !{!9, !12, !35, !36, !37, !38, !39, !40}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !7, file: !6, line: 128, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !6, line: 69, baseType: !11)
!11 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !7, file: !6, line: 129, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !6, line: 100, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !6, line: 107, size: 832, align: 64, elements: !16)
!16 = !{!17, !18, !20, !21, !22, !23, !24, !27, !28, !29, !30, !32, !33, !34}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !15, file: !6, line: 109, baseType: !10, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !15, file: !6, line: 110, baseType: !19, size: 32, align: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !15, file: !6, line: 111, baseType: !13, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !15, file: !6, line: 112, baseType: !13, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !15, file: !6, line: 113, baseType: !13, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !15, file: !6, line: 114, baseType: !13, size: 64, align: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !15, file: !6, line: 115, baseType: !25, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !6, line: 103, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !15, file: !6, line: 116, baseType: !25, size: 64, align: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !15, file: !6, line: 116, baseType: !25, size: 64, align: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !15, file: !6, line: 117, baseType: !25, size: 64, align: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !15, file: !6, line: 118, baseType: !31, size: 64, align: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !6, line: 68, baseType: !11)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !15, file: !6, line: 119, baseType: !11, size: 64, align: 64, offset: 704)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !15, file: !6, line: 120, baseType: !19, size: 32, align: 32, offset: 768)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !15, file: !6, line: 121, baseType: !19, size: 32, align: 32, offset: 800)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !7, file: !6, line: 129, baseType: !13, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !7, file: !6, line: 130, baseType: !19, size: 32, align: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !7, file: !6, line: 131, baseType: !25, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !7, file: !6, line: 131, baseType: !25, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !7, file: !6, line: 132, baseType: !31, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !7, file: !6, line: 133, baseType: !10, size: 64, align: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 30, baseType: !43)
!42 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !44, line: 92, baseType: !45)
!44 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!45 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!47 = !{!48, !99, !110, !122, !143}
!48 = !DISubprogram(name: "resize_prob", scope: !1, file: !1, line: 28, type: !49, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.network*)* @resize_prob, variables: !90)
!49 = !DISubroutineType(types: !50)
!50 = !{!11, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !6, line: 163, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !6, line: 138, size: 4992, align: 64, elements: !54)
!54 = !{!55, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !53, file: !6, line: 140, baseType: !56, size: 1600, align: 8)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1600, align: 8, elements: !58)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !{!59}
!59 = !DISubrange(count: 200)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !53, file: !6, line: 141, baseType: !56, size: 1600, align: 8, offset: 1600)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !53, file: !6, line: 142, baseType: !11, size: 64, align: 64, offset: 3200)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !53, file: !6, line: 142, baseType: !11, size: 64, align: 64, offset: 3264)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !53, file: !6, line: 143, baseType: !11, size: 64, align: 64, offset: 3328)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !53, file: !6, line: 143, baseType: !11, size: 64, align: 64, offset: 3392)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !53, file: !6, line: 143, baseType: !11, size: 64, align: 64, offset: 3456)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !53, file: !6, line: 143, baseType: !11, size: 64, align: 64, offset: 3520)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !53, file: !6, line: 144, baseType: !11, size: 64, align: 64, offset: 3584)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !53, file: !6, line: 144, baseType: !11, size: 64, align: 64, offset: 3648)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !53, file: !6, line: 146, baseType: !11, size: 64, align: 64, offset: 3712)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !53, file: !6, line: 147, baseType: !11, size: 64, align: 64, offset: 3776)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !53, file: !6, line: 148, baseType: !11, size: 64, align: 64, offset: 3840)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !53, file: !6, line: 149, baseType: !11, size: 64, align: 64, offset: 3904)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !53, file: !6, line: 150, baseType: !11, size: 64, align: 64, offset: 3968)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !53, file: !6, line: 151, baseType: !11, size: 64, align: 64, offset: 4032)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !53, file: !6, line: 152, baseType: !11, size: 64, align: 64, offset: 4096)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !53, file: !6, line: 153, baseType: !11, size: 64, align: 64, offset: 4160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !53, file: !6, line: 154, baseType: !11, size: 64, align: 64, offset: 4224)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !53, file: !6, line: 155, baseType: !79, size: 64, align: 64, offset: 4288)
!79 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !53, file: !6, line: 156, baseType: !10, size: 64, align: 64, offset: 4352)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !53, file: !6, line: 157, baseType: !13, size: 64, align: 64, offset: 4416)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !53, file: !6, line: 157, baseType: !13, size: 64, align: 64, offset: 4480)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !53, file: !6, line: 158, baseType: !25, size: 64, align: 64, offset: 4544)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !53, file: !6, line: 158, baseType: !25, size: 64, align: 64, offset: 4608)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !53, file: !6, line: 159, baseType: !25, size: 64, align: 64, offset: 4672)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !53, file: !6, line: 159, baseType: !25, size: 64, align: 64, offset: 4736)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !53, file: !6, line: 160, baseType: !11, size: 64, align: 64, offset: 4800)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !53, file: !6, line: 161, baseType: !11, size: 64, align: 64, offset: 4864)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !53, file: !6, line: 162, baseType: !11, size: 64, align: 64, offset: 4928)
!90 = !{!91, !92, !93, !96, !97, !98}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !48, file: !1, line: 28, type: !51)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arc", scope: !48, file: !1, line: 34, type: !4)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !48, file: !1, line: 35, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !6, line: 99, baseType: !15)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !48, file: !1, line: 35, type: !94)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "root", scope: !48, file: !1, line: 35, type: !94)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "off", scope: !48, file: !1, line: 36, type: !41)
!99 = !DISubprogram(name: "insert_new_arc", scope: !1, file: !1, line: 83, type: !100, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.arc*, i64, %struct.node*, %struct.node*, i64, i64)* @insert_new_arc, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !4, !11, !94, !94, !10, !10}
!102 = !{!103, !104, !105, !106, !107, !108, !109}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new", arg: 1, scope: !99, file: !1, line: 83, type: !4)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newpos", arg: 2, scope: !99, file: !1, line: 83, type: !11)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tail", arg: 3, scope: !99, file: !1, line: 83, type: !94)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 4, scope: !99, file: !1, line: 83, type: !94)
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cost", arg: 5, scope: !99, file: !1, line: 84, type: !10)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "red_cost", arg: 6, scope: !99, file: !1, line: 84, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !99, file: !1, line: 95, type: !11)
!110 = !DISubprogram(name: "replace_weaker_arc", scope: !1, file: !1, line: 129, type: !111, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.network*, %struct.arc*, %struct.node*, %struct.node*, i64, i64)* @replace_weaker_arc, variables: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !51, !4, !94, !94, !10, !10}
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !110, file: !1, line: 129, type: !51)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new", arg: 2, scope: !110, file: !1, line: 129, type: !4)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tail", arg: 3, scope: !110, file: !1, line: 129, type: !94)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 4, scope: !110, file: !1, line: 129, type: !94)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cost", arg: 5, scope: !110, file: !1, line: 130, type: !10)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "red_cost", arg: 6, scope: !110, file: !1, line: 130, type: !10)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !110, file: !1, line: 141, type: !11)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !110, file: !1, line: 142, type: !11)
!122 = !DISubprogram(name: "price_out_impl", scope: !1, file: !1, line: 194, type: !49, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.network*)* @price_out_impl, variables: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
