; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/mcfutil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i64, %struct.node*, %struct.node*, i32, %struct.arc*, %struct.arc*, i64, i64 }

@.str = private unnamed_addr constant [25 x i8] c"PRIMAL NETWORK SIMPLEX: \00", align 1
@.str1 = private unnamed_addr constant [49 x i8] c"artificial arc with nonzero flow, node %d (%ld)\0A\00", align 1
@.str2 = private unnamed_addr constant [31 x i8] c"basis primal infeasible (%ld)\0A\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str3 = private unnamed_addr constant [23 x i8] c"DUAL NETWORK SIMPLEX: \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !45, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/mcfutil.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !42, !11, !12, !33, !44}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !7, line: 99, baseType: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 107, size: 832, align: 64, elements: !9)
!9 = !{!10, !13, !15, !18, !19, !20, !21, !35, !36, !37, !38, !39, !40, !41}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !8, file: !7, line: 109, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !7, line: 69, baseType: !12)
!12 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !8, file: !7, line: 110, baseType: !14, size: 32, align: 32, offset: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !8, file: !7, line: 111, baseType: !16, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 100, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !8, file: !7, line: 112, baseType: !16, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !8, file: !7, line: 113, baseType: !16, size: 64, align: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !8, file: !7, line: 114, baseType: !16, size: 64, align: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !8, file: !7, line: 115, baseType: !22, size: 64, align: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 103, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 126, size: 512, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !24, file: !7, line: 128, baseType: !11, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !24, file: !7, line: 129, baseType: !16, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !24, file: !7, line: 129, baseType: !16, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !24, file: !7, line: 130, baseType: !14, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !24, file: !7, line: 131, baseType: !22, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !24, file: !7, line: 131, baseType: !22, size: 64, align: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !24, file: !7, line: 132, baseType: !33, size: 64, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !7, line: 68, baseType: !12)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !24, file: !7, line: 133, baseType: !11, size: 64, align: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !8, file: !7, line: 116, baseType: !22, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !8, file: !7, line: 116, baseType: !22, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !8, file: !7, line: 117, baseType: !22, size: 64, align: 64, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !8, file: !7, line: 118, baseType: !33, size: 64, align: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !8, file: !7, line: 119, baseType: !12, size: 64, align: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !8, file: !7, line: 120, baseType: !14, size: 32, align: 32, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !8, file: !7, line: 121, baseType: !14, size: 32, align: 32, offset: 800)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 102, baseType: !24)
!44 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!45 = !{!46, !92, !101, !111, !119, !128, !134}
!46 = !DISubprogram(name: "refresh_neighbour_lists", scope: !1, file: !1, line: 28, type: !47, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.network*)* @refresh_neighbour_lists, variables: !87)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !7, line: 163, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !7, line: 138, size: 4992, align: 64, elements: !52)
!52 = !{!53, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !51, file: !7, line: 140, baseType: !54, size: 1600, align: 8)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 1600, align: 8, elements: !56)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !{!57}
!57 = !DISubrange(count: 200)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !51, file: !7, line: 141, baseType: !54, size: 1600, align: 8, offset: 1600)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !51, file: !7, line: 142, baseType: !12, size: 64, align: 64, offset: 3200)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !51, file: !7, line: 142, baseType: !12, size: 64, align: 64, offset: 3264)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3328)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3392)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3456)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3520)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !51, file: !7, line: 144, baseType: !12, size: 64, align: 64, offset: 3584)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !51, file: !7, line: 144, baseType: !12, size: 64, align: 64, offset: 3648)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !51, file: !7, line: 146, baseType: !12, size: 64, align: 64, offset: 3712)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !51, file: !7, line: 147, baseType: !12, size: 64, align: 64, offset: 3776)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !51, file: !7, line: 148, baseType: !12, size: 64, align: 64, offset: 3840)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !51, file: !7, line: 149, baseType: !12, size: 64, align: 64, offset: 3904)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !51, file: !7, line: 150, baseType: !12, size: 64, align: 64, offset: 3968)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !51, file: !7, line: 151, baseType: !12, size: 64, align: 64, offset: 4032)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !51, file: !7, line: 152, baseType: !12, size: 64, align: 64, offset: 4096)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !51, file: !7, line: 153, baseType: !12, size: 64, align: 64, offset: 4160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !51, file: !7, line: 154, baseType: !12, size: 64, align: 64, offset: 4224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !51, file: !7, line: 155, baseType: !44, size: 64, align: 64, offset: 4288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !51, file: !7, line: 156, baseType: !11, size: 64, align: 64, offset: 4352)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !51, file: !7, line: 157, baseType: !16, size: 64, align: 64, offset: 4416)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !51, file: !7, line: 157, baseType: !16, size: 64, align: 64, offset: 4480)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !51, file: !7, line: 158, baseType: !22, size: 64, align: 64, offset: 4544)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !51, file: !7, line: 158, baseType: !22, size: 64, align: 64, offset: 4608)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !51, file: !7, line: 159, baseType: !22, size: 64, align: 64, offset: 4672)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !51, file: !7, line: 159, baseType: !22, size: 64, align: 64, offset: 4736)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !51, file: !7, line: 160, baseType: !12, size: 64, align: 64, offset: 4800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !51, file: !7, line: 161, baseType: !12, size: 64, align: 64, offset: 4864)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !51, file: !7, line: 162, baseType: !12, size: 64, align: 64, offset: 4928)
!87 = !{!88, !89, !90, !91}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !46, file: !1, line: 28, type: !49)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !46, file: !1, line: 34, type: !5)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arc", scope: !46, file: !1, line: 35, type: !42)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !46, file: !1, line: 36, type: !4)
!92 = !DISubprogram(name: "refresh_potential", scope: !1, file: !1, line: 68, type: !93, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.network*)* @refresh_potential, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{!12, !49}
!95 = !{!96, !97, !98, !99, !100}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !92, file: !1, line: 68, type: !49)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !92, file: !1, line: 74, type: !5)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !92, file: !1, line: 74, type: !5)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "root", scope: !92, file: !1, line: 75, type: !5)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "checksum", scope: !92, file: !1, line: 76, type: !12)
!101 = !DISubprogram(name: "flow_cost", scope: !1, file: !1, line: 122, type: !102, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct.network*)* @flow_cost, variables: !104)
!102 = !DISubroutineType(types: !103)
!103 = !{!44, !49}
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !101, file: !1, line: 122, type: !49)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arc", scope: !101, file: !1, line: 128, type: !42)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !101, file: !1, line: 129, type: !5)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !101, file: !1, line: 130, type: !4)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fleet", scope: !101, file: !1, line: 132, type: !12)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operational_cost", scope: !101, file: !1, line: 133, type: !11)
!111 = !DISubprogram(name: "flow_org_cost", scope: !1, file: !1, line: 181, type: !102, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct.network*)* @flow_org_cost, variables: !112)
!112 = !{!113, !114, !115, !116, !117, !118}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !111, file: !1, line: 181, type: !49)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arc", scope: !111, file: !1, line: 187, type: !42)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !111, file: !1, line: 188, type: !5)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !111, file: !1, line: 189, type: !4)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fleet", scope: !111, file: !1, line: 191, type: !12)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operational_cost", scope: !111, file: !1, line: 192, type: !11)
!119 = !DISubprogram(name: "primal_feasible", scope: !1, file: !1, line: 239, type: !93, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.network*)* @primal_feasible, variables: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !119, file: !1, line: 239, type: !49)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !119, file: !1, line: 245, type: !4)
