; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/pbeampp.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.basket = type { %struct.arc*, i64, i64 }
%struct.arc = type { i64, %struct.node*, %struct.node*, i32, %struct.arc*, %struct.arc*, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }

@perm = internal unnamed_addr global [351 x %struct.basket*] zeroinitializer, align 16
@initialize = internal unnamed_addr global i1 false
@basket = internal global [351 x %struct.basket] zeroinitializer, align 16
@nr_group = internal unnamed_addr global i64 0, align 8
@group_pos = internal unnamed_addr global i64 0, align 8
@basket_size = internal unnamed_addr global i64 0, align 8

; Function Attrs: nounwind optsize readonly ssp uwtable
define i32 @bea_is_dual_infeasible(%struct.arc* nocapture readonly %arc, i64 %red_cost) #0 {
  tail call void @llvm.dbg.value(metadata %struct.arc* %arc, i64 0, metadata !46, metadata !94), !dbg !95
  tail call void @llvm.dbg.value(metadata i64 %red_cost, i64 0, metadata !47, metadata !94), !dbg !96
  %1 = icmp slt i64 %red_cost, 0, !dbg !97
  br i1 %1, label %2, label %6, !dbg !98

; <label>:2                                       ; preds = %0
  %3 = getelementptr inbounds %struct.arc* %arc, i64 0, i32 3, !dbg !99

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !79, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/pbeampp.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!5 = !{!6, !48, !65}
!6 = !DISubprogram(name: "bea_is_dual_infeasible", scope: !1, file: !1, line: 34, type: !7, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arc*, i64)* @bea_is_dual_infeasible, variables: !45)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10, !16}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !12, line: 102, baseType: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !12, line: 126, size: 512, align: 64, elements: !14)
!14 = !{!15, !17, !39, !40, !41, !42, !43, !44}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !13, file: !12, line: 128, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !12, line: 69, baseType: !4)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !13, file: !12, line: 129, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !12, line: 100, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !12, line: 107, size: 832, align: 64, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !31, !32, !33, !34, !36, !37, !38}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !20, file: !12, line: 109, baseType: !16, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !20, file: !12, line: 110, baseType: !9, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !20, file: !12, line: 111, baseType: !18, size: 64, align: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !20, file: !12, line: 112, baseType: !18, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !20, file: !12, line: 113, baseType: !18, size: 64, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !20, file: !12, line: 114, baseType: !18, size: 64, align: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !20, file: !12, line: 115, baseType: !29, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !12, line: 103, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !20, file: !12, line: 116, baseType: !29, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !20, file: !12, line: 116, baseType: !29, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !20, file: !12, line: 117, baseType: !29, size: 64, align: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !20, file: !12, line: 118, baseType: !35, size: 64, align: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !12, line: 68, baseType: !4)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !20, file: !12, line: 119, baseType: !4, size: 64, align: 64, offset: 704)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !20, file: !12, line: 120, baseType: !9, size: 32, align: 32, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !20, file: !12, line: 121, baseType: !9, size: 32, align: 32, offset: 800)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !13, file: !12, line: 129, baseType: !18, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !13, file: !12, line: 130, baseType: !9, size: 32, align: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !13, file: !12, line: 131, baseType: !29, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !13, file: !12, line: 131, baseType: !29, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !13, file: !12, line: 132, baseType: !35, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !13, file: !12, line: 133, baseType: !16, size: 64, align: 64, offset: 448)
!45 = !{!46, !47}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arc", arg: 1, scope: !6, file: !1, line: 34, type: !10)
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "red_cost", arg: 2, scope: !6, file: !1, line: 34, type: !16)
!48 = !DISubprogram(name: "sort_basket", scope: !1, file: !1, line: 65, type: !49, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, i64)* @sort_basket, variables: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !4, !4}
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min", arg: 1, scope: !48, file: !1, line: 65, type: !4)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max", arg: 2, scope: !48, file: !1, line: 65, type: !4)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !48, file: !1, line: 71, type: !4)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !48, file: !1, line: 71, type: !4)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cut", scope: !48, file: !1, line: 72, type: !16)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xchange", scope: !48, file: !1, line: 73, type: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "BASKET", file: !1, line: 56, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "basket", file: !1, line: 51, size: 192, align: 64, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !60, file: !1, line: 53, baseType: !10, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !60, file: !1, line: 54, baseType: !16, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "abs_cost", scope: !60, file: !1, line: 55, baseType: !16, size: 64, align: 64, offset: 128)
!65 = !DISubprogram(name: "primal_bea_mpp", scope: !1, file: !1, line: 119, type: !66, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: %struct.arc* (i64, %struct.arc*, %struct.arc*, i64*)* @primal_bea_mpp, variables: !69)
!66 = !DISubroutineType(types: !67)
!67 = !{!10, !4, !10, !10, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !65, file: !1, line: 119, type: !4)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arcs", arg: 2, scope: !65, file: !1, line: 119, type: !10)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stop_arcs", arg: 3, scope: !65, file: !1, line: 119, type: !10)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "red_cost_of_bea", arg: 4, scope: !65, file: !1, line: 120, type: !68)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !65, file: !1, line: 129, type: !4)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !65, file: !1, line: 129, type: !4)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_group_pos", scope: !65, file: !1, line: 129, type: !4)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arc", scope: !65, file: !1, line: 130, type: !10)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "red_cost", scope: !65, file: !1, line: 131, type: !16)
!79 = !{!80, !81, !85, !87, !88, !89}
!80 = !DIGlobalVariable(name: "basket_size", scope: !0, file: !1, line: 58, type: !4, isLocal: true, isDefinition: true, variable: i64* @basket_size)
!81 = !DIGlobalVariable(name: "basket", scope: !0, file: !1, line: 59, type: !82, isLocal: true, isDefinition: true, variable: [351 x %struct.basket]* @basket)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 67392, align: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 351)
!85 = !DIGlobalVariable(name: "perm", scope: !0, file: !1, line: 60, type: !86, isLocal: true, isDefinition: true, variable: [351 x %struct.basket*]* @perm)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 22464, align: 64, elements: !83)
!87 = !DIGlobalVariable(name: "nr_group", scope: !0, file: !1, line: 111, type: !4, isLocal: true, isDefinition: true, variable: i64* @nr_group)
!88 = !DIGlobalVariable(name: "group_pos", scope: !0, file: !1, line: 112, type: !4, isLocal: true, isDefinition: true, variable: i64* @group_pos)
!89 = !DIGlobalVariable(name: "initialize", scope: !0, file: !1, line: 115, type: !4, isLocal: true, isDefinition: true)
!90 = !{i32 2, !"Dwarf Version", i32 2}
!91 = !{i32 2, !"Debug Info Version", i32 700000003}
!92 = !{i32 1, !"PIC Level", i32 2}
!93 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!94 = !DIExpression()
!95 = !DILocation(line: 34, column: 36, scope: !6)
!96 = !DILocation(line: 34, column: 48, scope: !6)
!97 = !DILocation(line: 41, column: 26, scope: !6)
!98 = !DILocation(line: 41, column: 30, scope: !6)
!99 = !DILocation(line: 41, column: 38, scope: !6)
!100 = !{!101, !106, i64 24}
!101 = !{!"arc", !102, i64 0, !105, i64 8, !105, i64 16, !106, i64 24, !105, i64 32, !105, i64 40, !102, i64 48, !102, i64 56}
!102 = !{!"long", !103, i64 0}
!103 = !{!"omnipotent char", !104, i64 0}
!104 = !{!"Simple C/C++ TBAA"}
!105 = !{!"any pointer", !103, i64 0}
!106 = !{!"int", !103, i64 0}
!107 = !DILocation(line: 41, column: 44, scope: !6)
!108 = !DILocation(line: 42, column: 13, scope: !6)
!109 = !DILocation(line: 42, column: 26, scope: !6)
!110 = !DILocation(line: 42, column: 30, scope: !6)
!111 = !DILocation(line: 42, column: 38, scope: !6)
!112 = !DILocation(line: 42, column: 44, scope: !6)
!113 = !DILocation(line: 41, column: 5, scope: !6)
!114 = !DILocation(line: 65, column: 24, scope: !48)
