; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/psimplex.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i64, %struct.node*, %struct.node*, i32, %struct.arc*, %struct.arc*, i64, i64 }

; Function Attrs: nounwind optsize ssp uwtable
define i64 @primal_net_simplex(%struct.network* %net) #0 {
.critedge:
  %delta = alloca i64, align 8
  %xchange = alloca i64, align 8
  %w = alloca %struct.node*, align 8
  %red_cost_of_bea = alloca i64, align 8
  tail call void @llvm.dbg.value(metadata %struct.network* %net, i64 0, metadata !83, metadata !114), !dbg !115
  tail call void @llvm.dbg.value(metadata i64 0, i64 0, metadata !86, metadata !114), !dbg !116
  %0 = getelementptr inbounds %struct.network* %net, i64 0, i32 23, !dbg !117
  %1 = load %struct.arc** %0, align 8, !dbg !117, !tbaa !118
  tail call void @llvm.dbg.value(metadata %struct.arc* %1, i64 0, metadata !100, metadata !114), !dbg !125
  %2 = getelementptr inbounds %struct.network* %net, i64 0, i32 24, !dbg !126

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/psimplex.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !5, line: 68, baseType: !6)
!5 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!7 = !{!8}
!8 = !DISubprogram(name: "primal_net_simplex", scope: !1, file: !1, line: 30, type: !9, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.network*)* @primal_net_simplex, variables: !82)
!9 = !DISubroutineType(types: !10)
!10 = !{!6, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !5, line: 163, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !5, line: 138, size: 4992, align: 64, elements: !14)
!14 = !{!15, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !40, !42, !74, !75, !76, !77, !78, !79, !80, !81}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !13, file: !5, line: 140, baseType: !16, size: 1600, align: 8)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1600, align: 8, elements: !18)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !{!19}
!19 = !DISubrange(count: 200)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !13, file: !5, line: 141, baseType: !16, size: 1600, align: 8, offset: 1600)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !13, file: !5, line: 142, baseType: !6, size: 64, align: 64, offset: 3200)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !13, file: !5, line: 142, baseType: !6, size: 64, align: 64, offset: 3264)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !13, file: !5, line: 143, baseType: !6, size: 64, align: 64, offset: 3328)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !13, file: !5, line: 143, baseType: !6, size: 64, align: 64, offset: 3392)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !13, file: !5, line: 143, baseType: !6, size: 64, align: 64, offset: 3456)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !13, file: !5, line: 143, baseType: !6, size: 64, align: 64, offset: 3520)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !13, file: !5, line: 144, baseType: !6, size: 64, align: 64, offset: 3584)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !13, file: !5, line: 144, baseType: !6, size: 64, align: 64, offset: 3648)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !13, file: !5, line: 146, baseType: !6, size: 64, align: 64, offset: 3712)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !13, file: !5, line: 147, baseType: !6, size: 64, align: 64, offset: 3776)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !13, file: !5, line: 148, baseType: !6, size: 64, align: 64, offset: 3840)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !13, file: !5, line: 149, baseType: !6, size: 64, align: 64, offset: 3904)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !13, file: !5, line: 150, baseType: !6, size: 64, align: 64, offset: 3968)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !13, file: !5, line: 151, baseType: !6, size: 64, align: 64, offset: 4032)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !13, file: !5, line: 152, baseType: !6, size: 64, align: 64, offset: 4096)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !13, file: !5, line: 153, baseType: !6, size: 64, align: 64, offset: 4160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !13, file: !5, line: 154, baseType: !6, size: 64, align: 64, offset: 4224)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !13, file: !5, line: 155, baseType: !39, size: 64, align: 64, offset: 4288)
!39 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !13, file: !5, line: 156, baseType: !41, size: 64, align: 64, offset: 4352)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !5, line: 69, baseType: !6)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !13, file: !5, line: 157, baseType: !43, size: 64, align: 64, offset: 4416)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !5, line: 100, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !5, line: 107, size: 832, align: 64, elements: !46)
!46 = !{!47, !48, !50, !51, !52, !53, !54, !67, !68, !69, !70, !71, !72, !73}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !45, file: !5, line: 109, baseType: !41, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !45, file: !5, line: 110, baseType: !49, size: 32, align: 32, offset: 64)
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !45, file: !5, line: 111, baseType: !43, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !45, file: !5, line: 112, baseType: !43, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !45, file: !5, line: 113, baseType: !43, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !45, file: !5, line: 114, baseType: !43, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !45, file: !5, line: 115, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !5, line: 103, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !5, line: 126, size: 512, align: 64, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !57, file: !5, line: 128, baseType: !41, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !57, file: !5, line: 129, baseType: !43, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !57, file: !5, line: 129, baseType: !43, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !57, file: !5, line: 130, baseType: !49, size: 32, align: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !57, file: !5, line: 131, baseType: !55, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !57, file: !5, line: 131, baseType: !55, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !57, file: !5, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !57, file: !5, line: 133, baseType: !41, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !45, file: !5, line: 116, baseType: !55, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !45, file: !5, line: 116, baseType: !55, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !45, file: !5, line: 117, baseType: !55, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !45, file: !5, line: 118, baseType: !4, size: 64, align: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !45, file: !5, line: 119, baseType: !6, size: 64, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !45, file: !5, line: 120, baseType: !49, size: 32, align: 32, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !45, file: !5, line: 121, baseType: !49, size: 32, align: 32, offset: 800)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !13, file: !5, line: 157, baseType: !43, size: 64, align: 64, offset: 4480)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !13, file: !5, line: 158, baseType: !55, size: 64, align: 64, offset: 4544)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !13, file: !5, line: 158, baseType: !55, size: 64, align: 64, offset: 4608)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !13, file: !5, line: 159, baseType: !55, size: 64, align: 64, offset: 4672)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !13, file: !5, line: 159, baseType: !55, size: 64, align: 64, offset: 4736)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !13, file: !5, line: 160, baseType: !6, size: 64, align: 64, offset: 4800)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !13, file: !5, line: 161, baseType: !6, size: 64, align: 64, offset: 4864)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !13, file: !5, line: 162, baseType: !6, size: 64, align: 64, offset: 4928)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !96, !99, !100, !101, !102, !103, !104, !105, !106, !108, !109}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !8, file: !1, line: 30, type: !11)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !8, file: !1, line: 36, type: !4)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_flow", scope: !8, file: !1, line: 37, type: !4)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opt", scope: !8, file: !1, line: 38, type: !6)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xchange", scope: !8, file: !1, line: 39, type: !6)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_orientation", scope: !8, file: !1, line: 40, type: !6)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iplus", scope: !8, file: !1, line: 41, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !5, line: 99, baseType: !45)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jplus", scope: !8, file: !1, line: 42, type: !90)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iminus", scope: !8, file: !1, line: 43, type: !90)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jminus", scope: !8, file: !1, line: 44, type: !90)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !8, file: !1, line: 45, type: !90)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bea", scope: !8, file: !1, line: 46, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !5, line: 102, baseType: !57)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bla", scope: !8, file: !1, line: 47, type: !97)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arcs", scope: !8, file: !1, line: 48, type: !97)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop_arcs", scope: !8, file: !1, line: 49, type: !97)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !8, file: !1, line: 50, type: !90)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !8, file: !1, line: 51, type: !6)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_set", scope: !8, file: !1, line: 52, type: !6)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "red_cost_of_bea", scope: !8, file: !1, line: 53, type: !41)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterations", scope: !8, file: !1, line: 54, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bound_exchanges", scope: !8, file: !1, line: 55, type: !107)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "checksum", scope: !8, file: !1, line: 56, type: !107)
!110 = !{i32 2, !"Dwarf Version", i32 2}
!111 = !{i32 2, !"Debug Info Version", i32 700000003}
!112 = !{i32 1, !"PIC Level", i32 2}
!113 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!114 = !DIExpression()
!115 = !DILocation(line: 30, column: 37, scope: !8)
!116 = !DILocation(line: 38, column: 19, scope: !8)
!117 = !DILocation(line: 48, column: 41, scope: !8)
!118 = !{!119, !124, i64 568}
!119 = !{!"network", !120, i64 0, !120, i64 200, !122, i64 400, !122, i64 408, !122, i64 416, !122, i64 424, !122, i64 432, !122, i64 440, !122, i64 448, !122, i64 456, !122, i64 464, !122, i64 472, !122, i64 480, !122, i64 488, !122, i64 496, !122, i64 504, !122, i64 512, !122, i64 520, !122, i64 528, !123, i64 536, !122, i64 544, !124, i64 552, !124, i64 560, !124, i64 568, !124, i64 576, !124, i64 584, !124, i64 592, !122, i64 600, !122, i64 608, !122, i64 616}
!120 = !{!"omnipotent char", !121, i64 0}
