; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/readmin.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.network = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, double, i64, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i64 }
%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i64, %struct.node*, %struct.node*, i32, %struct.arc*, %struct.arc*, i64, i64 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str1 = private unnamed_addr constant [8 x i8] c"%ld %ld\00", align 1
@.str5 = private unnamed_addr constant [12 x i8] c"%ld %ld %ld\00", align 1
@str = private unnamed_addr constant [30 x i8] c"read_min(): not enough memory\00"

; Function Attrs: nounwind optsize ssp uwtable
define i64 @read_min(%struct.network* %net) #0 {
  %instring = alloca [201 x i8], align 16
  %t = alloca i64, align 8
  %h = alloca i64, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !45, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/readmin.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !42, !33, !11, !12, !44}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !7, line: 99, baseType: !8)
!7 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !7, line: 107, size: 832, align: 64, elements: !9)
!9 = !{!10, !13, !15, !18, !19, !20, !21, !35, !36, !37, !38, !39, !40, !41}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !8, file: !7, line: 109, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !7, line: 69, baseType: !12)
!12 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !8, file: !7, line: 110, baseType: !14, size: 32, align: 32, offset: 64)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !8, file: !7, line: 111, baseType: !16, size: 64, align: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !7, line: 100, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !8, file: !7, line: 112, baseType: !16, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !8, file: !7, line: 113, baseType: !16, size: 64, align: 64, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !8, file: !7, line: 114, baseType: !16, size: 64, align: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !8, file: !7, line: 115, baseType: !22, size: 64, align: 64, offset: 384)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !7, line: 103, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !7, line: 126, size: 512, align: 64, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !24, file: !7, line: 128, baseType: !11, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !24, file: !7, line: 129, baseType: !16, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !24, file: !7, line: 129, baseType: !16, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !24, file: !7, line: 130, baseType: !14, size: 32, align: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !24, file: !7, line: 131, baseType: !22, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !24, file: !7, line: 131, baseType: !22, size: 64, align: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !24, file: !7, line: 132, baseType: !33, size: 64, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !7, line: 68, baseType: !12)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !24, file: !7, line: 133, baseType: !11, size: 64, align: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !8, file: !7, line: 116, baseType: !22, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !8, file: !7, line: 116, baseType: !22, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !8, file: !7, line: 117, baseType: !22, size: 64, align: 64, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !8, file: !7, line: 118, baseType: !33, size: 64, align: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !8, file: !7, line: 119, baseType: !12, size: 64, align: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !8, file: !7, line: 120, baseType: !14, size: 32, align: 32, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !8, file: !7, line: 121, baseType: !14, size: 32, align: 32, offset: 800)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !7, line: 102, baseType: !24)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !{!46}
!46 = !DISubprogram(name: "read_min", scope: !1, file: !1, line: 29, type: !47, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.network*)* @read_min, variables: !87)
!47 = !DISubroutineType(types: !48)
!48 = !{!12, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "network_t", file: !7, line: 163, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "network", file: !7, line: 138, size: 4992, align: 64, elements: !52)
!52 = !{!53, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "inputfile", scope: !51, file: !7, line: 140, baseType: !54, size: 1600, align: 8)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1600, align: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 200)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "clustfile", scope: !51, file: !7, line: 141, baseType: !54, size: 1600, align: 8, offset: 1600)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !51, file: !7, line: 142, baseType: !12, size: 64, align: 64, offset: 3200)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n_trips", scope: !51, file: !7, line: 142, baseType: !12, size: 64, align: 64, offset: 3264)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "max_m", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3328)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3392)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m_org", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3456)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "m_impl", scope: !51, file: !7, line: 143, baseType: !12, size: 64, align: 64, offset: 3520)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "max_residual_new_m", scope: !51, file: !7, line: 144, baseType: !12, size: 64, align: 64, offset: 3584)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_new_m", scope: !51, file: !7, line: 144, baseType: !12, size: 64, align: 64, offset: 3648)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "primal_unbounded", scope: !51, file: !7, line: 146, baseType: !12, size: 64, align: 64, offset: 3712)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "dual_unbounded", scope: !51, file: !7, line: 147, baseType: !12, size: 64, align: 64, offset: 3776)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "perturbed", scope: !51, file: !7, line: 148, baseType: !12, size: 64, align: 64, offset: 3840)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "feasible", scope: !51, file: !7, line: 149, baseType: !12, size: 64, align: 64, offset: 3904)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !51, file: !7, line: 150, baseType: !12, size: 64, align: 64, offset: 3968)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tol", scope: !51, file: !7, line: 151, baseType: !12, size: 64, align: 64, offset: 4032)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "feas_tol", scope: !51, file: !7, line: 152, baseType: !12, size: 64, align: 64, offset: 4096)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pert_val", scope: !51, file: !7, line: 153, baseType: !12, size: 64, align: 64, offset: 4160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bigM", scope: !51, file: !7, line: 154, baseType: !12, size: 64, align: 64, offset: 4224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "optcost", scope: !51, file: !7, line: 155, baseType: !76, size: 64, align: 64, offset: 4288)
!76 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_impl", scope: !51, file: !7, line: 156, baseType: !11, size: 64, align: 64, offset: 4352)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !51, file: !7, line: 157, baseType: !16, size: 64, align: 64, offset: 4416)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stop_nodes", scope: !51, file: !7, line: 157, baseType: !16, size: 64, align: 64, offset: 4480)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !51, file: !7, line: 158, baseType: !22, size: 64, align: 64, offset: 4544)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "stop_arcs", scope: !51, file: !7, line: 158, baseType: !22, size: 64, align: 64, offset: 4608)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_arcs", scope: !51, file: !7, line: 159, baseType: !22, size: 64, align: 64, offset: 4672)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stop_dummy", scope: !51, file: !7, line: 159, baseType: !22, size: 64, align: 64, offset: 4736)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !51, file: !7, line: 160, baseType: !12, size: 64, align: 64, offset: 4800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bound_exchanges", scope: !51, file: !7, line: 161, baseType: !12, size: 64, align: 64, offset: 4864)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !51, file: !7, line: 162, baseType: !12, size: 64, align: 64, offset: 4928)
!87 = !{!88, !89, !151, !155, !156, !157, !158, !159, !160}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "net", arg: 1, scope: !46, file: !1, line: 29, type: !49)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !46, file: !1, line: 35, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !92, line: 153, baseType: !93)
!92 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !92, line: 122, size: 1216, align: 64, elements: !94)
!94 = !{!95, !98, !99, !100, !102, !103, !108, !109, !110, !114, !119, !129, !135, !136, !139, !140, !144, !148, !149, !150}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !93, file: !92, line: 123, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !93, file: !92, line: 124, baseType: !14, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !93, file: !92, line: 125, baseType: !14, size: 32, align: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !93, file: !92, line: 126, baseType: !101, size: 16, align: 16, offset: 128)
!101 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !93, file: !92, line: 127, baseType: !101, size: 16, align: 16, offset: 144)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !93, file: !92, line: 128, baseType: !104, size: 128, align: 64, offset: 192)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !92, line: 88, size: 128, align: 64, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !104, file: !92, line: 89, baseType: !96, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !104, file: !92, line: 90, baseType: !14, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !93, file: !92, line: 129, baseType: !14, size: 32, align: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !93, file: !92, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !93, file: !92, line: 133, baseType: !111, size: 64, align: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!14, !4}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !93, file: !92, line: 134, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!14, !4, !118, !14}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !93, file: !92, line: 135, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !4, !123, !14}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !92, line: 77, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !125, line: 71, baseType: !126)
!125 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!128 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !93, file: !92, line: 136, baseType: !130, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!14, !4, !133, !14}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !93, file: !92, line: 139, baseType: !104, size: 128, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !93, file: !92, line: 140, baseType: !137, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !92, line: 94, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !93, file: !92, line: 141, baseType: !14, size: 32, align: 32, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !93, file: !92, line: 144, baseType: !141, size: 24, align: 8, offset: 928)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 24, align: 8, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 3)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !93, file: !92, line: 145, baseType: !145, size: 8, align: 8, offset: 952)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 8, align: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 1)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !93, file: !92, line: 148, baseType: !104, size: 128, align: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !93, file: !92, line: 151, baseType: !14, size: 32, align: 32, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !93, file: !92, line: 152, baseType: !123, size: 64, align: 64, offset: 1152)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instring", scope: !46, file: !1, line: 36, type: !152)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1608, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 201)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !46, file: !1, line: 37, type: !12)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !46, file: !1, line: 37, type: !12)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !46, file: !1, line: 37, type: !12)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !46, file: !1, line: 38, type: !12)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arc", scope: !46, file: !1, line: 39, type: !42)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !46, file: !1, line: 40, type: !5)
!161 = !{i32 2, !"Dwarf Version", i32 2}
!162 = !{i32 2, !"Debug Info Version", i32 700000003}
!163 = !{i32 1, !"PIC Level", i32 2}
!164 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!165 = !DIExpression()
!166 = !DILocation(line: 29, column: 27, scope: !46)
!167 = !DILocation(line: 35, column: 11, scope: !46)
!168 = !DILocation(line: 36, column: 5, scope: !46)
!169 = !DILocation(line: 36, column: 10, scope: !46)
!170 = !DILocation(line: 43, column: 22, scope: !171)
!171 = distinct !DILexicalBlock(scope: !46, file: !1, line: 43, column: 8)
!172 = !DILocation(line: 43, column: 15, scope: !171)
!173 = !DILocation(line: 43, column: 44, scope: !171)
!174 = !DILocation(line: 43, column: 8, scope: !46)
!175 = !DILocation(line: 46, column: 5, scope: !46)
!176 = !DILocation(line: 37, column: 10, scope: !46)
!177 = !DILocation(line: 37, column: 13, scope: !46)
!178 = !DILocation(line: 47, column: 9, scope: !179)
!179 = distinct !DILexicalBlock(scope: !46, file: !1, line: 47, column: 9)
!180 = !DILocation(line: 47, column: 47, scope: !179)
!181 = !DILocation(line: 47, column: 9, scope: !46)
!182 = !DILocation(line: 51, column: 20, scope: !46)
!183 = !{!184, !184, i64 0}
!184 = !{!"long", !185, i64 0}
!185 = !{!"omnipotent char", !186, i64 0}
!186 = !{!"Simple C/C++ TBAA"}
!187 = !DILocation(line: 51, column: 10, scope: !46)
!188 = !DILocation(line: 51, column: 18, scope: !46)
!189 = !{!190, !184, i64 408}
!190 = !{!"network", !185, i64 0, !185, i64 200, !184, i64 400, !184, i64 408, !184, i64 416, !184, i64 424, !184, i64 432, !184, i64 440, !184, i64 448, !184, i64 456, !184, i64 464, !184, i64 472, !184, i64 480, !184, i64 488, !184, i64 496, !184, i64 504, !184, i64 512, !184, i64 520, !184, i64 528, !191, i64 536, !184, i64 544, !192, i64 552, !192, i64 560, !192, i64 568, !192, i64 576, !192, i64 584, !192, i64 592, !184, i64 600, !184, i64 608, !184, i64 616}
!191 = !{!"double", !185, i64 0}
!192 = !{!"any pointer", !185, i64 0}
!193 = !DILocation(line: 52, column: 18, scope: !46)
!194 = !DILocation(line: 52, column: 10, scope: !46)
!195 = !DILocation(line: 52, column: 16, scope: !46)
!196 = !{!190, !184, i64 432}
!197 = !DILocation(line: 53, column: 16, scope: !46)
!198 = !DILocation(line: 53, column: 18, scope: !46)
!199 = !DILocation(line: 53, column: 10, scope: !46)
!200 = !DILocation(line: 53, column: 12, scope: !46)
!201 = !{!190, !184, i64 400}
!202 = !DILocation(line: 54, column: 18, scope: !46)
!203 = !DILocation(line: 54, column: 20, scope: !46)
!204 = !DILocation(line: 54, column: 10, scope: !46)
!205 = !DILocation(line: 54, column: 12, scope: !46)
!206 = !{!190, !184, i64 424}
!207 = !DILocation(line: 56, column: 22, scope: !208)
!208 = distinct !DILexicalBlock(scope: !46, file: !1, line: 56, column: 9)
!209 = !DILocation(line: 58, column: 12, scope: !210)
!210 = distinct !DILexicalBlock(scope: !208, file: !1, line: 57, column: 5)
!211 = !DILocation(line: 56, column: 9, scope: !46)
