; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/treeup.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.node = type { i64, i32, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, %struct.arc*, %struct.arc*, %struct.arc*, i64, i64, i32, i32 }
%struct.arc = type { i64, %struct.node*, %struct.node*, i32, %struct.arc*, %struct.arc*, i64, i64 }

; Function Attrs: nounwind optsize ssp uwtable
define void @update_tree(i64 %cycle_ori, i64 %new_orientation, i64 %delta, i64 %new_flow, %struct.node* %iplus, %struct.node* %jplus, %struct.node* %iminus, %struct.node* %jminus, %struct.node* readnone %w, %struct.arc* %bea, i64 %sigma, i64 %feas_tol) #0 {
  tail call void @llvm.dbg.value(metadata i64 %cycle_ori, i64 0, metadata !47, metadata !73), !dbg !74
  tail call void @llvm.dbg.value(metadata i64 %new_orientation, i64 0, metadata !48, metadata !73), !dbg !75
  tail call void @llvm.dbg.value(metadata i64 %delta, i64 0, metadata !49, metadata !73), !dbg !76
  tail call void @llvm.dbg.value(metadata i64 %new_flow, i64 0, metadata !50, metadata !73), !dbg !77
  tail call void @llvm.dbg.value(metadata %struct.node* %iplus, i64 0, metadata !51, metadata !73), !dbg !78
  tail call void @llvm.dbg.value(metadata %struct.node* %jplus, i64 0, metadata !52, metadata !73), !dbg !79
  tail call void @llvm.dbg.value(metadata %struct.node* %iminus, i64 0, metadata !53, metadata !73), !dbg !80

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/treeup.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "update_tree", scope: !1, file: !1, line: 29, type: !5, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, i64, i64, i64, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.node*, %struct.arc*, i64, i64)* @update_tree, variables: !46)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7, !7, !8, !8, !10, !10, !10, !10, !10, !44, !15, !8}
!7 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "flow_t", file: !9, line: 68, baseType: !7)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/429.mcf/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !9, line: 99, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "node", file: !9, line: 107, size: 832, align: 64, elements: !13)
!13 = !{!14, !16, !18, !21, !22, !23, !24, !37, !38, !39, !40, !41, !42, !43}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "potential", scope: !12, file: !9, line: 109, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cost_t", file: !9, line: 69, baseType: !7)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !12, file: !9, line: 110, baseType: !17, size: 32, align: 32, offset: 64)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !12, file: !9, line: 111, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_p", file: !9, line: 100, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pred", scope: !12, file: !9, line: 112, baseType: !19, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !12, file: !9, line: 113, baseType: !19, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sibling_prev", scope: !12, file: !9, line: 114, baseType: !19, size: 64, align: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "basic_arc", scope: !12, file: !9, line: 115, baseType: !25, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_p", file: !9, line: 103, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "arc", file: !9, line: 126, size: 512, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !27, file: !9, line: 128, baseType: !15, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !27, file: !9, line: 129, baseType: !19, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !27, file: !9, line: 129, baseType: !19, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !27, file: !9, line: 130, baseType: !17, size: 32, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nextout", scope: !27, file: !9, line: 131, baseType: !25, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nextin", scope: !27, file: !9, line: 131, baseType: !25, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !27, file: !9, line: 132, baseType: !8, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "org_cost", scope: !27, file: !9, line: 133, baseType: !15, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "firstout", scope: !12, file: !9, line: 116, baseType: !25, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "firstin", scope: !12, file: !9, line: 116, baseType: !25, size: 64, align: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "arc_tmp", scope: !12, file: !9, line: 117, baseType: !25, size: 64, align: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !12, file: !9, line: 118, baseType: !8, size: 64, align: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !12, file: !9, line: 119, baseType: !7, size: 64, align: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !12, file: !9, line: 120, baseType: !17, size: 32, align: 32, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !12, file: !9, line: 121, baseType: !17, size: 32, align: 32, offset: 800)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc_t", file: !9, line: 102, baseType: !27)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cycle_ori", arg: 1, scope: !4, file: !1, line: 30, type: !7)
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_orientation", arg: 2, scope: !4, file: !1, line: 31, type: !7)
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delta", arg: 3, scope: !4, file: !1, line: 32, type: !8)
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_flow", arg: 4, scope: !4, file: !1, line: 33, type: !8)
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iplus", arg: 5, scope: !4, file: !1, line: 34, type: !10)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jplus", arg: 6, scope: !4, file: !1, line: 35, type: !10)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iminus", arg: 7, scope: !4, file: !1, line: 36, type: !10)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "jminus", arg: 8, scope: !4, file: !1, line: 37, type: !10)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 9, scope: !4, file: !1, line: 38, type: !10)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bea", arg: 10, scope: !4, file: !1, line: 39, type: !44)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sigma", arg: 11, scope: !4, file: !1, line: 40, type: !15)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "feas_tol", arg: 12, scope: !4, file: !1, line: 41, type: !8)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "basic_arc_temp", scope: !4, file: !1, line: 58, type: !44)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_basic_arc", scope: !4, file: !1, line: 59, type: !44)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "father", scope: !4, file: !1, line: 60, type: !10)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !4, file: !1, line: 61, type: !10)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_pred", scope: !4, file: !1, line: 62, type: !10)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orientation_temp", scope: !4, file: !1, line: 63, type: !7)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth_temp", scope: !4, file: !1, line: 64, type: !7)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth_iminus", scope: !4, file: !1, line: 65, type: !7)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_depth", scope: !4, file: !1, line: 66, type: !7)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flow_temp", scope: !4, file: !1, line: 67, type: !8)
!69 = !{i32 2, !"Dwarf Version", i32 2}
!70 = !{i32 2, !"Debug Info Version", i32 700000003}
!71 = !{i32 1, !"PIC Level", i32 2}
!72 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!73 = !DIExpression()
!74 = !DILocation(line: 30, column: 23, scope: !4)
!75 = !DILocation(line: 31, column: 23, scope: !4)
!76 = !DILocation(line: 32, column: 25, scope: !4)
!77 = !DILocation(line: 33, column: 25, scope: !4)
!78 = !DILocation(line: 34, column: 26, scope: !4)
!79 = !DILocation(line: 35, column: 26, scope: !4)
!80 = !DILocation(line: 36, column: 26, scope: !4)
!81 = !DILocation(line: 37, column: 26, scope: !4)
!82 = !DILocation(line: 38, column: 26, scope: !4)
!83 = !DILocation(line: 39, column: 25, scope: !4)
!84 = !DILocation(line: 40, column: 25, scope: !4)
!85 = !DILocation(line: 41, column: 25, scope: !4)
!86 = !DILocation(line: 71, column: 15, scope: !87)
!87 = distinct !DILexicalBlock(scope: !4, file: !1, line: 71, column: 9)
!88 = !{!89, !93, i64 8}
!89 = !{!"arc", !90, i64 0, !93, i64 8, !93, i64 16, !94, i64 24, !93, i64 32, !93, i64 40, !90, i64 48, !90, i64 56}
