; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/biariencode.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !43, globals: !114, imports: !626)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/biariencode.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !42}
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !10, line: 228, baseType: !11)
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !10, line: 226, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 207, size: 832, align: 64, elements: !14)
!14 = !{!15, !17, !18, !19, !20, !21, !26, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !13, file: !10, line: 209, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !13, file: !10, line: 209, baseType: !16, size: 32, align: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !13, file: !10, line: 210, baseType: !16, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !13, file: !10, line: 211, baseType: !16, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !13, file: !10, line: 212, baseType: !16, size: 32, align: 32, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !13, file: !10, line: 213, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !24, line: 30, baseType: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !13, file: !10, line: 214, baseType: !27, size: 64, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !13, file: !10, line: 217, baseType: !16, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !13, file: !10, line: 217, baseType: !16, size: 32, align: 32, offset: 352)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !13, file: !10, line: 218, baseType: !16, size: 32, align: 32, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !13, file: !10, line: 219, baseType: !16, size: 32, align: 32, offset: 416)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !13, file: !10, line: 220, baseType: !16, size: 32, align: 32, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !13, file: !10, line: 221, baseType: !22, size: 64, align: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !13, file: !10, line: 222, baseType: !27, size: 64, align: 64, offset: 576)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !13, file: !10, line: 223, baseType: !28, size: 32, align: 32, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !13, file: !10, line: 223, baseType: !28, size: 32, align: 32, offset: 672)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !13, file: !10, line: 224, baseType: !28, size: 32, align: 32, offset: 704)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !13, file: !10, line: 224, baseType: !28, size: 32, align: 32, offset: 736)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !13, file: !10, line: 225, baseType: !28, size: 32, align: 32, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !13, file: !10, line: 225, baseType: !28, size: 32, align: 32, offset: 800)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!43 = !{!44, !49, !54, !63, !68, !71, !92, !99, !105}
!44 = !DISubprogram(name: "arienco_create_encoding_environment", scope: !1, file: !1, line: 61, type: !45, isLocal: false, isDefinition: true, scopeLine: 62, isOptimized: true, function: %struct.EncodingEnvironment* ()* @arienco_create_encoding_environment, variables: !47)
!45 = !DISubroutineType(types: !46)
!46 = !{!9}
!47 = !{!48}
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep", scope: !44, file: !1, line: 63, type: !9)
!49 = !DISubprogram(name: "arienco_delete_encoding_environment", scope: !1, file: !1, line: 79, type: !50, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*)* @arienco_delete_encoding_environment, variables: !52)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !9}
!52 = !{!53}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !49, file: !1, line: 79, type: !9)
!54 = !DISubprogram(name: "arienco_start_encoding", scope: !1, file: !1, line: 98, type: !55, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i8*, i32*, i32)* @arienco_start_encoding, variables: !58)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !9, !57, !27, !28}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!58 = !{!59, !60, !61, !62}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !54, file: !1, line: 98, type: !9)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code_buffer", arg: 2, scope: !54, file: !1, line: 99, type: !57)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code_len", arg: 3, scope: !54, file: !1, line: 100, type: !27)
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slice_type", arg: 4, scope: !54, file: !1, line: 100, type: !28)
!63 = !DISubprogram(name: "arienco_bits_written", scope: !1, file: !1, line: 125, type: !64, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.EncodingEnvironment*)* @arienco_bits_written, variables: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{!28, !9}
!66 = !{!67}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !63, file: !1, line: 125, type: !9)
!68 = !DISubprogram(name: "arienco_done_encoding", scope: !1, file: !1, line: 137, type: !50, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*)* @arienco_done_encoding, variables: !69)
!69 = !{!70}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !68, file: !1, line: 137, type: !9)
!71 = !DISubprogram(name: "biari_encode_symbol", scope: !1, file: !1, line: 163, type: !72, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i16, %struct.BiContextType*)* @biari_encode_symbol, variables: !85)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !9, !74, !75}
!74 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextTypePtr", file: !10, line: 240, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !10, line: 238, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 231, size: 128, align: 64, elements: !79)
!79 = !{!80, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !78, file: !10, line: 233, baseType: !81, size: 16, align: 16)
!81 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !78, file: !10, line: 234, baseType: !25, size: 8, align: 8, offset: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !78, file: !10, line: 236, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !71, file: !1, line: 163, type: !9)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !71, file: !1, line: 163, type: !74)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bi_ct", arg: 3, scope: !71, file: !1, line: 163, type: !75)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range", scope: !71, file: !1, line: 165, type: !16)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "low", scope: !71, file: !1, line: 166, type: !16)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rLPS", scope: !71, file: !1, line: 167, type: !16)
!92 = !DISubprogram(name: "biari_encode_symbol_eq_prob", scope: !1, file: !1, line: 239, type: !93, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i16)* @biari_encode_symbol_eq_prob, variables: !95)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !9, !74}
!95 = !{!96, !97, !98}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !92, file: !1, line: 239, type: !9)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !92, file: !1, line: 239, type: !74)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "low", scope: !92, file: !1, line: 241, type: !16)
!99 = !DISubprogram(name: "biari_encode_symbol_final", scope: !1, file: !1, line: 281, type: !93, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i16)* @biari_encode_symbol_final, variables: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep", arg: 1, scope: !99, file: !1, line: 281, type: !9)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !99, file: !1, line: 281, type: !74)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range", scope: !99, file: !1, line: 283, type: !16)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "low", scope: !99, file: !1, line: 284, type: !16)
!105 = !DISubprogram(name: "biari_init_context", scope: !1, file: !1, line: 330, type: !106, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.BiContextType*, i32*)* @biari_init_context, variables: !110)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !75, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!110 = !{!111, !112, !113}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !105, file: !1, line: 330, type: !75)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ini", arg: 2, scope: !105, file: !1, line: 330, type: !108)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pstate", scope: !105, file: !1, line: 332, type: !28)
!114 = !{!115, !122, !126, !127, !128, !284, !285, !286, !287, !288, !291, !293, !295, !296, !297, !298, !299, !338, !433, !434, !435, !437, !438, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !456, !457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !473, !477, !478, !479, !480, !481, !482, !485, !488, !489, !490, !491, !494, !497, !508, !550, !551, !552, !553, !554, !610, !611, !612, !613, !614, !618, !619, !620, !621, !622, !623, !624, !625}
!115 = !DIGlobalVariable(name: "rLPS_table_64x4", scope: !0, file: !116, line: 46, type: !117, isLocal: false, isDefinition: true, variable: [64 x [4 x i8]]* @rLPS_table_64x4)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/biariencode.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 2048, align: 8, elements: !119)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!119 = !{!120, !121}
!120 = !DISubrange(count: 64)
!121 = !DISubrange(count: 4)
!122 = !DIGlobalVariable(name: "AC_next_state_MPS_64", scope: !0, file: !116, line: 115, type: !123, isLocal: false, isDefinition: true, variable: [64 x i16]* @AC_next_state_MPS_64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1024, align: 16, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!125 = !{!120}
!126 = !DIGlobalVariable(name: "AC_next_state_LPS_64", scope: !0, file: !116, line: 126, type: !123, isLocal: false, isDefinition: true, variable: [64 x i16]* @AC_next_state_LPS_64)
!127 = !DIGlobalVariable(name: "binCount", scope: !0, file: !1, line: 22, type: !28, isLocal: false, isDefinition: true, variable: i32* @binCount)
!128 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !10, line: 558, type: !129, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !10, line: 484, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 475, size: 6592, align: 64, elements: !132)
!132 = !{!133, !134, !135, !279, !280, !282, !283}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !131, file: !10, line: 477, baseType: !28, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !131, file: !10, line: 478, baseType: !28, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !131, file: !10, line: 479, baseType: !136, size: 6400, align: 64, offset: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 6400, align: 64, elements: !277)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !10, line: 471, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 443, size: 1216, align: 64, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !147, !195, !225, !252, !261, !262, !263, !264, !265, !266, !267, !268, !269, !274}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !139, file: !10, line: 445, baseType: !28, size: 32, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !139, file: !10, line: 446, baseType: !28, size: 32, align: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !139, file: !10, line: 447, baseType: !28, size: 32, align: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !139, file: !10, line: 448, baseType: !28, size: 32, align: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !139, file: !10, line: 449, baseType: !28, size: 32, align: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !139, file: !10, line: 450, baseType: !28, size: 32, align: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !139, file: !10, line: 451, baseType: !148, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !10, line: 440, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !10, line: 430, size: 960, align: 64, elements: !151)
!151 = !{!152, !168, !169}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !150, file: !10, line: 433, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !10, line: 427, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 411, size: 384, align: 64, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !155, file: !10, line: 413, baseType: !28, size: 32, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !155, file: !10, line: 414, baseType: !28, size: 32, align: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !155, file: !10, line: 415, baseType: !23, size: 8, align: 8, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !155, file: !10, line: 416, baseType: !28, size: 32, align: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !155, file: !10, line: 417, baseType: !28, size: 32, align: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !155, file: !10, line: 418, baseType: !23, size: 8, align: 8, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !155, file: !10, line: 420, baseType: !23, size: 8, align: 8, offset: 168)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !155, file: !10, line: 421, baseType: !28, size: 32, align: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !155, file: !10, line: 422, baseType: !28, size: 32, align: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !155, file: !10, line: 424, baseType: !22, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !155, file: !10, line: 425, baseType: !28, size: 32, align: 32, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !150, file: !10, line: 434, baseType: !12, size: 832, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !150, file: !10, line: 436, baseType: !170, size: 64, align: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!28, !173, !194}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !10, line: 348, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !10, line: 327, size: 384, align: 64, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !189}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !10, line: 329, baseType: !28, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !175, file: !10, line: 330, baseType: !28, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !175, file: !10, line: 331, baseType: !28, size: 32, align: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !175, file: !10, line: 332, baseType: !28, size: 32, align: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !175, file: !10, line: 333, baseType: !28, size: 32, align: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !175, file: !10, line: 334, baseType: !16, size: 32, align: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !175, file: !10, line: 335, baseType: !28, size: 32, align: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !175, file: !10, line: 336, baseType: !28, size: 32, align: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !175, file: !10, line: 344, baseType: !186, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !28, !28, !27, !27}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !175, file: !10, line: 346, baseType: !190, size: 64, align: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193, !9}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !139, file: !10, line: 452, baseType: !196, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !10, line: 268, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 258, size: 12032, align: 64, elements: !199)
!199 = !{!200, !205, !210, !214, !218, !221, !222}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !198, file: !10, line: 260, baseType: !201, size: 4224, align: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 4224, align: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DISubrange(count: 3)
!204 = !DISubrange(count: 11)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !198, file: !10, line: 261, baseType: !206, size: 2304, align: 64, offset: 4224)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2304, align: 64, elements: !207)
!207 = !{!208, !209}
!208 = !DISubrange(count: 2)
!209 = !DISubrange(count: 9)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !198, file: !10, line: 262, baseType: !211, size: 2560, align: 64, offset: 6528)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2560, align: 64, elements: !212)
!212 = !{!208, !213}
!213 = !DISubrange(count: 10)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !198, file: !10, line: 263, baseType: !215, size: 1536, align: 64, offset: 9088)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1536, align: 64, elements: !216)
!216 = !{!208, !217}
!217 = !DISubrange(count: 6)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !198, file: !10, line: 264, baseType: !219, size: 512, align: 64, offset: 10624)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 512, align: 64, elements: !220)
!220 = !{!121}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !198, file: !10, line: 265, baseType: !219, size: 512, align: 64, offset: 11136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !198, file: !10, line: 266, baseType: !223, size: 384, align: 64, offset: 11648)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 384, align: 64, elements: !224)
!224 = !{!203}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !139, file: !10, line: 453, baseType: !226, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !10, line: 293, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 281, size: 97024, align: 64, elements: !229)
!229 = !{!230, !233, !234, !237, !240, !244, !245, !249, !250, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !228, file: !10, line: 283, baseType: !231, size: 256, align: 64)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, align: 64, elements: !232)
!232 = !{!208}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !228, file: !10, line: 284, baseType: !219, size: 512, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !228, file: !10, line: 285, baseType: !235, size: 1536, align: 64, offset: 768)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1536, align: 64, elements: !236)
!236 = !{!203, !121}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !228, file: !10, line: 286, baseType: !238, size: 5120, align: 64, offset: 2304)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 5120, align: 64, elements: !239)
!239 = !{!213, !121}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !228, file: !10, line: 287, baseType: !241, size: 19200, align: 64, offset: 7424)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 19200, align: 64, elements: !242)
!242 = !{!213, !243}
!243 = !DISubrange(count: 15)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !228, file: !10, line: 288, baseType: !241, size: 19200, align: 64, offset: 26624)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !228, file: !10, line: 289, baseType: !246, size: 6400, align: 64, offset: 45824)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 6400, align: 64, elements: !247)
!247 = !{!213, !248}
!248 = !DISubrange(count: 5)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !228, file: !10, line: 290, baseType: !246, size: 6400, align: 64, offset: 52224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !228, file: !10, line: 291, baseType: !241, size: 19200, align: 64, offset: 58624)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !228, file: !10, line: 292, baseType: !241, size: 19200, align: 64, offset: 77824)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !139, file: !10, line: 456, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !10, line: 313, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !10, line: 308, size: 128, align: 64, elements: !256)
!256 = !{!257, !258, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !255, file: !10, line: 310, baseType: !28, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !255, file: !10, line: 311, baseType: !28, size: 32, align: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !255, file: !10, line: 312, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !139, file: !10, line: 458, baseType: !28, size: 32, align: 32, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !139, file: !10, line: 459, baseType: !27, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !139, file: !10, line: 460, baseType: !27, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !139, file: !10, line: 461, baseType: !27, size: 64, align: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !139, file: !10, line: 462, baseType: !28, size: 32, align: 32, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !139, file: !10, line: 463, baseType: !27, size: 64, align: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !139, file: !10, line: 464, baseType: !27, size: 64, align: 64, offset: 832)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !139, file: !10, line: 465, baseType: !27, size: 64, align: 64, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !139, file: !10, line: 467, baseType: !270, size: 64, align: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !28}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !139, file: !10, line: 469, baseType: !275, size: 192, align: 32, offset: 1024)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, align: 32, elements: !276)
!276 = !{!203, !208}
!277 = !{!278}
!278 = !DISubrange(count: 100)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !131, file: !10, line: 480, baseType: !28, size: 32, align: 32, offset: 6464)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !131, file: !10, line: 481, baseType: !281, size: 32, align: 32, offset: 6496)
!281 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !131, file: !10, line: 482, baseType: !281, size: 32, align: 32, offset: 6528)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !131, file: !10, line: 483, baseType: !281, size: 32, align: 32, offset: 6560)
!284 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !10, line: 559, type: !129, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!285 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !10, line: 560, type: !129, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!286 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !10, line: 561, type: !129, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!287 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !10, line: 562, type: !129, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!288 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !10, line: 565, type: !289, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!291 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !10, line: 566, type: !292, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!293 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !10, line: 567, type: !294, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!295 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !10, line: 569, type: !16, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!296 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !10, line: 570, type: !16, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!297 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !10, line: 572, type: !28, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!298 = !DIGlobalVariable(name: "me_time", scope: !0, file: !10, line: 572, type: !28, isLocal: false, isDefinition: true, variable: i32* @me_time)
!299 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !10, line: 573, type: !300, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !302, file: !4, line: 105, baseType: !273, size: 32, align: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !302, file: !4, line: 106, baseType: !16, size: 32, align: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !302, file: !4, line: 107, baseType: !16, size: 32, align: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !302, file: !4, line: 108, baseType: !273, size: 32, align: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !302, file: !4, line: 110, baseType: !273, size: 32, align: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !302, file: !4, line: 111, baseType: !273, size: 32, align: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !302, file: !4, line: 112, baseType: !311, size: 256, align: 32, offset: 192)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, align: 32, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !302, file: !4, line: 115, baseType: !273, size: 32, align: 32, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !302, file: !4, line: 116, baseType: !16, size: 32, align: 32, offset: 480)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !302, file: !4, line: 117, baseType: !16, size: 32, align: 32, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !302, file: !4, line: 119, baseType: !318, size: 256, align: 32, offset: 544)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, align: 32, elements: !312)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !302, file: !4, line: 121, baseType: !318, size: 256, align: 32, offset: 800)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !302, file: !4, line: 122, baseType: !318, size: 256, align: 32, offset: 1056)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !302, file: !4, line: 124, baseType: !273, size: 32, align: 32, offset: 1312)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !302, file: !4, line: 125, baseType: !16, size: 32, align: 32, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !302, file: !4, line: 127, baseType: !16, size: 32, align: 32, offset: 1376)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !302, file: !4, line: 128, baseType: !22, size: 64, align: 64, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !302, file: !4, line: 130, baseType: !28, size: 32, align: 32, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !302, file: !4, line: 131, baseType: !28, size: 32, align: 32, offset: 1504)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !302, file: !4, line: 132, baseType: !273, size: 32, align: 32, offset: 1536)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !302, file: !4, line: 133, baseType: !16, size: 32, align: 32, offset: 1568)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !302, file: !4, line: 134, baseType: !28, size: 32, align: 32, offset: 1600)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !302, file: !4, line: 135, baseType: !28, size: 32, align: 32, offset: 1632)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !302, file: !4, line: 136, baseType: !28, size: 32, align: 32, offset: 1664)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !302, file: !4, line: 138, baseType: !28, size: 32, align: 32, offset: 1696)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !302, file: !4, line: 139, baseType: !28, size: 32, align: 32, offset: 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !302, file: !4, line: 141, baseType: !273, size: 32, align: 32, offset: 1760)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !302, file: !4, line: 142, baseType: !273, size: 32, align: 32, offset: 1792)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !302, file: !4, line: 143, baseType: !273, size: 32, align: 32, offset: 1824)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !302, file: !4, line: 144, baseType: !273, size: 32, align: 32, offset: 1856)
!338 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !10, line: 574, type: !339, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !341, file: !4, line: 151, baseType: !273, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !341, file: !4, line: 153, baseType: !16, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !341, file: !4, line: 154, baseType: !273, size: 32, align: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !341, file: !4, line: 155, baseType: !273, size: 32, align: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !341, file: !4, line: 156, baseType: !273, size: 32, align: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !341, file: !4, line: 157, baseType: !273, size: 32, align: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !341, file: !4, line: 158, baseType: !16, size: 32, align: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !341, file: !4, line: 159, baseType: !16, size: 32, align: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !341, file: !4, line: 160, baseType: !16, size: 32, align: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !341, file: !4, line: 162, baseType: !273, size: 32, align: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !341, file: !4, line: 163, baseType: !311, size: 256, align: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !341, file: !4, line: 165, baseType: !16, size: 32, align: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !341, file: !4, line: 166, baseType: !16, size: 32, align: 32, offset: 608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !341, file: !4, line: 167, baseType: !16, size: 32, align: 32, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !341, file: !4, line: 168, baseType: !16, size: 32, align: 32, offset: 672)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !341, file: !4, line: 170, baseType: !16, size: 32, align: 32, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !341, file: !4, line: 172, baseType: !273, size: 32, align: 32, offset: 736)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !341, file: !4, line: 173, baseType: !28, size: 32, align: 32, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !341, file: !4, line: 174, baseType: !28, size: 32, align: 32, offset: 800)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !341, file: !4, line: 175, baseType: !16, size: 32, align: 32, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !341, file: !4, line: 177, baseType: !364, size: 8192, align: 32, offset: 864)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 32, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !341, file: !4, line: 178, baseType: !16, size: 32, align: 32, offset: 9056)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !341, file: !4, line: 179, baseType: !273, size: 32, align: 32, offset: 9088)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !341, file: !4, line: 180, baseType: !16, size: 32, align: 32, offset: 9120)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !341, file: !4, line: 181, baseType: !16, size: 32, align: 32, offset: 9152)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !341, file: !4, line: 182, baseType: !273, size: 32, align: 32, offset: 9184)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !341, file: !4, line: 184, baseType: !273, size: 32, align: 32, offset: 9216)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !341, file: !4, line: 185, baseType: !273, size: 32, align: 32, offset: 9248)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !341, file: !4, line: 186, baseType: !273, size: 32, align: 32, offset: 9280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !341, file: !4, line: 187, baseType: !16, size: 32, align: 32, offset: 9312)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !341, file: !4, line: 188, baseType: !16, size: 32, align: 32, offset: 9344)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !341, file: !4, line: 189, baseType: !16, size: 32, align: 32, offset: 9376)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !341, file: !4, line: 190, baseType: !16, size: 32, align: 32, offset: 9408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !341, file: !4, line: 191, baseType: !273, size: 32, align: 32, offset: 9440)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !341, file: !4, line: 192, baseType: !381, size: 7584, align: 32, offset: 9472)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !382, file: !4, line: 65, baseType: !273, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !382, file: !4, line: 66, baseType: !16, size: 32, align: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !382, file: !4, line: 67, baseType: !16, size: 32, align: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !382, file: !4, line: 68, baseType: !16, size: 32, align: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !382, file: !4, line: 69, baseType: !273, size: 32, align: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !382, file: !4, line: 70, baseType: !273, size: 32, align: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !382, file: !4, line: 71, baseType: !273, size: 32, align: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !382, file: !4, line: 72, baseType: !16, size: 32, align: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !382, file: !4, line: 73, baseType: !273, size: 32, align: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !382, file: !4, line: 74, baseType: !273, size: 32, align: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !382, file: !4, line: 75, baseType: !16, size: 32, align: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !382, file: !4, line: 76, baseType: !16, size: 32, align: 32, offset: 352)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !382, file: !4, line: 77, baseType: !16, size: 32, align: 32, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !382, file: !4, line: 78, baseType: !273, size: 32, align: 32, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !382, file: !4, line: 79, baseType: !16, size: 32, align: 32, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !382, file: !4, line: 80, baseType: !16, size: 32, align: 32, offset: 480)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !382, file: !4, line: 81, baseType: !273, size: 32, align: 32, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !382, file: !4, line: 82, baseType: !16, size: 32, align: 32, offset: 544)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !382, file: !4, line: 83, baseType: !16, size: 32, align: 32, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !382, file: !4, line: 84, baseType: !273, size: 32, align: 32, offset: 608)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !382, file: !4, line: 85, baseType: !273, size: 32, align: 32, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !382, file: !4, line: 86, baseType: !406, size: 3296, align: 32, offset: 672)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !408)
!408 = !{!409, !410, !411, !412, !416, !417, !418, !419, !420, !421}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !407, file: !4, line: 50, baseType: !16, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !407, file: !4, line: 51, baseType: !16, size: 32, align: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !407, file: !4, line: 52, baseType: !16, size: 32, align: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !407, file: !4, line: 53, baseType: !413, size: 1024, align: 32, offset: 96)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 1024, align: 32, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !407, file: !4, line: 54, baseType: !413, size: 1024, align: 32, offset: 1120)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !407, file: !4, line: 55, baseType: !413, size: 1024, align: 32, offset: 2144)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !407, file: !4, line: 56, baseType: !16, size: 32, align: 32, offset: 3168)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !407, file: !4, line: 57, baseType: !16, size: 32, align: 32, offset: 3200)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !407, file: !4, line: 58, baseType: !16, size: 32, align: 32, offset: 3232)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !407, file: !4, line: 59, baseType: !16, size: 32, align: 32, offset: 3264)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !382, file: !4, line: 87, baseType: !273, size: 32, align: 32, offset: 3968)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !382, file: !4, line: 88, baseType: !406, size: 3296, align: 32, offset: 4000)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !382, file: !4, line: 90, baseType: !273, size: 32, align: 32, offset: 7296)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !382, file: !4, line: 91, baseType: !273, size: 32, align: 32, offset: 7328)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !382, file: !4, line: 92, baseType: !273, size: 32, align: 32, offset: 7360)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !382, file: !4, line: 93, baseType: !16, size: 32, align: 32, offset: 7392)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !382, file: !4, line: 94, baseType: !16, size: 32, align: 32, offset: 7424)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !382, file: !4, line: 95, baseType: !16, size: 32, align: 32, offset: 7456)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !382, file: !4, line: 96, baseType: !16, size: 32, align: 32, offset: 7488)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !382, file: !4, line: 97, baseType: !16, size: 32, align: 32, offset: 7520)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !382, file: !4, line: 98, baseType: !16, size: 32, align: 32, offset: 7552)
!433 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !10, line: 578, type: !28, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!434 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !10, line: 579, type: !28, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!435 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !10, line: 583, type: !436, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!437 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !10, line: 584, type: !436, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!438 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !10, line: 585, type: !439, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!440 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !10, line: 586, type: !28, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!441 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !10, line: 587, type: !28, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!442 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !10, line: 588, type: !28, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!443 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !10, line: 589, type: !28, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!444 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !10, line: 592, type: !289, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!445 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !10, line: 593, type: !289, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!446 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !10, line: 595, type: !292, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!447 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !10, line: 596, type: !292, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!448 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !10, line: 598, type: !289, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!449 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !10, line: 599, type: !292, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!450 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !10, line: 601, type: !289, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!451 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !10, line: 602, type: !292, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!452 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !10, line: 604, type: !453, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!456 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !10, line: 605, type: !454, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!457 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !10, line: 608, type: !458, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!459 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !10, line: 609, type: !458, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!460 = !DIGlobalVariable(name: "intras", scope: !0, file: !10, line: 610, type: !28, isLocal: false, isDefinition: true, variable: i32* @intras)
!461 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !10, line: 612, type: !28, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!462 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !10, line: 612, type: !28, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!463 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !10, line: 612, type: !28, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!464 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !10, line: 613, type: !28, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!465 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !10, line: 613, type: !28, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!466 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !10, line: 613, type: !28, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!467 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !10, line: 614, type: !28, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!468 = !DIGlobalVariable(name: "errortext", scope: !0, file: !10, line: 617, type: !469, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 2400, align: 8, elements: !471)
!470 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!471 = !{!472}
!472 = !DISubrange(count: 300)
!473 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !10, line: 620, type: !474, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 32, elements: !475)
!475 = !{!476, !476}
!476 = !DISubrange(count: 16)
!477 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !10, line: 620, type: !474, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!478 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !10, line: 620, type: !474, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!479 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !10, line: 621, type: !474, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!480 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !10, line: 621, type: !474, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!481 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !10, line: 621, type: !474, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!482 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !10, line: 622, type: !483, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 24576, align: 32, elements: !484)
!484 = !{!203, !476, !476}
!485 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !10, line: 623, type: !486, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, align: 32, elements: !487)
!487 = !{!208, !121, !121}
!488 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !10, line: 623, type: !486, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!489 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !10, line: 624, type: !486, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!490 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !10, line: 624, type: !486, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!491 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !10, line: 625, type: !492, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, align: 32, elements: !493)
!493 = !{!121, !121}
!494 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !10, line: 625, type: !495, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, align: 32, elements: !496)
!496 = !{!476}
!497 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !10, line: 1201, type: !498, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !10, line: 1190, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 1182, size: 192, align: 32, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !500, file: !10, line: 1184, baseType: !28, size: 32, align: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !500, file: !10, line: 1185, baseType: !28, size: 32, align: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !500, file: !10, line: 1186, baseType: !28, size: 32, align: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !500, file: !10, line: 1187, baseType: !28, size: 32, align: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !500, file: !10, line: 1188, baseType: !28, size: 32, align: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !500, file: !10, line: 1189, baseType: !28, size: 32, align: 32, offset: 160)
!508 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !10, line: 1202, type: !509, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !10, line: 1177, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 1145, size: 26880, align: 64, elements: !512)
!512 = !{!513, !515, !516, !517, !518, !519, !520, !521, !522, !524, !525, !526, !527, !528, !533, !534, !538, !539, !540, !541, !543, !544, !545, !546, !547, !548, !549}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !511, file: !10, line: 1147, baseType: !514, size: 64, align: 64)
!514 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !511, file: !10, line: 1149, baseType: !474, size: 8192, align: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !511, file: !10, line: 1150, baseType: !474, size: 8192, align: 32, offset: 8256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !511, file: !10, line: 1150, baseType: !474, size: 8192, align: 32, offset: 16448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !511, file: !10, line: 1151, baseType: !439, size: 64, align: 64, offset: 24640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !511, file: !10, line: 1152, baseType: !436, size: 64, align: 64, offset: 24704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !511, file: !10, line: 1153, baseType: !28, size: 32, align: 32, offset: 24768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !511, file: !10, line: 1155, baseType: !28, size: 32, align: 32, offset: 24800)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !511, file: !10, line: 1157, baseType: !523, size: 128, align: 32, offset: 24832)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, align: 32, elements: !220)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !511, file: !10, line: 1157, baseType: !523, size: 128, align: 32, offset: 24960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !511, file: !10, line: 1158, baseType: !294, size: 64, align: 64, offset: 25088)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !511, file: !10, line: 1159, baseType: !495, size: 512, align: 32, offset: 25152)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !511, file: !10, line: 1160, baseType: !28, size: 32, align: 32, offset: 25664)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !511, file: !10, line: 1161, baseType: !529, size: 64, align: 64, offset: 25728)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !10, line: 62, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !531, line: 30, baseType: !532)
!531 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!532 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !511, file: !10, line: 1162, baseType: !28, size: 32, align: 32, offset: 25792)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !511, file: !10, line: 1163, baseType: !535, size: 64, align: 64, offset: 25856)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !511, file: !10, line: 1164, baseType: !535, size: 64, align: 64, offset: 25920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !511, file: !10, line: 1165, baseType: !535, size: 64, align: 64, offset: 25984)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !511, file: !10, line: 1166, baseType: !535, size: 64, align: 64, offset: 26048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !511, file: !10, line: 1167, baseType: !542, size: 512, align: 16, offset: 26112)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 512, align: 16, elements: !487)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !511, file: !10, line: 1168, baseType: !28, size: 32, align: 32, offset: 26624)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !511, file: !10, line: 1169, baseType: !28, size: 32, align: 32, offset: 26656)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !511, file: !10, line: 1171, baseType: !28, size: 32, align: 32, offset: 26688)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !511, file: !10, line: 1172, baseType: !28, size: 32, align: 32, offset: 26720)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !511, file: !10, line: 1174, baseType: !28, size: 32, align: 32, offset: 26752)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !511, file: !10, line: 1175, baseType: !28, size: 32, align: 32, offset: 26784)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !511, file: !10, line: 1176, baseType: !28, size: 32, align: 32, offset: 26816)
!550 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !10, line: 1203, type: !510, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!551 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !10, line: 1203, type: !510, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!552 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !10, line: 1204, type: !510, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!553 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !10, line: 1204, type: !510, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!554 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !10, line: 1230, type: !555, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !557, line: 153, baseType: !558)
!557 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !557, line: 122, size: 1216, align: 64, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !570, !571, !572, !576, !581, !590, !596, !597, !600, !601, !603, !607, !608, !609}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !558, file: !557, line: 123, baseType: !57, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !558, file: !557, line: 124, baseType: !28, size: 32, align: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !558, file: !557, line: 125, baseType: !28, size: 32, align: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !558, file: !557, line: 126, baseType: !74, size: 16, align: 16, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !558, file: !557, line: 127, baseType: !74, size: 16, align: 16, offset: 144)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !558, file: !557, line: 128, baseType: !566, size: 128, align: 64, offset: 192)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !557, line: 88, size: 128, align: 64, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !566, file: !557, line: 89, baseType: !57, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !566, file: !557, line: 90, baseType: !28, size: 32, align: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !558, file: !557, line: 129, baseType: !28, size: 32, align: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !558, file: !557, line: 132, baseType: !42, size: 64, align: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !558, file: !557, line: 133, baseType: !573, size: 64, align: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!28, !42}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !558, file: !557, line: 134, baseType: !577, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!28, !42, !580, !28}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !558, file: !557, line: 135, baseType: !582, size: 64, align: 64, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !42, !585, !28}
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !557, line: 77, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !587, line: 71, baseType: !588)
!587 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !589, line: 46, baseType: !532)
!589 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !558, file: !557, line: 136, baseType: !591, size: 64, align: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!28, !42, !594, !28}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !558, file: !557, line: 139, baseType: !566, size: 128, align: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !558, file: !557, line: 140, baseType: !598, size: 64, align: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !557, line: 94, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !558, file: !557, line: 141, baseType: !28, size: 32, align: 32, offset: 896)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !558, file: !557, line: 144, baseType: !602, size: 24, align: 8, offset: 928)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 24, align: 8, elements: !224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !558, file: !557, line: 145, baseType: !604, size: 8, align: 8, offset: 952)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, align: 8, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 1)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !558, file: !557, line: 148, baseType: !566, size: 128, align: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !558, file: !557, line: 151, baseType: !28, size: 32, align: 32, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !558, file: !557, line: 152, baseType: !585, size: 64, align: 64, offset: 1152)
!610 = !DIGlobalVariable(name: "p_log", scope: !0, file: !10, line: 1231, type: !555, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!611 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !10, line: 1232, type: !555, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!612 = !DIGlobalVariable(name: "p_in", scope: !0, file: !10, line: 1233, type: !28, isLocal: false, isDefinition: true, variable: i32* @p_in)
!613 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !10, line: 1234, type: !28, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!614 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !10, line: 1237, type: !615, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 640, align: 32, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 20)
!618 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !10, line: 1238, type: !615, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!619 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !10, line: 1239, type: !615, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!620 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !10, line: 1240, type: !615, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!621 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !10, line: 1241, type: !615, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!622 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !10, line: 1242, type: !615, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!623 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !10, line: 1456, type: !28, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!624 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !10, line: 1465, type: !28, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!625 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !10, line: 1466, type: !28, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!626 = !{}
!627 = !{i32 2, !"Dwarf Version", i32 2}
!628 = !{i32 2, !"Debug Info Version", i32 700000003}
!629 = !{i32 1, !"PIC Level", i32 2}
!630 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!631 = !DILocation(line: 65, column: 40, scope: !632)
!632 = distinct !DILexicalBlock(scope: !44, file: !1, line: 65, column: 8)
!633 = !DILocation(line: 65, column: 15, scope: !632)
!634 = !DIExpression()
!635 = !DILocation(line: 63, column: 26, scope: !44)
!636 = !DILocation(line: 65, column: 79, scope: !632)
!637 = !DILocation(line: 65, column: 8, scope: !44)
!638 = !DILocation(line: 66, column: 5, scope: !632)
!639 = !DILocation(line: 68, column: 3, scope: !44)
!640 = !DILocation(line: 79, column: 65, scope: !49)
!641 = !DILocation(line: 81, column: 11, scope: !642)
!642 = distinct !DILexicalBlock(scope: !49, file: !1, line: 81, column: 7)
!643 = !DILocation(line: 81, column: 7, scope: !49)
!644 = !DILocation(line: 83, column: 5, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !1, line: 82, column: 3)
!646 = !DILocation(line: 84, column: 5, scope: !645)
!647 = !DILocation(line: 85, column: 3, scope: !645)
!648 = !DILocation(line: 87, column: 10, scope: !642)
!649 = !DILocation(line: 87, column: 5, scope: !642)
!650 = !DILocation(line: 88, column: 1, scope: !49)
!651 = !DILocation(line: 98, column: 52, scope: !54)
!652 = !DILocation(line: 99, column: 44, scope: !54)
