; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/block.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.storable_picture = type { i32, i32, i32, i32, i32, i32, [6 x [33 x i64]], [6 x [33 x i64]], [6 x [33 x i64]], [6 x [33 x i64]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16**, i16*, i16*, i16**, i16**, i16***, i8*, i16***, i64***, i64***, i16****, i8**, i8**, %struct.storable_picture*, %struct.storable_picture*, %struct.storable_picture*, i32, i32, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !13, subprograms: !21, globals: !426, imports: !975)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/block.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 178, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "UVLC", value: 0)
!12 = !DIEnumerator(name: "CABAC", value: 1)
!13 = !{!14, !15, !16, !17}
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !19, line: 30, baseType: !20)
!19 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!20 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!21 = !{!22, !65, !94, !193, !224, !271, !299, !311, !356, !408}
!22 = !DISubprogram(name: "intrapred_luma", scope: !1, file: !1, line: 106, type: !23, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*, i32*)* @intrapred_luma, variables: !26)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !14, !14, !25, !25, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !39, !42, !43, !44, !45, !58, !59, !60, !61, !62, !63, !64}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_x", arg: 1, scope: !22, file: !1, line: 106, type: !14)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_y", arg: 2, scope: !22, file: !1, line: 106, type: !14)
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left_available", arg: 3, scope: !22, file: !1, line: 106, type: !25)
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "up_available", arg: 4, scope: !22, file: !1, line: 106, type: !25)
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "all_available", arg: 5, scope: !22, file: !1, line: 106, type: !25)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !22, file: !1, line: 108, type: !14)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !22, file: !1, line: 108, type: !14)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !22, file: !1, line: 109, type: !14)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PredPel", scope: !22, file: !1, line: 110, type: !36)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 416, align: 32, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 13)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !22, file: !1, line: 111, type: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !22, file: !1, line: 113, type: !14)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "joff", scope: !22, file: !1, line: 114, type: !14)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !22, file: !1, line: 115, type: !14)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_a", scope: !22, file: !1, line: 117, type: !46)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 768, align: 32, elements: !56)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !9, line: 305, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !9, line: 297, size: 192, align: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !48, file: !9, line: 299, baseType: !14, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !48, file: !9, line: 300, baseType: !14, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !9, line: 301, baseType: !14, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !9, line: 302, baseType: !14, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !48, file: !9, line: 303, baseType: !14, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !48, file: !9, line: 304, baseType: !14, size: 32, align: 32, offset: 160)
!56 = !{!57}
!57 = !DISubrange(count: 4)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_b", scope: !22, file: !1, line: 118, type: !47)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_c", scope: !22, file: !1, line: 118, type: !47)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_d", scope: !22, file: !1, line: 118, type: !47)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_up", scope: !22, file: !1, line: 120, type: !14)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_left", scope: !22, file: !1, line: 121, type: !14)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_up_left", scope: !22, file: !1, line: 122, type: !14)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_up_right", scope: !22, file: !1, line: 123, type: !14)
!65 = !DISubprogram(name: "intrapred_luma_16x16", scope: !1, file: !1, line: 396, type: !66, isLocal: false, isDefinition: true, scopeLine: 397, isOptimized: true, function: void ()* @intrapred_luma_16x16, variables: !68)
!66 = !DISubroutineType(types: !67)
!67 = !{null}
!68 = !{!69, !70, !71, !72, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !91, !92, !93}
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !65, file: !1, line: 398, type: !14)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !65, file: !1, line: 398, type: !14)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !65, file: !1, line: 398, type: !14)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !65, file: !1, line: 399, type: !73)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, align: 32, elements: !74)
!74 = !{!75, !76}
!75 = !DISubrange(count: 16)
!76 = !DISubrange(count: 2)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !65, file: !1, line: 400, type: !14)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !65, file: !1, line: 400, type: !14)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ih", scope: !65, file: !1, line: 402, type: !14)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !65, file: !1, line: 402, type: !14)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ib", scope: !65, file: !1, line: 403, type: !14)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !65, file: !1, line: 403, type: !14)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iaa", scope: !65, file: !1, line: 403, type: !14)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY_pred", scope: !65, file: !1, line: 405, type: !40)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !65, file: !1, line: 406, type: !14)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !65, file: !1, line: 408, type: !47)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !65, file: !1, line: 409, type: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 3264, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 17)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up_avail", scope: !65, file: !1, line: 411, type: !14)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_avail", scope: !65, file: !1, line: 411, type: !14)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_up_avail", scope: !65, file: !1, line: 411, type: !14)
!94 = !DISubprogram(name: "dct_luma_16x16", scope: !1, file: !1, line: 514, type: !95, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @dct_luma_16x16, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!14, !14}
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !108, !111, !113, !114, !117, !118, !119, !120, !121, !122, !123, !124, !125, !185, !186, !187, !188, !189, !190, !191}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_intra_mode", arg: 1, scope: !94, file: !1, line: 514, type: !14)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !94, file: !1, line: 517, type: !14)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !94, file: !1, line: 517, type: !14)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !94, file: !1, line: 518, type: !14)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !94, file: !1, line: 518, type: !14)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !94, file: !1, line: 519, type: !14)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !94, file: !1, line: 519, type: !14)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M1", scope: !94, file: !1, line: 520, type: !106)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, align: 32, elements: !107)
!107 = !{!75, !75}
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M4", scope: !94, file: !1, line: 521, type: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 32, elements: !110)
!110 = !{!57, !57}
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M5", scope: !94, file: !1, line: 522, type: !112)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, align: 32, elements: !56)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M6", scope: !94, file: !1, line: 522, type: !112)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M0", scope: !94, file: !1, line: 523, type: !115)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, align: 32, elements: !116)
!116 = !{!57, !57, !57, !57}
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !94, file: !1, line: 524, type: !14)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !94, file: !1, line: 524, type: !14)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !94, file: !1, line: 524, type: !14)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !94, file: !1, line: 524, type: !14)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !94, file: !1, line: 525, type: !14)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !94, file: !1, line: 525, type: !14)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !94, file: !1, line: 525, type: !14)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ac_coef", scope: !94, file: !1, line: 526, type: !14)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !94, file: !1, line: 528, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !9, line: 406, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !9, line: 351, size: 5056, align: 64, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !139, !141, !142, !143, !146, !149, !150, !151, !152, !153, !154, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !128, file: !9, line: 353, baseType: !14, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !128, file: !9, line: 354, baseType: !14, size: 32, align: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !128, file: !9, line: 355, baseType: !14, size: 32, align: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !128, file: !9, line: 356, baseType: !14, size: 32, align: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !128, file: !9, line: 357, baseType: !14, size: 32, align: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !128, file: !9, line: 358, baseType: !136, size: 256, align: 32, offset: 160)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 32, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !128, file: !9, line: 360, baseType: !140, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !128, file: !9, line: 361, baseType: !140, size: 64, align: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !128, file: !9, line: 363, baseType: !14, size: 32, align: 32, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !128, file: !9, line: 364, baseType: !144, size: 2048, align: 32, offset: 608)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 32, elements: !145)
!145 = !{!76, !57, !57, !76}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !128, file: !9, line: 365, baseType: !147, size: 512, align: 32, offset: 2656)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 32, elements: !148)
!148 = !{!75}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !128, file: !9, line: 366, baseType: !147, size: 512, align: 32, offset: 3168)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !128, file: !9, line: 367, baseType: !14, size: 32, align: 32, offset: 3680)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !128, file: !9, line: 368, baseType: !17, size: 64, align: 64, offset: 3712)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !128, file: !9, line: 369, baseType: !112, size: 128, align: 32, offset: 3776)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !128, file: !9, line: 370, baseType: !112, size: 128, align: 32, offset: 3904)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !128, file: !9, line: 371, baseType: !155, size: 64, align: 64, offset: 4032)
!155 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !128, file: !9, line: 373, baseType: !14, size: 32, align: 32, offset: 4096)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !128, file: !9, line: 374, baseType: !14, size: 32, align: 32, offset: 4128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !128, file: !9, line: 375, baseType: !14, size: 32, align: 32, offset: 4160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !128, file: !9, line: 377, baseType: !14, size: 32, align: 32, offset: 4192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !128, file: !9, line: 378, baseType: !14, size: 32, align: 32, offset: 4224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !128, file: !9, line: 380, baseType: !14, size: 32, align: 32, offset: 4256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !128, file: !9, line: 382, baseType: !14, size: 32, align: 32, offset: 4288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !128, file: !9, line: 382, baseType: !14, size: 32, align: 32, offset: 4320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !128, file: !9, line: 382, baseType: !14, size: 32, align: 32, offset: 4352)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !128, file: !9, line: 382, baseType: !14, size: 32, align: 32, offset: 4384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !128, file: !9, line: 383, baseType: !14, size: 32, align: 32, offset: 4416)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !128, file: !9, line: 383, baseType: !14, size: 32, align: 32, offset: 4448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !128, file: !9, line: 383, baseType: !14, size: 32, align: 32, offset: 4480)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !128, file: !9, line: 383, baseType: !14, size: 32, align: 32, offset: 4512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !128, file: !9, line: 385, baseType: !14, size: 32, align: 32, offset: 4544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !128, file: !9, line: 386, baseType: !14, size: 32, align: 32, offset: 4576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !128, file: !9, line: 387, baseType: !14, size: 32, align: 32, offset: 4608)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !128, file: !9, line: 390, baseType: !14, size: 32, align: 32, offset: 4640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !128, file: !9, line: 394, baseType: !175, size: 64, align: 64, offset: 4672)
!175 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !128, file: !9, line: 395, baseType: !14, size: 32, align: 32, offset: 4736)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !128, file: !9, line: 396, baseType: !14, size: 32, align: 32, offset: 4768)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !128, file: !9, line: 397, baseType: !14, size: 32, align: 32, offset: 4800)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !128, file: !9, line: 398, baseType: !14, size: 32, align: 32, offset: 4832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !128, file: !9, line: 399, baseType: !14, size: 32, align: 32, offset: 4864)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !128, file: !9, line: 401, baseType: !14, size: 32, align: 32, offset: 4896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !128, file: !9, line: 402, baseType: !14, size: 32, align: 32, offset: 4928)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !128, file: !9, line: 403, baseType: !14, size: 32, align: 32, offset: 4960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !128, file: !9, line: 405, baseType: !14, size: 32, align: 32, offset: 4992)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !94, file: !1, line: 530, type: !14)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !94, file: !1, line: 530, type: !14)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCLevel", scope: !94, file: !1, line: 531, type: !25)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCRun", scope: !94, file: !1, line: 532, type: !25)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !94, file: !1, line: 533, type: !25)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !94, file: !1, line: 534, type: !25)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lossless_qpprime", scope: !94, file: !1, line: 536, type: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!193 = !DISubprogram(name: "dct_luma", scope: !1, file: !1, line: 875, type: !194, isLocal: false, isDefinition: true, scopeLine: 876, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*, i32)* @dct_luma, variables: !196)
!194 = !DISubroutineType(types: !195)
!195 = !{!14, !14, !14, !25, !14}
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 1, scope: !193, file: !1, line: 875, type: !14)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 2, scope: !193, file: !1, line: 875, type: !14)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coeff_cost", arg: 3, scope: !193, file: !1, line: 875, type: !25)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intra", arg: 4, scope: !193, file: !1, line: 875, type: !14)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !193, file: !1, line: 879, type: !14)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !193, file: !1, line: 879, type: !14)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !193, file: !1, line: 879, type: !14)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !193, file: !1, line: 879, type: !14)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilev", scope: !193, file: !1, line: 879, type: !14)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m5", scope: !193, file: !1, line: 879, type: !112)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !193, file: !1, line: 879, type: !112)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !193, file: !1, line: 879, type: !14)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !193, file: !1, line: 881, type: !14)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !193, file: !1, line: 881, type: !14)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !193, file: !1, line: 881, type: !14)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !193, file: !1, line: 882, type: !14)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !193, file: !1, line: 883, type: !14)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !193, file: !1, line: 883, type: !14)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !193, file: !1, line: 883, type: !14)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos_x", scope: !193, file: !1, line: 885, type: !14)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos_y", scope: !193, file: !1, line: 886, type: !14)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !193, file: !1, line: 887, type: !14)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !193, file: !1, line: 888, type: !14)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !193, file: !1, line: 889, type: !25)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !193, file: !1, line: 890, type: !25)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !193, file: !1, line: 892, type: !126)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lossless_qpprime", scope: !193, file: !1, line: 893, type: !192)
!224 = !DISubprogram(name: "dct_chroma", scope: !1, file: !1, line: 1098, type: !225, isLocal: false, isDefinition: true, scopeLine: 1099, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @dct_chroma, variables: !227)
!225 = !DISubroutineType(types: !226)
!226 = !{!14, !14, !14}
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !263, !264, !265, !266, !267, !268, !269, !270}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 1, scope: !224, file: !1, line: 1098, type: !14)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr_cbp", arg: 2, scope: !224, file: !1, line: 1098, type: !14)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !224, file: !1, line: 1100, type: !14)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !224, file: !1, line: 1100, type: !14)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !224, file: !1, line: 1100, type: !14)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j2", scope: !224, file: !1, line: 1100, type: !14)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilev", scope: !224, file: !1, line: 1100, type: !14)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !224, file: !1, line: 1100, type: !14)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !224, file: !1, line: 1100, type: !14)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !224, file: !1, line: 1100, type: !14)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !224, file: !1, line: 1100, type: !14)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !224, file: !1, line: 1100, type: !14)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !224, file: !1, line: 1100, type: !14)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !224, file: !1, line: 1100, type: !14)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !224, file: !1, line: 1100, type: !14)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m1", scope: !224, file: !1, line: 1101, type: !112)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m5", scope: !224, file: !1, line: 1101, type: !112)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !224, file: !1, line: 1101, type: !112)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_cost", scope: !224, file: !1, line: 1102, type: !14)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_cbp_tmp", scope: !224, file: !1, line: 1103, type: !14)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCcoded", scope: !224, file: !1, line: 1104, type: !14)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !224, file: !1, line: 1105, type: !126)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !224, file: !1, line: 1107, type: !14)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !224, file: !1, line: 1107, type: !14)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !224, file: !1, line: 1107, type: !14)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_c", scope: !224, file: !1, line: 1108, type: !14)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !224, file: !1, line: 1110, type: !14)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCLevel", scope: !224, file: !1, line: 1111, type: !25)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCRun", scope: !224, file: !1, line: 1112, type: !25)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !224, file: !1, line: 1113, type: !25)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !224, file: !1, line: 1114, type: !25)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intra", scope: !224, file: !1, line: 1115, type: !14)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv_scale", scope: !224, file: !1, line: 1116, type: !14)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbpblk_pattern", scope: !224, file: !1, line: 1119, type: !262)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, align: 64, elements: !56)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yuv", scope: !224, file: !1, line: 1120, type: !14)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !224, file: !1, line: 1121, type: !14)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m3", scope: !224, file: !1, line: 1122, type: !109)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m4", scope: !224, file: !1, line: 1123, type: !109)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per_dc", scope: !224, file: !1, line: 1124, type: !14)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem_dc", scope: !224, file: !1, line: 1125, type: !14)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits_422", scope: !224, file: !1, line: 1126, type: !14)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lossless_qpprime", scope: !224, file: !1, line: 1127, type: !192)
!271 = !DISubprogram(name: "dct_chroma4x4", scope: !1, file: !1, line: 1728, type: !272, isLocal: false, isDefinition: true, scopeLine: 1729, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @dct_chroma4x4, variables: !274)
!272 = !DISubroutineType(types: !273)
!273 = !{!14, !14, !14, !14}
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 1, scope: !271, file: !1, line: 1728, type: !14)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 2, scope: !271, file: !1, line: 1728, type: !14)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b4", arg: 3, scope: !271, file: !1, line: 1728, type: !14)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !271, file: !1, line: 1732, type: !14)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !271, file: !1, line: 1732, type: !14)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !271, file: !1, line: 1732, type: !14)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !271, file: !1, line: 1732, type: !14)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilev", scope: !271, file: !1, line: 1732, type: !14)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m5", scope: !271, file: !1, line: 1732, type: !112)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !271, file: !1, line: 1732, type: !112)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !271, file: !1, line: 1732, type: !14)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !271, file: !1, line: 1733, type: !14)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !271, file: !1, line: 1733, type: !14)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !271, file: !1, line: 1733, type: !14)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzeroAC", scope: !271, file: !1, line: 1734, type: !14)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !271, file: !1, line: 1735, type: !126)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intra", scope: !271, file: !1, line: 1736, type: !14)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !271, file: !1, line: 1738, type: !14)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !271, file: !1, line: 1738, type: !14)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !271, file: !1, line: 1738, type: !14)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_c", scope: !271, file: !1, line: 1739, type: !14)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !271, file: !1, line: 1741, type: !25)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !271, file: !1, line: 1742, type: !25)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lossless_qpprime", scope: !271, file: !1, line: 1744, type: !192)
!299 = !DISubprogram(name: "dct_chroma_DC", scope: !1, file: !1, line: 1922, type: !225, isLocal: false, isDefinition: true, scopeLine: 1923, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @dct_chroma_DC, variables: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 1, scope: !299, file: !1, line: 1922, type: !14)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr_cbp", arg: 2, scope: !299, file: !1, line: 1922, type: !14)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !299, file: !1, line: 1924, type: !14)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !299, file: !1, line: 1924, type: !14)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !299, file: !1, line: 1924, type: !14)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !299, file: !1, line: 1924, type: !14)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !299, file: !1, line: 1924, type: !14)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !299, file: !1, line: 1924, type: !14)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCLevel", scope: !299, file: !1, line: 1925, type: !25)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCRun", scope: !299, file: !1, line: 1926, type: !25)
!311 = !DISubprogram(name: "dct_luma_sp", scope: !1, file: !1, line: 1972, type: !312, isLocal: false, isDefinition: true, scopeLine: 1973, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*)* @dct_luma_sp, variables: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!14, !14, !14, !25}
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 1, scope: !311, file: !1, line: 1972, type: !14)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 2, scope: !311, file: !1, line: 1972, type: !14)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coeff_cost", arg: 3, scope: !311, file: !1, line: 1972, type: !25)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !311, file: !1, line: 1976, type: !14)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !311, file: !1, line: 1976, type: !14)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !311, file: !1, line: 1976, type: !14)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !311, file: !1, line: 1976, type: !14)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilev", scope: !311, file: !1, line: 1976, type: !14)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m5", scope: !311, file: !1, line: 1976, type: !112)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !311, file: !1, line: 1976, type: !112)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !311, file: !1, line: 1976, type: !14)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_const", scope: !311, file: !1, line: 1977, type: !14)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !311, file: !1, line: 1977, type: !14)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !311, file: !1, line: 1977, type: !14)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !311, file: !1, line: 1977, type: !14)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !311, file: !1, line: 1978, type: !14)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "predicted_block", scope: !311, file: !1, line: 1980, type: !109)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_err", scope: !311, file: !1, line: 1980, type: !14)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_const2", scope: !311, file: !1, line: 1980, type: !14)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !311, file: !1, line: 1981, type: !14)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !311, file: !1, line: 1981, type: !14)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !311, file: !1, line: 1981, type: !14)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per_sp", scope: !311, file: !1, line: 1982, type: !14)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem_sp", scope: !311, file: !1, line: 1982, type: !14)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits_sp", scope: !311, file: !1, line: 1982, type: !14)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos_x", scope: !311, file: !1, line: 1984, type: !14)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos_y", scope: !311, file: !1, line: 1985, type: !14)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !311, file: !1, line: 1986, type: !14)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !311, file: !1, line: 1987, type: !14)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !311, file: !1, line: 1988, type: !25)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !311, file: !1, line: 1989, type: !25)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !311, file: !1, line: 1990, type: !126)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_err1", scope: !311, file: !1, line: 1993, type: !14)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_err2", scope: !311, file: !1, line: 1993, type: !14)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level1", scope: !311, file: !1, line: 1993, type: !14)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level2", scope: !311, file: !1, line: 1993, type: !14)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D_dis1", scope: !311, file: !1, line: 1994, type: !175)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D_dis2", scope: !311, file: !1, line: 1994, type: !175)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !311, file: !1, line: 1995, type: !14)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !311, file: !1, line: 1995, type: !14)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_mode", scope: !311, file: !1, line: 1996, type: !175)
!356 = !DISubprogram(name: "dct_chroma_sp", scope: !1, file: !1, line: 2231, type: !225, isLocal: false, isDefinition: true, scopeLine: 2232, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @dct_chroma_sp, variables: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 1, scope: !356, file: !1, line: 2231, type: !14)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr_cbp", arg: 2, scope: !356, file: !1, line: 2231, type: !14)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !356, file: !1, line: 2233, type: !14)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !356, file: !1, line: 2233, type: !14)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !356, file: !1, line: 2233, type: !14)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j2", scope: !356, file: !1, line: 2233, type: !14)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilev", scope: !356, file: !1, line: 2233, type: !14)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !356, file: !1, line: 2233, type: !14)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !356, file: !1, line: 2233, type: !14)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !356, file: !1, line: 2233, type: !14)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !356, file: !1, line: 2233, type: !14)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !356, file: !1, line: 2233, type: !14)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_const", scope: !356, file: !1, line: 2233, type: !14)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_err", scope: !356, file: !1, line: 2233, type: !14)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !356, file: !1, line: 2233, type: !14)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !356, file: !1, line: 2233, type: !14)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !356, file: !1, line: 2233, type: !14)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m1", scope: !356, file: !1, line: 2234, type: !112)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m5", scope: !356, file: !1, line: 2234, type: !112)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !356, file: !1, line: 2234, type: !112)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_cost", scope: !356, file: !1, line: 2235, type: !14)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_cbp_tmp", scope: !356, file: !1, line: 2236, type: !14)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "predicted_chroma_block", scope: !356, file: !1, line: 2237, type: !381)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 32, elements: !382)
!382 = !{!138, !138}
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_const2", scope: !356, file: !1, line: 2237, type: !14)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp1", scope: !356, file: !1, line: 2237, type: !112)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !356, file: !1, line: 2238, type: !126)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !356, file: !1, line: 2240, type: !14)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !356, file: !1, line: 2240, type: !14)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !356, file: !1, line: 2240, type: !14)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per_sp", scope: !356, file: !1, line: 2241, type: !14)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem_sp", scope: !356, file: !1, line: 2241, type: !14)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits_sp", scope: !356, file: !1, line: 2241, type: !14)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !356, file: !1, line: 2243, type: !14)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCLevel", scope: !356, file: !1, line: 2244, type: !25)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DCRun", scope: !356, file: !1, line: 2245, type: !25)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !356, file: !1, line: 2246, type: !25)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !356, file: !1, line: 2247, type: !25)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_err1", scope: !356, file: !1, line: 2249, type: !14)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_err2", scope: !356, file: !1, line: 2249, type: !14)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level1", scope: !356, file: !1, line: 2249, type: !14)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level2", scope: !356, file: !1, line: 2249, type: !14)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !356, file: !1, line: 2250, type: !14)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !356, file: !1, line: 2250, type: !14)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D_dis1", scope: !356, file: !1, line: 2251, type: !175)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D_dis2", scope: !356, file: !1, line: 2251, type: !175)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_mode", scope: !356, file: !1, line: 2252, type: !175)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qpChroma", scope: !356, file: !1, line: 2255, type: !14)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qpChromaSP", scope: !356, file: !1, line: 2256, type: !14)
!408 = !DISubprogram(name: "copyblock_sp", scope: !1, file: !1, line: 2619, type: !409, isLocal: false, isDefinition: true, scopeLine: 2620, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @copyblock_sp, variables: !411)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !14, !14}
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 1, scope: !408, file: !1, line: 2619, type: !14)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 2, scope: !408, file: !1, line: 2619, type: !14)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !408, file: !1, line: 2623, type: !14)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !408, file: !1, line: 2623, type: !14)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !408, file: !1, line: 2623, type: !14)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !408, file: !1, line: 2623, type: !14)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m5", scope: !408, file: !1, line: 2623, type: !112)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !408, file: !1, line: 2623, type: !112)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !408, file: !1, line: 2625, type: !126)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "predicted_block", scope: !408, file: !1, line: 2627, type: !109)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !408, file: !1, line: 2628, type: !14)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !408, file: !1, line: 2629, type: !14)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !408, file: !1, line: 2630, type: !14)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_const2", scope: !408, file: !1, line: 2631, type: !14)
!426 = !{!427, !436, !438, !439, !442, !446, !449, !453, !454, !459, !460, !644, !645, !646, !647, !648, !649, !651, !653, !654, !655, !656, !657, !693, !788, !789, !790, !792, !793, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !812, !813, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !829, !830, !831, !832, !833, !834, !835, !837, !840, !841, !842, !843, !844, !845, !856, !892, !893, !894, !895, !896, !954, !955, !956, !957, !958, !962, !963, !964, !965, !966, !967, !968, !969, !970, !973}
!427 = !DIGlobalVariable(name: "QP_SCALE_CR", scope: !0, file: !428, line: 22, type: !429, isLocal: false, isDefinition: true, variable: [52 x i8]* @QP_SCALE_CR)
!428 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 416, align: 8, elements: !434)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !432, line: 30, baseType: !433)
!432 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!433 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!434 = !{!435}
!435 = !DISubrange(count: 52)
!436 = !DIGlobalVariable(name: "SNGL_SCAN", scope: !0, file: !428, line: 32, type: !437, isLocal: false, isDefinition: true, variable: [16 x [2 x i8]]* @SNGL_SCAN)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 256, align: 8, elements: !74)
!438 = !DIGlobalVariable(name: "FIELD_SCAN", scope: !0, file: !428, line: 41, type: !437, isLocal: false, isDefinition: true, variable: [16 x [2 x i8]]* @FIELD_SCAN)
!439 = !DIGlobalVariable(name: "COEFF_COST", scope: !0, file: !428, line: 51, type: !440, isLocal: false, isDefinition: true, variable: [2 x [16 x i8]]* @COEFF_COST)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 256, align: 8, elements: !441)
!441 = !{!76, !75}
!442 = !DIGlobalVariable(name: "COEFF_BIT_COST", scope: !0, file: !428, line: 60, type: !443, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i8]]]* @COEFF_BIT_COST)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 6144, align: 8, elements: !444)
!444 = !{!445, !75, !75}
!445 = !DISubrange(count: 3)
!446 = !DIGlobalVariable(name: "SCAN_YUV422", scope: !0, file: !428, line: 117, type: !447, isLocal: false, isDefinition: true, variable: [8 x [2 x i8]]* @SCAN_YUV422)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, align: 8, elements: !448)
!448 = !{!138, !76}
!449 = !DIGlobalVariable(name: "hor_offset", scope: !0, file: !428, line: 126, type: !450, isLocal: false, isDefinition: true, variable: [4 x [4 x [4 x i8]]]* @hor_offset)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 512, align: 8, elements: !452)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!452 = !{!57, !57, !57}
!453 = !DIGlobalVariable(name: "ver_offset", scope: !0, file: !428, line: 147, type: !450, isLocal: false, isDefinition: true, variable: [4 x [4 x [4 x i8]]]* @ver_offset)
!454 = !DIGlobalVariable(name: "quant_coef", scope: !0, file: !1, line: 39, type: !455, isLocal: false, isDefinition: true, variable: [6 x [4 x [4 x i32]]]* @quant_coef)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 3072, align: 32, elements: !457)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!457 = !{!458, !57, !57}
!458 = !DISubrange(count: 6)
!459 = !DIGlobalVariable(name: "dequant_coef", scope: !0, file: !1, line: 48, type: !455, isLocal: false, isDefinition: true, variable: [6 x [4 x [4 x i32]]]* @dequant_coef)
!460 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !461, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !464)
!464 = !{!465, !466, !467, !639, !640, !642, !643}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !463, file: !9, line: 477, baseType: !14, size: 32, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !463, file: !9, line: 478, baseType: !14, size: 32, align: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !463, file: !9, line: 479, baseType: !468, size: 6400, align: 64, offset: 64)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 6400, align: 64, elements: !637)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !554, !586, !613, !622, !623, !624, !625, !626, !627, !628, !629, !630, !634}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !471, file: !9, line: 445, baseType: !14, size: 32, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !471, file: !9, line: 446, baseType: !14, size: 32, align: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !471, file: !9, line: 447, baseType: !14, size: 32, align: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !471, file: !9, line: 448, baseType: !14, size: 32, align: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !471, file: !9, line: 449, baseType: !14, size: 32, align: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !471, file: !9, line: 450, baseType: !14, size: 32, align: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !471, file: !9, line: 451, baseType: !480, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !482)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !483)
!483 = !{!484, !501, !526}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !482, file: !9, line: 433, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !500}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !487, file: !9, line: 413, baseType: !14, size: 32, align: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !487, file: !9, line: 414, baseType: !14, size: 32, align: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !487, file: !9, line: 415, baseType: !431, size: 8, align: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !487, file: !9, line: 416, baseType: !14, size: 32, align: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !487, file: !9, line: 417, baseType: !14, size: 32, align: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !487, file: !9, line: 418, baseType: !431, size: 8, align: 8, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !487, file: !9, line: 420, baseType: !431, size: 8, align: 8, offset: 168)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !487, file: !9, line: 421, baseType: !14, size: 32, align: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !487, file: !9, line: 422, baseType: !14, size: 32, align: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !487, file: !9, line: 424, baseType: !499, size: 64, align: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !487, file: !9, line: 425, baseType: !14, size: 32, align: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !482, file: !9, line: 434, baseType: !502, size: 832, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !503)
!503 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !504)
!504 = !{!505, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !503, file: !9, line: 209, baseType: !506, size: 32, align: 32)
!506 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !503, file: !9, line: 209, baseType: !506, size: 32, align: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !503, file: !9, line: 210, baseType: !506, size: 32, align: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !503, file: !9, line: 211, baseType: !506, size: 32, align: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !503, file: !9, line: 212, baseType: !506, size: 32, align: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !503, file: !9, line: 213, baseType: !499, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !503, file: !9, line: 214, baseType: !25, size: 64, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !503, file: !9, line: 217, baseType: !506, size: 32, align: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !503, file: !9, line: 217, baseType: !506, size: 32, align: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !503, file: !9, line: 218, baseType: !506, size: 32, align: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !503, file: !9, line: 219, baseType: !506, size: 32, align: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !503, file: !9, line: 220, baseType: !506, size: 32, align: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !503, file: !9, line: 221, baseType: !499, size: 64, align: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !503, file: !9, line: 222, baseType: !25, size: 64, align: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !503, file: !9, line: 223, baseType: !14, size: 32, align: 32, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !503, file: !9, line: 223, baseType: !14, size: 32, align: 32, offset: 672)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !503, file: !9, line: 224, baseType: !14, size: 32, align: 32, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !503, file: !9, line: 224, baseType: !14, size: 32, align: 32, offset: 736)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !503, file: !9, line: 225, baseType: !14, size: 32, align: 32, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !503, file: !9, line: 225, baseType: !14, size: 32, align: 32, offset: 800)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !482, file: !9, line: 436, baseType: !527, size: 64, align: 64, offset: 896)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!14, !530, !553}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !546}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !532, file: !9, line: 329, baseType: !14, size: 32, align: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !532, file: !9, line: 330, baseType: !14, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !532, file: !9, line: 331, baseType: !14, size: 32, align: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !532, file: !9, line: 332, baseType: !14, size: 32, align: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !532, file: !9, line: 333, baseType: !14, size: 32, align: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !532, file: !9, line: 334, baseType: !506, size: 32, align: 32, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !532, file: !9, line: 335, baseType: !14, size: 32, align: 32, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !532, file: !9, line: 336, baseType: !14, size: 32, align: 32, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !532, file: !9, line: 344, baseType: !543, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !14, !14, !25, !25}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !532, file: !9, line: 346, baseType: !547, size: 64, align: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !550, !551}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !471, file: !9, line: 452, baseType: !555, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !558)
!558 = !{!559, !569, !573, !577, !580, !582, !583}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !557, file: !9, line: 260, baseType: !560, size: 4224, align: 64)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 4224, align: 64, elements: !567)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !562, file: !9, line: 233, baseType: !15, size: 16, align: 16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !562, file: !9, line: 234, baseType: !433, size: 8, align: 8, offset: 16)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !562, file: !9, line: 236, baseType: !155, size: 64, align: 64, offset: 64)
!567 = !{!445, !568}
!568 = !DISubrange(count: 11)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !557, file: !9, line: 261, baseType: !570, size: 2304, align: 64, offset: 4224)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 2304, align: 64, elements: !571)
!571 = !{!76, !572}
!572 = !DISubrange(count: 9)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !557, file: !9, line: 262, baseType: !574, size: 2560, align: 64, offset: 6528)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 2560, align: 64, elements: !575)
!575 = !{!76, !576}
!576 = !DISubrange(count: 10)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !557, file: !9, line: 263, baseType: !578, size: 1536, align: 64, offset: 9088)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 1536, align: 64, elements: !579)
!579 = !{!76, !458}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !557, file: !9, line: 264, baseType: !581, size: 512, align: 64, offset: 10624)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 512, align: 64, elements: !56)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !557, file: !9, line: 265, baseType: !581, size: 512, align: 64, offset: 11136)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !557, file: !9, line: 266, baseType: !584, size: 384, align: 64, offset: 11648)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 384, align: 64, elements: !585)
!585 = !{!445}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !471, file: !9, line: 453, baseType: !587, size: 64, align: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !589)
!589 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !590)
!590 = !{!591, !594, !595, !598, !601, !605, !606, !610, !611, !612}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !589, file: !9, line: 283, baseType: !592, size: 256, align: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 256, align: 64, elements: !593)
!593 = !{!76}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !589, file: !9, line: 284, baseType: !581, size: 512, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !589, file: !9, line: 285, baseType: !596, size: 1536, align: 64, offset: 768)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 1536, align: 64, elements: !597)
!597 = !{!445, !57}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !589, file: !9, line: 286, baseType: !599, size: 5120, align: 64, offset: 2304)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 5120, align: 64, elements: !600)
!600 = !{!576, !57}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !589, file: !9, line: 287, baseType: !602, size: 19200, align: 64, offset: 7424)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 19200, align: 64, elements: !603)
!603 = !{!576, !604}
!604 = !DISubrange(count: 15)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !589, file: !9, line: 288, baseType: !602, size: 19200, align: 64, offset: 26624)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !589, file: !9, line: 289, baseType: !607, size: 6400, align: 64, offset: 45824)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 6400, align: 64, elements: !608)
!608 = !{!576, !609}
!609 = !DISubrange(count: 5)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !589, file: !9, line: 290, baseType: !607, size: 6400, align: 64, offset: 52224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !589, file: !9, line: 291, baseType: !602, size: 19200, align: 64, offset: 58624)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !589, file: !9, line: 292, baseType: !602, size: 19200, align: 64, offset: 77824)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !471, file: !9, line: 456, baseType: !614, size: 64, align: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !616, file: !9, line: 310, baseType: !14, size: 32, align: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !616, file: !9, line: 311, baseType: !14, size: 32, align: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !616, file: !9, line: 312, baseType: !621, size: 64, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !471, file: !9, line: 458, baseType: !14, size: 32, align: 32, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !471, file: !9, line: 459, baseType: !25, size: 64, align: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !471, file: !9, line: 460, baseType: !25, size: 64, align: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !471, file: !9, line: 461, baseType: !25, size: 64, align: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !471, file: !9, line: 462, baseType: !14, size: 32, align: 32, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !471, file: !9, line: 463, baseType: !25, size: 64, align: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !471, file: !9, line: 464, baseType: !25, size: 64, align: 64, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !471, file: !9, line: 465, baseType: !25, size: 64, align: 64, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !471, file: !9, line: 467, baseType: !631, size: 64, align: 64, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!192, !14}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !471, file: !9, line: 469, baseType: !635, size: 192, align: 32, offset: 1024)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, align: 32, elements: !636)
!636 = !{!445, !76}
!637 = !{!638}
!638 = !DISubrange(count: 100)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !463, file: !9, line: 480, baseType: !14, size: 32, align: 32, offset: 6464)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !463, file: !9, line: 481, baseType: !641, size: 32, align: 32, offset: 6496)
!641 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !463, file: !9, line: 482, baseType: !641, size: 32, align: 32, offset: 6528)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !463, file: !9, line: 483, baseType: !641, size: 32, align: 32, offset: 6560)
!644 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !461, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!645 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !461, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!646 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !461, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!647 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !461, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!648 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !40, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!649 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !650, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!651 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !652, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!653 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !506, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!654 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !506, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!655 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !14, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!656 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !14, isLocal: false, isDefinition: true, variable: i32* @me_time)
!657 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !658, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !660, file: !4, line: 105, baseType: !192, size: 32, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !660, file: !4, line: 106, baseType: !506, size: 32, align: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !660, file: !4, line: 107, baseType: !506, size: 32, align: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !660, file: !4, line: 108, baseType: !192, size: 32, align: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !660, file: !4, line: 110, baseType: !192, size: 32, align: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !660, file: !4, line: 111, baseType: !192, size: 32, align: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !660, file: !4, line: 112, baseType: !136, size: 256, align: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !660, file: !4, line: 115, baseType: !192, size: 32, align: 32, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !660, file: !4, line: 116, baseType: !506, size: 32, align: 32, offset: 480)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !660, file: !4, line: 117, baseType: !506, size: 32, align: 32, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !660, file: !4, line: 119, baseType: !673, size: 256, align: 32, offset: 544)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 256, align: 32, elements: !137)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !660, file: !4, line: 121, baseType: !673, size: 256, align: 32, offset: 800)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !660, file: !4, line: 122, baseType: !673, size: 256, align: 32, offset: 1056)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !660, file: !4, line: 124, baseType: !192, size: 32, align: 32, offset: 1312)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !660, file: !4, line: 125, baseType: !506, size: 32, align: 32, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !660, file: !4, line: 127, baseType: !506, size: 32, align: 32, offset: 1376)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !660, file: !4, line: 128, baseType: !499, size: 64, align: 64, offset: 1408)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !660, file: !4, line: 130, baseType: !14, size: 32, align: 32, offset: 1472)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !660, file: !4, line: 131, baseType: !14, size: 32, align: 32, offset: 1504)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !660, file: !4, line: 132, baseType: !192, size: 32, align: 32, offset: 1536)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !660, file: !4, line: 133, baseType: !506, size: 32, align: 32, offset: 1568)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !660, file: !4, line: 134, baseType: !14, size: 32, align: 32, offset: 1600)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !660, file: !4, line: 135, baseType: !14, size: 32, align: 32, offset: 1632)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !660, file: !4, line: 136, baseType: !14, size: 32, align: 32, offset: 1664)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !660, file: !4, line: 138, baseType: !14, size: 32, align: 32, offset: 1696)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !660, file: !4, line: 139, baseType: !14, size: 32, align: 32, offset: 1728)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !660, file: !4, line: 141, baseType: !192, size: 32, align: 32, offset: 1760)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !660, file: !4, line: 142, baseType: !192, size: 32, align: 32, offset: 1792)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !660, file: !4, line: 143, baseType: !192, size: 32, align: 32, offset: 1824)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !660, file: !4, line: 144, baseType: !192, size: 32, align: 32, offset: 1856)
!693 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !694, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !696)
!696 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !696, file: !4, line: 151, baseType: !192, size: 32, align: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !696, file: !4, line: 153, baseType: !506, size: 32, align: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !696, file: !4, line: 154, baseType: !192, size: 32, align: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !696, file: !4, line: 155, baseType: !192, size: 32, align: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !696, file: !4, line: 156, baseType: !192, size: 32, align: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !696, file: !4, line: 157, baseType: !192, size: 32, align: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !696, file: !4, line: 158, baseType: !506, size: 32, align: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !696, file: !4, line: 159, baseType: !506, size: 32, align: 32, offset: 224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !696, file: !4, line: 160, baseType: !506, size: 32, align: 32, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !696, file: !4, line: 162, baseType: !192, size: 32, align: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !696, file: !4, line: 163, baseType: !136, size: 256, align: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !696, file: !4, line: 165, baseType: !506, size: 32, align: 32, offset: 576)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !696, file: !4, line: 166, baseType: !506, size: 32, align: 32, offset: 608)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !696, file: !4, line: 167, baseType: !506, size: 32, align: 32, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !696, file: !4, line: 168, baseType: !506, size: 32, align: 32, offset: 672)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !696, file: !4, line: 170, baseType: !506, size: 32, align: 32, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !696, file: !4, line: 172, baseType: !192, size: 32, align: 32, offset: 736)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !696, file: !4, line: 173, baseType: !14, size: 32, align: 32, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !696, file: !4, line: 174, baseType: !14, size: 32, align: 32, offset: 800)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !696, file: !4, line: 175, baseType: !506, size: 32, align: 32, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !696, file: !4, line: 177, baseType: !719, size: 8192, align: 32, offset: 864)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, align: 32, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !696, file: !4, line: 178, baseType: !506, size: 32, align: 32, offset: 9056)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !696, file: !4, line: 179, baseType: !192, size: 32, align: 32, offset: 9088)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !696, file: !4, line: 180, baseType: !506, size: 32, align: 32, offset: 9120)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !696, file: !4, line: 181, baseType: !506, size: 32, align: 32, offset: 9152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !696, file: !4, line: 182, baseType: !192, size: 32, align: 32, offset: 9184)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !696, file: !4, line: 184, baseType: !192, size: 32, align: 32, offset: 9216)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !696, file: !4, line: 185, baseType: !192, size: 32, align: 32, offset: 9248)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !696, file: !4, line: 186, baseType: !192, size: 32, align: 32, offset: 9280)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !696, file: !4, line: 187, baseType: !506, size: 32, align: 32, offset: 9312)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !696, file: !4, line: 188, baseType: !506, size: 32, align: 32, offset: 9344)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !696, file: !4, line: 189, baseType: !506, size: 32, align: 32, offset: 9376)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !696, file: !4, line: 190, baseType: !506, size: 32, align: 32, offset: 9408)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !696, file: !4, line: 191, baseType: !192, size: 32, align: 32, offset: 9440)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !696, file: !4, line: 192, baseType: !736, size: 7584, align: 32, offset: 9472)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !737)
!737 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !737, file: !4, line: 65, baseType: !192, size: 32, align: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !737, file: !4, line: 66, baseType: !506, size: 32, align: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !737, file: !4, line: 67, baseType: !506, size: 32, align: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !737, file: !4, line: 68, baseType: !506, size: 32, align: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !737, file: !4, line: 69, baseType: !192, size: 32, align: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !737, file: !4, line: 70, baseType: !192, size: 32, align: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !737, file: !4, line: 71, baseType: !192, size: 32, align: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !737, file: !4, line: 72, baseType: !506, size: 32, align: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !737, file: !4, line: 73, baseType: !192, size: 32, align: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !737, file: !4, line: 74, baseType: !192, size: 32, align: 32, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !737, file: !4, line: 75, baseType: !506, size: 32, align: 32, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !737, file: !4, line: 76, baseType: !506, size: 32, align: 32, offset: 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !737, file: !4, line: 77, baseType: !506, size: 32, align: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !737, file: !4, line: 78, baseType: !192, size: 32, align: 32, offset: 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !737, file: !4, line: 79, baseType: !506, size: 32, align: 32, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !737, file: !4, line: 80, baseType: !506, size: 32, align: 32, offset: 480)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !737, file: !4, line: 81, baseType: !192, size: 32, align: 32, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !737, file: !4, line: 82, baseType: !506, size: 32, align: 32, offset: 544)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !737, file: !4, line: 83, baseType: !506, size: 32, align: 32, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !737, file: !4, line: 84, baseType: !192, size: 32, align: 32, offset: 608)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !737, file: !4, line: 85, baseType: !192, size: 32, align: 32, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !737, file: !4, line: 86, baseType: !761, size: 3296, align: 32, offset: 672)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !763)
!763 = !{!764, !765, !766, !767, !771, !772, !773, !774, !775, !776}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !762, file: !4, line: 50, baseType: !506, size: 32, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !762, file: !4, line: 51, baseType: !506, size: 32, align: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !762, file: !4, line: 52, baseType: !506, size: 32, align: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !762, file: !4, line: 53, baseType: !768, size: 1024, align: 32, offset: 96)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 1024, align: 32, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !762, file: !4, line: 54, baseType: !768, size: 1024, align: 32, offset: 1120)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !762, file: !4, line: 55, baseType: !768, size: 1024, align: 32, offset: 2144)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !762, file: !4, line: 56, baseType: !506, size: 32, align: 32, offset: 3168)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !762, file: !4, line: 57, baseType: !506, size: 32, align: 32, offset: 3200)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !762, file: !4, line: 58, baseType: !506, size: 32, align: 32, offset: 3232)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !762, file: !4, line: 59, baseType: !506, size: 32, align: 32, offset: 3264)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !737, file: !4, line: 87, baseType: !192, size: 32, align: 32, offset: 3968)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !737, file: !4, line: 88, baseType: !761, size: 3296, align: 32, offset: 4000)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !737, file: !4, line: 90, baseType: !192, size: 32, align: 32, offset: 7296)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !737, file: !4, line: 91, baseType: !192, size: 32, align: 32, offset: 7328)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !737, file: !4, line: 92, baseType: !192, size: 32, align: 32, offset: 7360)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !737, file: !4, line: 93, baseType: !506, size: 32, align: 32, offset: 7392)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !737, file: !4, line: 94, baseType: !506, size: 32, align: 32, offset: 7424)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !737, file: !4, line: 95, baseType: !506, size: 32, align: 32, offset: 7456)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !737, file: !4, line: 96, baseType: !506, size: 32, align: 32, offset: 7488)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !737, file: !4, line: 97, baseType: !506, size: 32, align: 32, offset: 7520)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !737, file: !4, line: 98, baseType: !506, size: 32, align: 32, offset: 7552)
!788 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !14, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!789 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !14, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!790 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !791, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!792 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !791, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!793 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !794, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!795 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !14, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!796 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !14, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!797 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !14, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!798 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !14, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!799 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !40, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!800 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !40, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!801 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !650, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!802 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !650, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!803 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !40, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!804 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !650, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!805 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !40, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!806 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !650, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!807 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !808, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!812 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !809, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!813 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !814, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!815 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !814, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!816 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !14, isLocal: false, isDefinition: true, variable: i32* @intras)
!817 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !14, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!818 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !14, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!819 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !14, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!820 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !14, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!821 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !14, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!822 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !14, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!823 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !14, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!824 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !825, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 2400, align: 8, elements: !827)
!826 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!827 = !{!828}
!828 = !DISubrange(count: 300)
