; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/cabac.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !45, subprograms: !115, globals: !567, imports: !119)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/cabac.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !28, !35, !40}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 119, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!6 = !DIEnumerator(name: "SE_HEADER", value: 0)
!7 = !DIEnumerator(name: "SE_PTYPE", value: 1)
!8 = !DIEnumerator(name: "SE_MBTYPE", value: 2)
!9 = !DIEnumerator(name: "SE_REFFRAME", value: 3)
!10 = !DIEnumerator(name: "SE_INTRAPREDMODE", value: 4)
!11 = !DIEnumerator(name: "SE_MVD", value: 5)
!12 = !DIEnumerator(name: "SE_CBP_INTRA", value: 6)
!13 = !DIEnumerator(name: "SE_LUM_DC_INTRA", value: 7)
!14 = !DIEnumerator(name: "SE_CHR_DC_INTRA", value: 8)
!15 = !DIEnumerator(name: "SE_LUM_AC_INTRA", value: 9)
!16 = !DIEnumerator(name: "SE_CHR_AC_INTRA", value: 10)
!17 = !DIEnumerator(name: "SE_CBP_INTER", value: 11)
!18 = !DIEnumerator(name: "SE_LUM_DC_INTER", value: 12)
!19 = !DIEnumerator(name: "SE_CHR_DC_INTER", value: 13)
!20 = !DIEnumerator(name: "SE_LUM_AC_INTER", value: 14)
!21 = !DIEnumerator(name: "SE_CHR_AC_INTER", value: 15)
!22 = !DIEnumerator(name: "SE_DELTA_QUANT_INTER", value: 16)
!23 = !DIEnumerator(name: "SE_DELTA_QUANT_INTRA", value: 17)
!24 = !DIEnumerator(name: "SE_BFRAME", value: 18)
!25 = !DIEnumerator(name: "SE_EOS", value: 19)
!26 = !DIEnumerator(name: "SE_TRANSFORM_SIZE_FLAG", value: 20)
!27 = !DIEnumerator(name: "SE_MAX_ELEMENTS", value: 21)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "P_SLICE", value: 0)
!31 = !DIEnumerator(name: "B_SLICE", value: 1)
!32 = !DIEnumerator(name: "I_SLICE", value: 2)
!33 = !DIEnumerator(name: "SP_SLICE", value: 3)
!34 = !DIEnumerator(name: "SI_SLICE", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 185, size: 32, align: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "FRAME", value: 0)
!38 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!39 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, size: 32, align: 32, elements: !42)
!41 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!42 = !{!43, !44}
!43 = !DIEnumerator(name: "FALSE", value: 0)
!44 = !DIEnumerator(name: "TRUE", value: 1)
!45 = !{!46, !85, !86, !58, !112, !113, !114}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !49)
!49 = !{!50, !64, !69, !73, !77, !81, !82}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !48, file: !4, line: 260, baseType: !51, size: 4224, align: 64)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 4224, align: 64, elements: !61)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !54)
!54 = !{!55, !57, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !4, line: 233, baseType: !56, size: 16, align: 16)
!56 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !53, file: !4, line: 234, baseType: !58, size: 8, align: 8, offset: 16)
!58 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !4, line: 236, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!61 = !{!62, !63}
!62 = !DISubrange(count: 3)
!63 = !DISubrange(count: 11)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !48, file: !4, line: 261, baseType: !65, size: 2304, align: 64, offset: 4224)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2304, align: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DISubrange(count: 2)
!68 = !DISubrange(count: 9)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !48, file: !4, line: 262, baseType: !70, size: 2560, align: 64, offset: 6528)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2560, align: 64, elements: !71)
!71 = !{!67, !72}
!72 = !DISubrange(count: 10)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !48, file: !4, line: 263, baseType: !74, size: 1536, align: 64, offset: 9088)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1536, align: 64, elements: !75)
!75 = !{!67, !76}
!76 = !DISubrange(count: 6)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !48, file: !4, line: 264, baseType: !78, size: 512, align: 64, offset: 10624)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, align: 64, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 4)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !48, file: !4, line: 265, baseType: !78, size: 512, align: 64, offset: 11136)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !48, file: !4, line: 266, baseType: !83, size: 384, align: 64, offset: 11648)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 384, align: 64, elements: !84)
!84 = !{!62}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !89)
!89 = !{!90, !93, !94, !97, !100, !104, !105, !109, !110, !111}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !88, file: !4, line: 283, baseType: !91, size: 256, align: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 256, align: 64, elements: !92)
!92 = !{!67}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !88, file: !4, line: 284, baseType: !78, size: 512, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !88, file: !4, line: 285, baseType: !95, size: 1536, align: 64, offset: 768)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1536, align: 64, elements: !96)
!96 = !{!62, !80}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !88, file: !4, line: 286, baseType: !98, size: 5120, align: 64, offset: 2304)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 5120, align: 64, elements: !99)
!99 = !{!72, !80}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !88, file: !4, line: 287, baseType: !101, size: 19200, align: 64, offset: 7424)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 19200, align: 64, elements: !102)
!102 = !{!72, !103}
!103 = !DISubrange(count: 15)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !88, file: !4, line: 288, baseType: !101, size: 19200, align: 64, offset: 26624)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !88, file: !4, line: 289, baseType: !106, size: 6400, align: 64, offset: 45824)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 6400, align: 64, elements: !107)
!107 = !{!72, !108}
!108 = !DISubrange(count: 5)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !88, file: !4, line: 290, baseType: !106, size: 6400, align: 64, offset: 52224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !88, file: !4, line: 291, baseType: !101, size: 19200, align: 64, offset: 58624)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !88, file: !4, line: 292, baseType: !101, size: 19200, align: 64, offset: 77824)
!112 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!113 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!114 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!115 = !{!116, !120, !198, !203, !208, !213, !218, !302, !314, !325, !335, !350, !359, !364, !383, !393, !412, !422, !437, !450, !476, !495, !510, !516, !526, !537, !544, !554}
!116 = !DISubprogram(name: "cabac_new_slice", scope: !1, file: !1, line: 53, type: !117, isLocal: false, isDefinition: true, scopeLine: 54, isOptimized: true, function: void ()* @cabac_new_slice, variables: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{null}
!119 = !{}
!120 = !DISubprogram(name: "CheckAvailabilityOfNeighborsCABAC", scope: !1, file: !1, line: 66, type: !117, isLocal: false, isDefinition: true, scopeLine: 67, isOptimized: true, function: void ()* @CheckAvailabilityOfNeighborsCABAC, variables: !121)
!121 = !{!122, !187, !197}
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !120, file: !1, line: 68, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !4, line: 406, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !4, line: 351, size: 5056, align: 64, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !136, !138, !139, !140, !143, !147, !148, !149, !154, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !125, file: !4, line: 353, baseType: !114, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !125, file: !4, line: 354, baseType: !114, size: 32, align: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !125, file: !4, line: 355, baseType: !114, size: 32, align: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !125, file: !4, line: 356, baseType: !114, size: 32, align: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !125, file: !4, line: 357, baseType: !114, size: 32, align: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !125, file: !4, line: 358, baseType: !133, size: 256, align: 32, offset: 160)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, align: 32, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !125, file: !4, line: 360, baseType: !137, size: 64, align: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !125, file: !4, line: 361, baseType: !137, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !125, file: !4, line: 363, baseType: !114, size: 32, align: 32, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !125, file: !4, line: 364, baseType: !141, size: 2048, align: 32, offset: 608)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2048, align: 32, elements: !142)
!142 = !{!67, !80, !80, !67}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !125, file: !4, line: 365, baseType: !144, size: 512, align: 32, offset: 2656)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 512, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !125, file: !4, line: 366, baseType: !144, size: 512, align: 32, offset: 3168)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !125, file: !4, line: 367, baseType: !114, size: 32, align: 32, offset: 3680)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !125, file: !4, line: 368, baseType: !150, size: 64, align: 64, offset: 3712)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !152, line: 30, baseType: !153)
!152 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !125, file: !4, line: 369, baseType: !155, size: 128, align: 32, offset: 3776)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, align: 32, elements: !79)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !125, file: !4, line: 370, baseType: !155, size: 128, align: 32, offset: 3904)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !125, file: !4, line: 371, baseType: !60, size: 64, align: 64, offset: 4032)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !125, file: !4, line: 373, baseType: !114, size: 32, align: 32, offset: 4096)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !125, file: !4, line: 374, baseType: !114, size: 32, align: 32, offset: 4128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !125, file: !4, line: 375, baseType: !114, size: 32, align: 32, offset: 4160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !125, file: !4, line: 377, baseType: !114, size: 32, align: 32, offset: 4192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !125, file: !4, line: 378, baseType: !114, size: 32, align: 32, offset: 4224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !125, file: !4, line: 380, baseType: !114, size: 32, align: 32, offset: 4256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !125, file: !4, line: 382, baseType: !114, size: 32, align: 32, offset: 4288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !125, file: !4, line: 382, baseType: !114, size: 32, align: 32, offset: 4320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !125, file: !4, line: 382, baseType: !114, size: 32, align: 32, offset: 4352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !125, file: !4, line: 382, baseType: !114, size: 32, align: 32, offset: 4384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !125, file: !4, line: 383, baseType: !114, size: 32, align: 32, offset: 4416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !125, file: !4, line: 383, baseType: !114, size: 32, align: 32, offset: 4448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !125, file: !4, line: 383, baseType: !114, size: 32, align: 32, offset: 4480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !125, file: !4, line: 383, baseType: !114, size: 32, align: 32, offset: 4512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !125, file: !4, line: 385, baseType: !114, size: 32, align: 32, offset: 4544)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !125, file: !4, line: 386, baseType: !114, size: 32, align: 32, offset: 4576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !125, file: !4, line: 387, baseType: !114, size: 32, align: 32, offset: 4608)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !125, file: !4, line: 390, baseType: !114, size: 32, align: 32, offset: 4640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !125, file: !4, line: 394, baseType: !177, size: 64, align: 64, offset: 4672)
!177 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !125, file: !4, line: 395, baseType: !114, size: 32, align: 32, offset: 4736)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !125, file: !4, line: 396, baseType: !114, size: 32, align: 32, offset: 4768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !125, file: !4, line: 397, baseType: !114, size: 32, align: 32, offset: 4800)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !125, file: !4, line: 398, baseType: !114, size: 32, align: 32, offset: 4832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !125, file: !4, line: 399, baseType: !114, size: 32, align: 32, offset: 4864)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !125, file: !4, line: 401, baseType: !114, size: 32, align: 32, offset: 4896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !125, file: !4, line: 402, baseType: !114, size: 32, align: 32, offset: 4928)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !125, file: !4, line: 403, baseType: !114, size: 32, align: 32, offset: 4960)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !125, file: !4, line: 405, baseType: !114, size: 32, align: 32, offset: 4992)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !120, file: !1, line: 69, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !4, line: 305, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !4, line: 297, size: 192, align: 32, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !189, file: !4, line: 299, baseType: !114, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !189, file: !4, line: 300, baseType: !114, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !189, file: !4, line: 301, baseType: !114, size: 32, align: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !189, file: !4, line: 302, baseType: !114, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !189, file: !4, line: 303, baseType: !114, size: 32, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !189, file: !4, line: 304, baseType: !114, size: 32, align: 32, offset: 160)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !120, file: !1, line: 69, type: !188)
!198 = !DISubprogram(name: "create_contexts_MotionInfo", scope: !1, file: !1, line: 92, type: !199, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct.MotionInfoContexts* ()* @create_contexts_MotionInfo, variables: !201)
!199 = !DISubroutineType(types: !200)
!200 = !{!46}
!201 = !{!202}
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enco_ctx", scope: !198, file: !1, line: 94, type: !46)
!203 = !DISubprogram(name: "create_contexts_TextureInfo", scope: !1, file: !1, line: 111, type: !204, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: %struct.TextureInfoContexts* ()* @create_contexts_TextureInfo, variables: !206)
!204 = !DISubroutineType(types: !205)
!205 = !{!86}
!206 = !{!207}
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enco_ctx", scope: !203, file: !1, line: 113, type: !86)
!208 = !DISubprogram(name: "delete_contexts_MotionInfo", scope: !1, file: !1, line: 132, type: !209, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MotionInfoContexts*)* @delete_contexts_MotionInfo, variables: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !46}
!211 = !{!212}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enco_ctx", arg: 1, scope: !208, file: !1, line: 132, type: !46)
!213 = !DISubprogram(name: "delete_contexts_TextureInfo", scope: !1, file: !1, line: 149, type: !214, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.TextureInfoContexts*)* @delete_contexts_TextureInfo, variables: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !86}
!216 = !{!217}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enco_ctx", arg: 1, scope: !213, file: !1, line: 149, type: !86)
!218 = !DISubprogram(name: "writeSyntaxElement_CABAC", scope: !1, file: !1, line: 166, type: !219, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_CABAC, variables: !297)
!219 = !DISubroutineType(types: !220)
!220 = !{!114, !221, !271}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !238}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !4, line: 329, baseType: !114, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !223, file: !4, line: 330, baseType: !114, size: 32, align: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !223, file: !4, line: 331, baseType: !114, size: 32, align: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !223, file: !4, line: 332, baseType: !114, size: 32, align: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !223, file: !4, line: 333, baseType: !114, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !223, file: !4, line: 334, baseType: !113, size: 32, align: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !223, file: !4, line: 335, baseType: !114, size: 32, align: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !223, file: !4, line: 336, baseType: !114, size: 32, align: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !223, file: !4, line: 344, baseType: !234, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !114, !114, !237, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !223, file: !4, line: 346, baseType: !239, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !242, !243}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !246, file: !4, line: 209, baseType: !113, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !246, file: !4, line: 209, baseType: !113, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !246, file: !4, line: 210, baseType: !113, size: 32, align: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !246, file: !4, line: 211, baseType: !113, size: 32, align: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !246, file: !4, line: 212, baseType: !113, size: 32, align: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !246, file: !4, line: 213, baseType: !254, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !256, line: 30, baseType: !58)
!256 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !246, file: !4, line: 214, baseType: !237, size: 64, align: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !246, file: !4, line: 217, baseType: !113, size: 32, align: 32, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !246, file: !4, line: 217, baseType: !113, size: 32, align: 32, offset: 352)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !246, file: !4, line: 218, baseType: !113, size: 32, align: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !246, file: !4, line: 219, baseType: !113, size: 32, align: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !246, file: !4, line: 220, baseType: !113, size: 32, align: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !246, file: !4, line: 221, baseType: !254, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !246, file: !4, line: 222, baseType: !237, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !246, file: !4, line: 223, baseType: !114, size: 32, align: 32, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !246, file: !4, line: 223, baseType: !114, size: 32, align: 32, offset: 672)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !246, file: !4, line: 224, baseType: !114, size: 32, align: 32, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !246, file: !4, line: 224, baseType: !114, size: 32, align: 32, offset: 736)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !246, file: !4, line: 225, baseType: !114, size: 32, align: 32, offset: 768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !246, file: !4, line: 225, baseType: !114, size: 32, align: 32, offset: 800)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !274)
!274 = !{!275, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !273, file: !4, line: 433, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !278, file: !4, line: 413, baseType: !114, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !278, file: !4, line: 414, baseType: !114, size: 32, align: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !278, file: !4, line: 415, baseType: !255, size: 8, align: 8, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !278, file: !4, line: 416, baseType: !114, size: 32, align: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !278, file: !4, line: 417, baseType: !114, size: 32, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !278, file: !4, line: 418, baseType: !255, size: 8, align: 8, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !278, file: !4, line: 420, baseType: !255, size: 8, align: 8, offset: 168)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !278, file: !4, line: 421, baseType: !114, size: 32, align: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !278, file: !4, line: 422, baseType: !114, size: 32, align: 32, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !278, file: !4, line: 424, baseType: !254, size: 64, align: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !278, file: !4, line: 425, baseType: !114, size: 32, align: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !273, file: !4, line: 434, baseType: !245, size: 832, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !273, file: !4, line: 436, baseType: !293, size: 64, align: 64, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!114, !221, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!297 = !{!298, !299, !300, !301}
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !218, file: !1, line: 166, type: !221)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !218, file: !1, line: 166, type: !271)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_len", scope: !218, file: !1, line: 168, type: !114)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep_dp", scope: !218, file: !1, line: 169, type: !243)
!302 = !DISubprogram(name: "writeFieldModeInfo_CABAC", scope: !1, file: !1, line: 189, type: !303, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeFieldModeInfo_CABAC, variables: !305)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !221, !243}
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313}
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !302, file: !1, line: 189, type: !221)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !302, file: !1, line: 189, type: !243)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !302, file: !1, line: 191, type: !114)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !302, file: !1, line: 191, type: !114)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !302, file: !1, line: 191, type: !114)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !302, file: !1, line: 192, type: !46)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !302, file: !1, line: 193, type: !123)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_field", scope: !302, file: !1, line: 194, type: !114)
!314 = !DISubprogram(name: "writeMB_skip_flagInfo_CABAC", scope: !1, file: !1, line: 223, type: !303, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeMB_skip_flagInfo_CABAC, variables: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324}
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !314, file: !1, line: 223, type: !221)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !314, file: !1, line: 223, type: !243)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !314, file: !1, line: 225, type: !114)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !314, file: !1, line: 225, type: !114)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !314, file: !1, line: 225, type: !114)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !314, file: !1, line: 226, type: !114)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !314, file: !1, line: 227, type: !46)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !314, file: !1, line: 228, type: !123)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_mb_type", scope: !314, file: !1, line: 229, type: !114)
!325 = !DISubprogram(name: "writeMB_transform_size_CABAC", scope: !1, file: !1, line: 284, type: !303, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeMB_transform_size_CABAC, variables: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334}
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !325, file: !1, line: 284, type: !221)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !325, file: !1, line: 284, type: !243)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !325, file: !1, line: 286, type: !114)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !325, file: !1, line: 286, type: !114)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !325, file: !1, line: 287, type: !114)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !325, file: !1, line: 288, type: !114)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !325, file: !1, line: 290, type: !46)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !325, file: !1, line: 291, type: !123)
!335 = !DISubprogram(name: "writeMB_typeInfo_CABAC", scope: !1, file: !1, line: 322, type: !303, isLocal: false, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeMB_typeInfo_CABAC, variables: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !335, file: !1, line: 322, type: !221)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !335, file: !1, line: 322, type: !243)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !335, file: !1, line: 324, type: !114)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !335, file: !1, line: 324, type: !114)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !335, file: !1, line: 325, type: !114)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !335, file: !1, line: 326, type: !114)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "csym", scope: !335, file: !1, line: 327, type: !114)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !335, file: !1, line: 328, type: !114)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode_sym", scope: !335, file: !1, line: 329, type: !114)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode16x16", scope: !335, file: !1, line: 330, type: !114)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !335, file: !1, line: 333, type: !46)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !335, file: !1, line: 334, type: !123)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_mb_type", scope: !335, file: !1, line: 335, type: !114)
!350 = !DISubprogram(name: "writeB8_typeInfo_CABAC", scope: !1, file: !1, line: 580, type: !303, isLocal: false, isDefinition: true, scopeLine: 581, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeB8_typeInfo_CABAC, variables: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358}
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !350, file: !1, line: 580, type: !221)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !350, file: !1, line: 580, type: !243)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !350, file: !1, line: 582, type: !114)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !350, file: !1, line: 583, type: !114)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "csym", scope: !350, file: !1, line: 583, type: !114)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !350, file: !1, line: 584, type: !114)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !350, file: !1, line: 586, type: !46)
!359 = !DISubprogram(name: "writeIntraPredMode_CABAC", scope: !1, file: !1, line: 677, type: !303, isLocal: false, isDefinition: true, scopeLine: 678, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeIntraPredMode_CABAC, variables: !360)
!360 = !{!361, !362, !363}
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !359, file: !1, line: 677, type: !221)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !359, file: !1, line: 677, type: !243)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !359, file: !1, line: 679, type: !86)
!364 = !DISubprogram(name: "writeRefFrame_CABAC", scope: !1, file: !1, line: 701, type: !303, isLocal: false, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeRefFrame_CABAC, variables: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !378, !379, !380, !381, !382}
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !364, file: !1, line: 701, type: !221)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !364, file: !1, line: 701, type: !243)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !364, file: !1, line: 703, type: !46)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !364, file: !1, line: 704, type: !123)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addctx", scope: !364, file: !1, line: 705, type: !114)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !364, file: !1, line: 707, type: !114)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !364, file: !1, line: 707, type: !114)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !364, file: !1, line: 708, type: !114)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !364, file: !1, line: 709, type: !114)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refframe_array", scope: !364, file: !1, line: 710, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bslice", scope: !364, file: !1, line: 712, type: !114)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8a", scope: !364, file: !1, line: 714, type: !114)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8b", scope: !364, file: !1, line: 714, type: !114)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_a", scope: !364, file: !1, line: 716, type: !188)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_b", scope: !364, file: !1, line: 716, type: !188)
!383 = !DISubprogram(name: "writeDquant_CABAC", scope: !1, file: !1, line: 773, type: !303, isLocal: false, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeDquant_CABAC, variables: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392}
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !383, file: !1, line: 773, type: !221)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !383, file: !1, line: 773, type: !243)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !383, file: !1, line: 775, type: !46)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !383, file: !1, line: 777, type: !114)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !383, file: !1, line: 778, type: !114)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dquant", scope: !383, file: !1, line: 779, type: !114)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !383, file: !1, line: 780, type: !114)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !383, file: !1, line: 782, type: !123)
!393 = !DISubprogram(name: "writeMVD_CABAC", scope: !1, file: !1, line: 815, type: !303, isLocal: false, isDefinition: true, scopeLine: 816, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeMVD_CABAC, variables: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !393, file: !1, line: 815, type: !221)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !393, file: !1, line: 815, type: !243)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !393, file: !1, line: 817, type: !114)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !393, file: !1, line: 818, type: !114)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !393, file: !1, line: 819, type: !114)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !393, file: !1, line: 819, type: !114)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !393, file: !1, line: 820, type: !114)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !393, file: !1, line: 821, type: !114)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_pred_res", scope: !393, file: !1, line: 822, type: !114)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_local_err", scope: !393, file: !1, line: 823, type: !114)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_sign", scope: !393, file: !1, line: 824, type: !114)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_idx", scope: !393, file: !1, line: 825, type: !114)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !393, file: !1, line: 826, type: !114)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_a", scope: !393, file: !1, line: 828, type: !188)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_b", scope: !393, file: !1, line: 828, type: !188)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !393, file: !1, line: 830, type: !46)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !393, file: !1, line: 831, type: !123)
!412 = !DISubprogram(name: "writeCIPredMode_CABAC", scope: !1, file: !1, line: 899, type: !303, isLocal: false, isDefinition: true, scopeLine: 900, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeCIPredMode_CABAC, variables: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421}
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !412, file: !1, line: 899, type: !221)
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !412, file: !1, line: 899, type: !243)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !412, file: !1, line: 901, type: !86)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !412, file: !1, line: 902, type: !123)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_ctx", scope: !412, file: !1, line: 903, type: !114)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !412, file: !1, line: 903, type: !114)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !412, file: !1, line: 903, type: !114)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "act_sym", scope: !412, file: !1, line: 904, type: !114)
!422 = !DISubprogram(name: "writeCBP_BIT_CABAC", scope: !1, file: !1, line: 930, type: !423, isLocal: false, isDefinition: true, scopeLine: 931, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, %struct.macroblock*, i32, %struct.EncodingEnvironment*)* @writeCBP_BIT_CABAC, variables: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !114, !114, !114, !123, !114, !243}
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !422, file: !1, line: 930, type: !114)
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bit", arg: 2, scope: !422, file: !1, line: 930, type: !114)
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp", arg: 3, scope: !422, file: !1, line: 930, type: !114)
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 4, scope: !422, file: !1, line: 930, type: !123)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inter", arg: 5, scope: !422, file: !1, line: 930, type: !114)
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 6, scope: !422, file: !1, line: 930, type: !243)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_a", scope: !422, file: !1, line: 932, type: !188)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !422, file: !1, line: 933, type: !114)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !422, file: !1, line: 933, type: !114)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !422, file: !1, line: 935, type: !114)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !422, file: !1, line: 936, type: !114)
!437 = !DISubprogram(name: "writeCBP_CABAC", scope: !1, file: !1, line: 985, type: !303, isLocal: false, isDefinition: true, scopeLine: 986, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeCBP_CABAC, variables: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !437, file: !1, line: 985, type: !221)
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !437, file: !1, line: 985, type: !243)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !437, file: !1, line: 987, type: !86)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !437, file: !1, line: 988, type: !123)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !437, file: !1, line: 990, type: !114)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !437, file: !1, line: 990, type: !114)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_cbp_ctx", scope: !437, file: !1, line: 991, type: !114)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_cbp_idx", scope: !437, file: !1, line: 991, type: !114)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp", scope: !437, file: !1, line: 992, type: !114)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp_bit", scope: !437, file: !1, line: 993, type: !114)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !437, file: !1, line: 994, type: !114)
!450 = !DISubprogram(name: "write_and_store_CBP_block_bit", scope: !1, file: !1, line: 1076, type: !451, isLocal: false, isDefinition: true, scopeLine: 1077, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.macroblock*, %struct.EncodingEnvironment*, i32, i32)* @write_and_store_CBP_block_bit, variables: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !123, !243, !114, !114}
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !450, file: !1, line: 1076, type: !123)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !450, file: !1, line: 1076, type: !243)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !450, file: !1, line: 1076, type: !114)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp_bit", arg: 4, scope: !450, file: !1, line: 1076, type: !114)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y_ac", scope: !450, file: !1, line: 1080, type: !114)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y_dc", scope: !450, file: !1, line: 1081, type: !114)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u_ac", scope: !450, file: !1, line: 1082, type: !114)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v_ac", scope: !450, file: !1, line: 1083, type: !114)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chroma_dc", scope: !450, file: !1, line: 1084, type: !114)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u_dc", scope: !450, file: !1, line: 1085, type: !114)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v_dc", scope: !450, file: !1, line: 1086, type: !114)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !450, file: !1, line: 1087, type: !114)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !450, file: !1, line: 1088, type: !114)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit", scope: !450, file: !1, line: 1089, type: !114)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_bit", scope: !450, file: !1, line: 1090, type: !114)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upper_bit", scope: !450, file: !1, line: 1091, type: !114)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_bit", scope: !450, file: !1, line: 1092, type: !114)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !450, file: !1, line: 1093, type: !114)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_pos_a", scope: !450, file: !1, line: 1095, type: !114)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_pos_b", scope: !450, file: !1, line: 1096, type: !114)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_a", scope: !450, file: !1, line: 1098, type: !188)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_b", scope: !450, file: !1, line: 1098, type: !188)
!476 = !DISubprogram(name: "write_significance_map", scope: !1, file: !1, line: 1235, type: !477, isLocal: false, isDefinition: true, scopeLine: 1236, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.macroblock*, %struct.EncodingEnvironment*, i32, i32*, i32)* @write_significance_map, variables: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !123, !243, !114, !237, !114}
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !494}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !476, file: !1, line: 1235, type: !123)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !476, file: !1, line: 1235, type: !243)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !476, file: !1, line: 1235, type: !114)
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coeff", arg: 4, scope: !476, file: !1, line: 1235, type: !237)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coeff_ctr", arg: 5, scope: !476, file: !1, line: 1235, type: !114)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !476, file: !1, line: 1237, type: !112)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig", scope: !476, file: !1, line: 1237, type: !112)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !476, file: !1, line: 1237, type: !112)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k0", scope: !476, file: !1, line: 1238, type: !114)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k1", scope: !476, file: !1, line: 1239, type: !114)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fld", scope: !476, file: !1, line: 1241, type: !114)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map_ctx", scope: !476, file: !1, line: 1242, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextTypePtr", file: !4, line: 240, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last_ctx", scope: !476, file: !1, line: 1244, type: !492)
!495 = !DISubprogram(name: "write_significant_coefficients", scope: !1, file: !1, line: 1280, type: !496, isLocal: false, isDefinition: true, scopeLine: 1281, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.macroblock*, %struct.EncodingEnvironment*, i32, i32*)* @write_significant_coefficients, variables: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !123, !243, !114, !237}
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !495, file: !1, line: 1280, type: !123)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !495, file: !1, line: 1280, type: !243)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !495, file: !1, line: 1280, type: !114)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coeff", arg: 4, scope: !495, file: !1, line: 1280, type: !237)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !495, file: !1, line: 1282, type: !114)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "absLevel", scope: !495, file: !1, line: 1283, type: !114)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx", scope: !495, file: !1, line: 1284, type: !114)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !495, file: !1, line: 1285, type: !112)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "greater_one", scope: !495, file: !1, line: 1286, type: !112)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !495, file: !1, line: 1287, type: !114)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !495, file: !1, line: 1288, type: !114)
!510 = !DISubprogram(name: "writeRunLevel_CABAC", scope: !1, file: !1, line: 1327, type: !303, isLocal: false, isDefinition: true, scopeLine: 1328, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* @writeRunLevel_CABAC, variables: !511)
!511 = !{!512, !513, !514, !515}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !510, file: !1, line: 1327, type: !221)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 2, scope: !510, file: !1, line: 1327, type: !243)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !510, file: !1, line: 1333, type: !123)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !510, file: !1, line: 1334, type: !114)
!516 = !DISubprogram(name: "unary_bin_encode", scope: !1, file: !1, line: 1376, type: !517, isLocal: false, isDefinition: true, scopeLine: 1380, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i32, %struct.BiContextType*, i32)* @unary_bin_encode, variables: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !243, !113, !492, !114}
!519 = !{!520, !521, !522, !523, !524, !525}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 1, scope: !516, file: !1, line: 1376, type: !243)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !516, file: !1, line: 1377, type: !113)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !516, file: !1, line: 1378, type: !492)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx_offset", arg: 4, scope: !516, file: !1, line: 1379, type: !114)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !516, file: !1, line: 1381, type: !113)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ictx", scope: !516, file: !1, line: 1382, type: !492)
!526 = !DISubprogram(name: "unary_bin_max_encode", scope: !1, file: !1, line: 1410, type: !527, isLocal: false, isDefinition: true, scopeLine: 1415, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i32, %struct.BiContextType*, i32, i32)* @unary_bin_max_encode, variables: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !243, !113, !492, !114, !113}
!529 = !{!530, !531, !532, !533, !534, !535, !536}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 1, scope: !526, file: !1, line: 1410, type: !243)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !526, file: !1, line: 1411, type: !113)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !526, file: !1, line: 1412, type: !492)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx_offset", arg: 4, scope: !526, file: !1, line: 1413, type: !114)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_symbol", arg: 5, scope: !526, file: !1, line: 1414, type: !113)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !526, file: !1, line: 1416, type: !113)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ictx", scope: !526, file: !1, line: 1417, type: !492)
!537 = !DISubprogram(name: "exp_golomb_encode_eq_prob", scope: !1, file: !1, line: 1445, type: !538, isLocal: false, isDefinition: true, scopeLine: 1448, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i32, i32)* @exp_golomb_encode_eq_prob, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !243, !113, !114}
!540 = !{!541, !542, !543}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 1, scope: !537, file: !1, line: 1445, type: !243)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !537, file: !1, line: 1446, type: !113)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 3, scope: !537, file: !1, line: 1447, type: !114)
!544 = !DISubprogram(name: "unary_exp_golomb_level_encode", scope: !1, file: !1, line: 1475, type: !545, isLocal: false, isDefinition: true, scopeLine: 1478, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i32, %struct.BiContextType*)* @unary_exp_golomb_level_encode, variables: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !243, !113, !492}
!547 = !{!548, !549, !550, !551, !552, !553}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 1, scope: !544, file: !1, line: 1475, type: !243)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !544, file: !1, line: 1476, type: !113)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !544, file: !1, line: 1477, type: !492)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !544, file: !1, line: 1479, type: !113)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !544, file: !1, line: 1479, type: !113)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp_start", scope: !544, file: !1, line: 1480, type: !113)
!554 = !DISubprogram(name: "unary_exp_golomb_mv_encode", scope: !1, file: !1, line: 1508, type: !555, isLocal: false, isDefinition: true, scopeLine: 1512, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.EncodingEnvironment*, i32, %struct.BiContextType*, i32)* @unary_exp_golomb_mv_encode, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !243, !113, !492, !113}
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eep_dp", arg: 1, scope: !554, file: !1, line: 1508, type: !243)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !554, file: !1, line: 1509, type: !113)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !554, file: !1, line: 1510, type: !492)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_bin", arg: 4, scope: !554, file: !1, line: 1511, type: !113)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !554, file: !1, line: 1513, type: !113)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !554, file: !1, line: 1513, type: !113)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bin", scope: !554, file: !1, line: 1514, type: !113)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ictx", scope: !554, file: !1, line: 1515, type: !492)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp_start", scope: !554, file: !1, line: 1516, type: !113)
!567 = !{!568, !569, !573, !574, !575, !629, !630, !631, !632, !633, !636, !638, !640, !641, !642, !643, !644, !680, !775, !776, !777, !779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !813, !816, !817, !818, !819, !820, !821, !824, !827, !828, !829, !830, !833, !834, !845, !881, !882, !883, !884, !885, !942, !943, !944, !945, !946, !950, !951, !952, !953, !954, !955, !956, !957, !958, !962, !963, !964, !965, !966, !969, !971, !973, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989}
!568 = !DIGlobalVariable(name: "last_dquant", scope: !0, file: !1, line: 24, type: !114, isLocal: false, isDefinition: true, variable: i32* @last_dquant)
!569 = !DIGlobalVariable(name: "coeff", scope: !510, file: !1, line: 1329, type: !570, isLocal: true, isDefinition: true, variable: [64 x i32]* @writeRunLevel_CABAC.coeff)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2048, align: 32, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 64)
!573 = !DIGlobalVariable(name: "coeff_ctr", scope: !510, file: !1, line: 1330, type: !114, isLocal: true, isDefinition: true, variable: i32* @writeRunLevel_CABAC.coeff_ctr)
!574 = !DIGlobalVariable(name: "pos", scope: !510, file: !1, line: 1331, type: !114, isLocal: true, isDefinition: true, variable: i32* @writeRunLevel_CABAC.pos)
!575 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !576, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !579)
!579 = !{!580, !581, !582, !624, !625, !627, !628}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !578, file: !4, line: 477, baseType: !114, size: 32, align: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !578, file: !4, line: 478, baseType: !114, size: 32, align: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !578, file: !4, line: 479, baseType: !583, size: 6400, align: 64, offset: 64)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 6400, align: 64, elements: !622)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !586)
!586 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !606, !607, !608, !609, !610, !611, !612, !613, !614, !619}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !586, file: !4, line: 445, baseType: !114, size: 32, align: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !586, file: !4, line: 446, baseType: !114, size: 32, align: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !586, file: !4, line: 447, baseType: !114, size: 32, align: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !586, file: !4, line: 448, baseType: !114, size: 32, align: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !586, file: !4, line: 449, baseType: !114, size: 32, align: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !586, file: !4, line: 450, baseType: !114, size: 32, align: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !586, file: !4, line: 451, baseType: !271, size: 64, align: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !586, file: !4, line: 452, baseType: !46, size: 64, align: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !586, file: !4, line: 453, baseType: !86, size: 64, align: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !586, file: !4, line: 456, baseType: !598, size: 64, align: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !600)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !600, file: !4, line: 310, baseType: !114, size: 32, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !600, file: !4, line: 311, baseType: !114, size: 32, align: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !600, file: !4, line: 312, baseType: !605, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !586, file: !4, line: 458, baseType: !114, size: 32, align: 32, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !586, file: !4, line: 459, baseType: !237, size: 64, align: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !586, file: !4, line: 460, baseType: !237, size: 64, align: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !586, file: !4, line: 461, baseType: !237, size: 64, align: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !586, file: !4, line: 462, baseType: !114, size: 32, align: 32, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !586, file: !4, line: 463, baseType: !237, size: 64, align: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !586, file: !4, line: 464, baseType: !237, size: 64, align: 64, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !586, file: !4, line: 465, baseType: !237, size: 64, align: 64, offset: 896)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !586, file: !4, line: 467, baseType: !615, size: 64, align: 64, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!618, !114}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !41, line: 45, baseType: !40)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !586, file: !4, line: 469, baseType: !620, size: 192, align: 32, offset: 1024)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 192, align: 32, elements: !621)
!621 = !{!62, !67}
!622 = !{!623}
!623 = !DISubrange(count: 100)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !578, file: !4, line: 480, baseType: !114, size: 32, align: 32, offset: 6464)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !578, file: !4, line: 481, baseType: !626, size: 32, align: 32, offset: 6496)
!626 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !578, file: !4, line: 482, baseType: !626, size: 32, align: 32, offset: 6528)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !578, file: !4, line: 483, baseType: !626, size: 32, align: 32, offset: 6560)
!629 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !576, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!630 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !576, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!631 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !576, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!632 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !576, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!633 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !634, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!636 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !637, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!638 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !639, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!640 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !113, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!641 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !113, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!642 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !114, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!643 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !114, isLocal: false, isDefinition: true, variable: i32* @me_time)
!644 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !645, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !41, line: 145, baseType: !647)
!647 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 103, size: 1920, align: 64, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !647, file: !41, line: 105, baseType: !618, size: 32, align: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !647, file: !41, line: 106, baseType: !113, size: 32, align: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !647, file: !41, line: 107, baseType: !113, size: 32, align: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !647, file: !41, line: 108, baseType: !618, size: 32, align: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !647, file: !41, line: 110, baseType: !618, size: 32, align: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !647, file: !41, line: 111, baseType: !618, size: 32, align: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !647, file: !41, line: 112, baseType: !133, size: 256, align: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !647, file: !41, line: 115, baseType: !618, size: 32, align: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !647, file: !41, line: 116, baseType: !113, size: 32, align: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !647, file: !41, line: 117, baseType: !113, size: 32, align: 32, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !647, file: !41, line: 119, baseType: !660, size: 256, align: 32, offset: 544)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, align: 32, elements: !134)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !647, file: !41, line: 121, baseType: !660, size: 256, align: 32, offset: 800)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !647, file: !41, line: 122, baseType: !660, size: 256, align: 32, offset: 1056)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !647, file: !41, line: 124, baseType: !618, size: 32, align: 32, offset: 1312)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !647, file: !41, line: 125, baseType: !113, size: 32, align: 32, offset: 1344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !647, file: !41, line: 127, baseType: !113, size: 32, align: 32, offset: 1376)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !647, file: !41, line: 128, baseType: !254, size: 64, align: 64, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !647, file: !41, line: 130, baseType: !114, size: 32, align: 32, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !647, file: !41, line: 131, baseType: !114, size: 32, align: 32, offset: 1504)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !647, file: !41, line: 132, baseType: !618, size: 32, align: 32, offset: 1536)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !647, file: !41, line: 133, baseType: !113, size: 32, align: 32, offset: 1568)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !647, file: !41, line: 134, baseType: !114, size: 32, align: 32, offset: 1600)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !647, file: !41, line: 135, baseType: !114, size: 32, align: 32, offset: 1632)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !647, file: !41, line: 136, baseType: !114, size: 32, align: 32, offset: 1664)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !647, file: !41, line: 138, baseType: !114, size: 32, align: 32, offset: 1696)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !647, file: !41, line: 139, baseType: !114, size: 32, align: 32, offset: 1728)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !647, file: !41, line: 141, baseType: !618, size: 32, align: 32, offset: 1760)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !647, file: !41, line: 142, baseType: !618, size: 32, align: 32, offset: 1792)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !647, file: !41, line: 143, baseType: !618, size: 32, align: 32, offset: 1824)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !647, file: !41, line: 144, baseType: !618, size: 32, align: 32, offset: 1856)
!680 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !681, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !41, line: 193, baseType: !683)
!683 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 149, size: 17056, align: 32, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !683, file: !41, line: 151, baseType: !618, size: 32, align: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !683, file: !41, line: 153, baseType: !113, size: 32, align: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !683, file: !41, line: 154, baseType: !618, size: 32, align: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !683, file: !41, line: 155, baseType: !618, size: 32, align: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !683, file: !41, line: 156, baseType: !618, size: 32, align: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !683, file: !41, line: 157, baseType: !618, size: 32, align: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !683, file: !41, line: 158, baseType: !113, size: 32, align: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !683, file: !41, line: 159, baseType: !113, size: 32, align: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !683, file: !41, line: 160, baseType: !113, size: 32, align: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !683, file: !41, line: 162, baseType: !618, size: 32, align: 32, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !683, file: !41, line: 163, baseType: !133, size: 256, align: 32, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !683, file: !41, line: 165, baseType: !113, size: 32, align: 32, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !683, file: !41, line: 166, baseType: !113, size: 32, align: 32, offset: 608)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !683, file: !41, line: 167, baseType: !113, size: 32, align: 32, offset: 640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !683, file: !41, line: 168, baseType: !113, size: 32, align: 32, offset: 672)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !683, file: !41, line: 170, baseType: !113, size: 32, align: 32, offset: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !683, file: !41, line: 172, baseType: !618, size: 32, align: 32, offset: 736)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !683, file: !41, line: 173, baseType: !114, size: 32, align: 32, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !683, file: !41, line: 174, baseType: !114, size: 32, align: 32, offset: 800)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !683, file: !41, line: 175, baseType: !113, size: 32, align: 32, offset: 832)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !683, file: !41, line: 177, baseType: !706, size: 8192, align: 32, offset: 864)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 8192, align: 32, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !683, file: !41, line: 178, baseType: !113, size: 32, align: 32, offset: 9056)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !683, file: !41, line: 179, baseType: !618, size: 32, align: 32, offset: 9088)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !683, file: !41, line: 180, baseType: !113, size: 32, align: 32, offset: 9120)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !683, file: !41, line: 181, baseType: !113, size: 32, align: 32, offset: 9152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !683, file: !41, line: 182, baseType: !618, size: 32, align: 32, offset: 9184)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !683, file: !41, line: 184, baseType: !618, size: 32, align: 32, offset: 9216)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !683, file: !41, line: 185, baseType: !618, size: 32, align: 32, offset: 9248)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !683, file: !41, line: 186, baseType: !618, size: 32, align: 32, offset: 9280)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !683, file: !41, line: 187, baseType: !113, size: 32, align: 32, offset: 9312)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !683, file: !41, line: 188, baseType: !113, size: 32, align: 32, offset: 9344)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !683, file: !41, line: 189, baseType: !113, size: 32, align: 32, offset: 9376)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !683, file: !41, line: 190, baseType: !113, size: 32, align: 32, offset: 9408)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !683, file: !41, line: 191, baseType: !618, size: 32, align: 32, offset: 9440)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !683, file: !41, line: 192, baseType: !723, size: 7584, align: 32, offset: 9472)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !41, line: 99, baseType: !724)
!724 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 63, size: 7584, align: 32, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !724, file: !41, line: 65, baseType: !618, size: 32, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !724, file: !41, line: 66, baseType: !113, size: 32, align: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !724, file: !41, line: 67, baseType: !113, size: 32, align: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !724, file: !41, line: 68, baseType: !113, size: 32, align: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !724, file: !41, line: 69, baseType: !618, size: 32, align: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !724, file: !41, line: 70, baseType: !618, size: 32, align: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !724, file: !41, line: 71, baseType: !618, size: 32, align: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !724, file: !41, line: 72, baseType: !113, size: 32, align: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !724, file: !41, line: 73, baseType: !618, size: 32, align: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !724, file: !41, line: 74, baseType: !618, size: 32, align: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !724, file: !41, line: 75, baseType: !113, size: 32, align: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !724, file: !41, line: 76, baseType: !113, size: 32, align: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !724, file: !41, line: 77, baseType: !113, size: 32, align: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !724, file: !41, line: 78, baseType: !618, size: 32, align: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !724, file: !41, line: 79, baseType: !113, size: 32, align: 32, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !724, file: !41, line: 80, baseType: !113, size: 32, align: 32, offset: 480)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !724, file: !41, line: 81, baseType: !618, size: 32, align: 32, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !724, file: !41, line: 82, baseType: !113, size: 32, align: 32, offset: 544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !724, file: !41, line: 83, baseType: !113, size: 32, align: 32, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !724, file: !41, line: 84, baseType: !618, size: 32, align: 32, offset: 608)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !724, file: !41, line: 85, baseType: !618, size: 32, align: 32, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !724, file: !41, line: 86, baseType: !748, size: 3296, align: 32, offset: 672)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !41, line: 60, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 48, size: 3296, align: 32, elements: !750)
!750 = !{!751, !752, !753, !754, !758, !759, !760, !761, !762, !763}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !749, file: !41, line: 50, baseType: !113, size: 32, align: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !749, file: !41, line: 51, baseType: !113, size: 32, align: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !749, file: !41, line: 52, baseType: !113, size: 32, align: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !749, file: !41, line: 53, baseType: !755, size: 1024, align: 32, offset: 96)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1024, align: 32, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !749, file: !41, line: 54, baseType: !755, size: 1024, align: 32, offset: 1120)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !749, file: !41, line: 55, baseType: !755, size: 1024, align: 32, offset: 2144)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !749, file: !41, line: 56, baseType: !113, size: 32, align: 32, offset: 3168)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !749, file: !41, line: 57, baseType: !113, size: 32, align: 32, offset: 3200)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !749, file: !41, line: 58, baseType: !113, size: 32, align: 32, offset: 3232)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !749, file: !41, line: 59, baseType: !113, size: 32, align: 32, offset: 3264)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !724, file: !41, line: 87, baseType: !618, size: 32, align: 32, offset: 3968)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !724, file: !41, line: 88, baseType: !748, size: 3296, align: 32, offset: 4000)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !724, file: !41, line: 90, baseType: !618, size: 32, align: 32, offset: 7296)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !724, file: !41, line: 91, baseType: !618, size: 32, align: 32, offset: 7328)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !724, file: !41, line: 92, baseType: !618, size: 32, align: 32, offset: 7360)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !724, file: !41, line: 93, baseType: !113, size: 32, align: 32, offset: 7392)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !724, file: !41, line: 94, baseType: !113, size: 32, align: 32, offset: 7424)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !724, file: !41, line: 95, baseType: !113, size: 32, align: 32, offset: 7456)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !724, file: !41, line: 96, baseType: !113, size: 32, align: 32, offset: 7488)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !724, file: !41, line: 97, baseType: !113, size: 32, align: 32, offset: 7520)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !724, file: !41, line: 98, baseType: !113, size: 32, align: 32, offset: 7552)
!775 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !114, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!776 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !114, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!777 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !778, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!779 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !778, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!780 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !781, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!782 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !114, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!783 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !114, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!784 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !114, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!785 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !114, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!786 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !634, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!787 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !634, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!788 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !637, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!789 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !637, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!790 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !634, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!791 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !637, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!792 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !634, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!793 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !637, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!794 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !795, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!796 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !376, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!797 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !798, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!799 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !798, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!800 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !114, isLocal: false, isDefinition: true, variable: i32* @intras)
!801 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !114, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!802 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !114, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!803 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !114, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!804 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !114, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!805 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !114, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!806 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !114, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!807 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !114, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!808 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !809, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 2400, align: 8, elements: !811)
!810 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!811 = !{!812}
!812 = !DISubrange(count: 300)
!813 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !814, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
