; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/configfile.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }
%struct.Mapping = type { i8*, i8*, i32, double, i32, double, double }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 178, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "UVLC", value: 0)
!12 = !DIEnumerator(name: "CABAC", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 111, size: 32, align: 32, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!16 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!17 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 104, size: 32, align: 32, elements: !19)
!19 = !{!20, !21}
!20 = !DIEnumerator(name: "PAR_OF_ANNEXB", value: 0)
!21 = !DIEnumerator(name: "PAR_OF_RTP", value: 1)
!22 = !{!23, !24, !26, !28, !25, !30, !31}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !32, line: 30, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35, !39, !59, !127, !135, !136, !155, !161, !166, !169, !189, !195, !196}
!35 = !DISubprogram(name: "JMHelpExit", scope: !1, file: !1, line: 102, type: !36, isLocal: false, isDefinition: true, scopeLine: 103, isOptimized: true, function: void ()* @JMHelpExit, variables: !38)
!36 = !DISubroutineType(types: !37)
!37 = !{null}
!38 = !{}
!39 = !DISubprogram(name: "Configure", scope: !1, file: !1, line: 141, type: !40, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8**)* @Configure, variables: !43)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !25, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !58}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ac", arg: 1, scope: !39, file: !1, line: 141, type: !25)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "av", arg: 2, scope: !39, file: !1, line: 141, type: !42)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "content", scope: !39, file: !1, line: 143, type: !26)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CLcount", scope: !39, file: !1, line: 144, type: !25)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ContentLen", scope: !39, file: !1, line: 144, type: !25)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NumberParams", scope: !39, file: !1, line: 144, type: !25)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !39, file: !1, line: 145, type: !26)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "source", scope: !52, file: !1, line: 226, type: !26)
!52 = distinct !DILexicalBlock(scope: !53, file: !1, line: 225, column: 9)
!53 = distinct !DILexicalBlock(scope: !54, file: !1, line: 205, column: 7)
!54 = distinct !DILexicalBlock(scope: !55, file: !1, line: 204, column: 11)
!55 = distinct !DILexicalBlock(scope: !56, file: !1, line: 203, column: 5)
!56 = distinct !DILexicalBlock(scope: !57, file: !1, line: 192, column: 9)
!57 = distinct !DILexicalBlock(scope: !39, file: !1, line: 186, column: 3)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "destin", scope: !52, file: !1, line: 227, type: !26)
!59 = !DISubprogram(name: "GetConfigFileContent", scope: !1, file: !1, line: 271, type: !60, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @GetConfigFileContent, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{!26, !26}
!62 = !{!63, !64, !66, !126}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Filename", arg: 1, scope: !59, file: !1, line: 271, type: !26)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "FileSize", scope: !59, file: !1, line: 273, type: !65)
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !59, file: !1, line: 274, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !69, line: 153, baseType: !70)
!69 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !69, line: 122, size: 1216, align: 64, elements: !71)
!71 = !{!72, !74, !75, !76, !78, !79, !84, !85, !86, !90, !94, !104, !110, !111, !114, !115, !119, !123, !124, !125}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !70, file: !69, line: 123, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !70, file: !69, line: 124, baseType: !25, size: 32, align: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !70, file: !69, line: 125, baseType: !25, size: 32, align: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !70, file: !69, line: 126, baseType: !77, size: 16, align: 16, offset: 128)
!77 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !70, file: !69, line: 127, baseType: !77, size: 16, align: 16, offset: 144)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !70, file: !69, line: 128, baseType: !80, size: 128, align: 64, offset: 192)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !69, line: 88, size: 128, align: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !80, file: !69, line: 89, baseType: !73, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !80, file: !69, line: 90, baseType: !25, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !70, file: !69, line: 129, baseType: !25, size: 32, align: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !70, file: !69, line: 132, baseType: !23, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !70, file: !69, line: 133, baseType: !87, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!25, !23}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !70, file: !69, line: 134, baseType: !91, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!25, !23, !26, !25}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !70, file: !69, line: 135, baseType: !95, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !23, !98, !25}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !69, line: 77, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !100, line: 71, baseType: !101)
!100 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !70, file: !69, line: 136, baseType: !105, size: 64, align: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!25, !23, !108, !25}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !70, file: !69, line: 139, baseType: !80, size: 128, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !70, file: !69, line: 140, baseType: !112, size: 64, align: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !69, line: 94, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !70, file: !69, line: 141, baseType: !25, size: 32, align: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !70, file: !69, line: 144, baseType: !116, size: 24, align: 8, offset: 928)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !70, file: !69, line: 145, baseType: !120, size: 8, align: 8, offset: 952)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !70, file: !69, line: 148, baseType: !80, size: 128, align: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !70, file: !69, line: 151, baseType: !25, size: 32, align: 32, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !70, file: !69, line: 152, baseType: !98, size: 64, align: 64, offset: 1152)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !59, file: !1, line: 275, type: !26)
!127 = !DISubprogram(name: "CeilLog2", scope: !1, file: !1, line: 599, type: !128, isLocal: false, isDefinition: true, scopeLine: 600, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @CeilLog2, variables: !131)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !130}
!130 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!131 = !{!132, !133, !134}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uiVal", arg: 1, scope: !127, file: !1, line: 599, type: !130)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uiTmp", scope: !127, file: !1, line: 601, type: !130)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uiRet", scope: !127, file: !1, line: 602, type: !130)
!135 = !DISubprogram(name: "PatchInputNoFrames", scope: !1, file: !1, line: 1038, type: !36, isLocal: false, isDefinition: true, scopeLine: 1039, isOptimized: true, function: void ()* @PatchInputNoFrames, variables: !38)
!136 = !DISubprogram(name: "ParseContent", scope: !1, file: !1, line: 328, type: !137, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @ParseContent, variables: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !26, !25}
!139 = !{!140, !141, !142, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !136, file: !1, line: 328, type: !26)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsize", arg: 2, scope: !136, file: !1, line: 328, type: !25)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !136, file: !1, line: 331, type: !143)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 640000, align: 64, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 10000)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MapIdx", scope: !136, file: !1, line: 332, type: !25)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !136, file: !1, line: 333, type: !25)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "InString", scope: !136, file: !1, line: 334, type: !25)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "InItem", scope: !136, file: !1, line: 334, type: !25)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !136, file: !1, line: 335, type: !26)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufend", scope: !136, file: !1, line: 336, type: !26)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "IntContent", scope: !136, file: !1, line: 337, type: !25)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DoubleContent", scope: !136, file: !1, line: 338, type: !29)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !136, file: !1, line: 339, type: !25)
!155 = !DISubprogram(name: "ParameterNameToMapIndex", scope: !1, file: !1, line: 455, type: !156, isLocal: true, isDefinition: true, scopeLine: 456, flags: DIFlagPrototyped, isOptimized: true, variables: !158)
!156 = !DISubroutineType(types: !157)
!157 = !{!25, !26}
!158 = !{!159, !160}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !155, file: !1, line: 455, type: !26)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !155, file: !1, line: 457, type: !25)
!161 = !DISubprogram(name: "InitEncoderParams", scope: !1, file: !1, line: 475, type: !162, isLocal: true, isDefinition: true, scopeLine: 476, isOptimized: true, variables: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{!25}
!164 = !{!165}
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !161, file: !1, line: 477, type: !25)
!166 = !DISubprogram(name: "DisplayEncoderParams", scope: !1, file: !1, line: 572, type: !162, isLocal: true, isDefinition: true, scopeLine: 573, isOptimized: true, variables: !167)
!167 = !{!168}
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !166, file: !1, line: 574, type: !25)
!169 = !DISubprogram(name: "PatchInp", scope: !1, file: !1, line: 619, type: !36, isLocal: true, isDefinition: true, scopeLine: 620, isOptimized: true, variables: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !180}
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitdepth_qp_scale", scope: !169, file: !1, line: 621, type: !25)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sgfile", scope: !169, file: !1, line: 624, type: !67)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !169, file: !1, line: 625, type: !25)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_mb_only", scope: !169, file: !1, line: 626, type: !25)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_width", scope: !169, file: !1, line: 627, type: !25)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_height", scope: !169, file: !1, line: 627, type: !25)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapunit_height", scope: !169, file: !1, line: 627, type: !25)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "storedBplus1", scope: !179, file: !1, line: 684, type: !25)
!179 = distinct !DILexicalBlock(scope: !169, file: !1, line: 683, column: 3)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !181, file: !1, line: 863, type: !25)
!181 = distinct !DILexicalBlock(scope: !182, file: !1, line: 862, column: 7)
!182 = distinct !DILexicalBlock(scope: !183, file: !1, line: 861, column: 16)
!183 = distinct !DILexicalBlock(scope: !184, file: !1, line: 842, column: 16)
!184 = distinct !DILexicalBlock(scope: !185, file: !1, line: 828, column: 11)
!185 = distinct !DILexicalBlock(scope: !186, file: !1, line: 827, column: 5)
!186 = distinct !DILexicalBlock(scope: !187, file: !1, line: 821, column: 9)
!187 = distinct !DILexicalBlock(scope: !188, file: !1, line: 820, column: 3)
!188 = distinct !DILexicalBlock(scope: !169, file: !1, line: 818, column: 7)
!189 = !DISubprogram(name: "TestEncoderParams", scope: !1, file: !1, line: 498, type: !190, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{!25, !25}
!192 = !{!193, !194}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bitdepth_qp_scale", arg: 1, scope: !189, file: !1, line: 498, type: !25)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !189, file: !1, line: 500, type: !25)
!195 = !DISubprogram(name: "ProfileCheck", scope: !1, file: !1, line: 1050, type: !36, isLocal: true, isDefinition: true, scopeLine: 1051, isOptimized: true, variables: !38)
!196 = !DISubprogram(name: "LevelCheck", scope: !1, file: !1, line: 1140, type: !36, isLocal: true, isDefinition: true, scopeLine: 1141, isOptimized: true, variables: !38)
!197 = !{!198, !213, !401, !402, !403, !404, !405, !408, !410, !412, !413, !414, !415, !416, !455, !550, !551, !552, !554, !555, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !573, !574, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !589, !593, !594, !595, !596, !597, !598, !601, !604, !605, !606, !607, !610, !613, !624, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!198 = !DIGlobalVariable(name: "Map", scope: !0, file: !199, line: 43, type: !200, isLocal: false, isDefinition: true, variable: [151 x %struct.Mapping]* @Map)
!199 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/configfile.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 67648, align: 64, elements: !211)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mapping", file: !199, line: 30, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 22, size: 448, align: 64, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "TokenName", scope: !202, file: !199, line: 23, baseType: !26, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Place", scope: !202, file: !199, line: 24, baseType: !23, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !202, file: !199, line: 25, baseType: !25, size: 32, align: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Default", scope: !202, file: !199, line: 26, baseType: !29, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "param_limits", scope: !202, file: !199, line: 27, baseType: !25, size: 32, align: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "min_limit", scope: !202, file: !199, line: 28, baseType: !29, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "max_limit", scope: !202, file: !199, line: 29, baseType: !29, size: 64, align: 64, offset: 384)
!211 = !{!212}
!212 = !DISubrange(count: 151)
!213 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !214, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !217)
!217 = !{!218, !219, !220, !396, !397, !399, !400}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !216, file: !9, line: 477, baseType: !25, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !216, file: !9, line: 478, baseType: !25, size: 32, align: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !216, file: !9, line: 479, baseType: !221, size: 6400, align: 64, offset: 64)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 6400, align: 64, elements: !394)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !305, !342, !369, !378, !379, !380, !381, !382, !383, !384, !385, !386, !391}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !224, file: !9, line: 445, baseType: !25, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !224, file: !9, line: 446, baseType: !25, size: 32, align: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !224, file: !9, line: 447, baseType: !25, size: 32, align: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !224, file: !9, line: 448, baseType: !25, size: 32, align: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !224, file: !9, line: 449, baseType: !25, size: 32, align: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !224, file: !9, line: 450, baseType: !25, size: 32, align: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !224, file: !9, line: 451, baseType: !233, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !236)
!236 = !{!237, !253, !277}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !235, file: !9, line: 433, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !240, file: !9, line: 413, baseType: !25, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !240, file: !9, line: 414, baseType: !25, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !240, file: !9, line: 415, baseType: !31, size: 8, align: 8, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !240, file: !9, line: 416, baseType: !25, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !240, file: !9, line: 417, baseType: !25, size: 32, align: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !240, file: !9, line: 418, baseType: !31, size: 8, align: 8, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !240, file: !9, line: 420, baseType: !31, size: 8, align: 8, offset: 168)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !240, file: !9, line: 421, baseType: !25, size: 32, align: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !240, file: !9, line: 422, baseType: !25, size: 32, align: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !240, file: !9, line: 424, baseType: !30, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !240, file: !9, line: 425, baseType: !25, size: 32, align: 32, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !235, file: !9, line: 434, baseType: !254, size: 832, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !255, file: !9, line: 209, baseType: !130, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !255, file: !9, line: 209, baseType: !130, size: 32, align: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !255, file: !9, line: 210, baseType: !130, size: 32, align: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !255, file: !9, line: 211, baseType: !130, size: 32, align: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !255, file: !9, line: 212, baseType: !130, size: 32, align: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !255, file: !9, line: 213, baseType: !30, size: 64, align: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !255, file: !9, line: 214, baseType: !24, size: 64, align: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !255, file: !9, line: 217, baseType: !130, size: 32, align: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !255, file: !9, line: 217, baseType: !130, size: 32, align: 32, offset: 352)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !255, file: !9, line: 218, baseType: !130, size: 32, align: 32, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !255, file: !9, line: 219, baseType: !130, size: 32, align: 32, offset: 416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !255, file: !9, line: 220, baseType: !130, size: 32, align: 32, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !255, file: !9, line: 221, baseType: !30, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !255, file: !9, line: 222, baseType: !24, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !255, file: !9, line: 223, baseType: !25, size: 32, align: 32, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !255, file: !9, line: 223, baseType: !25, size: 32, align: 32, offset: 672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !255, file: !9, line: 224, baseType: !25, size: 32, align: 32, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !255, file: !9, line: 224, baseType: !25, size: 32, align: 32, offset: 736)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !255, file: !9, line: 225, baseType: !25, size: 32, align: 32, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !255, file: !9, line: 225, baseType: !25, size: 32, align: 32, offset: 800)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !235, file: !9, line: 436, baseType: !278, size: 64, align: 64, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!25, !281, !304}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !283)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !297}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !9, line: 329, baseType: !25, size: 32, align: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !283, file: !9, line: 330, baseType: !25, size: 32, align: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !283, file: !9, line: 331, baseType: !25, size: 32, align: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !283, file: !9, line: 332, baseType: !25, size: 32, align: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !283, file: !9, line: 333, baseType: !25, size: 32, align: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !283, file: !9, line: 334, baseType: !130, size: 32, align: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !283, file: !9, line: 335, baseType: !25, size: 32, align: 32, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !283, file: !9, line: 336, baseType: !25, size: 32, align: 32, offset: 224)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !283, file: !9, line: 344, baseType: !294, size: 64, align: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !25, !25, !24, !24}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !283, file: !9, line: 346, baseType: !298, size: 64, align: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !301, !302}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !224, file: !9, line: 452, baseType: !306, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !308)
!308 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !309)
!309 = !{!310, !322, !327, !331, !335, !339, !340}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !308, file: !9, line: 260, baseType: !311, size: 4224, align: 64)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 4224, align: 64, elements: !320)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !314)
!314 = !{!315, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !9, line: 233, baseType: !316, size: 16, align: 16)
!316 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !313, file: !9, line: 234, baseType: !33, size: 8, align: 8, offset: 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !313, file: !9, line: 236, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!320 = !{!118, !321}
!321 = !DISubrange(count: 11)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !308, file: !9, line: 261, baseType: !323, size: 2304, align: 64, offset: 4224)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 2304, align: 64, elements: !324)
!324 = !{!325, !326}
!325 = !DISubrange(count: 2)
!326 = !DISubrange(count: 9)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !308, file: !9, line: 262, baseType: !328, size: 2560, align: 64, offset: 6528)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 2560, align: 64, elements: !329)
!329 = !{!325, !330}
!330 = !DISubrange(count: 10)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !308, file: !9, line: 263, baseType: !332, size: 1536, align: 64, offset: 9088)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 1536, align: 64, elements: !333)
!333 = !{!325, !334}
!334 = !DISubrange(count: 6)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !308, file: !9, line: 264, baseType: !336, size: 512, align: 64, offset: 10624)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 512, align: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 4)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !308, file: !9, line: 265, baseType: !336, size: 512, align: 64, offset: 11136)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !308, file: !9, line: 266, baseType: !341, size: 384, align: 64, offset: 11648)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 384, align: 64, elements: !117)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !224, file: !9, line: 453, baseType: !343, size: 64, align: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !346)
!346 = !{!347, !350, !351, !354, !357, !361, !362, !366, !367, !368}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !345, file: !9, line: 283, baseType: !348, size: 256, align: 64)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 256, align: 64, elements: !349)
!349 = !{!325}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !345, file: !9, line: 284, baseType: !336, size: 512, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !345, file: !9, line: 285, baseType: !352, size: 1536, align: 64, offset: 768)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 1536, align: 64, elements: !353)
!353 = !{!118, !338}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !345, file: !9, line: 286, baseType: !355, size: 5120, align: 64, offset: 2304)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 5120, align: 64, elements: !356)
!356 = !{!330, !338}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !345, file: !9, line: 287, baseType: !358, size: 19200, align: 64, offset: 7424)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 19200, align: 64, elements: !359)
!359 = !{!330, !360}
!360 = !DISubrange(count: 15)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !345, file: !9, line: 288, baseType: !358, size: 19200, align: 64, offset: 26624)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !345, file: !9, line: 289, baseType: !363, size: 6400, align: 64, offset: 45824)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 6400, align: 64, elements: !364)
!364 = !{!330, !365}
!365 = !DISubrange(count: 5)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !345, file: !9, line: 290, baseType: !363, size: 6400, align: 64, offset: 52224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !345, file: !9, line: 291, baseType: !358, size: 19200, align: 64, offset: 58624)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !345, file: !9, line: 292, baseType: !358, size: 19200, align: 64, offset: 77824)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !224, file: !9, line: 456, baseType: !370, size: 64, align: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !372, file: !9, line: 310, baseType: !25, size: 32, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !372, file: !9, line: 311, baseType: !25, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !372, file: !9, line: 312, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !224, file: !9, line: 458, baseType: !25, size: 32, align: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !224, file: !9, line: 459, baseType: !24, size: 64, align: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !224, file: !9, line: 460, baseType: !24, size: 64, align: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !224, file: !9, line: 461, baseType: !24, size: 64, align: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !224, file: !9, line: 462, baseType: !25, size: 32, align: 32, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !224, file: !9, line: 463, baseType: !24, size: 64, align: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !224, file: !9, line: 464, baseType: !24, size: 64, align: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !224, file: !9, line: 465, baseType: !24, size: 64, align: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !224, file: !9, line: 467, baseType: !387, size: 64, align: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !25}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !224, file: !9, line: 469, baseType: !392, size: 192, align: 32, offset: 1024)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, align: 32, elements: !393)
!393 = !{!118, !325}
!394 = !{!395}
!395 = !DISubrange(count: 100)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !216, file: !9, line: 480, baseType: !25, size: 32, align: 32, offset: 6464)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !216, file: !9, line: 481, baseType: !398, size: 32, align: 32, offset: 6496)
!398 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !216, file: !9, line: 482, baseType: !398, size: 32, align: 32, offset: 6528)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !216, file: !9, line: 483, baseType: !398, size: 32, align: 32, offset: 6560)
!401 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !214, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!402 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !214, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!403 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !214, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!404 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !214, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!405 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !406, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!408 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !409, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!410 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !411, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!412 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !130, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!413 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !130, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!414 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !25, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!415 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !25, isLocal: false, isDefinition: true, variable: i32* @me_time)
!416 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !417, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !431, !432, !433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !419, file: !4, line: 105, baseType: !390, size: 32, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !419, file: !4, line: 106, baseType: !130, size: 32, align: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !419, file: !4, line: 107, baseType: !130, size: 32, align: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !419, file: !4, line: 108, baseType: !390, size: 32, align: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !419, file: !4, line: 110, baseType: !390, size: 32, align: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !419, file: !4, line: 111, baseType: !390, size: 32, align: 32, offset: 160)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !419, file: !4, line: 112, baseType: !428, size: 256, align: 32, offset: 192)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, align: 32, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !419, file: !4, line: 115, baseType: !390, size: 32, align: 32, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !419, file: !4, line: 116, baseType: !130, size: 32, align: 32, offset: 480)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !419, file: !4, line: 117, baseType: !130, size: 32, align: 32, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !419, file: !4, line: 119, baseType: !435, size: 256, align: 32, offset: 544)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 256, align: 32, elements: !429)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !419, file: !4, line: 121, baseType: !435, size: 256, align: 32, offset: 800)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !419, file: !4, line: 122, baseType: !435, size: 256, align: 32, offset: 1056)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !419, file: !4, line: 124, baseType: !390, size: 32, align: 32, offset: 1312)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !419, file: !4, line: 125, baseType: !130, size: 32, align: 32, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !419, file: !4, line: 127, baseType: !130, size: 32, align: 32, offset: 1376)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !419, file: !4, line: 128, baseType: !30, size: 64, align: 64, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !419, file: !4, line: 130, baseType: !25, size: 32, align: 32, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !419, file: !4, line: 131, baseType: !25, size: 32, align: 32, offset: 1504)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !419, file: !4, line: 132, baseType: !390, size: 32, align: 32, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !419, file: !4, line: 133, baseType: !130, size: 32, align: 32, offset: 1568)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !419, file: !4, line: 134, baseType: !25, size: 32, align: 32, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !419, file: !4, line: 135, baseType: !25, size: 32, align: 32, offset: 1632)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !419, file: !4, line: 136, baseType: !25, size: 32, align: 32, offset: 1664)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !419, file: !4, line: 138, baseType: !25, size: 32, align: 32, offset: 1696)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !419, file: !4, line: 139, baseType: !25, size: 32, align: 32, offset: 1728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !419, file: !4, line: 141, baseType: !390, size: 32, align: 32, offset: 1760)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !419, file: !4, line: 142, baseType: !390, size: 32, align: 32, offset: 1792)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !419, file: !4, line: 143, baseType: !390, size: 32, align: 32, offset: 1824)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !419, file: !4, line: 144, baseType: !390, size: 32, align: 32, offset: 1856)
!455 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !456, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !458, file: !4, line: 151, baseType: !390, size: 32, align: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !458, file: !4, line: 153, baseType: !130, size: 32, align: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !458, file: !4, line: 154, baseType: !390, size: 32, align: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !458, file: !4, line: 155, baseType: !390, size: 32, align: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !458, file: !4, line: 156, baseType: !390, size: 32, align: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !458, file: !4, line: 157, baseType: !390, size: 32, align: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !458, file: !4, line: 158, baseType: !130, size: 32, align: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !458, file: !4, line: 159, baseType: !130, size: 32, align: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !458, file: !4, line: 160, baseType: !130, size: 32, align: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !458, file: !4, line: 162, baseType: !390, size: 32, align: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !458, file: !4, line: 163, baseType: !428, size: 256, align: 32, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !458, file: !4, line: 165, baseType: !130, size: 32, align: 32, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !458, file: !4, line: 166, baseType: !130, size: 32, align: 32, offset: 608)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !458, file: !4, line: 167, baseType: !130, size: 32, align: 32, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !458, file: !4, line: 168, baseType: !130, size: 32, align: 32, offset: 672)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !458, file: !4, line: 170, baseType: !130, size: 32, align: 32, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !458, file: !4, line: 172, baseType: !390, size: 32, align: 32, offset: 736)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !458, file: !4, line: 173, baseType: !25, size: 32, align: 32, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !458, file: !4, line: 174, baseType: !25, size: 32, align: 32, offset: 800)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !458, file: !4, line: 175, baseType: !130, size: 32, align: 32, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !458, file: !4, line: 177, baseType: !481, size: 8192, align: 32, offset: 864)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8192, align: 32, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !458, file: !4, line: 178, baseType: !130, size: 32, align: 32, offset: 9056)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !458, file: !4, line: 179, baseType: !390, size: 32, align: 32, offset: 9088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !458, file: !4, line: 180, baseType: !130, size: 32, align: 32, offset: 9120)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !458, file: !4, line: 181, baseType: !130, size: 32, align: 32, offset: 9152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !458, file: !4, line: 182, baseType: !390, size: 32, align: 32, offset: 9184)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !458, file: !4, line: 184, baseType: !390, size: 32, align: 32, offset: 9216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !458, file: !4, line: 185, baseType: !390, size: 32, align: 32, offset: 9248)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !458, file: !4, line: 186, baseType: !390, size: 32, align: 32, offset: 9280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !458, file: !4, line: 187, baseType: !130, size: 32, align: 32, offset: 9312)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !458, file: !4, line: 188, baseType: !130, size: 32, align: 32, offset: 9344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !458, file: !4, line: 189, baseType: !130, size: 32, align: 32, offset: 9376)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !458, file: !4, line: 190, baseType: !130, size: 32, align: 32, offset: 9408)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !458, file: !4, line: 191, baseType: !390, size: 32, align: 32, offset: 9440)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !458, file: !4, line: 192, baseType: !498, size: 7584, align: 32, offset: 9472)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !499)
!499 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !499, file: !4, line: 65, baseType: !390, size: 32, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !499, file: !4, line: 66, baseType: !130, size: 32, align: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !499, file: !4, line: 67, baseType: !130, size: 32, align: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !499, file: !4, line: 68, baseType: !130, size: 32, align: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !499, file: !4, line: 69, baseType: !390, size: 32, align: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !499, file: !4, line: 70, baseType: !390, size: 32, align: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !499, file: !4, line: 71, baseType: !390, size: 32, align: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !499, file: !4, line: 72, baseType: !130, size: 32, align: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !499, file: !4, line: 73, baseType: !390, size: 32, align: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !499, file: !4, line: 74, baseType: !390, size: 32, align: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !499, file: !4, line: 75, baseType: !130, size: 32, align: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !499, file: !4, line: 76, baseType: !130, size: 32, align: 32, offset: 352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !499, file: !4, line: 77, baseType: !130, size: 32, align: 32, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !499, file: !4, line: 78, baseType: !390, size: 32, align: 32, offset: 416)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !499, file: !4, line: 79, baseType: !130, size: 32, align: 32, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !499, file: !4, line: 80, baseType: !130, size: 32, align: 32, offset: 480)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !499, file: !4, line: 81, baseType: !390, size: 32, align: 32, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !499, file: !4, line: 82, baseType: !130, size: 32, align: 32, offset: 544)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !499, file: !4, line: 83, baseType: !130, size: 32, align: 32, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !499, file: !4, line: 84, baseType: !390, size: 32, align: 32, offset: 608)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !499, file: !4, line: 85, baseType: !390, size: 32, align: 32, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !499, file: !4, line: 86, baseType: !523, size: 3296, align: 32, offset: 672)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !525)
!525 = !{!526, !527, !528, !529, !533, !534, !535, !536, !537, !538}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !524, file: !4, line: 50, baseType: !130, size: 32, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !524, file: !4, line: 51, baseType: !130, size: 32, align: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !524, file: !4, line: 52, baseType: !130, size: 32, align: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !524, file: !4, line: 53, baseType: !530, size: 1024, align: 32, offset: 96)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 1024, align: 32, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !524, file: !4, line: 54, baseType: !530, size: 1024, align: 32, offset: 1120)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !524, file: !4, line: 55, baseType: !530, size: 1024, align: 32, offset: 2144)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !524, file: !4, line: 56, baseType: !130, size: 32, align: 32, offset: 3168)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !524, file: !4, line: 57, baseType: !130, size: 32, align: 32, offset: 3200)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !524, file: !4, line: 58, baseType: !130, size: 32, align: 32, offset: 3232)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !524, file: !4, line: 59, baseType: !130, size: 32, align: 32, offset: 3264)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !499, file: !4, line: 87, baseType: !390, size: 32, align: 32, offset: 3968)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !499, file: !4, line: 88, baseType: !523, size: 3296, align: 32, offset: 4000)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !499, file: !4, line: 90, baseType: !390, size: 32, align: 32, offset: 7296)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !499, file: !4, line: 91, baseType: !390, size: 32, align: 32, offset: 7328)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !499, file: !4, line: 92, baseType: !390, size: 32, align: 32, offset: 7360)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !499, file: !4, line: 93, baseType: !130, size: 32, align: 32, offset: 7392)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !499, file: !4, line: 94, baseType: !130, size: 32, align: 32, offset: 7424)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !499, file: !4, line: 95, baseType: !130, size: 32, align: 32, offset: 7456)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !499, file: !4, line: 96, baseType: !130, size: 32, align: 32, offset: 7488)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !499, file: !4, line: 97, baseType: !130, size: 32, align: 32, offset: 7520)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !499, file: !4, line: 98, baseType: !130, size: 32, align: 32, offset: 7552)
!550 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !25, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!551 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !25, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!552 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !553, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!554 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !553, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!555 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !556, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!557 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !25, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!558 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !25, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!559 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !25, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!560 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !25, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!561 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !406, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!562 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !406, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!563 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !409, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!564 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !409, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!565 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !406, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!566 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !409, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!567 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !406, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!568 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !409, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!569 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !570, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!573 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !571, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!574 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !575, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!576 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !575, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!577 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !25, isLocal: false, isDefinition: true, variable: i32* @intras)
!578 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !25, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!579 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !25, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!580 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !25, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!581 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !25, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!582 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !25, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!583 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !25, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!584 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !25, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!585 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !586, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2400, align: 8, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 300)
!589 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !590, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8192, align: 32, elements: !591)
!591 = !{!592, !592}
!592 = !DISubrange(count: 16)
!593 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !590, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!594 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !590, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!595 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !590, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!596 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !590, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!597 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !590, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!598 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !599, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 24576, align: 32, elements: !600)
!600 = !{!118, !592, !592}
!601 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !602, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 1024, align: 32, elements: !603)
!603 = !{!325, !338, !338}
!604 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !602, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!605 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !602, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!606 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !602, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!607 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !608, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 32, elements: !609)
!609 = !{!338, !338}
!610 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !611, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 32, elements: !612)
!612 = !{!592}
!613 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !614, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !616, file: !9, line: 1184, baseType: !25, size: 32, align: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !616, file: !9, line: 1185, baseType: !25, size: 32, align: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !616, file: !9, line: 1186, baseType: !25, size: 32, align: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !616, file: !9, line: 1187, baseType: !25, size: 32, align: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !616, file: !9, line: 1188, baseType: !25, size: 32, align: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !616, file: !9, line: 1189, baseType: !25, size: 32, align: 32, offset: 160)
!624 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !625, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !627)
!627 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !647, !648, !652, !653, !654, !655, !657, !658, !659, !660, !661, !662, !663}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !627, file: !9, line: 1147, baseType: !29, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !627, file: !9, line: 1149, baseType: !590, size: 8192, align: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !627, file: !9, line: 1150, baseType: !590, size: 8192, align: 32, offset: 8256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !627, file: !9, line: 1150, baseType: !590, size: 8192, align: 32, offset: 16448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !627, file: !9, line: 1151, baseType: !556, size: 64, align: 64, offset: 24640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !627, file: !9, line: 1152, baseType: !553, size: 64, align: 64, offset: 24704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !627, file: !9, line: 1153, baseType: !25, size: 32, align: 32, offset: 24768)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !627, file: !9, line: 1155, baseType: !25, size: 32, align: 32, offset: 24800)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !627, file: !9, line: 1157, baseType: !638, size: 128, align: 32, offset: 24832)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, align: 32, elements: !337)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !627, file: !9, line: 1157, baseType: !638, size: 128, align: 32, offset: 24960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !627, file: !9, line: 1158, baseType: !411, size: 64, align: 64, offset: 25088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !627, file: !9, line: 1159, baseType: !611, size: 512, align: 32, offset: 25152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !627, file: !9, line: 1160, baseType: !25, size: 32, align: 32, offset: 25664)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !627, file: !9, line: 1161, baseType: !644, size: 64, align: 64, offset: 25728)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !646, line: 30, baseType: !103)
!646 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !627, file: !9, line: 1162, baseType: !25, size: 32, align: 32, offset: 25792)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !627, file: !9, line: 1163, baseType: !649, size: 64, align: 64, offset: 25856)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !627, file: !9, line: 1164, baseType: !649, size: 64, align: 64, offset: 25920)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !627, file: !9, line: 1165, baseType: !649, size: 64, align: 64, offset: 25984)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !627, file: !9, line: 1166, baseType: !649, size: 64, align: 64, offset: 26048)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !627, file: !9, line: 1167, baseType: !656, size: 512, align: 16, offset: 26112)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 512, align: 16, elements: !603)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !627, file: !9, line: 1168, baseType: !25, size: 32, align: 32, offset: 26624)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !627, file: !9, line: 1169, baseType: !25, size: 32, align: 32, offset: 26656)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !627, file: !9, line: 1171, baseType: !25, size: 32, align: 32, offset: 26688)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !627, file: !9, line: 1172, baseType: !25, size: 32, align: 32, offset: 26720)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !627, file: !9, line: 1174, baseType: !25, size: 32, align: 32, offset: 26752)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !627, file: !9, line: 1175, baseType: !25, size: 32, align: 32, offset: 26784)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !627, file: !9, line: 1176, baseType: !25, size: 32, align: 32, offset: 26816)
!664 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !626, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!665 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !626, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!666 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !626, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!667 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !626, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!668 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !67, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!669 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !67, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!670 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !67, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!671 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !25, isLocal: false, isDefinition: true, variable: i32* @p_in)
!672 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !25, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!673 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !674, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 640, align: 32, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 20)
!677 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !674, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!678 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !674, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!679 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !674, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!680 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !674, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!681 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !674, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!682 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !25, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!683 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !25, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!684 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !25, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!685 = !DIGlobalVariable(name: "configinput", scope: !0, file: !199, line: 37, type: !686, isLocal: false, isDefinition: true, variable: %struct.InputParameters* @configinput)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !9, line: 865, baseType: !687)
!687 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 661, size: 28736, align: 64, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !712, !713, !714, !715, !716, !717, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !845, !846}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileIDC", scope: !687, file: !9, line: 663, baseType: !25, size: 32, align: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "LevelIDC", scope: !687, file: !9, line: 664, baseType: !25, size: 32, align: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "no_frames", scope: !687, file: !9, line: 666, baseType: !25, size: 32, align: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "qp0", scope: !687, file: !9, line: 667, baseType: !25, size: 32, align: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "qpN", scope: !687, file: !9, line: 668, baseType: !25, size: 32, align: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "jumpd", scope: !687, file: !9, line: 669, baseType: !25, size: 32, align: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard", scope: !687, file: !9, line: 670, baseType: !25, size: 32, align: 32, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hadamardqpel", scope: !687, file: !9, line: 672, baseType: !25, size: 32, align: 32, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "search_range", scope: !687, file: !9, line: 673, baseType: !25, size: 32, align: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !687, file: !9, line: 676, baseType: !25, size: 32, align: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "P_List0_refs", scope: !687, file: !9, line: 677, baseType: !25, size: 32, align: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "B_List0_refs", scope: !687, file: !9, line: 678, baseType: !25, size: 32, align: 32, offset: 352)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "B_List1_refs", scope: !687, file: !9, line: 679, baseType: !25, size: 32, align: 32, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Log2MaxFrameNum", scope: !687, file: !9, line: 680, baseType: !25, size: 32, align: 32, offset: 416)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ResendPPS", scope: !687, file: !9, line: 681, baseType: !25, size: 32, align: 32, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateMultiplePPS", scope: !687, file: !9, line: 682, baseType: !25, size: 32, align: 32, offset: 480)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "img_width", scope: !687, file: !9, line: 684, baseType: !25, size: 32, align: 32, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "img_height", scope: !687, file: !9, line: 685, baseType: !25, size: 32, align: 32, offset: 544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !687, file: !9, line: 686, baseType: !25, size: 32, align: 32, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "intra_upd", scope: !687, file: !9, line: 687, baseType: !25, size: 32, align: 32, offset: 608)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "blc_size", scope: !687, file: !9, line: 691, baseType: !710, size: 512, align: 32, offset: 640)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 32, elements: !711)
!711 = !{!430, !325}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "part_size", scope: !687, file: !9, line: 692, baseType: !710, size: 512, align: 32, offset: 1152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "slice_mode", scope: !687, file: !9, line: 693, baseType: !25, size: 32, align: 32, offset: 1664)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "slice_argument", scope: !687, file: !9, line: 694, baseType: !25, size: 32, align: 32, offset: 1696)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "UseConstrainedIntraPred", scope: !687, file: !9, line: 695, baseType: !25, size: 32, align: 32, offset: 1728)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "infile_header", scope: !687, file: !9, line: 696, baseType: !25, size: 32, align: 32, offset: 1760)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !687, file: !9, line: 697, baseType: !718, size: 1600, align: 8, offset: 1792)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1600, align: 8, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 200)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !687, file: !9, line: 698, baseType: !718, size: 1600, align: 8, offset: 3392)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ReconFile", scope: !687, file: !9, line: 699, baseType: !718, size: 1600, align: 8, offset: 4992)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "TraceFile", scope: !687, file: !9, line: 700, baseType: !718, size: 1600, align: 8, offset: 6592)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "QmatrixFile", scope: !687, file: !9, line: 701, baseType: !718, size: 1600, align: 8, offset: 8192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "intra_period", scope: !687, file: !9, line: 702, baseType: !25, size: 32, align: 32, offset: 9792)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "idr_enable", scope: !687, file: !9, line: 704, baseType: !25, size: 32, align: 32, offset: 9824)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !687, file: !9, line: 705, baseType: !25, size: 32, align: 32, offset: 9856)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "successive_Bframe", scope: !687, file: !9, line: 708, baseType: !25, size: 32, align: 32, offset: 9888)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "qpB", scope: !687, file: !9, line: 709, baseType: !25, size: 32, align: 32, offset: 9920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "qpBRSOffset", scope: !687, file: !9, line: 710, baseType: !25, size: 32, align: 32, offset: 9952)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !687, file: !9, line: 711, baseType: !25, size: 32, align: 32, offset: 9984)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "directInferenceFlag", scope: !687, file: !9, line: 712, baseType: !25, size: 32, align: 32, offset: 10016)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMotionEstimation", scope: !687, file: !9, line: 714, baseType: !25, size: 32, align: 32, offset: 10048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMERefinements", scope: !687, file: !9, line: 715, baseType: !25, size: 32, align: 32, offset: 10080)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMESearchRange", scope: !687, file: !9, line: 716, baseType: !25, size: 32, align: 32, offset: 10112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMESubPel", scope: !687, file: !9, line: 717, baseType: !25, size: 32, align: 32, offset: 10144)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sp_periodicity", scope: !687, file: !9, line: 721, baseType: !25, size: 32, align: 32, offset: 10176)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !687, file: !9, line: 722, baseType: !25, size: 32, align: 32, offset: 10208)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp_pred", scope: !687, file: !9, line: 723, baseType: !25, size: 32, align: 32, offset: 10240)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "WeightedPrediction", scope: !687, file: !9, line: 725, baseType: !25, size: 32, align: 32, offset: 10272)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "WeightedBiprediction", scope: !687, file: !9, line: 726, baseType: !25, size: 32, align: 32, offset: 10304)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "UseWeightedReferenceME", scope: !687, file: !9, line: 727, baseType: !25, size: 32, align: 32, offset: 10336)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RDPictureDecision", scope: !687, file: !9, line: 728, baseType: !25, size: 32, align: 32, offset: 10368)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "RDPictureIntra", scope: !687, file: !9, line: 729, baseType: !25, size: 32, align: 32, offset: 10400)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "RDPSliceWeightOnly", scope: !687, file: !9, line: 730, baseType: !25, size: 32, align: 32, offset: 10432)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "RDBSliceWeightOnly", scope: !687, file: !9, line: 731, baseType: !25, size: 32, align: 32, offset: 10464)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "SkipIntraInInterSlices", scope: !687, file: !9, line: 732, baseType: !25, size: 32, align: 32, offset: 10496)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "BRefPictures", scope: !687, file: !9, line: 733, baseType: !25, size: 32, align: 32, offset: 10528)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "PyramidCoding", scope: !687, file: !9, line: 734, baseType: !25, size: 32, align: 32, offset: 10560)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ExplicitPyramidFormat", scope: !687, file: !9, line: 735, baseType: !751, size: 8192, align: 8, offset: 10592)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 8, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "PyramidRefReorder", scope: !687, file: !9, line: 736, baseType: !25, size: 32, align: 32, offset: 18784)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "PocMemoryManagement", scope: !687, file: !9, line: 737, baseType: !25, size: 32, align: 32, offset: 18816)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_mode", scope: !687, file: !9, line: 739, baseType: !25, size: 32, align: 32, offset: 18848)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "of_mode", scope: !687, file: !9, line: 740, baseType: !25, size: 32, align: 32, offset: 18880)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "partition_mode", scope: !687, file: !9, line: 741, baseType: !25, size: 32, align: 32, offset: 18912)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch16x16", scope: !687, file: !9, line: 743, baseType: !25, size: 32, align: 32, offset: 18944)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch16x8", scope: !687, file: !9, line: 744, baseType: !25, size: 32, align: 32, offset: 18976)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch8x16", scope: !687, file: !9, line: 745, baseType: !25, size: 32, align: 32, offset: 19008)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch8x8", scope: !687, file: !9, line: 746, baseType: !25, size: 32, align: 32, offset: 19040)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch8x4", scope: !687, file: !9, line: 747, baseType: !25, size: 32, align: 32, offset: 19072)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch4x8", scope: !687, file: !9, line: 748, baseType: !25, size: 32, align: 32, offset: 19104)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch4x4", scope: !687, file: !9, line: 749, baseType: !25, size: 32, align: 32, offset: 19136)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "IntraDisableInterOnly", scope: !687, file: !9, line: 751, baseType: !25, size: 32, align: 32, offset: 19168)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Intra4x4ParDisable", scope: !687, file: !9, line: 752, baseType: !25, size: 32, align: 32, offset: 19200)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Intra4x4DiagDisable", scope: !687, file: !9, line: 753, baseType: !25, size: 32, align: 32, offset: 19232)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Intra4x4DirDisable", scope: !687, file: !9, line: 754, baseType: !25, size: 32, align: 32, offset: 19264)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Intra16x16ParDisable", scope: !687, file: !9, line: 755, baseType: !25, size: 32, align: 32, offset: 19296)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Intra16x16PlaneDisable", scope: !687, file: !9, line: 756, baseType: !25, size: 32, align: 32, offset: 19328)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaIntraDisable", scope: !687, file: !9, line: 757, baseType: !25, size: 32, align: 32, offset: 19360)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "FrameRate", scope: !687, file: !9, line: 759, baseType: !29, size: 64, align: 64, offset: 19392)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !687, file: !9, line: 761, baseType: !25, size: 32, align: 32, offset: 19456)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "full_search", scope: !687, file: !9, line: 763, baseType: !25, size: 32, align: 32, offset: 19488)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "last_frame", scope: !687, file: !9, line: 766, baseType: !25, size: 32, align: 32, offset: 19520)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "qpN2", scope: !687, file: !9, line: 769, baseType: !25, size: 32, align: 32, offset: 19552)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "qpB2", scope: !687, file: !9, line: 769, baseType: !25, size: 32, align: 32, offset: 19584)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "qp2start", scope: !687, file: !9, line: 769, baseType: !25, size: 32, align: 32, offset: 19616)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "qp02", scope: !687, file: !9, line: 770, baseType: !25, size: 32, align: 32, offset: 19648)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "qpBRS2Offset", scope: !687, file: !9, line: 770, baseType: !25, size: 32, align: 32, offset: 19680)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rdopt", scope: !687, file: !9, line: 772, baseType: !25, size: 32, align: 32, offset: 19712)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "disthres", scope: !687, file: !9, line: 773, baseType: !25, size: 32, align: 32, offset: 19744)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nobskip", scope: !687, file: !9, line: 774, baseType: !25, size: 32, align: 32, offset: 19776)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "NumberLeakyBuckets", scope: !687, file: !9, line: 777, baseType: !25, size: 32, align: 32, offset: 19808)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "LeakyBucketRateFile", scope: !687, file: !9, line: 778, baseType: !718, size: 1600, align: 8, offset: 19840)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "LeakyBucketParamFile", scope: !687, file: !9, line: 779, baseType: !718, size: 1600, align: 8, offset: 21440)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "PicInterlace", scope: !687, file: !9, line: 782, baseType: !25, size: 32, align: 32, offset: 23040)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "MbInterlace", scope: !687, file: !9, line: 783, baseType: !25, size: 32, align: 32, offset: 23072)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "IntraBottom", scope: !687, file: !9, line: 785, baseType: !25, size: 32, align: 32, offset: 23104)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "LossRateA", scope: !687, file: !9, line: 787, baseType: !25, size: 32, align: 32, offset: 23136)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "LossRateB", scope: !687, file: !9, line: 788, baseType: !25, size: 32, align: 32, offset: 23168)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "LossRateC", scope: !687, file: !9, line: 789, baseType: !25, size: 32, align: 32, offset: 23200)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "NoOfDecoders", scope: !687, file: !9, line: 790, baseType: !25, size: 32, align: 32, offset: 23232)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RestrictRef", scope: !687, file: !9, line: 791, baseType: !25, size: 32, align: 32, offset: 23264)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "NumFramesInELSubSeq", scope: !687, file: !9, line: 792, baseType: !25, size: 32, align: 32, offset: 23296)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "NumFrameIn2ndIGOP", scope: !687, file: !9, line: 793, baseType: !25, size: 32, align: 32, offset: 23328)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RandomIntraMBRefresh", scope: !687, file: !9, line: 795, baseType: !25, size: 32, align: 32, offset: 23360)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "LFSendParameters", scope: !687, file: !9, line: 797, baseType: !25, size: 32, align: 32, offset: 23392)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !687, file: !9, line: 798, baseType: !25, size: 32, align: 32, offset: 23424)
