; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/context_ini.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !23, globals: !152, imports: !712)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/context_ini.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "P_SLICE", value: 0)
!7 = !DIEnumerator(name: "B_SLICE", value: 1)
!8 = !DIEnumerator(name: "I_SLICE", value: 2)
!9 = !DIEnumerator(name: "SP_SLICE", value: 3)
!10 = !DIEnumerator(name: "SI_SLICE", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 42, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "FALSE", value: 0)
!15 = !DIEnumerator(name: "TRUE", value: 1)
!16 = !{!17, !21, !18, !19, !22}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!23 = !{!24, !32, !36, !41, !112, !127, !140, !145}
!24 = !DISubprogram(name: "create_context_memory", scope: !1, file: !1, line: 62, type: !25, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: true, function: void ()* @create_context_memory, variables: !27)
!25 = !DISubroutineType(types: !26)
!26 = !{null}
!27 = !{!28, !29, !30, !31}
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !24, file: !1, line: 64, type: !20)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !24, file: !1, line: 64, type: !20)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !24, file: !1, line: 64, type: !20)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_mb", scope: !24, file: !1, line: 65, type: !20)
!32 = !DISubprogram(name: "free_context_memory", scope: !1, file: !1, line: 127, type: !25, isLocal: false, isDefinition: true, scopeLine: 128, isOptimized: true, function: void ()* @free_context_memory, variables: !33)
!33 = !{!34, !35}
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !32, file: !1, line: 129, type: !20)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !32, file: !1, line: 129, type: !20)
!36 = !DISubprogram(name: "SetCtxModelNumber", scope: !1, file: !1, line: 170, type: !25, isLocal: false, isDefinition: true, scopeLine: 171, isOptimized: true, function: void ()* @SetCtxModelNumber, variables: !37)
!37 = !{!38, !39, !40}
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_field", scope: !36, file: !1, line: 172, type: !20)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_type", scope: !36, file: !1, line: 173, type: !20)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx_number", scope: !36, file: !1, line: 174, type: !20)
!41 = !DISubprogram(name: "init_contexts", scope: !1, file: !1, line: 203, type: !25, isLocal: false, isDefinition: true, scopeLine: 204, isOptimized: true, function: void ()* @init_contexts, variables: !42)
!42 = !{!43, !83, !110, !111}
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mc", scope: !41, file: !1, line: 205, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !47)
!47 = !{!48, !62, !67, !71, !75, !79, !80}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !46, file: !4, line: 260, baseType: !49, size: 4224, align: 64)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 4224, align: 64, elements: !59)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !52)
!52 = !{!53, !55, !57}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !51, file: !4, line: 233, baseType: !54, size: 16, align: 16)
!54 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !51, file: !4, line: 234, baseType: !56, size: 8, align: 8, offset: 16)
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !51, file: !4, line: 236, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!59 = !{!60, !61}
!60 = !DISubrange(count: 3)
!61 = !DISubrange(count: 11)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !46, file: !4, line: 261, baseType: !63, size: 2304, align: 64, offset: 4224)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2304, align: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DISubrange(count: 2)
!66 = !DISubrange(count: 9)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !46, file: !4, line: 262, baseType: !68, size: 2560, align: 64, offset: 6528)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2560, align: 64, elements: !69)
!69 = !{!65, !70}
!70 = !DISubrange(count: 10)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !46, file: !4, line: 263, baseType: !72, size: 1536, align: 64, offset: 9088)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1536, align: 64, elements: !73)
!73 = !{!65, !74}
!74 = !DISubrange(count: 6)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !46, file: !4, line: 264, baseType: !76, size: 512, align: 64, offset: 10624)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, align: 64, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 4)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !46, file: !4, line: 265, baseType: !76, size: 512, align: 64, offset: 11136)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !46, file: !4, line: 266, baseType: !81, size: 384, align: 64, offset: 11648)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 384, align: 64, elements: !82)
!82 = !{!60}
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tc", scope: !41, file: !1, line: 206, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !87)
!87 = !{!88, !91, !92, !95, !98, !102, !103, !107, !108, !109}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !86, file: !4, line: 283, baseType: !89, size: 256, align: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 256, align: 64, elements: !90)
!90 = !{!65}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !86, file: !4, line: 284, baseType: !76, size: 512, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !86, file: !4, line: 285, baseType: !93, size: 1536, align: 64, offset: 768)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1536, align: 64, elements: !94)
!94 = !{!60, !78}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !86, file: !4, line: 286, baseType: !96, size: 5120, align: 64, offset: 2304)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 5120, align: 64, elements: !97)
!97 = !{!70, !78}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !86, file: !4, line: 287, baseType: !99, size: 19200, align: 64, offset: 7424)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 19200, align: 64, elements: !100)
!100 = !{!70, !101}
!101 = !DISubrange(count: 15)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !86, file: !4, line: 288, baseType: !99, size: 19200, align: 64, offset: 26624)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !86, file: !4, line: 289, baseType: !104, size: 6400, align: 64, offset: 45824)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 6400, align: 64, elements: !105)
!105 = !{!70, !106}
!106 = !DISubrange(count: 5)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !86, file: !4, line: 290, baseType: !104, size: 6400, align: 64, offset: 52224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !86, file: !4, line: 291, baseType: !99, size: 19200, align: 64, offset: 58624)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !86, file: !4, line: 292, baseType: !99, size: 19200, align: 64, offset: 77824)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !41, file: !1, line: 207, type: !20)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !41, file: !1, line: 207, type: !20)
!112 = !DISubprogram(name: "XRate", scope: !1, file: !1, line: 235, type: !113, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct.BiContextType*, i32*)* @XRate, variables: !119)
!113 = !DISubroutineType(types: !114)
!114 = !{!22, !115, !117}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextTypePtr", file: !4, line: 240, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!119 = !{!120, !121, !122, !123, !124, !125, !126}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !112, file: !1, line: 235, type: !115)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "model", arg: 2, scope: !112, file: !1, line: 235, type: !117)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx_state", scope: !112, file: !1, line: 237, type: !20)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod_state", scope: !112, file: !1, line: 237, type: !20)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !112, file: !1, line: 238, type: !22)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xr", scope: !112, file: !1, line: 238, type: !22)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp", scope: !112, file: !1, line: 239, type: !20)
!127 = !DISubprogram(name: "GetCtxModelNumber", scope: !1, file: !1, line: 272, type: !128, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, %struct.MotionInfoContexts*, %struct.TextureInfoContexts*)* @GetCtxModelNumber, variables: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !19, !44, !84}
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mnumber", arg: 1, scope: !127, file: !1, line: 272, type: !19)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mc", arg: 2, scope: !127, file: !1, line: 272, type: !44)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tc", arg: 3, scope: !127, file: !1, line: 272, type: !84)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "model", scope: !127, file: !1, line: 274, type: !20)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !127, file: !1, line: 274, type: !20)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !127, file: !1, line: 274, type: !20)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_models", scope: !127, file: !1, line: 275, type: !20)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xr", scope: !127, file: !1, line: 276, type: !22)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_xr", scope: !127, file: !1, line: 276, type: !22)
!140 = !DISubprogram(name: "store_contexts", scope: !1, file: !1, line: 318, type: !25, isLocal: false, isDefinition: true, scopeLine: 319, isOptimized: true, function: void ()* @store_contexts, variables: !141)
!141 = !{!142, !143, !144}
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_field", scope: !140, file: !1, line: 320, type: !20)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_type", scope: !140, file: !1, line: 321, type: !20)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctx_number", scope: !140, file: !1, line: 322, type: !20)
!145 = !DISubprogram(name: "update_field_frame_contexts", scope: !1, file: !1, line: 336, type: !146, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @update_field_frame_contexts, variables: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !20}
!148 = !{!149, !150, !151}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "field", arg: 1, scope: !145, file: !1, line: 336, type: !20)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !145, file: !1, line: 338, type: !20)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !145, file: !1, line: 338, type: !20)
!152 = !{!153, !157, !287, !288, !289, !290, !291, !294, !296, !297, !298, !299, !300, !301, !340, !435, !436, !437, !438, !439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !458, !459, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !475, !479, !480, !481, !482, !483, !484, !487, !490, !491, !492, !493, !496, !499, !510, !551, !552, !553, !554, !555, !612, !613, !614, !615, !616, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !637, !640, !643, !646, !649, !652, !655, !658, !661, !664, !665, !666, !669, !672, !675, !678, !679, !680, !683, !686, !689, !692, !695, !698, !699, !700, !703, !706, !707, !708, !709, !710, !711}
!153 = !DIGlobalVariable(name: "probability", scope: !0, file: !1, line: 39, type: !154, isLocal: false, isDefinition: true, variable: [128 x double]* @probability)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, align: 64, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 128)
!157 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !158, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !161)
!161 = !{!162, !163, !164, !282, !283, !285, !286}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !160, file: !4, line: 477, baseType: !20, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !160, file: !4, line: 478, baseType: !20, size: 32, align: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !160, file: !4, line: 479, baseType: !165, size: 6400, align: 64, offset: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 6400, align: 64, elements: !280)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !253, !254, !255, !264, !265, !266, !267, !268, !269, !270, !271, !272, !277}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !168, file: !4, line: 445, baseType: !20, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !168, file: !4, line: 446, baseType: !20, size: 32, align: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !168, file: !4, line: 447, baseType: !20, size: 32, align: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !168, file: !4, line: 448, baseType: !20, size: 32, align: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !168, file: !4, line: 449, baseType: !20, size: 32, align: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !168, file: !4, line: 450, baseType: !20, size: 32, align: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !168, file: !4, line: 451, baseType: !177, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !180)
!180 = !{!181, !200, !225}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !179, file: !4, line: 433, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !185)
!185 = !{!186, !187, !188, !191, !192, !193, !194, !195, !196, !197, !199}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !184, file: !4, line: 413, baseType: !20, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !184, file: !4, line: 414, baseType: !20, size: 32, align: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !184, file: !4, line: 415, baseType: !189, size: 8, align: 8, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !190, line: 30, baseType: !56)
!190 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !184, file: !4, line: 416, baseType: !20, size: 32, align: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !184, file: !4, line: 417, baseType: !20, size: 32, align: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !184, file: !4, line: 418, baseType: !189, size: 8, align: 8, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !184, file: !4, line: 420, baseType: !189, size: 8, align: 8, offset: 168)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !184, file: !4, line: 421, baseType: !20, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !184, file: !4, line: 422, baseType: !20, size: 32, align: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !184, file: !4, line: 424, baseType: !198, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !184, file: !4, line: 425, baseType: !20, size: 32, align: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !179, file: !4, line: 434, baseType: !201, size: 832, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !203)
!203 = !{!204, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !202, file: !4, line: 209, baseType: !205, size: 32, align: 32)
!205 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !202, file: !4, line: 209, baseType: !205, size: 32, align: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !202, file: !4, line: 210, baseType: !205, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !202, file: !4, line: 211, baseType: !205, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !202, file: !4, line: 212, baseType: !205, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !202, file: !4, line: 213, baseType: !198, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !202, file: !4, line: 214, baseType: !19, size: 64, align: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !202, file: !4, line: 217, baseType: !205, size: 32, align: 32, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !202, file: !4, line: 217, baseType: !205, size: 32, align: 32, offset: 352)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !202, file: !4, line: 218, baseType: !205, size: 32, align: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !202, file: !4, line: 219, baseType: !205, size: 32, align: 32, offset: 416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !202, file: !4, line: 220, baseType: !205, size: 32, align: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !202, file: !4, line: 221, baseType: !198, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !202, file: !4, line: 222, baseType: !19, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !202, file: !4, line: 223, baseType: !20, size: 32, align: 32, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !202, file: !4, line: 223, baseType: !20, size: 32, align: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !202, file: !4, line: 224, baseType: !20, size: 32, align: 32, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !202, file: !4, line: 224, baseType: !20, size: 32, align: 32, offset: 736)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !202, file: !4, line: 225, baseType: !20, size: 32, align: 32, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !202, file: !4, line: 225, baseType: !20, size: 32, align: 32, offset: 800)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !179, file: !4, line: 436, baseType: !226, size: 64, align: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!20, !229, !252}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !245}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !4, line: 329, baseType: !20, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !231, file: !4, line: 330, baseType: !20, size: 32, align: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !231, file: !4, line: 331, baseType: !20, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, file: !4, line: 332, baseType: !20, size: 32, align: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !231, file: !4, line: 333, baseType: !20, size: 32, align: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !231, file: !4, line: 334, baseType: !205, size: 32, align: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !231, file: !4, line: 335, baseType: !20, size: 32, align: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !231, file: !4, line: 336, baseType: !20, size: 32, align: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !231, file: !4, line: 344, baseType: !242, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !20, !20, !19, !19}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !231, file: !4, line: 346, baseType: !246, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !249, !250}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !168, file: !4, line: 452, baseType: !44, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !168, file: !4, line: 453, baseType: !84, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !168, file: !4, line: 456, baseType: !256, size: 64, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !258, file: !4, line: 310, baseType: !20, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !258, file: !4, line: 311, baseType: !20, size: 32, align: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !258, file: !4, line: 312, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !168, file: !4, line: 458, baseType: !20, size: 32, align: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !168, file: !4, line: 459, baseType: !19, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !168, file: !4, line: 460, baseType: !19, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !168, file: !4, line: 461, baseType: !19, size: 64, align: 64, offset: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !168, file: !4, line: 462, baseType: !20, size: 32, align: 32, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !168, file: !4, line: 463, baseType: !19, size: 64, align: 64, offset: 768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !168, file: !4, line: 464, baseType: !19, size: 64, align: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !168, file: !4, line: 465, baseType: !19, size: 64, align: 64, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !168, file: !4, line: 467, baseType: !273, size: 64, align: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !20}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !12, line: 45, baseType: !11)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !168, file: !4, line: 469, baseType: !278, size: 192, align: 32, offset: 1024)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 192, align: 32, elements: !279)
!279 = !{!60, !65}
!280 = !{!281}
!281 = !DISubrange(count: 100)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !160, file: !4, line: 480, baseType: !20, size: 32, align: 32, offset: 6464)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !160, file: !4, line: 481, baseType: !284, size: 32, align: 32, offset: 6496)
!284 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !160, file: !4, line: 482, baseType: !284, size: 32, align: 32, offset: 6528)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !160, file: !4, line: 483, baseType: !284, size: 32, align: 32, offset: 6560)
!287 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !158, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!288 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !158, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!289 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !158, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!290 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !158, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!291 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !292, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!294 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !295, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!296 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !18, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!297 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !205, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!298 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !205, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!299 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !20, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!300 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !20, isLocal: false, isDefinition: true, variable: i32* @me_time)
!301 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !302, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !12, line: 145, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 103, size: 1920, align: 64, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !316, !317, !318, !319, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !304, file: !12, line: 105, baseType: !276, size: 32, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !304, file: !12, line: 106, baseType: !205, size: 32, align: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !304, file: !12, line: 107, baseType: !205, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !304, file: !12, line: 108, baseType: !276, size: 32, align: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !304, file: !12, line: 110, baseType: !276, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !304, file: !12, line: 111, baseType: !276, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !304, file: !12, line: 112, baseType: !313, size: 256, align: 32, offset: 192)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, align: 32, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !304, file: !12, line: 115, baseType: !276, size: 32, align: 32, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !304, file: !12, line: 116, baseType: !205, size: 32, align: 32, offset: 480)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !304, file: !12, line: 117, baseType: !205, size: 32, align: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !304, file: !12, line: 119, baseType: !320, size: 256, align: 32, offset: 544)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 256, align: 32, elements: !314)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !304, file: !12, line: 121, baseType: !320, size: 256, align: 32, offset: 800)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !304, file: !12, line: 122, baseType: !320, size: 256, align: 32, offset: 1056)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !304, file: !12, line: 124, baseType: !276, size: 32, align: 32, offset: 1312)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !304, file: !12, line: 125, baseType: !205, size: 32, align: 32, offset: 1344)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !304, file: !12, line: 127, baseType: !205, size: 32, align: 32, offset: 1376)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !304, file: !12, line: 128, baseType: !198, size: 64, align: 64, offset: 1408)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !304, file: !12, line: 130, baseType: !20, size: 32, align: 32, offset: 1472)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !304, file: !12, line: 131, baseType: !20, size: 32, align: 32, offset: 1504)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !304, file: !12, line: 132, baseType: !276, size: 32, align: 32, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !304, file: !12, line: 133, baseType: !205, size: 32, align: 32, offset: 1568)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !304, file: !12, line: 134, baseType: !20, size: 32, align: 32, offset: 1600)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !304, file: !12, line: 135, baseType: !20, size: 32, align: 32, offset: 1632)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !304, file: !12, line: 136, baseType: !20, size: 32, align: 32, offset: 1664)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !304, file: !12, line: 138, baseType: !20, size: 32, align: 32, offset: 1696)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !304, file: !12, line: 139, baseType: !20, size: 32, align: 32, offset: 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !304, file: !12, line: 141, baseType: !276, size: 32, align: 32, offset: 1760)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !304, file: !12, line: 142, baseType: !276, size: 32, align: 32, offset: 1792)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !304, file: !12, line: 143, baseType: !276, size: 32, align: 32, offset: 1824)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !304, file: !12, line: 144, baseType: !276, size: 32, align: 32, offset: 1856)
!340 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !341, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !12, line: 193, baseType: !343)
!343 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 149, size: 17056, align: 32, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !343, file: !12, line: 151, baseType: !276, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !343, file: !12, line: 153, baseType: !205, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !343, file: !12, line: 154, baseType: !276, size: 32, align: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !343, file: !12, line: 155, baseType: !276, size: 32, align: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !343, file: !12, line: 156, baseType: !276, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !343, file: !12, line: 157, baseType: !276, size: 32, align: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !343, file: !12, line: 158, baseType: !205, size: 32, align: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !343, file: !12, line: 159, baseType: !205, size: 32, align: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !343, file: !12, line: 160, baseType: !205, size: 32, align: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !343, file: !12, line: 162, baseType: !276, size: 32, align: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !343, file: !12, line: 163, baseType: !313, size: 256, align: 32, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !343, file: !12, line: 165, baseType: !205, size: 32, align: 32, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !343, file: !12, line: 166, baseType: !205, size: 32, align: 32, offset: 608)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !343, file: !12, line: 167, baseType: !205, size: 32, align: 32, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !343, file: !12, line: 168, baseType: !205, size: 32, align: 32, offset: 672)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !343, file: !12, line: 170, baseType: !205, size: 32, align: 32, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !343, file: !12, line: 172, baseType: !276, size: 32, align: 32, offset: 736)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !343, file: !12, line: 173, baseType: !20, size: 32, align: 32, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !343, file: !12, line: 174, baseType: !20, size: 32, align: 32, offset: 800)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !343, file: !12, line: 175, baseType: !205, size: 32, align: 32, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !343, file: !12, line: 177, baseType: !366, size: 8192, align: 32, offset: 864)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, align: 32, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !343, file: !12, line: 178, baseType: !205, size: 32, align: 32, offset: 9056)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !343, file: !12, line: 179, baseType: !276, size: 32, align: 32, offset: 9088)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !343, file: !12, line: 180, baseType: !205, size: 32, align: 32, offset: 9120)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !343, file: !12, line: 181, baseType: !205, size: 32, align: 32, offset: 9152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !343, file: !12, line: 182, baseType: !276, size: 32, align: 32, offset: 9184)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !343, file: !12, line: 184, baseType: !276, size: 32, align: 32, offset: 9216)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !343, file: !12, line: 185, baseType: !276, size: 32, align: 32, offset: 9248)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !343, file: !12, line: 186, baseType: !276, size: 32, align: 32, offset: 9280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !343, file: !12, line: 187, baseType: !205, size: 32, align: 32, offset: 9312)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !343, file: !12, line: 188, baseType: !205, size: 32, align: 32, offset: 9344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !343, file: !12, line: 189, baseType: !205, size: 32, align: 32, offset: 9376)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !343, file: !12, line: 190, baseType: !205, size: 32, align: 32, offset: 9408)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !343, file: !12, line: 191, baseType: !276, size: 32, align: 32, offset: 9440)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !343, file: !12, line: 192, baseType: !383, size: 7584, align: 32, offset: 9472)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !12, line: 99, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 63, size: 7584, align: 32, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !384, file: !12, line: 65, baseType: !276, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !384, file: !12, line: 66, baseType: !205, size: 32, align: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !384, file: !12, line: 67, baseType: !205, size: 32, align: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !384, file: !12, line: 68, baseType: !205, size: 32, align: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !384, file: !12, line: 69, baseType: !276, size: 32, align: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !384, file: !12, line: 70, baseType: !276, size: 32, align: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !384, file: !12, line: 71, baseType: !276, size: 32, align: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !384, file: !12, line: 72, baseType: !205, size: 32, align: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !384, file: !12, line: 73, baseType: !276, size: 32, align: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !384, file: !12, line: 74, baseType: !276, size: 32, align: 32, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !384, file: !12, line: 75, baseType: !205, size: 32, align: 32, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !384, file: !12, line: 76, baseType: !205, size: 32, align: 32, offset: 352)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !384, file: !12, line: 77, baseType: !205, size: 32, align: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !384, file: !12, line: 78, baseType: !276, size: 32, align: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !384, file: !12, line: 79, baseType: !205, size: 32, align: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !384, file: !12, line: 80, baseType: !205, size: 32, align: 32, offset: 480)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !384, file: !12, line: 81, baseType: !276, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !384, file: !12, line: 82, baseType: !205, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !384, file: !12, line: 83, baseType: !205, size: 32, align: 32, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !384, file: !12, line: 84, baseType: !276, size: 32, align: 32, offset: 608)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !384, file: !12, line: 85, baseType: !276, size: 32, align: 32, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !384, file: !12, line: 86, baseType: !408, size: 3296, align: 32, offset: 672)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !12, line: 60, baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 48, size: 3296, align: 32, elements: !410)
!410 = !{!411, !412, !413, !414, !418, !419, !420, !421, !422, !423}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !409, file: !12, line: 50, baseType: !205, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !409, file: !12, line: 51, baseType: !205, size: 32, align: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !409, file: !12, line: 52, baseType: !205, size: 32, align: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !409, file: !12, line: 53, baseType: !415, size: 1024, align: 32, offset: 96)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 1024, align: 32, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !409, file: !12, line: 54, baseType: !415, size: 1024, align: 32, offset: 1120)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !409, file: !12, line: 55, baseType: !415, size: 1024, align: 32, offset: 2144)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !409, file: !12, line: 56, baseType: !205, size: 32, align: 32, offset: 3168)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !409, file: !12, line: 57, baseType: !205, size: 32, align: 32, offset: 3200)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !409, file: !12, line: 58, baseType: !205, size: 32, align: 32, offset: 3232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !409, file: !12, line: 59, baseType: !205, size: 32, align: 32, offset: 3264)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !384, file: !12, line: 87, baseType: !276, size: 32, align: 32, offset: 3968)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !384, file: !12, line: 88, baseType: !408, size: 3296, align: 32, offset: 4000)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !384, file: !12, line: 90, baseType: !276, size: 32, align: 32, offset: 7296)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !384, file: !12, line: 91, baseType: !276, size: 32, align: 32, offset: 7328)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !384, file: !12, line: 92, baseType: !276, size: 32, align: 32, offset: 7360)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !384, file: !12, line: 93, baseType: !205, size: 32, align: 32, offset: 7392)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !384, file: !12, line: 94, baseType: !205, size: 32, align: 32, offset: 7424)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !384, file: !12, line: 95, baseType: !205, size: 32, align: 32, offset: 7456)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !384, file: !12, line: 96, baseType: !205, size: 32, align: 32, offset: 7488)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !384, file: !12, line: 97, baseType: !205, size: 32, align: 32, offset: 7520)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !384, file: !12, line: 98, baseType: !205, size: 32, align: 32, offset: 7552)
!435 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !20, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!436 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !20, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!437 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !17, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!438 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !17, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!439 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !440, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!441 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !20, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!442 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !20, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!443 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !20, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!444 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !20, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!445 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !292, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!446 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !292, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!447 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !295, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!448 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !295, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!449 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !292, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!450 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !295, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!451 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !292, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!452 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !295, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!453 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !454, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!458 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !455, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!459 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !460, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!461 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !460, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!462 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !20, isLocal: false, isDefinition: true, variable: i32* @intras)
!463 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !20, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!464 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !20, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!465 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !20, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!466 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !20, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!467 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !20, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!468 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !20, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!469 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !20, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!470 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !471, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 2400, align: 8, elements: !473)
!472 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!473 = !{!474}
!474 = !DISubrange(count: 300)
!475 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !476, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, align: 32, elements: !477)
!477 = !{!478, !478}
!478 = !DISubrange(count: 16)
!479 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !476, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!480 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !476, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!481 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !476, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!482 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !476, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!483 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !476, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!484 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !485, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24576, align: 32, elements: !486)
!486 = !{!60, !478, !478}
!487 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !488, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, align: 32, elements: !489)
!489 = !{!65, !78, !78}
!490 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !488, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!491 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !488, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!492 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !488, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!493 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !494, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, align: 32, elements: !495)
!495 = !{!78, !78}
!496 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !497, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, align: 32, elements: !498)
!498 = !{!478}
!499 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !500, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !502)
!502 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !502, file: !4, line: 1184, baseType: !20, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !502, file: !4, line: 1185, baseType: !20, size: 32, align: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !502, file: !4, line: 1186, baseType: !20, size: 32, align: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !502, file: !4, line: 1187, baseType: !20, size: 32, align: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !502, file: !4, line: 1188, baseType: !20, size: 32, align: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !502, file: !4, line: 1189, baseType: !20, size: 32, align: 32, offset: 160)
!510 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !511, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !525, !526, !527, !528, !529, !534, !535, !539, !540, !541, !542, !544, !545, !546, !547, !548, !549, !550}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !513, file: !4, line: 1147, baseType: !22, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !513, file: !4, line: 1149, baseType: !476, size: 8192, align: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !513, file: !4, line: 1150, baseType: !476, size: 8192, align: 32, offset: 8256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !513, file: !4, line: 1150, baseType: !476, size: 8192, align: 32, offset: 16448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !513, file: !4, line: 1151, baseType: !440, size: 64, align: 64, offset: 24640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !513, file: !4, line: 1152, baseType: !17, size: 64, align: 64, offset: 24704)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !513, file: !4, line: 1153, baseType: !20, size: 32, align: 32, offset: 24768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !513, file: !4, line: 1155, baseType: !20, size: 32, align: 32, offset: 24800)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !513, file: !4, line: 1157, baseType: !524, size: 128, align: 32, offset: 24832)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, align: 32, elements: !77)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !513, file: !4, line: 1157, baseType: !524, size: 128, align: 32, offset: 24960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !513, file: !4, line: 1158, baseType: !18, size: 64, align: 64, offset: 25088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !513, file: !4, line: 1159, baseType: !497, size: 512, align: 32, offset: 25152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !513, file: !4, line: 1160, baseType: !20, size: 32, align: 32, offset: 25664)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !513, file: !4, line: 1161, baseType: !530, size: 64, align: 64, offset: 25728)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !532, line: 30, baseType: !533)
!532 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!533 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !513, file: !4, line: 1162, baseType: !20, size: 32, align: 32, offset: 25792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !513, file: !4, line: 1163, baseType: !536, size: 64, align: 64, offset: 25856)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !513, file: !4, line: 1164, baseType: !536, size: 64, align: 64, offset: 25920)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !513, file: !4, line: 1165, baseType: !536, size: 64, align: 64, offset: 25984)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !513, file: !4, line: 1166, baseType: !536, size: 64, align: 64, offset: 26048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !513, file: !4, line: 1167, baseType: !543, size: 512, align: 16, offset: 26112)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 512, align: 16, elements: !489)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !513, file: !4, line: 1168, baseType: !20, size: 32, align: 32, offset: 26624)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !513, file: !4, line: 1169, baseType: !20, size: 32, align: 32, offset: 26656)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !513, file: !4, line: 1171, baseType: !20, size: 32, align: 32, offset: 26688)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !513, file: !4, line: 1172, baseType: !20, size: 32, align: 32, offset: 26720)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !513, file: !4, line: 1174, baseType: !20, size: 32, align: 32, offset: 26752)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !513, file: !4, line: 1175, baseType: !20, size: 32, align: 32, offset: 26784)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !513, file: !4, line: 1176, baseType: !20, size: 32, align: 32, offset: 26816)
!551 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !512, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!552 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !512, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!553 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !512, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!554 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !512, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!555 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !556, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !558, line: 153, baseType: !559)
!558 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !558, line: 122, size: 1216, align: 64, elements: !560)
!560 = !{!561, !563, !564, !565, !566, !567, !572, !573, !574, !578, !583, !592, !598, !599, !602, !603, !605, !609, !610, !611}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !559, file: !558, line: 123, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !559, file: !558, line: 124, baseType: !20, size: 32, align: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !559, file: !558, line: 125, baseType: !20, size: 32, align: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !559, file: !558, line: 126, baseType: !457, size: 16, align: 16, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !559, file: !558, line: 127, baseType: !457, size: 16, align: 16, offset: 144)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !559, file: !558, line: 128, baseType: !568, size: 128, align: 64, offset: 192)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !558, line: 88, size: 128, align: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !568, file: !558, line: 89, baseType: !562, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !568, file: !558, line: 90, baseType: !20, size: 32, align: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !559, file: !558, line: 129, baseType: !20, size: 32, align: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !559, file: !558, line: 132, baseType: !21, size: 64, align: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !559, file: !558, line: 133, baseType: !575, size: 64, align: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!20, !21}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !559, file: !558, line: 134, baseType: !579, size: 64, align: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!20, !21, !582, !20}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !559, file: !558, line: 135, baseType: !584, size: 64, align: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !21, !587, !20}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !558, line: 77, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !589, line: 71, baseType: !590)
!589 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !591, line: 46, baseType: !533)
!591 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !559, file: !558, line: 136, baseType: !593, size: 64, align: 64, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!20, !21, !596, !20}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !559, file: !558, line: 139, baseType: !568, size: 128, align: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !559, file: !558, line: 140, baseType: !600, size: 64, align: 64, offset: 832)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !558, line: 94, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !559, file: !558, line: 141, baseType: !20, size: 32, align: 32, offset: 896)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !559, file: !558, line: 144, baseType: !604, size: 24, align: 8, offset: 928)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 24, align: 8, elements: !82)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !559, file: !558, line: 145, baseType: !606, size: 8, align: 8, offset: 952)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 1)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !559, file: !558, line: 148, baseType: !568, size: 128, align: 64, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !559, file: !558, line: 151, baseType: !20, size: 32, align: 32, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !559, file: !558, line: 152, baseType: !587, size: 64, align: 64, offset: 1152)
!612 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !556, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!613 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !556, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!614 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !20, isLocal: false, isDefinition: true, variable: i32* @p_in)
!615 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !20, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!616 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !617, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 640, align: 32, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 20)
!620 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !617, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!621 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !617, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!622 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !617, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!623 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !617, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!624 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !617, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!625 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !20, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!626 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !20, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!627 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !20, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!628 = !DIGlobalVariable(name: "num_mb_per_slice", scope: !0, file: !1, line: 32, type: !20, isLocal: false, isDefinition: true, variable: i32* @num_mb_per_slice)
!629 = !DIGlobalVariable(name: "number_of_slices", scope: !0, file: !1, line: 33, type: !20, isLocal: false, isDefinition: true, variable: i32* @number_of_slices)
!630 = !DIGlobalVariable(name: "initialized", scope: !0, file: !1, line: 34, type: !17, isLocal: false, isDefinition: true, variable: i32**** @initialized)
!631 = !DIGlobalVariable(name: "model_number", scope: !0, file: !1, line: 35, type: !17, isLocal: false, isDefinition: true, variable: i32**** @model_number)
!632 = !DIGlobalVariable(name: "entropy", scope: !0, file: !1, line: 38, type: !154, isLocal: false, isDefinition: true, variable: [128 x double]* @entropy)
!633 = !DIGlobalVariable(name: "INIT_MB_TYPE_I", scope: !0, file: !634, line: 26, type: !635, isLocal: true, isDefinition: true, variable: [1 x [3 x [11 x [2 x i32]]]]* @INIT_MB_TYPE_I)
!634 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/ctx_tables.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 2112, align: 32, elements: !636)
!636 = !{!608, !60, !61, !65}
