; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/decoder.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !18, globals: !246, imports: !757)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/decoder.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "P_SLICE", value: 0)
!7 = !DIEnumerator(name: "B_SLICE", value: 1)
!8 = !DIEnumerator(name: "I_SLICE", value: 2)
!9 = !DIEnumerator(name: "SP_SLICE", value: 3)
!10 = !DIEnumerator(name: "SI_SLICE", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 42, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "FALSE", value: 0)
!15 = !DIEnumerator(name: "TRUE", value: 1)
!16 = !{!17}
!17 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!18 = !{!19, !53, !123, !140, !165, !170, !179, !191, !196, !210, !221}
!19 = !DISubprogram(name: "decode_one_b8block", scope: !1, file: !1, line: 37, type: !20, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32)* @decode_one_b8block, variables: !23)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !22, !22, !22, !22}
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !41, !45, !46, !47, !48, !49, !50, !51, !52}
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decoder", arg: 1, scope: !19, file: !1, line: 37, type: !22)
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbmode", arg: 2, scope: !19, file: !1, line: 37, type: !22)
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8block", arg: 3, scope: !19, file: !1, line: 37, type: !22)
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8mode", arg: 4, scope: !19, file: !1, line: 37, type: !22)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8ref", arg: 5, scope: !19, file: !1, line: 37, type: !22)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !19, file: !1, line: 39, type: !22)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !19, file: !1, line: 39, type: !22)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !19, file: !1, line: 39, type: !22)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !19, file: !1, line: 39, type: !22)
!33 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx", scope: !19, file: !1, line: 39, type: !22)
!34 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by", scope: !19, file: !1, line: 39, type: !22)
!35 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_inx", scope: !19, file: !1, line: 40, type: !22)
!36 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !19, file: !1, line: 42, type: !37)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, align: 32, elements: !38)
!38 = !{!39, !40, !40}
!39 = !DISubrange(count: 2)
!40 = !DISubrange(count: 4)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resY_tmp", scope: !19, file: !1, line: 43, type: !42)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, align: 32, elements: !43)
!43 = !{!44, !44}
!44 = !DISubrange(count: 16)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !19, file: !1, line: 45, type: !22)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !19, file: !1, line: 45, type: !22)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx0", scope: !19, file: !1, line: 45, type: !22)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx1", scope: !19, file: !1, line: 45, type: !22)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !19, file: !1, line: 46, type: !22)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !19, file: !1, line: 46, type: !22)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by0", scope: !19, file: !1, line: 46, type: !22)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by1", scope: !19, file: !1, line: 46, type: !22)
!53 = !DISubprogram(name: "decode_one_mb", scope: !1, file: !1, line: 146, type: !54, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.macroblock*)* @decode_one_mb, variables: !120)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !22, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !4, line: 406, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !4, line: 351, size: 5056, align: 64, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !69, !71, !72, !73, !76, !79, !80, !81, !86, !89, !90, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !58, file: !4, line: 353, baseType: !22, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !58, file: !4, line: 354, baseType: !22, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !58, file: !4, line: 355, baseType: !22, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !58, file: !4, line: 356, baseType: !22, size: 32, align: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !58, file: !4, line: 357, baseType: !22, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !58, file: !4, line: 358, baseType: !66, size: 256, align: 32, offset: 160)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, align: 32, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !58, file: !4, line: 360, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !58, file: !4, line: 361, baseType: !70, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !58, file: !4, line: 363, baseType: !22, size: 32, align: 32, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !58, file: !4, line: 364, baseType: !74, size: 2048, align: 32, offset: 608)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, align: 32, elements: !75)
!75 = !{!39, !40, !40, !39}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !58, file: !4, line: 365, baseType: !77, size: 512, align: 32, offset: 2656)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 32, elements: !78)
!78 = !{!44}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !58, file: !4, line: 366, baseType: !77, size: 512, align: 32, offset: 3168)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !58, file: !4, line: 367, baseType: !22, size: 32, align: 32, offset: 3680)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !58, file: !4, line: 368, baseType: !82, size: 64, align: 64, offset: 3712)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !84, line: 30, baseType: !85)
!84 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !58, file: !4, line: 369, baseType: !87, size: 128, align: 32, offset: 3776)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, align: 32, elements: !88)
!88 = !{!40}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !58, file: !4, line: 370, baseType: !87, size: 128, align: 32, offset: 3904)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !58, file: !4, line: 371, baseType: !91, size: 64, align: 64, offset: 4032)
!91 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !58, file: !4, line: 373, baseType: !22, size: 32, align: 32, offset: 4096)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !58, file: !4, line: 374, baseType: !22, size: 32, align: 32, offset: 4128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !58, file: !4, line: 375, baseType: !22, size: 32, align: 32, offset: 4160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !58, file: !4, line: 377, baseType: !22, size: 32, align: 32, offset: 4192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !58, file: !4, line: 378, baseType: !22, size: 32, align: 32, offset: 4224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !58, file: !4, line: 380, baseType: !22, size: 32, align: 32, offset: 4256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !58, file: !4, line: 382, baseType: !22, size: 32, align: 32, offset: 4288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !58, file: !4, line: 382, baseType: !22, size: 32, align: 32, offset: 4320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !58, file: !4, line: 382, baseType: !22, size: 32, align: 32, offset: 4352)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !58, file: !4, line: 382, baseType: !22, size: 32, align: 32, offset: 4384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !58, file: !4, line: 383, baseType: !22, size: 32, align: 32, offset: 4416)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !58, file: !4, line: 383, baseType: !22, size: 32, align: 32, offset: 4448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !58, file: !4, line: 383, baseType: !22, size: 32, align: 32, offset: 4480)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !58, file: !4, line: 383, baseType: !22, size: 32, align: 32, offset: 4512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !58, file: !4, line: 385, baseType: !22, size: 32, align: 32, offset: 4544)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !58, file: !4, line: 386, baseType: !22, size: 32, align: 32, offset: 4576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !58, file: !4, line: 387, baseType: !22, size: 32, align: 32, offset: 4608)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !58, file: !4, line: 390, baseType: !22, size: 32, align: 32, offset: 4640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !58, file: !4, line: 394, baseType: !17, size: 64, align: 64, offset: 4672)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !58, file: !4, line: 395, baseType: !22, size: 32, align: 32, offset: 4736)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !58, file: !4, line: 396, baseType: !22, size: 32, align: 32, offset: 4768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !58, file: !4, line: 397, baseType: !22, size: 32, align: 32, offset: 4800)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !58, file: !4, line: 398, baseType: !22, size: 32, align: 32, offset: 4832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !58, file: !4, line: 399, baseType: !22, size: 32, align: 32, offset: 4864)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !58, file: !4, line: 401, baseType: !22, size: 32, align: 32, offset: 4896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !58, file: !4, line: 402, baseType: !22, size: 32, align: 32, offset: 4928)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !58, file: !4, line: 403, baseType: !22, size: 32, align: 32, offset: 4960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !58, file: !4, line: 405, baseType: !22, size: 32, align: 32, offset: 4992)
!120 = !{!121, !122}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decoder", arg: 1, scope: !53, file: !1, line: 146, type: !22)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 2, scope: !53, file: !1, line: 146, type: !56)
!123 = !DISubprogram(name: "Get_Reference_Block", scope: !1, file: !1, line: 179, type: !124, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i32, i32, i32, i32, i16**)* @Get_Reference_Block, variables: !129)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126, !22, !22, !22, !22, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imY", arg: 1, scope: !123, file: !1, line: 179, type: !126)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 2, scope: !123, file: !1, line: 180, type: !22)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 3, scope: !123, file: !1, line: 181, type: !22)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mvhor", arg: 4, scope: !123, file: !1, line: 182, type: !22)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mvver", arg: 5, scope: !123, file: !1, line: 183, type: !22)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 6, scope: !123, file: !1, line: 184, type: !126)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !123, file: !1, line: 186, type: !22)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !123, file: !1, line: 186, type: !22)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !123, file: !1, line: 186, type: !22)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !123, file: !1, line: 186, type: !22)
!140 = !DISubprogram(name: "Get_Reference_Pixel", scope: !1, file: !1, line: 207, type: !141, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i16**, i32, i32)* @Get_Reference_Pixel, variables: !146)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !126, !22, !22}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !144, line: 30, baseType: !145)
!144 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imY", arg: 1, scope: !140, file: !1, line: 207, type: !126)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y_pos", arg: 2, scope: !140, file: !1, line: 207, type: !22)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x_pos", arg: 3, scope: !140, file: !1, line: 207, type: !22)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !140, file: !1, line: 210, type: !22)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !140, file: !1, line: 210, type: !22)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !140, file: !1, line: 211, type: !22)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !140, file: !1, line: 211, type: !22)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxold_x", scope: !140, file: !1, line: 212, type: !22)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxold_y", scope: !140, file: !1, line: 212, type: !22)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !140, file: !1, line: 214, type: !22)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result1", scope: !140, file: !1, line: 214, type: !22)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result2", scope: !140, file: !1, line: 214, type: !22)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pres_x", scope: !140, file: !1, line: 215, type: !22)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pres_y", scope: !140, file: !1, line: 216, type: !22)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_res", scope: !140, file: !1, line: 218, type: !162)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, align: 32, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 6)
!165 = !DISubprogram(name: "UpdateDecoders", scope: !1, file: !1, line: 361, type: !166, isLocal: false, isDefinition: true, scopeLine: 362, isOptimized: true, function: void ()* @UpdateDecoders, variables: !168)
!166 = !DISubroutineType(types: !167)
!167 = !{null}
!168 = !{!169}
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !165, file: !1, line: 363, type: !22)
!170 = !DISubprogram(name: "DecOneForthPix", scope: !1, file: !1, line: 386, type: !171, isLocal: false, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i16***)* @DecOneForthPix, variables: !174)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !126, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!174 = !{!175, !176, !177, !178}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dY", arg: 1, scope: !170, file: !1, line: 386, type: !126)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dref", arg: 2, scope: !170, file: !1, line: 386, type: !173)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !170, file: !1, line: 388, type: !22)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !170, file: !1, line: 388, type: !22)
!179 = !DISubprogram(name: "compute_residue_b8block", scope: !1, file: !1, line: 400, type: !180, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @compute_residue_b8block, variables: !182)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !22, !22}
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8block", arg: 1, scope: !179, file: !1, line: 400, type: !22)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i16mode", arg: 2, scope: !179, file: !1, line: 400, type: !22)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !179, file: !1, line: 402, type: !22)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !179, file: !1, line: 402, type: !22)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !179, file: !1, line: 403, type: !22)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !179, file: !1, line: 403, type: !22)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !179, file: !1, line: 404, type: !22)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !179, file: !1, line: 404, type: !22)
!191 = !DISubprogram(name: "compute_residue_mb", scope: !1, file: !1, line: 430, type: !192, isLocal: false, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @compute_residue_mb, variables: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !22}
!194 = !{!195}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i16mode", arg: 1, scope: !191, file: !1, line: 430, type: !22)
!196 = !DISubprogram(name: "Build_Status_Map", scope: !1, file: !1, line: 449, type: !197, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**)* @Build_Status_Map, variables: !201)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209}
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_map", arg: 1, scope: !196, file: !1, line: 449, type: !199)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !196, file: !1, line: 451, type: !22)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !196, file: !1, line: 451, type: !22)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slice", scope: !196, file: !1, line: 451, type: !22)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb", scope: !196, file: !1, line: 451, type: !22)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !196, file: !1, line: 451, type: !22)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !196, file: !1, line: 451, type: !22)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "packet_lost", scope: !196, file: !1, line: 451, type: !22)
!210 = !DISubprogram(name: "Error_Concealment", scope: !1, file: !1, line: 500, type: !211, isLocal: false, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i8**, i16***)* @Error_Concealment, variables: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !126, !199, !173}
!213 = !{!214, !215, !216, !217, !218, !219, !220}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inY", arg: 1, scope: !210, file: !1, line: 500, type: !126)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_map", arg: 2, scope: !210, file: !1, line: 500, type: !199)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "refY", arg: 3, scope: !210, file: !1, line: 500, type: !173)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !210, file: !1, line: 502, type: !22)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !210, file: !1, line: 502, type: !22)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_h", scope: !210, file: !1, line: 502, type: !22)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_w", scope: !210, file: !1, line: 502, type: !22)
!221 = !DISubprogram(name: "Conceal_Error", scope: !1, file: !1, line: 520, type: !222, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i32, i32, i16***, i8**)* @Conceal_Error, variables: !224)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !126, !22, !22, !173, !199}
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inY", arg: 1, scope: !221, file: !1, line: 520, type: !126)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_y", arg: 2, scope: !221, file: !1, line: 520, type: !22)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_x", arg: 3, scope: !221, file: !1, line: 520, type: !22)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "refY", arg: 4, scope: !221, file: !1, line: 520, type: !173)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_map", arg: 5, scope: !221, file: !1, line: 520, type: !199)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !221, file: !1, line: 522, type: !22)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !221, file: !1, line: 522, type: !22)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !221, file: !1, line: 522, type: !22)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !221, file: !1, line: 522, type: !22)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_inx", scope: !221, file: !1, line: 523, type: !22)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos_y", scope: !221, file: !1, line: 524, type: !22)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos_x", scope: !221, file: !1, line: 524, type: !22)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !221, file: !1, line: 525, type: !37)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resY", scope: !221, file: !1, line: 526, type: !42)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !221, file: !1, line: 527, type: !22)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inter", scope: !221, file: !1, line: 528, type: !22)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_mv", scope: !221, file: !1, line: 529, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!246 = !{!247, !250, !436, !437, !438, !439, !440, !441, !442, !444, !445, !446, !447, !448, !484, !579, !580, !581, !583, !584, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !615, !616, !617, !618, !619, !620, !621, !624, !625, !626, !627, !628, !631, !632, !643, !679, !680, !681, !682, !683, !741, !742, !743, !744, !745, !749, !750, !751, !752, !753, !754, !755, !756}
!247 = !DIGlobalVariable(name: "COEF", scope: !140, file: !1, line: 220, type: !248, isLocal: true, isDefinition: true, variable: [6 x i32]* @Get_Reference_Pixel.COEF)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 192, align: 32, elements: !163)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!250 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !251, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !254)
!254 = !{!255, !256, !257, !431, !432, !434, !435}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !253, file: !4, line: 477, baseType: !22, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !253, file: !4, line: 478, baseType: !22, size: 32, align: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !253, file: !4, line: 479, baseType: !258, size: 6400, align: 64, offset: 64)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 6400, align: 64, elements: !429)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !261)
!261 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !344, !377, !404, !413, !414, !415, !416, !417, !418, !419, !420, !421, !426}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !261, file: !4, line: 445, baseType: !22, size: 32, align: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !261, file: !4, line: 446, baseType: !22, size: 32, align: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !261, file: !4, line: 447, baseType: !22, size: 32, align: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !261, file: !4, line: 448, baseType: !22, size: 32, align: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !261, file: !4, line: 449, baseType: !22, size: 32, align: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !261, file: !4, line: 450, baseType: !22, size: 32, align: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !261, file: !4, line: 451, baseType: !270, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !273)
!273 = !{!274, !290, !316}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !272, file: !4, line: 433, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !277, file: !4, line: 413, baseType: !22, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !277, file: !4, line: 414, baseType: !22, size: 32, align: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !277, file: !4, line: 415, baseType: !143, size: 8, align: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !277, file: !4, line: 416, baseType: !22, size: 32, align: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !277, file: !4, line: 417, baseType: !22, size: 32, align: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !277, file: !4, line: 418, baseType: !143, size: 8, align: 8, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !277, file: !4, line: 420, baseType: !143, size: 8, align: 8, offset: 168)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !277, file: !4, line: 421, baseType: !22, size: 32, align: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !277, file: !4, line: 422, baseType: !22, size: 32, align: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !277, file: !4, line: 424, baseType: !200, size: 64, align: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !277, file: !4, line: 425, baseType: !22, size: 32, align: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !272, file: !4, line: 434, baseType: !291, size: 832, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !293)
!293 = !{!294, !296, !297, !298, !299, !300, !301, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !292, file: !4, line: 209, baseType: !295, size: 32, align: 32)
!295 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !292, file: !4, line: 209, baseType: !295, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !292, file: !4, line: 210, baseType: !295, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !292, file: !4, line: 211, baseType: !295, size: 32, align: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !292, file: !4, line: 212, baseType: !295, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !292, file: !4, line: 213, baseType: !200, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !292, file: !4, line: 214, baseType: !302, size: 64, align: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !292, file: !4, line: 217, baseType: !295, size: 32, align: 32, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !292, file: !4, line: 217, baseType: !295, size: 32, align: 32, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !292, file: !4, line: 218, baseType: !295, size: 32, align: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !292, file: !4, line: 219, baseType: !295, size: 32, align: 32, offset: 416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !292, file: !4, line: 220, baseType: !295, size: 32, align: 32, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !292, file: !4, line: 221, baseType: !200, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !292, file: !4, line: 222, baseType: !302, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !292, file: !4, line: 223, baseType: !22, size: 32, align: 32, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !292, file: !4, line: 223, baseType: !22, size: 32, align: 32, offset: 672)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !292, file: !4, line: 224, baseType: !22, size: 32, align: 32, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !292, file: !4, line: 224, baseType: !22, size: 32, align: 32, offset: 736)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !292, file: !4, line: 225, baseType: !22, size: 32, align: 32, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !292, file: !4, line: 225, baseType: !22, size: 32, align: 32, offset: 800)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !272, file: !4, line: 436, baseType: !317, size: 64, align: 64, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!22, !320, !343}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !322)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !4, line: 329, baseType: !22, size: 32, align: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !322, file: !4, line: 330, baseType: !22, size: 32, align: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !322, file: !4, line: 331, baseType: !22, size: 32, align: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !322, file: !4, line: 332, baseType: !22, size: 32, align: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !322, file: !4, line: 333, baseType: !22, size: 32, align: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !322, file: !4, line: 334, baseType: !295, size: 32, align: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !322, file: !4, line: 335, baseType: !22, size: 32, align: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !322, file: !4, line: 336, baseType: !22, size: 32, align: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !322, file: !4, line: 344, baseType: !333, size: 64, align: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !22, !22, !302, !302}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !322, file: !4, line: 346, baseType: !337, size: 64, align: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340, !341}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !261, file: !4, line: 452, baseType: !345, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !347)
!347 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !348)
!348 = !{!349, !360, !364, !368, !371, !373, !374}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !347, file: !4, line: 260, baseType: !350, size: 4224, align: 64)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 4224, align: 64, elements: !357)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !4, line: 233, baseType: !128, size: 16, align: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !352, file: !4, line: 234, baseType: !145, size: 8, align: 8, offset: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !352, file: !4, line: 236, baseType: !91, size: 64, align: 64, offset: 64)
!357 = !{!358, !359}
!358 = !DISubrange(count: 3)
!359 = !DISubrange(count: 11)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !347, file: !4, line: 261, baseType: !361, size: 2304, align: 64, offset: 4224)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 2304, align: 64, elements: !362)
!362 = !{!39, !363}
!363 = !DISubrange(count: 9)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !347, file: !4, line: 262, baseType: !365, size: 2560, align: 64, offset: 6528)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 2560, align: 64, elements: !366)
!366 = !{!39, !367}
!367 = !DISubrange(count: 10)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !347, file: !4, line: 263, baseType: !369, size: 1536, align: 64, offset: 9088)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 1536, align: 64, elements: !370)
!370 = !{!39, !164}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !347, file: !4, line: 264, baseType: !372, size: 512, align: 64, offset: 10624)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 512, align: 64, elements: !88)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !347, file: !4, line: 265, baseType: !372, size: 512, align: 64, offset: 11136)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !347, file: !4, line: 266, baseType: !375, size: 384, align: 64, offset: 11648)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 384, align: 64, elements: !376)
!376 = !{!358}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !261, file: !4, line: 453, baseType: !378, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !381)
!381 = !{!382, !385, !386, !389, !392, !396, !397, !401, !402, !403}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !380, file: !4, line: 283, baseType: !383, size: 256, align: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 256, align: 64, elements: !384)
!384 = !{!39}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !380, file: !4, line: 284, baseType: !372, size: 512, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !380, file: !4, line: 285, baseType: !387, size: 1536, align: 64, offset: 768)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 1536, align: 64, elements: !388)
!388 = !{!358, !40}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !380, file: !4, line: 286, baseType: !390, size: 5120, align: 64, offset: 2304)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 5120, align: 64, elements: !391)
!391 = !{!367, !40}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !380, file: !4, line: 287, baseType: !393, size: 19200, align: 64, offset: 7424)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 19200, align: 64, elements: !394)
!394 = !{!367, !395}
!395 = !DISubrange(count: 15)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !380, file: !4, line: 288, baseType: !393, size: 19200, align: 64, offset: 26624)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !380, file: !4, line: 289, baseType: !398, size: 6400, align: 64, offset: 45824)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 6400, align: 64, elements: !399)
!399 = !{!367, !400}
!400 = !DISubrange(count: 5)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !380, file: !4, line: 290, baseType: !398, size: 6400, align: 64, offset: 52224)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !380, file: !4, line: 291, baseType: !393, size: 19200, align: 64, offset: 58624)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !380, file: !4, line: 292, baseType: !393, size: 19200, align: 64, offset: 77824)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !261, file: !4, line: 456, baseType: !405, size: 64, align: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !407, file: !4, line: 310, baseType: !22, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !407, file: !4, line: 311, baseType: !22, size: 32, align: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !407, file: !4, line: 312, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !261, file: !4, line: 458, baseType: !22, size: 32, align: 32, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !261, file: !4, line: 459, baseType: !302, size: 64, align: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !261, file: !4, line: 460, baseType: !302, size: 64, align: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !261, file: !4, line: 461, baseType: !302, size: 64, align: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !261, file: !4, line: 462, baseType: !22, size: 32, align: 32, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !261, file: !4, line: 463, baseType: !302, size: 64, align: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !261, file: !4, line: 464, baseType: !302, size: 64, align: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !261, file: !4, line: 465, baseType: !302, size: 64, align: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !261, file: !4, line: 467, baseType: !422, size: 64, align: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !22}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !12, line: 45, baseType: !11)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !261, file: !4, line: 469, baseType: !427, size: 192, align: 32, offset: 1024)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, align: 32, elements: !428)
!428 = !{!358, !39}
!429 = !{!430}
!430 = !DISubrange(count: 100)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !253, file: !4, line: 480, baseType: !22, size: 32, align: 32, offset: 6464)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !253, file: !4, line: 481, baseType: !433, size: 32, align: 32, offset: 6496)
!433 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !253, file: !4, line: 482, baseType: !433, size: 32, align: 32, offset: 6528)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !253, file: !4, line: 483, baseType: !433, size: 32, align: 32, offset: 6560)
!436 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !251, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!437 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !251, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!438 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !251, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!439 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !251, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!440 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !126, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!441 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !173, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!442 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !443, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!444 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !295, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!445 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !295, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!446 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !22, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!447 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !22, isLocal: false, isDefinition: true, variable: i32* @me_time)
!448 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !449, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !12, line: 145, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 103, size: 1920, align: 64, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !451, file: !12, line: 105, baseType: !425, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !451, file: !12, line: 106, baseType: !295, size: 32, align: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !451, file: !12, line: 107, baseType: !295, size: 32, align: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !451, file: !12, line: 108, baseType: !425, size: 32, align: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !451, file: !12, line: 110, baseType: !425, size: 32, align: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !451, file: !12, line: 111, baseType: !425, size: 32, align: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !451, file: !12, line: 112, baseType: !66, size: 256, align: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !451, file: !12, line: 115, baseType: !425, size: 32, align: 32, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !451, file: !12, line: 116, baseType: !295, size: 32, align: 32, offset: 480)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !451, file: !12, line: 117, baseType: !295, size: 32, align: 32, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !451, file: !12, line: 119, baseType: !464, size: 256, align: 32, offset: 544)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 256, align: 32, elements: !67)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !451, file: !12, line: 121, baseType: !464, size: 256, align: 32, offset: 800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !451, file: !12, line: 122, baseType: !464, size: 256, align: 32, offset: 1056)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !451, file: !12, line: 124, baseType: !425, size: 32, align: 32, offset: 1312)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !451, file: !12, line: 125, baseType: !295, size: 32, align: 32, offset: 1344)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !451, file: !12, line: 127, baseType: !295, size: 32, align: 32, offset: 1376)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !451, file: !12, line: 128, baseType: !200, size: 64, align: 64, offset: 1408)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !451, file: !12, line: 130, baseType: !22, size: 32, align: 32, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !451, file: !12, line: 131, baseType: !22, size: 32, align: 32, offset: 1504)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !451, file: !12, line: 132, baseType: !425, size: 32, align: 32, offset: 1536)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !451, file: !12, line: 133, baseType: !295, size: 32, align: 32, offset: 1568)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !451, file: !12, line: 134, baseType: !22, size: 32, align: 32, offset: 1600)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !451, file: !12, line: 135, baseType: !22, size: 32, align: 32, offset: 1632)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !451, file: !12, line: 136, baseType: !22, size: 32, align: 32, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !451, file: !12, line: 138, baseType: !22, size: 32, align: 32, offset: 1696)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !451, file: !12, line: 139, baseType: !22, size: 32, align: 32, offset: 1728)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !451, file: !12, line: 141, baseType: !425, size: 32, align: 32, offset: 1760)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !451, file: !12, line: 142, baseType: !425, size: 32, align: 32, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !451, file: !12, line: 143, baseType: !425, size: 32, align: 32, offset: 1824)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !451, file: !12, line: 144, baseType: !425, size: 32, align: 32, offset: 1856)
!484 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !485, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !12, line: 193, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 149, size: 17056, align: 32, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !487, file: !12, line: 151, baseType: !425, size: 32, align: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !487, file: !12, line: 153, baseType: !295, size: 32, align: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !487, file: !12, line: 154, baseType: !425, size: 32, align: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !487, file: !12, line: 155, baseType: !425, size: 32, align: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !487, file: !12, line: 156, baseType: !425, size: 32, align: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !487, file: !12, line: 157, baseType: !425, size: 32, align: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !487, file: !12, line: 158, baseType: !295, size: 32, align: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !487, file: !12, line: 159, baseType: !295, size: 32, align: 32, offset: 224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !487, file: !12, line: 160, baseType: !295, size: 32, align: 32, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !487, file: !12, line: 162, baseType: !425, size: 32, align: 32, offset: 288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !487, file: !12, line: 163, baseType: !66, size: 256, align: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !487, file: !12, line: 165, baseType: !295, size: 32, align: 32, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !487, file: !12, line: 166, baseType: !295, size: 32, align: 32, offset: 608)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !487, file: !12, line: 167, baseType: !295, size: 32, align: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !487, file: !12, line: 168, baseType: !295, size: 32, align: 32, offset: 672)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !487, file: !12, line: 170, baseType: !295, size: 32, align: 32, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !487, file: !12, line: 172, baseType: !425, size: 32, align: 32, offset: 736)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !487, file: !12, line: 173, baseType: !22, size: 32, align: 32, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !487, file: !12, line: 174, baseType: !22, size: 32, align: 32, offset: 800)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !487, file: !12, line: 175, baseType: !295, size: 32, align: 32, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !487, file: !12, line: 177, baseType: !510, size: 8192, align: 32, offset: 864)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, align: 32, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !487, file: !12, line: 178, baseType: !295, size: 32, align: 32, offset: 9056)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !487, file: !12, line: 179, baseType: !425, size: 32, align: 32, offset: 9088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !487, file: !12, line: 180, baseType: !295, size: 32, align: 32, offset: 9120)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !487, file: !12, line: 181, baseType: !295, size: 32, align: 32, offset: 9152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !487, file: !12, line: 182, baseType: !425, size: 32, align: 32, offset: 9184)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !487, file: !12, line: 184, baseType: !425, size: 32, align: 32, offset: 9216)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !487, file: !12, line: 185, baseType: !425, size: 32, align: 32, offset: 9248)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !487, file: !12, line: 186, baseType: !425, size: 32, align: 32, offset: 9280)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !487, file: !12, line: 187, baseType: !295, size: 32, align: 32, offset: 9312)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !487, file: !12, line: 188, baseType: !295, size: 32, align: 32, offset: 9344)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !487, file: !12, line: 189, baseType: !295, size: 32, align: 32, offset: 9376)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !487, file: !12, line: 190, baseType: !295, size: 32, align: 32, offset: 9408)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !487, file: !12, line: 191, baseType: !425, size: 32, align: 32, offset: 9440)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !487, file: !12, line: 192, baseType: !527, size: 7584, align: 32, offset: 9472)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !12, line: 99, baseType: !528)
!528 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 63, size: 7584, align: 32, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !528, file: !12, line: 65, baseType: !425, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !528, file: !12, line: 66, baseType: !295, size: 32, align: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !528, file: !12, line: 67, baseType: !295, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !528, file: !12, line: 68, baseType: !295, size: 32, align: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !528, file: !12, line: 69, baseType: !425, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !528, file: !12, line: 70, baseType: !425, size: 32, align: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !528, file: !12, line: 71, baseType: !425, size: 32, align: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !528, file: !12, line: 72, baseType: !295, size: 32, align: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !528, file: !12, line: 73, baseType: !425, size: 32, align: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !528, file: !12, line: 74, baseType: !425, size: 32, align: 32, offset: 288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !528, file: !12, line: 75, baseType: !295, size: 32, align: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !528, file: !12, line: 76, baseType: !295, size: 32, align: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !528, file: !12, line: 77, baseType: !295, size: 32, align: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !528, file: !12, line: 78, baseType: !425, size: 32, align: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !528, file: !12, line: 79, baseType: !295, size: 32, align: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !528, file: !12, line: 80, baseType: !295, size: 32, align: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !528, file: !12, line: 81, baseType: !425, size: 32, align: 32, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !528, file: !12, line: 82, baseType: !295, size: 32, align: 32, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !528, file: !12, line: 83, baseType: !295, size: 32, align: 32, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !528, file: !12, line: 84, baseType: !425, size: 32, align: 32, offset: 608)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !528, file: !12, line: 85, baseType: !425, size: 32, align: 32, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !528, file: !12, line: 86, baseType: !552, size: 3296, align: 32, offset: 672)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !12, line: 60, baseType: !553)
!553 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 48, size: 3296, align: 32, elements: !554)
!554 = !{!555, !556, !557, !558, !562, !563, !564, !565, !566, !567}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !553, file: !12, line: 50, baseType: !295, size: 32, align: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !553, file: !12, line: 51, baseType: !295, size: 32, align: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !553, file: !12, line: 52, baseType: !295, size: 32, align: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !553, file: !12, line: 53, baseType: !559, size: 1024, align: 32, offset: 96)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 1024, align: 32, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !553, file: !12, line: 54, baseType: !559, size: 1024, align: 32, offset: 1120)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !553, file: !12, line: 55, baseType: !559, size: 1024, align: 32, offset: 2144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !553, file: !12, line: 56, baseType: !295, size: 32, align: 32, offset: 3168)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !553, file: !12, line: 57, baseType: !295, size: 32, align: 32, offset: 3200)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !553, file: !12, line: 58, baseType: !295, size: 32, align: 32, offset: 3232)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !553, file: !12, line: 59, baseType: !295, size: 32, align: 32, offset: 3264)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !528, file: !12, line: 87, baseType: !425, size: 32, align: 32, offset: 3968)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !528, file: !12, line: 88, baseType: !552, size: 3296, align: 32, offset: 4000)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !528, file: !12, line: 90, baseType: !425, size: 32, align: 32, offset: 7296)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !528, file: !12, line: 91, baseType: !425, size: 32, align: 32, offset: 7328)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !528, file: !12, line: 92, baseType: !425, size: 32, align: 32, offset: 7360)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !528, file: !12, line: 93, baseType: !295, size: 32, align: 32, offset: 7392)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !528, file: !12, line: 94, baseType: !295, size: 32, align: 32, offset: 7424)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !528, file: !12, line: 95, baseType: !295, size: 32, align: 32, offset: 7456)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !528, file: !12, line: 96, baseType: !295, size: 32, align: 32, offset: 7488)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !528, file: !12, line: 97, baseType: !295, size: 32, align: 32, offset: 7520)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !528, file: !12, line: 98, baseType: !295, size: 32, align: 32, offset: 7552)
!579 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !22, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!580 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !22, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!581 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !582, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!583 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !582, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!584 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !585, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!586 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !22, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!587 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !22, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!588 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !22, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!589 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !22, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!590 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !126, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!591 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !126, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!592 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !173, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!593 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !173, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!594 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !126, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!595 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !173, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!596 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !126, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!597 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !173, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!598 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !242, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!599 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !243, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!600 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !199, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!601 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !199, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!602 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !22, isLocal: false, isDefinition: true, variable: i32* @intras)
!603 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !22, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!604 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !22, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!605 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !22, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!606 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !22, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!607 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !22, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!608 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !22, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!609 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !22, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!610 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !611, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 2400, align: 8, elements: !613)
!612 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!613 = !{!614}
!614 = !DISubrange(count: 300)
!615 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !42, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!616 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !42, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!617 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !42, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!618 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !42, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!619 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !42, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!620 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !42, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!621 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !622, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 24576, align: 32, elements: !623)
!623 = !{!358, !44, !44}
!624 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !37, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!625 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !37, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!626 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !37, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!627 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !37, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!628 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !629, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 32, elements: !630)
!630 = !{!40, !40}
!631 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !77, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!632 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !633, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !635)
!635 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !635, file: !4, line: 1184, baseType: !22, size: 32, align: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !635, file: !4, line: 1185, baseType: !22, size: 32, align: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !635, file: !4, line: 1186, baseType: !22, size: 32, align: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !635, file: !4, line: 1187, baseType: !22, size: 32, align: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !635, file: !4, line: 1188, baseType: !22, size: 32, align: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !635, file: !4, line: 1189, baseType: !22, size: 32, align: 32, offset: 160)
!643 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !644, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !667, !668, !669, !670, !672, !673, !674, !675, !676, !677, !678}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !646, file: !4, line: 1147, baseType: !17, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !646, file: !4, line: 1149, baseType: !42, size: 8192, align: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !646, file: !4, line: 1150, baseType: !42, size: 8192, align: 32, offset: 8256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !646, file: !4, line: 1150, baseType: !42, size: 8192, align: 32, offset: 16448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !646, file: !4, line: 1151, baseType: !585, size: 64, align: 64, offset: 24640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !646, file: !4, line: 1152, baseType: !582, size: 64, align: 64, offset: 24704)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !646, file: !4, line: 1153, baseType: !22, size: 32, align: 32, offset: 24768)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !646, file: !4, line: 1155, baseType: !22, size: 32, align: 32, offset: 24800)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !646, file: !4, line: 1157, baseType: !87, size: 128, align: 32, offset: 24832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !646, file: !4, line: 1157, baseType: !87, size: 128, align: 32, offset: 24960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !646, file: !4, line: 1158, baseType: !443, size: 64, align: 64, offset: 25088)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !646, file: !4, line: 1159, baseType: !77, size: 512, align: 32, offset: 25152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !646, file: !4, line: 1160, baseType: !22, size: 32, align: 32, offset: 25664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !646, file: !4, line: 1161, baseType: !82, size: 64, align: 64, offset: 25728)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !646, file: !4, line: 1162, baseType: !22, size: 32, align: 32, offset: 25792)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !646, file: !4, line: 1163, baseType: !664, size: 64, align: 64, offset: 25856)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !646, file: !4, line: 1164, baseType: !664, size: 64, align: 64, offset: 25920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !646, file: !4, line: 1165, baseType: !664, size: 64, align: 64, offset: 25984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !646, file: !4, line: 1166, baseType: !664, size: 64, align: 64, offset: 26048)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !646, file: !4, line: 1167, baseType: !671, size: 512, align: 16, offset: 26112)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 512, align: 16, elements: !38)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !646, file: !4, line: 1168, baseType: !22, size: 32, align: 32, offset: 26624)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !646, file: !4, line: 1169, baseType: !22, size: 32, align: 32, offset: 26656)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !646, file: !4, line: 1171, baseType: !22, size: 32, align: 32, offset: 26688)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !646, file: !4, line: 1172, baseType: !22, size: 32, align: 32, offset: 26720)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !646, file: !4, line: 1174, baseType: !22, size: 32, align: 32, offset: 26752)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !646, file: !4, line: 1175, baseType: !22, size: 32, align: 32, offset: 26784)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !646, file: !4, line: 1176, baseType: !22, size: 32, align: 32, offset: 26816)
!679 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !645, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!680 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !645, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!681 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !645, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!682 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !645, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!683 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !684, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !686, line: 153, baseType: !687)
!686 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !686, line: 122, size: 1216, align: 64, elements: !688)
!688 = !{!689, !691, !692, !693, !694, !695, !700, !701, !703, !707, !712, !721, !727, !728, !731, !732, !734, !738, !739, !740}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !687, file: !686, line: 123, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !687, file: !686, line: 124, baseType: !22, size: 32, align: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !687, file: !686, line: 125, baseType: !22, size: 32, align: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !687, file: !686, line: 126, baseType: !245, size: 16, align: 16, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !687, file: !686, line: 127, baseType: !245, size: 16, align: 16, offset: 144)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !687, file: !686, line: 128, baseType: !696, size: 128, align: 64, offset: 192)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !686, line: 88, size: 128, align: 64, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !696, file: !686, line: 89, baseType: !690, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !696, file: !686, line: 90, baseType: !22, size: 32, align: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !687, file: !686, line: 129, baseType: !22, size: 32, align: 32, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !687, file: !686, line: 132, baseType: !702, size: 64, align: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !687, file: !686, line: 133, baseType: !704, size: 64, align: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!22, !702}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !687, file: !686, line: 134, baseType: !708, size: 64, align: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!22, !702, !711, !22}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !687, file: !686, line: 135, baseType: !713, size: 64, align: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !702, !716, !22}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !686, line: 77, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !718, line: 71, baseType: !719)
!718 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !720, line: 46, baseType: !85)
!720 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !687, file: !686, line: 136, baseType: !722, size: 64, align: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!22, !702, !725, !22}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !687, file: !686, line: 139, baseType: !696, size: 128, align: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !687, file: !686, line: 140, baseType: !729, size: 64, align: 64, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !686, line: 94, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !687, file: !686, line: 141, baseType: !22, size: 32, align: 32, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !687, file: !686, line: 144, baseType: !733, size: 24, align: 8, offset: 928)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 24, align: 8, elements: !376)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !687, file: !686, line: 145, baseType: !735, size: 8, align: 8, offset: 952)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8, align: 8, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 1)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !687, file: !686, line: 148, baseType: !696, size: 128, align: 64, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !687, file: !686, line: 151, baseType: !22, size: 32, align: 32, offset: 1088)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !687, file: !686, line: 152, baseType: !716, size: 64, align: 64, offset: 1152)
!741 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !684, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!742 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !684, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!743 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !22, isLocal: false, isDefinition: true, variable: i32* @p_in)
!744 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !22, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!745 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !746, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 640, align: 32, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 20)
!749 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !746, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!750 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !746, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!751 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !746, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!752 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !746, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!753 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !746, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!754 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !22, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!755 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !22, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!756 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !22, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!757 = !{}
!758 = !{i32 2, !"Dwarf Version", i32 2}
!759 = !{i32 2, !"Debug Info Version", i32 700000003}
!760 = !{i32 1, !"PIC Level", i32 2}
!761 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!762 = !DIExpression()
!763 = !DILocation(line: 37, column: 30, scope: !19)
!764 = !DILocation(line: 37, column: 43, scope: !19)
!765 = !DILocation(line: 37, column: 55, scope: !19)
!766 = !DILocation(line: 37, column: 68, scope: !19)
!767 = !DILocation(line: 37, column: 80, scope: !19)
!768 = !DILocation(line: 40, column: 18, scope: !19)
!769 = !{!770, !770, i64 0}
!770 = !{!"any pointer", !771, i64 0}
!771 = !{!"omnipotent char", !772, i64 0}
!772 = !{!"Simple C/C++ TBAA"}
!773 = !{!774, !775, i64 0}
