; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/explicit_gop.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }
%struct.GOP_DATA = type { i32, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !37, globals: !124, imports: !84)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/explicit_gop.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !11, !16}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "P_SLICE", value: 0)
!7 = !DIEnumerator(name: "B_SLICE", value: 1)
!8 = !DIEnumerator(name: "I_SLICE", value: 2)
!9 = !DIEnumerator(name: "SP_SLICE", value: 3)
!10 = !DIEnumerator(name: "SI_SLICE", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 111, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!14 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!15 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 42, size: 32, align: 32, elements: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !{!19, !20}
!19 = !DIEnumerator(name: "FALSE", value: 0)
!20 = !DIEnumerator(name: "TRUE", value: 1)
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !4, line: 324, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !4, line: 316, size: 256, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !28, file: !4, line: 318, baseType: !24, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !28, file: !4, line: 319, baseType: !24, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !28, file: !4, line: 320, baseType: !24, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !28, file: !4, line: 321, baseType: !24, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !28, file: !4, line: 322, baseType: !24, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !28, file: !4, line: 323, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!37 = !{!38, !62, !80, !83, !85, !97, !98, !109, !115}
!38 = !DISubprogram(name: "create_pyramid", scope: !1, file: !1, line: 32, type: !39, isLocal: false, isDefinition: true, scopeLine: 33, isOptimized: true, function: void ()* @create_pyramid, variables: !41)
!39 = !DISubroutineType(types: !40)
!40 = !{null}
!41 = !{!42, !43, !44, !45, !48, !49, !50, !51, !52, !53, !54, !55}
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !38, file: !1, line: 34, type: !24)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !38, file: !1, line: 34, type: !24)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "centerB", scope: !38, file: !1, line: 35, type: !24)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "GOPlevels", scope: !46, file: !1, line: 61, type: !24)
!46 = distinct !DILexicalBlock(scope: !47, file: !1, line: 60, column: 3)
!47 = distinct !DILexicalBlock(scope: !38, file: !1, line: 37, column: 7)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Bframes", scope: !46, file: !1, line: 62, type: !24)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curGOPLevelfrm", scope: !46, file: !1, line: 63, type: !23)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curGOPLeveldist", scope: !46, file: !1, line: 63, type: !23)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curlevel", scope: !46, file: !1, line: 64, type: !24)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prvlevelrefs", scope: !46, file: !1, line: 65, type: !24)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levelrefs", scope: !46, file: !1, line: 66, type: !24)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !46, file: !1, line: 67, type: !24)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tempnum", scope: !56, file: !1, line: 110, type: !24)
!56 = distinct !DILexicalBlock(scope: !57, file: !1, line: 109, column: 7)
!57 = distinct !DILexicalBlock(scope: !58, file: !1, line: 108, column: 7)
!58 = distinct !DILexicalBlock(scope: !59, file: !1, line: 108, column: 7)
!59 = distinct !DILexicalBlock(scope: !60, file: !1, line: 107, column: 5)
!60 = distinct !DILexicalBlock(scope: !61, file: !1, line: 106, column: 5)
!61 = distinct !DILexicalBlock(scope: !46, file: !1, line: 106, column: 5)
!62 = !DISubprogram(name: "gop_pyramid", scope: !1, file: !1, line: 153, type: !63, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, %struct.GOP_DATA*)* @gop_pyramid, variables: !75)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !24, !24, !24, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !67, file: !4, line: 1184, baseType: !24, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !67, file: !4, line: 1185, baseType: !24, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !67, file: !4, line: 1186, baseType: !24, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !67, file: !4, line: 1187, baseType: !24, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !67, file: !4, line: 1188, baseType: !24, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !67, file: !4, line: 1189, baseType: !24, size: 32, align: 32, offset: 160)
!75 = !{!76, !77, !78, !79}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 1, scope: !62, file: !1, line: 153, type: !24)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frm_no", arg: 2, scope: !62, file: !1, line: 153, type: !24)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frames", arg: 3, scope: !62, file: !1, line: 153, type: !24)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pyramid_structure", arg: 4, scope: !62, file: !1, line: 153, type: !65)
!80 = !DISubprogram(name: "init_gop_structure", scope: !1, file: !1, line: 190, type: !39, isLocal: false, isDefinition: true, scopeLine: 191, isOptimized: true, function: void ()* @init_gop_structure, variables: !81)
!81 = !{!82}
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_gopsize", scope: !80, file: !1, line: 192, type: !24)
!83 = !DISubprogram(name: "clear_gop_structure", scope: !1, file: !1, line: 206, type: !39, isLocal: false, isDefinition: true, scopeLine: 207, isOptimized: true, function: void ()* @clear_gop_structure, variables: !84)
!84 = !{}
!85 = !DISubprogram(name: "interpret_gop_structure", scope: !1, file: !1, line: 219, type: !39, isLocal: false, isDefinition: true, scopeLine: 220, isOptimized: true, function: void ()* @interpret_gop_structure, variables: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nLength", scope: !85, file: !1, line: 222, type: !24)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !85, file: !1, line: 223, type: !24)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !85, file: !1, line: 223, type: !24)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp", scope: !85, file: !1, line: 223, type: !24)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "display_no", scope: !85, file: !1, line: 223, type: !24)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slice_read", scope: !85, file: !1, line: 224, type: !24)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order_read", scope: !85, file: !1, line: 224, type: !24)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stored_read", scope: !85, file: !1, line: 224, type: !24)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_read", scope: !85, file: !1, line: 224, type: !24)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded_frame", scope: !85, file: !1, line: 225, type: !24)
!97 = !DISubprogram(name: "encode_enhancement_layer", scope: !1, file: !1, line: 363, type: !39, isLocal: false, isDefinition: true, scopeLine: 364, isOptimized: true, function: void ()* @encode_enhancement_layer, variables: !84)
!98 = !DISubprogram(name: "poc_based_ref_management", scope: !1, file: !1, line: 482, type: !99, isLocal: false, isDefinition: true, scopeLine: 483, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @poc_based_ref_management, variables: !101)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !24}
!101 = !{!102, !103, !105, !106, !107, !108}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "current_pic_num", arg: 1, scope: !98, file: !1, line: 482, type: !24)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !98, file: !1, line: 484, type: !104)
!104 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_num", scope: !98, file: !1, line: 484, type: !104)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_poc", scope: !98, file: !1, line: 486, type: !24)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_drpm", scope: !98, file: !1, line: 487, type: !26)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_drpm2", scope: !98, file: !1, line: 487, type: !26)
!109 = !DISubprogram(name: "isdigit", scope: !110, file: !110, line: 237, type: !111, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, variables: !113)
!110 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!111 = !DISubroutineType(types: !112)
!112 = !{!24, !24}
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !109, file: !110, line: 237, type: !24)
!115 = !DISubprogram(name: "__isctype", scope: !110, file: !110, line: 164, type: !116, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, variables: !121)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !118, !120}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !119, line: 70, baseType: !24)
!119 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!120 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!121 = !{!122, !123}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !115, file: !110, line: 164, type: !118)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !115, file: !110, line: 164, type: !120)
!124 = !{!125, !318, !319, !320, !321, !322, !325, !327, !329, !330, !331, !332, !333, !372, !467, !468, !469, !471, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !491, !492, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !508, !512, !513, !514, !515, !516, !517, !520, !523, !524, !525, !526, !529, !532, !533, !574, !575, !576, !577, !578, !634, !635, !636, !637, !638, !642, !643, !644, !645, !646, !647, !648, !649}
!125 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !126, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !129)
!129 = !{!130, !131, !132, !313, !314, !316, !317}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !128, file: !4, line: 477, baseType: !24, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !128, file: !4, line: 478, baseType: !24, size: 32, align: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !128, file: !4, line: 479, baseType: !133, size: 6400, align: 64, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 6400, align: 64, elements: !311)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !221, !259, !286, !295, !296, !297, !298, !299, !300, !301, !302, !303, !308}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !136, file: !4, line: 445, baseType: !24, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !136, file: !4, line: 446, baseType: !24, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !136, file: !4, line: 447, baseType: !24, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !136, file: !4, line: 448, baseType: !24, size: 32, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !136, file: !4, line: 449, baseType: !24, size: 32, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !136, file: !4, line: 450, baseType: !24, size: 32, align: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !136, file: !4, line: 451, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !148)
!148 = !{!149, !169, !193}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !147, file: !4, line: 433, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !153)
!153 = !{!154, !155, !156, !160, !161, !162, !163, !164, !165, !166, !168}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !152, file: !4, line: 413, baseType: !24, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !152, file: !4, line: 414, baseType: !24, size: 32, align: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !152, file: !4, line: 415, baseType: !157, size: 8, align: 8, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !158, line: 30, baseType: !159)
!158 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !152, file: !4, line: 416, baseType: !24, size: 32, align: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !152, file: !4, line: 417, baseType: !24, size: 32, align: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !152, file: !4, line: 418, baseType: !157, size: 8, align: 8, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !152, file: !4, line: 420, baseType: !157, size: 8, align: 8, offset: 168)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !152, file: !4, line: 421, baseType: !24, size: 32, align: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !152, file: !4, line: 422, baseType: !24, size: 32, align: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !152, file: !4, line: 424, baseType: !167, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !152, file: !4, line: 425, baseType: !24, size: 32, align: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !147, file: !4, line: 434, baseType: !170, size: 832, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !171, file: !4, line: 209, baseType: !104, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !171, file: !4, line: 209, baseType: !104, size: 32, align: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !171, file: !4, line: 210, baseType: !104, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !171, file: !4, line: 211, baseType: !104, size: 32, align: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !171, file: !4, line: 212, baseType: !104, size: 32, align: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !171, file: !4, line: 213, baseType: !167, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !171, file: !4, line: 214, baseType: !23, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !171, file: !4, line: 217, baseType: !104, size: 32, align: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !171, file: !4, line: 217, baseType: !104, size: 32, align: 32, offset: 352)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !171, file: !4, line: 218, baseType: !104, size: 32, align: 32, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !171, file: !4, line: 219, baseType: !104, size: 32, align: 32, offset: 416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !171, file: !4, line: 220, baseType: !104, size: 32, align: 32, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !171, file: !4, line: 221, baseType: !167, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !171, file: !4, line: 222, baseType: !23, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !171, file: !4, line: 223, baseType: !24, size: 32, align: 32, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !171, file: !4, line: 223, baseType: !24, size: 32, align: 32, offset: 672)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !171, file: !4, line: 224, baseType: !24, size: 32, align: 32, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !171, file: !4, line: 224, baseType: !24, size: 32, align: 32, offset: 736)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !171, file: !4, line: 225, baseType: !24, size: 32, align: 32, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !171, file: !4, line: 225, baseType: !24, size: 32, align: 32, offset: 800)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !147, file: !4, line: 436, baseType: !194, size: 64, align: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!24, !197, !220}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !199)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !213}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !4, line: 329, baseType: !24, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !199, file: !4, line: 330, baseType: !24, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !199, file: !4, line: 331, baseType: !24, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !199, file: !4, line: 332, baseType: !24, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !199, file: !4, line: 333, baseType: !24, size: 32, align: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !199, file: !4, line: 334, baseType: !104, size: 32, align: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !199, file: !4, line: 335, baseType: !24, size: 32, align: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !199, file: !4, line: 336, baseType: !24, size: 32, align: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !199, file: !4, line: 344, baseType: !210, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !24, !24, !23, !23}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !199, file: !4, line: 346, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !217, !218}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !136, file: !4, line: 452, baseType: !222, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !225)
!225 = !{!226, !238, !243, !247, !251, !255, !256}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !224, file: !4, line: 260, baseType: !227, size: 4224, align: 64)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 4224, align: 64, elements: !235)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !230)
!230 = !{!231, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !229, file: !4, line: 233, baseType: !232, size: 16, align: 16)
!232 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !229, file: !4, line: 234, baseType: !159, size: 8, align: 8, offset: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !229, file: !4, line: 236, baseType: !120, size: 64, align: 64, offset: 64)
!235 = !{!236, !237}
!236 = !DISubrange(count: 3)
!237 = !DISubrange(count: 11)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !224, file: !4, line: 261, baseType: !239, size: 2304, align: 64, offset: 4224)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 2304, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DISubrange(count: 2)
!242 = !DISubrange(count: 9)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !224, file: !4, line: 262, baseType: !244, size: 2560, align: 64, offset: 6528)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 2560, align: 64, elements: !245)
!245 = !{!241, !246}
!246 = !DISubrange(count: 10)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !224, file: !4, line: 263, baseType: !248, size: 1536, align: 64, offset: 9088)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 1536, align: 64, elements: !249)
!249 = !{!241, !250}
!250 = !DISubrange(count: 6)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !224, file: !4, line: 264, baseType: !252, size: 512, align: 64, offset: 10624)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 512, align: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 4)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !224, file: !4, line: 265, baseType: !252, size: 512, align: 64, offset: 11136)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !224, file: !4, line: 266, baseType: !257, size: 384, align: 64, offset: 11648)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 384, align: 64, elements: !258)
!258 = !{!236}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !136, file: !4, line: 453, baseType: !260, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !263)
!263 = !{!264, !267, !268, !271, !274, !278, !279, !283, !284, !285}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !262, file: !4, line: 283, baseType: !265, size: 256, align: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 256, align: 64, elements: !266)
!266 = !{!241}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !262, file: !4, line: 284, baseType: !252, size: 512, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !262, file: !4, line: 285, baseType: !269, size: 1536, align: 64, offset: 768)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 1536, align: 64, elements: !270)
!270 = !{!236, !254}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !262, file: !4, line: 286, baseType: !272, size: 5120, align: 64, offset: 2304)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 5120, align: 64, elements: !273)
!273 = !{!246, !254}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !262, file: !4, line: 287, baseType: !275, size: 19200, align: 64, offset: 7424)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 19200, align: 64, elements: !276)
!276 = !{!246, !277}
!277 = !DISubrange(count: 15)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !262, file: !4, line: 288, baseType: !275, size: 19200, align: 64, offset: 26624)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !262, file: !4, line: 289, baseType: !280, size: 6400, align: 64, offset: 45824)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 6400, align: 64, elements: !281)
!281 = !{!246, !282}
!282 = !DISubrange(count: 5)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !262, file: !4, line: 290, baseType: !280, size: 6400, align: 64, offset: 52224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !262, file: !4, line: 291, baseType: !275, size: 19200, align: 64, offset: 58624)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !262, file: !4, line: 292, baseType: !275, size: 19200, align: 64, offset: 77824)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !136, file: !4, line: 456, baseType: !287, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !289)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !289, file: !4, line: 310, baseType: !24, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !289, file: !4, line: 311, baseType: !24, size: 32, align: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !289, file: !4, line: 312, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !136, file: !4, line: 458, baseType: !24, size: 32, align: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !136, file: !4, line: 459, baseType: !23, size: 64, align: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !136, file: !4, line: 460, baseType: !23, size: 64, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !136, file: !4, line: 461, baseType: !23, size: 64, align: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !136, file: !4, line: 462, baseType: !24, size: 32, align: 32, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !136, file: !4, line: 463, baseType: !23, size: 64, align: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !136, file: !4, line: 464, baseType: !23, size: 64, align: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !136, file: !4, line: 465, baseType: !23, size: 64, align: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !136, file: !4, line: 467, baseType: !304, size: 64, align: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !24}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !17, line: 45, baseType: !16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !136, file: !4, line: 469, baseType: !309, size: 192, align: 32, offset: 1024)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 32, elements: !310)
!310 = !{!236, !241}
!311 = !{!312}
!312 = !DISubrange(count: 100)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !128, file: !4, line: 480, baseType: !24, size: 32, align: 32, offset: 6464)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !128, file: !4, line: 481, baseType: !315, size: 32, align: 32, offset: 6496)
!315 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !128, file: !4, line: 482, baseType: !315, size: 32, align: 32, offset: 6528)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !128, file: !4, line: 483, baseType: !315, size: 32, align: 32, offset: 6560)
!318 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !126, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!319 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !126, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!320 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !126, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!321 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !126, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!322 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!325 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!327 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !328, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!329 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !104, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!330 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !104, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!331 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !24, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!332 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !24, isLocal: false, isDefinition: true, variable: i32* @me_time)
!333 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !334, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !17, line: 145, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 103, size: 1920, align: 64, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !336, file: !17, line: 105, baseType: !307, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !336, file: !17, line: 106, baseType: !104, size: 32, align: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !336, file: !17, line: 107, baseType: !104, size: 32, align: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !336, file: !17, line: 108, baseType: !307, size: 32, align: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !336, file: !17, line: 110, baseType: !307, size: 32, align: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !336, file: !17, line: 111, baseType: !307, size: 32, align: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !336, file: !17, line: 112, baseType: !345, size: 256, align: 32, offset: 192)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 32, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !336, file: !17, line: 115, baseType: !307, size: 32, align: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !336, file: !17, line: 116, baseType: !104, size: 32, align: 32, offset: 480)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !336, file: !17, line: 117, baseType: !104, size: 32, align: 32, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !336, file: !17, line: 119, baseType: !352, size: 256, align: 32, offset: 544)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 256, align: 32, elements: !346)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !336, file: !17, line: 121, baseType: !352, size: 256, align: 32, offset: 800)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !336, file: !17, line: 122, baseType: !352, size: 256, align: 32, offset: 1056)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !336, file: !17, line: 124, baseType: !307, size: 32, align: 32, offset: 1312)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !336, file: !17, line: 125, baseType: !104, size: 32, align: 32, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !336, file: !17, line: 127, baseType: !104, size: 32, align: 32, offset: 1376)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !336, file: !17, line: 128, baseType: !167, size: 64, align: 64, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !336, file: !17, line: 130, baseType: !24, size: 32, align: 32, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !336, file: !17, line: 131, baseType: !24, size: 32, align: 32, offset: 1504)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !336, file: !17, line: 132, baseType: !307, size: 32, align: 32, offset: 1536)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !336, file: !17, line: 133, baseType: !104, size: 32, align: 32, offset: 1568)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !336, file: !17, line: 134, baseType: !24, size: 32, align: 32, offset: 1600)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !336, file: !17, line: 135, baseType: !24, size: 32, align: 32, offset: 1632)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !336, file: !17, line: 136, baseType: !24, size: 32, align: 32, offset: 1664)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !336, file: !17, line: 138, baseType: !24, size: 32, align: 32, offset: 1696)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !336, file: !17, line: 139, baseType: !24, size: 32, align: 32, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !336, file: !17, line: 141, baseType: !307, size: 32, align: 32, offset: 1760)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !336, file: !17, line: 142, baseType: !307, size: 32, align: 32, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !336, file: !17, line: 143, baseType: !307, size: 32, align: 32, offset: 1824)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !336, file: !17, line: 144, baseType: !307, size: 32, align: 32, offset: 1856)
!372 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !373, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !17, line: 193, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 149, size: 17056, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !375, file: !17, line: 151, baseType: !307, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !375, file: !17, line: 153, baseType: !104, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !375, file: !17, line: 154, baseType: !307, size: 32, align: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !375, file: !17, line: 155, baseType: !307, size: 32, align: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !375, file: !17, line: 156, baseType: !307, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !375, file: !17, line: 157, baseType: !307, size: 32, align: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !375, file: !17, line: 158, baseType: !104, size: 32, align: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !375, file: !17, line: 159, baseType: !104, size: 32, align: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !375, file: !17, line: 160, baseType: !104, size: 32, align: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !375, file: !17, line: 162, baseType: !307, size: 32, align: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !375, file: !17, line: 163, baseType: !345, size: 256, align: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !375, file: !17, line: 165, baseType: !104, size: 32, align: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !375, file: !17, line: 166, baseType: !104, size: 32, align: 32, offset: 608)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !375, file: !17, line: 167, baseType: !104, size: 32, align: 32, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !375, file: !17, line: 168, baseType: !104, size: 32, align: 32, offset: 672)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !375, file: !17, line: 170, baseType: !104, size: 32, align: 32, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !375, file: !17, line: 172, baseType: !307, size: 32, align: 32, offset: 736)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !375, file: !17, line: 173, baseType: !24, size: 32, align: 32, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !375, file: !17, line: 174, baseType: !24, size: 32, align: 32, offset: 800)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !375, file: !17, line: 175, baseType: !104, size: 32, align: 32, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !375, file: !17, line: 177, baseType: !398, size: 8192, align: 32, offset: 864)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 32, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !375, file: !17, line: 178, baseType: !104, size: 32, align: 32, offset: 9056)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !375, file: !17, line: 179, baseType: !307, size: 32, align: 32, offset: 9088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !375, file: !17, line: 180, baseType: !104, size: 32, align: 32, offset: 9120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !375, file: !17, line: 181, baseType: !104, size: 32, align: 32, offset: 9152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !375, file: !17, line: 182, baseType: !307, size: 32, align: 32, offset: 9184)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !375, file: !17, line: 184, baseType: !307, size: 32, align: 32, offset: 9216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !375, file: !17, line: 185, baseType: !307, size: 32, align: 32, offset: 9248)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !375, file: !17, line: 186, baseType: !307, size: 32, align: 32, offset: 9280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !375, file: !17, line: 187, baseType: !104, size: 32, align: 32, offset: 9312)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !375, file: !17, line: 188, baseType: !104, size: 32, align: 32, offset: 9344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !375, file: !17, line: 189, baseType: !104, size: 32, align: 32, offset: 9376)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !375, file: !17, line: 190, baseType: !104, size: 32, align: 32, offset: 9408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !375, file: !17, line: 191, baseType: !307, size: 32, align: 32, offset: 9440)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !375, file: !17, line: 192, baseType: !415, size: 7584, align: 32, offset: 9472)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !17, line: 99, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 63, size: 7584, align: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !416, file: !17, line: 65, baseType: !307, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !416, file: !17, line: 66, baseType: !104, size: 32, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !416, file: !17, line: 67, baseType: !104, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !416, file: !17, line: 68, baseType: !104, size: 32, align: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !416, file: !17, line: 69, baseType: !307, size: 32, align: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !416, file: !17, line: 70, baseType: !307, size: 32, align: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !416, file: !17, line: 71, baseType: !307, size: 32, align: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !416, file: !17, line: 72, baseType: !104, size: 32, align: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !416, file: !17, line: 73, baseType: !307, size: 32, align: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !416, file: !17, line: 74, baseType: !307, size: 32, align: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !416, file: !17, line: 75, baseType: !104, size: 32, align: 32, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !416, file: !17, line: 76, baseType: !104, size: 32, align: 32, offset: 352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !416, file: !17, line: 77, baseType: !104, size: 32, align: 32, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !416, file: !17, line: 78, baseType: !307, size: 32, align: 32, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !416, file: !17, line: 79, baseType: !104, size: 32, align: 32, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !416, file: !17, line: 80, baseType: !104, size: 32, align: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !416, file: !17, line: 81, baseType: !307, size: 32, align: 32, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !416, file: !17, line: 82, baseType: !104, size: 32, align: 32, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !416, file: !17, line: 83, baseType: !104, size: 32, align: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !416, file: !17, line: 84, baseType: !307, size: 32, align: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !416, file: !17, line: 85, baseType: !307, size: 32, align: 32, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !416, file: !17, line: 86, baseType: !440, size: 3296, align: 32, offset: 672)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !17, line: 60, baseType: !441)
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 48, size: 3296, align: 32, elements: !442)
!442 = !{!443, !444, !445, !446, !450, !451, !452, !453, !454, !455}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !441, file: !17, line: 50, baseType: !104, size: 32, align: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !441, file: !17, line: 51, baseType: !104, size: 32, align: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !441, file: !17, line: 52, baseType: !104, size: 32, align: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !441, file: !17, line: 53, baseType: !447, size: 1024, align: 32, offset: 96)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1024, align: 32, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !441, file: !17, line: 54, baseType: !447, size: 1024, align: 32, offset: 1120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !441, file: !17, line: 55, baseType: !447, size: 1024, align: 32, offset: 2144)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !441, file: !17, line: 56, baseType: !104, size: 32, align: 32, offset: 3168)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !441, file: !17, line: 57, baseType: !104, size: 32, align: 32, offset: 3200)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !441, file: !17, line: 58, baseType: !104, size: 32, align: 32, offset: 3232)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !441, file: !17, line: 59, baseType: !104, size: 32, align: 32, offset: 3264)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !416, file: !17, line: 87, baseType: !307, size: 32, align: 32, offset: 3968)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !416, file: !17, line: 88, baseType: !440, size: 3296, align: 32, offset: 4000)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !416, file: !17, line: 90, baseType: !307, size: 32, align: 32, offset: 7296)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !416, file: !17, line: 91, baseType: !307, size: 32, align: 32, offset: 7328)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !416, file: !17, line: 92, baseType: !307, size: 32, align: 32, offset: 7360)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !416, file: !17, line: 93, baseType: !104, size: 32, align: 32, offset: 7392)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !416, file: !17, line: 94, baseType: !104, size: 32, align: 32, offset: 7424)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !416, file: !17, line: 95, baseType: !104, size: 32, align: 32, offset: 7456)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !416, file: !17, line: 96, baseType: !104, size: 32, align: 32, offset: 7488)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !416, file: !17, line: 97, baseType: !104, size: 32, align: 32, offset: 7520)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !416, file: !17, line: 98, baseType: !104, size: 32, align: 32, offset: 7552)
!467 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !24, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!468 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !24, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!469 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !470, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!471 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !470, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!472 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !473, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!474 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !24, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!475 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !24, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!476 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !24, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!477 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !24, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!478 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!479 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!480 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!481 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!482 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!483 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!484 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!485 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!486 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !487, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!491 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !488, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!492 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !493, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!494 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !493, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!495 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !24, isLocal: false, isDefinition: true, variable: i32* @intras)
!496 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !24, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!497 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !24, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!498 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !24, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!499 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !24, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!500 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !24, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!501 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !24, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!502 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !24, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!503 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !504, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 2400, align: 8, elements: !506)
!505 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!506 = !{!507}
!507 = !DISubrange(count: 300)
!508 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 32, elements: !510)
!510 = !{!511, !511}
!511 = !DISubrange(count: 16)
!512 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!513 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!514 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!515 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!516 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!517 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !518, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24576, align: 32, elements: !519)
!519 = !{!236, !511, !511}
!520 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1024, align: 32, elements: !522)
!522 = !{!241, !254, !254}
!523 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!524 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!525 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!526 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !527, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 32, elements: !528)
!528 = !{!254, !254}
!529 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !530, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 32, elements: !531)
!531 = !{!511}
!532 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !65, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!533 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !534, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !548, !549, !550, !551, !552, !557, !558, !562, !563, !564, !565, !567, !568, !569, !570, !571, !572, !573}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !536, file: !4, line: 1147, baseType: !25, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !536, file: !4, line: 1149, baseType: !509, size: 8192, align: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !536, file: !4, line: 1150, baseType: !509, size: 8192, align: 32, offset: 8256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !536, file: !4, line: 1150, baseType: !509, size: 8192, align: 32, offset: 16448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !536, file: !4, line: 1151, baseType: !473, size: 64, align: 64, offset: 24640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !536, file: !4, line: 1152, baseType: !470, size: 64, align: 64, offset: 24704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !536, file: !4, line: 1153, baseType: !24, size: 32, align: 32, offset: 24768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !536, file: !4, line: 1155, baseType: !24, size: 32, align: 32, offset: 24800)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !536, file: !4, line: 1157, baseType: !547, size: 128, align: 32, offset: 24832)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, align: 32, elements: !253)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !536, file: !4, line: 1157, baseType: !547, size: 128, align: 32, offset: 24960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !536, file: !4, line: 1158, baseType: !328, size: 64, align: 64, offset: 25088)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !536, file: !4, line: 1159, baseType: !530, size: 512, align: 32, offset: 25152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !536, file: !4, line: 1160, baseType: !24, size: 32, align: 32, offset: 25664)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !536, file: !4, line: 1161, baseType: !553, size: 64, align: 64, offset: 25728)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !555, line: 30, baseType: !556)
!555 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!556 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !536, file: !4, line: 1162, baseType: !24, size: 32, align: 32, offset: 25792)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !536, file: !4, line: 1163, baseType: !559, size: 64, align: 64, offset: 25856)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !536, file: !4, line: 1164, baseType: !559, size: 64, align: 64, offset: 25920)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !536, file: !4, line: 1165, baseType: !559, size: 64, align: 64, offset: 25984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !536, file: !4, line: 1166, baseType: !559, size: 64, align: 64, offset: 26048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !536, file: !4, line: 1167, baseType: !566, size: 512, align: 16, offset: 26112)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 512, align: 16, elements: !522)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !536, file: !4, line: 1168, baseType: !24, size: 32, align: 32, offset: 26624)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !536, file: !4, line: 1169, baseType: !24, size: 32, align: 32, offset: 26656)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !536, file: !4, line: 1171, baseType: !24, size: 32, align: 32, offset: 26688)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !536, file: !4, line: 1172, baseType: !24, size: 32, align: 32, offset: 26720)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !536, file: !4, line: 1174, baseType: !24, size: 32, align: 32, offset: 26752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !536, file: !4, line: 1175, baseType: !24, size: 32, align: 32, offset: 26784)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !536, file: !4, line: 1176, baseType: !24, size: 32, align: 32, offset: 26816)
!574 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !535, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!575 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !535, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!576 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !535, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!577 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !535, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!578 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !579, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !581, line: 153, baseType: !582)
!581 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !581, line: 122, size: 1216, align: 64, elements: !583)
!583 = !{!584, !586, !587, !588, !589, !590, !595, !596, !597, !601, !606, !614, !620, !621, !624, !625, !627, !631, !632, !633}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !582, file: !581, line: 123, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !582, file: !581, line: 124, baseType: !24, size: 32, align: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !582, file: !581, line: 125, baseType: !24, size: 32, align: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !582, file: !581, line: 126, baseType: !490, size: 16, align: 16, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !582, file: !581, line: 127, baseType: !490, size: 16, align: 16, offset: 144)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !582, file: !581, line: 128, baseType: !591, size: 128, align: 64, offset: 192)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !581, line: 88, size: 128, align: 64, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !591, file: !581, line: 89, baseType: !585, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !591, file: !581, line: 90, baseType: !24, size: 32, align: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !582, file: !581, line: 129, baseType: !24, size: 32, align: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !582, file: !581, line: 132, baseType: !22, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !582, file: !581, line: 133, baseType: !598, size: 64, align: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!24, !22}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !582, file: !581, line: 134, baseType: !602, size: 64, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!24, !22, !605, !24}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !582, file: !581, line: 135, baseType: !607, size: 64, align: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !22, !610, !24}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !581, line: 77, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !612, line: 71, baseType: !613)
!612 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !119, line: 46, baseType: !556)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !582, file: !581, line: 136, baseType: !615, size: 64, align: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!24, !22, !618, !24}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !582, file: !581, line: 139, baseType: !591, size: 128, align: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !582, file: !581, line: 140, baseType: !622, size: 64, align: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !581, line: 94, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !582, file: !581, line: 141, baseType: !24, size: 32, align: 32, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !582, file: !581, line: 144, baseType: !626, size: 24, align: 8, offset: 928)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 24, align: 8, elements: !258)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !582, file: !581, line: 145, baseType: !628, size: 8, align: 8, offset: 952)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 8, align: 8, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 1)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !582, file: !581, line: 148, baseType: !591, size: 128, align: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !582, file: !581, line: 151, baseType: !24, size: 32, align: 32, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !582, file: !581, line: 152, baseType: !610, size: 64, align: 64, offset: 1152)
!634 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !579, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!635 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !579, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!636 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !24, isLocal: false, isDefinition: true, variable: i32* @p_in)
!637 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !24, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!638 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !639, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 640, align: 32, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 20)
!642 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !639, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!643 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !639, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!644 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !639, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!645 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !639, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!646 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !639, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!647 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !24, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!648 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !24, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!649 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !24, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!650 = !{i32 2, !"Dwarf Version", i32 2}
!651 = !{i32 2, !"Debug Info Version", i32 700000003}
!652 = !{i32 1, !"PIC Level", i32 2}
!653 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!654 = !DILocation(line: 35, column: 15, scope: !38)
!655 = !{!656, !656, i64 0}
!656 = !{!"any pointer", !657, i64 0}
!657 = !{!"omnipotent char", !658, i64 0}
!658 = !{!"Simple C/C++ TBAA"}
!659 = !DILocation(line: 35, column: 22, scope: !38)
!660 = !{!661, !662, i64 1236}
