; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/fast_me.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }

!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !111, file: !1, line: 343, type: !32)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !111, file: !1, line: 344, type: !32)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !111, file: !1, line: 345, type: !32)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x", arg: 7, scope: !111, file: !1, line: 346, type: !114)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y", arg: 8, scope: !111, file: !1, line: 347, type: !114)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 9, scope: !111, file: !1, line: 348, type: !115)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 10, scope: !111, file: !1, line: 349, type: !115)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_range", arg: 11, scope: !111, file: !1, line: 350, type: !32)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 12, scope: !111, file: !1, line: 351, type: !32)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 13, scope: !111, file: !1, line: 352, type: !34)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !111, file: !1, line: 361, type: !32)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_x", scope: !111, file: !1, line: 361, type: !32)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_y", scope: !111, file: !1, line: 361, type: !32)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !111, file: !1, line: 361, type: !32)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_ref_line", scope: !111, file: !1, line: 362, type: !92)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !111, file: !1, line: 363, type: !32)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !111, file: !1, line: 364, type: !89)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !111, file: !1, line: 365, type: !32)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mvshift", scope: !111, file: !1, line: 366, type: !32)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_y", scope: !111, file: !1, line: 367, type: !32)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x", scope: !111, file: !1, line: 368, type: !32)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x4", scope: !111, file: !1, line: 369, type: !32)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_x", scope: !111, file: !1, line: 370, type: !32)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_y", scope: !111, file: !1, line: 371, type: !32)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "center_x", scope: !111, file: !1, line: 372, type: !32)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "center_y", scope: !111, file: !1, line: 373, type: !32)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_x", scope: !111, file: !1, line: 374, type: !32)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_y", scope: !111, file: !1, line: 374, type: !32)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_step", scope: !111, file: !1, line: 375, type: !32)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iYMinNow", scope: !111, file: !1, line: 375, type: !32)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iXMinNow", scope: !111, file: !1, line: 375, type: !32)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !111, file: !1, line: 376, type: !32)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !111, file: !1, line: 376, type: !32)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iSADLayer", scope: !111, file: !1, line: 376, type: !32)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iAbort", scope: !111, file: !1, line: 377, type: !32)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N_Bframe", scope: !111, file: !1, line: 378, type: !32)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "betaSec", scope: !111, file: !1, line: 379, type: !157)
!157 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "betaThird", scope: !111, file: !1, line: 379, type: !157)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "height", scope: !111, file: !1, line: 380, type: !32)
!160 = !DISubprogram(name: "AddUpSADQuarter", scope: !1, file: !1, line: 648, type: !161, isLocal: false, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32, i32, i32, %struct.storable_picture*, i16**, i32, i32, i32)* @AddUpSADQuarter, variables: !239)
!161 = !DISubroutineType(types: !162)
!162 = !{!32, !32, !32, !32, !32, !32, !32, !163, !91, !32, !32, !32}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !165, line: 82, baseType: !166)
!165 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !165, line: 21, size: 52672, align: 64, elements: !167)
!167 = !{!168, !170, !171, !172, !173, !174, !175, !184, !185, !186, !187, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !210, !215, !218, !222, !223, !225, !227, !228, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !166, file: !165, line: 23, baseType: !169, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !4, line: 190, baseType: !16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !166, file: !165, line: 25, baseType: !32, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !166, file: !165, line: 26, baseType: !32, size: 32, align: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !166, file: !165, line: 27, baseType: !32, size: 32, align: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !166, file: !165, line: 28, baseType: !32, size: 32, align: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !166, file: !165, line: 29, baseType: !32, size: 32, align: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !166, file: !165, line: 30, baseType: !176, size: 12672, align: 64, offset: 192)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 12672, align: 64, elements: !181)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !179, line: 30, baseType: !180)
!179 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!180 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!181 = !{!182, !183}
!182 = !DISubrange(count: 6)
!183 = !DISubrange(count: 33)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !166, file: !165, line: 31, baseType: !176, size: 12672, align: 64, offset: 12864)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !166, file: !165, line: 32, baseType: !176, size: 12672, align: 64, offset: 25536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !166, file: !165, line: 33, baseType: !176, size: 12672, align: 64, offset: 38208)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !166, file: !165, line: 34, baseType: !188, size: 32, align: 32, offset: 50880)
!188 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !166, file: !165, line: 35, baseType: !32, size: 32, align: 32, offset: 50912)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !166, file: !165, line: 36, baseType: !32, size: 32, align: 32, offset: 50944)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !166, file: !165, line: 37, baseType: !32, size: 32, align: 32, offset: 50976)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !166, file: !165, line: 39, baseType: !32, size: 32, align: 32, offset: 51008)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !166, file: !165, line: 40, baseType: !32, size: 32, align: 32, offset: 51040)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !166, file: !165, line: 41, baseType: !32, size: 32, align: 32, offset: 51072)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !166, file: !165, line: 42, baseType: !32, size: 32, align: 32, offset: 51104)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !166, file: !165, line: 44, baseType: !32, size: 32, align: 32, offset: 51136)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !166, file: !165, line: 44, baseType: !32, size: 32, align: 32, offset: 51168)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !166, file: !165, line: 44, baseType: !32, size: 32, align: 32, offset: 51200)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !166, file: !165, line: 44, baseType: !32, size: 32, align: 32, offset: 51232)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !166, file: !165, line: 45, baseType: !32, size: 32, align: 32, offset: 51264)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !166, file: !165, line: 46, baseType: !32, size: 32, align: 32, offset: 51296)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !166, file: !165, line: 47, baseType: !32, size: 32, align: 32, offset: 51328)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !166, file: !165, line: 49, baseType: !91, size: 64, align: 64, offset: 51392)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !166, file: !165, line: 50, baseType: !89, size: 64, align: 64, offset: 51456)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !166, file: !165, line: 51, baseType: !89, size: 64, align: 64, offset: 51520)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !166, file: !165, line: 52, baseType: !91, size: 64, align: 64, offset: 51584)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !166, file: !165, line: 53, baseType: !91, size: 64, align: 64, offset: 51648)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !166, file: !165, line: 54, baseType: !209, size: 64, align: 64, offset: 51712)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !166, file: !165, line: 56, baseType: !211, size: 64, align: 64, offset: 51776)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !213, line: 30, baseType: !214)
!213 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!214 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !166, file: !165, line: 58, baseType: !216, size: 64, align: 64, offset: 51840)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !166, file: !165, line: 60, baseType: !219, size: 64, align: 64, offset: 51904)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !166, file: !165, line: 63, baseType: !219, size: 64, align: 64, offset: 51968)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !166, file: !165, line: 66, baseType: !224, size: 64, align: 64, offset: 52032)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !166, file: !165, line: 68, baseType: !226, size: 64, align: 64, offset: 52096)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !166, file: !165, line: 69, baseType: !226, size: 64, align: 64, offset: 52160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !166, file: !165, line: 71, baseType: !229, size: 64, align: 64, offset: 52224)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !166, file: !165, line: 72, baseType: !229, size: 64, align: 64, offset: 52288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !166, file: !165, line: 73, baseType: !229, size: 64, align: 64, offset: 52352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !166, file: !165, line: 75, baseType: !32, size: 32, align: 32, offset: 52416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !166, file: !165, line: 76, baseType: !32, size: 32, align: 32, offset: 52448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !166, file: !165, line: 77, baseType: !32, size: 32, align: 32, offset: 52480)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !166, file: !165, line: 78, baseType: !32, size: 32, align: 32, offset: 52512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !166, file: !165, line: 79, baseType: !32, size: 32, align: 32, offset: 52544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !166, file: !165, line: 80, baseType: !32, size: 32, align: 32, offset: 52576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !166, file: !165, line: 81, baseType: !32, size: 32, align: 32, offset: 52608)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !262, !263, !264, !265, !266, !267, !270, !271, !272}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 1, scope: !160, file: !1, line: 648, type: !32)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 2, scope: !160, file: !1, line: 648, type: !32)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocksize_x", arg: 3, scope: !160, file: !1, line: 648, type: !32)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocksize_y", arg: 4, scope: !160, file: !1, line: 648, type: !32)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cand_mv_x", arg: 5, scope: !160, file: !1, line: 649, type: !32)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cand_mv_y", arg: 6, scope: !160, file: !1, line: 649, type: !32)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref_picture", arg: 7, scope: !160, file: !1, line: 649, type: !163)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 8, scope: !160, file: !1, line: 649, type: !91)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Mvmcost", arg: 9, scope: !160, file: !1, line: 650, type: !32)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 10, scope: !160, file: !1, line: 650, type: !32)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "useABT", arg: 11, scope: !160, file: !1, line: 650, type: !32)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abort_search", scope: !160, file: !1, line: 652, type: !32)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y0", scope: !160, file: !1, line: 652, type: !32)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !160, file: !1, line: 652, type: !32)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rx0", scope: !160, file: !1, line: 652, type: !32)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry0", scope: !160, file: !1, line: 652, type: !32)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry", scope: !160, file: !1, line: 652, type: !32)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_line", scope: !160, file: !1, line: 653, type: !89)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !160, file: !1, line: 654, type: !259)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, align: 32, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 16)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !160, file: !1, line: 654, type: !31)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !160, file: !1, line: 655, type: !32)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yy", scope: !160, file: !1, line: 656, type: !32)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kk", scope: !160, file: !1, line: 656, type: !32)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xx", scope: !160, file: !1, line: 656, type: !32)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_diff", scope: !160, file: !1, line: 657, type: !268)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, align: 32, elements: !269)
!269 = !{!261, !261}
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !160, file: !1, line: 659, type: !91)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !160, file: !1, line: 660, type: !32)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !160, file: !1, line: 661, type: !32)
!273 = !DISubprogram(name: "FastSubPelBlockMotionSearch", scope: !1, file: !1, line: 719, type: !274, isLocal: false, isDefinition: true, scopeLine: 734, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16**, i16, i32, i32, i32, i32, i16, i16, i16*, i16*, i32, i32, i32, double, i32)* @FastSubPelBlockMotionSearch, variables: !276)
!274 = !DISubroutineType(types: !275)
!275 = !{!32, !91, !114, !32, !32, !32, !32, !114, !114, !115, !115, !32, !32, !32, !34, !32}
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 1, scope: !273, file: !1, line: 719, type: !91)
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 2, scope: !273, file: !1, line: 720, type: !114)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !273, file: !1, line: 721, type: !32)
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !273, file: !1, line: 722, type: !32)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !273, file: !1, line: 723, type: !32)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !273, file: !1, line: 724, type: !32)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x", arg: 7, scope: !273, file: !1, line: 725, type: !114)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y", arg: 8, scope: !273, file: !1, line: 726, type: !114)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 9, scope: !273, file: !1, line: 727, type: !115)
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 10, scope: !273, file: !1, line: 728, type: !115)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_pos2", arg: 11, scope: !273, file: !1, line: 729, type: !32)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_pos4", arg: 12, scope: !273, file: !1, line: 730, type: !32)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 13, scope: !273, file: !1, line: 731, type: !32)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 14, scope: !273, file: !1, line: 732, type: !34)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "useABT", arg: 15, scope: !273, file: !1, line: 733, type: !32)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !273, file: !1, line: 737, type: !32)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_mv_x", scope: !273, file: !1, line: 738, type: !32)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_mv_y", scope: !273, file: !1, line: 738, type: !32)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !273, file: !1, line: 740, type: !32)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_picture", scope: !273, file: !1, line: 741, type: !163)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !273, file: !1, line: 743, type: !32)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_shift", scope: !273, file: !1, line: 744, type: !32)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x", scope: !273, file: !1, line: 745, type: !32)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_y", scope: !273, file: !1, line: 746, type: !32)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic4_pix_x", scope: !273, file: !1, line: 747, type: !32)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic4_pix_y", scope: !273, file: !1, line: 748, type: !32)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos_x4", scope: !273, file: !1, line: 749, type: !32)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos_y4", scope: !273, file: !1, line: 750, type: !32)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_range_dynamic", scope: !273, file: !1, line: 752, type: !32)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iXMinNow", scope: !273, file: !1, line: 752, type: !32)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iYMinNow", scope: !273, file: !1, line: 752, type: !32)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !273, file: !1, line: 752, type: !32)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iSADLayer", scope: !273, file: !1, line: 753, type: !32)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !273, file: !1, line: 753, type: !32)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currmv_x", scope: !273, file: !1, line: 753, type: !32)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currmv_y", scope: !273, file: !1, line: 753, type: !32)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iCurrSearchRange", scope: !273, file: !1, line: 753, type: !32)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_frac_mv_x", scope: !273, file: !1, line: 754, type: !32)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_frac_mv_y", scope: !273, file: !1, line: 754, type: !32)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abort_search", scope: !273, file: !1, line: 754, type: !32)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_cost", scope: !273, file: !1, line: 755, type: !32)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_frac_up_mv_x", scope: !273, file: !1, line: 757, type: !32)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_frac_up_mv_y", scope: !273, file: !1, line: 757, type: !32)
!320 = !DISubprogram(name: "decide_intrabk_SAD", scope: !1, file: !1, line: 873, type: !37, isLocal: false, isDefinition: true, scopeLine: 874, isOptimized: true, function: void ()* @decide_intrabk_SAD, variables: !39)
!321 = !DISubprogram(name: "skip_intrabk_SAD", scope: !1, file: !1, line: 897, type: !322, isLocal: false, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @skip_intrabk_SAD, variables: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !32, !32}
!324 = !{!325, !326, !327, !328, !329, !330}
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "best_mode", arg: 1, scope: !321, file: !1, line: 897, type: !32)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref_max", arg: 2, scope: !321, file: !1, line: 897, type: !32)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !321, file: !1, line: 899, type: !32)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !321, file: !1, line: 899, type: !32)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !321, file: !1, line: 899, type: !32)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !321, file: !1, line: 899, type: !32)
!331 = !{!332, !336, !337, !340, !341, !342, !343, !344, !345, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !580, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !709, !710, !711, !712, !713, !714, !715, !718, !721, !722, !723, !724, !727, !728, !739, !774, !775, !776, !777, !778, !835, !836, !837, !838, !839, !843, !844, !845, !846, !847, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !860, !862, !863, !864, !865, !867, !868, !869, !870, !871, !872, !873, !877}
!332 = !DIGlobalVariable(name: "Diamond_x", scope: !111, file: !1, line: 354, type: !333, isLocal: true, isDefinition: true, variable: [4 x i32]* @FastSubPelBlockMotionSearch.Diamond_x)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, align: 32, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 4)
!336 = !DIGlobalVariable(name: "Diamond_y", scope: !111, file: !1, line: 355, type: !333, isLocal: true, isDefinition: true, variable: [4 x i32]* @FastSubPelBlockMotionSearch.Diamond_y)
!337 = !DIGlobalVariable(name: "Hexagon_x", scope: !111, file: !1, line: 356, type: !338, isLocal: true, isDefinition: true, variable: [6 x i32]* @FastIntegerPelBlockMotionSearch.Hexagon_x)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, align: 32, elements: !339)
!339 = !{!182}
!340 = !DIGlobalVariable(name: "Hexagon_y", scope: !111, file: !1, line: 357, type: !338, isLocal: true, isDefinition: true, variable: [6 x i32]* @FastIntegerPelBlockMotionSearch.Hexagon_y)
!341 = !DIGlobalVariable(name: "Big_Hexagon_x", scope: !111, file: !1, line: 358, type: !259, isLocal: true, isDefinition: true, variable: [16 x i32]* @FastIntegerPelBlockMotionSearch.Big_Hexagon_x)
!342 = !DIGlobalVariable(name: "Big_Hexagon_y", scope: !111, file: !1, line: 359, type: !259, isLocal: true, isDefinition: true, variable: [16 x i32]* @FastIntegerPelBlockMotionSearch.Big_Hexagon_y)
!343 = !DIGlobalVariable(name: "Diamond_x", scope: !273, file: !1, line: 735, type: !333, isLocal: true, isDefinition: true, variable: [4 x i32]* @FastSubPelBlockMotionSearch.Diamond_x)
!344 = !DIGlobalVariable(name: "Diamond_y", scope: !273, file: !1, line: 736, type: !333, isLocal: true, isDefinition: true, variable: [4 x i32]* @FastSubPelBlockMotionSearch.Diamond_y)
!345 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !346, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !349)
!349 = !{!350, !351, !352, !526, !527, !528, !529}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !348, file: !4, line: 477, baseType: !32, size: 32, align: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !348, file: !4, line: 478, baseType: !32, size: 32, align: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !348, file: !4, line: 479, baseType: !353, size: 6400, align: 64, offset: 64)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 6400, align: 64, elements: !524)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !356)
!356 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !437, !472, !499, !508, !509, !510, !511, !512, !513, !514, !515, !516, !521}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !356, file: !4, line: 445, baseType: !32, size: 32, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !356, file: !4, line: 446, baseType: !32, size: 32, align: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !356, file: !4, line: 447, baseType: !32, size: 32, align: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !356, file: !4, line: 448, baseType: !32, size: 32, align: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !356, file: !4, line: 449, baseType: !32, size: 32, align: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !356, file: !4, line: 450, baseType: !32, size: 32, align: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !356, file: !4, line: 451, baseType: !365, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !367)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !368)
!368 = !{!369, !385, !409}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !367, file: !4, line: 433, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !372, file: !4, line: 413, baseType: !32, size: 32, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !372, file: !4, line: 414, baseType: !32, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !372, file: !4, line: 415, baseType: !212, size: 8, align: 8, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !372, file: !4, line: 416, baseType: !32, size: 32, align: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !372, file: !4, line: 417, baseType: !32, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !372, file: !4, line: 418, baseType: !212, size: 8, align: 8, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !372, file: !4, line: 420, baseType: !212, size: 8, align: 8, offset: 168)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !372, file: !4, line: 421, baseType: !32, size: 32, align: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !372, file: !4, line: 422, baseType: !32, size: 32, align: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !372, file: !4, line: 424, baseType: !211, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !372, file: !4, line: 425, baseType: !32, size: 32, align: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !367, file: !4, line: 434, baseType: !386, size: 832, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !387, file: !4, line: 209, baseType: !188, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !387, file: !4, line: 209, baseType: !188, size: 32, align: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !387, file: !4, line: 210, baseType: !188, size: 32, align: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !387, file: !4, line: 211, baseType: !188, size: 32, align: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !387, file: !4, line: 212, baseType: !188, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !387, file: !4, line: 213, baseType: !211, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !387, file: !4, line: 214, baseType: !31, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !387, file: !4, line: 217, baseType: !188, size: 32, align: 32, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !387, file: !4, line: 217, baseType: !188, size: 32, align: 32, offset: 352)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !387, file: !4, line: 218, baseType: !188, size: 32, align: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !387, file: !4, line: 219, baseType: !188, size: 32, align: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !387, file: !4, line: 220, baseType: !188, size: 32, align: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !387, file: !4, line: 221, baseType: !211, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !387, file: !4, line: 222, baseType: !31, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !387, file: !4, line: 223, baseType: !32, size: 32, align: 32, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !387, file: !4, line: 223, baseType: !32, size: 32, align: 32, offset: 672)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !387, file: !4, line: 224, baseType: !32, size: 32, align: 32, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !387, file: !4, line: 224, baseType: !32, size: 32, align: 32, offset: 736)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !387, file: !4, line: 225, baseType: !32, size: 32, align: 32, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !387, file: !4, line: 225, baseType: !32, size: 32, align: 32, offset: 800)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !367, file: !4, line: 436, baseType: !410, size: 64, align: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!32, !413, !436}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !415)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !429}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !4, line: 329, baseType: !32, size: 32, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !415, file: !4, line: 330, baseType: !32, size: 32, align: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !415, file: !4, line: 331, baseType: !32, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !415, file: !4, line: 332, baseType: !32, size: 32, align: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !415, file: !4, line: 333, baseType: !32, size: 32, align: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !415, file: !4, line: 334, baseType: !188, size: 32, align: 32, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !415, file: !4, line: 335, baseType: !32, size: 32, align: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !415, file: !4, line: 336, baseType: !32, size: 32, align: 32, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !415, file: !4, line: 344, baseType: !426, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !32, !32, !31, !31}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !415, file: !4, line: 346, baseType: !430, size: 64, align: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !433, !434}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !356, file: !4, line: 452, baseType: !438, size: 64, align: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !441)
!441 = !{!442, !454, !459, !463, !466, !468, !469}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !440, file: !4, line: 260, baseType: !443, size: 4224, align: 64)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 4224, align: 64, elements: !451)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !445, file: !4, line: 233, baseType: !90, size: 16, align: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !445, file: !4, line: 234, baseType: !214, size: 8, align: 8, offset: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !445, file: !4, line: 236, baseType: !450, size: 64, align: 64, offset: 64)
!450 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!451 = !{!452, !453}
!452 = !DISubrange(count: 3)
!453 = !DISubrange(count: 11)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !440, file: !4, line: 261, baseType: !455, size: 2304, align: 64, offset: 4224)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 2304, align: 64, elements: !456)
!456 = !{!457, !458}
!457 = !DISubrange(count: 2)
!458 = !DISubrange(count: 9)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !440, file: !4, line: 262, baseType: !460, size: 2560, align: 64, offset: 6528)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 2560, align: 64, elements: !461)
!461 = !{!457, !462}
!462 = !DISubrange(count: 10)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !440, file: !4, line: 263, baseType: !464, size: 1536, align: 64, offset: 9088)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1536, align: 64, elements: !465)
!465 = !{!457, !182}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !440, file: !4, line: 264, baseType: !467, size: 512, align: 64, offset: 10624)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 512, align: 64, elements: !334)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !440, file: !4, line: 265, baseType: !467, size: 512, align: 64, offset: 11136)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !440, file: !4, line: 266, baseType: !470, size: 384, align: 64, offset: 11648)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 384, align: 64, elements: !471)
!471 = !{!452}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !356, file: !4, line: 453, baseType: !473, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !476)
!476 = !{!477, !480, !481, !484, !487, !491, !492, !496, !497, !498}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !475, file: !4, line: 283, baseType: !478, size: 256, align: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 256, align: 64, elements: !479)
!479 = !{!457}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !475, file: !4, line: 284, baseType: !467, size: 512, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !475, file: !4, line: 285, baseType: !482, size: 1536, align: 64, offset: 768)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1536, align: 64, elements: !483)
!483 = !{!452, !335}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !475, file: !4, line: 286, baseType: !485, size: 5120, align: 64, offset: 2304)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 5120, align: 64, elements: !486)
!486 = !{!462, !335}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !475, file: !4, line: 287, baseType: !488, size: 19200, align: 64, offset: 7424)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 19200, align: 64, elements: !489)
!489 = !{!462, !490}
!490 = !DISubrange(count: 15)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !475, file: !4, line: 288, baseType: !488, size: 19200, align: 64, offset: 26624)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !475, file: !4, line: 289, baseType: !493, size: 6400, align: 64, offset: 45824)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 6400, align: 64, elements: !494)
!494 = !{!462, !495}
!495 = !DISubrange(count: 5)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !475, file: !4, line: 290, baseType: !493, size: 6400, align: 64, offset: 52224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !475, file: !4, line: 291, baseType: !488, size: 19200, align: 64, offset: 58624)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !475, file: !4, line: 292, baseType: !488, size: 19200, align: 64, offset: 77824)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !356, file: !4, line: 456, baseType: !500, size: 64, align: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !502)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !502, file: !4, line: 310, baseType: !32, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !502, file: !4, line: 311, baseType: !32, size: 32, align: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !502, file: !4, line: 312, baseType: !507, size: 64, align: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !356, file: !4, line: 458, baseType: !32, size: 32, align: 32, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !356, file: !4, line: 459, baseType: !31, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !356, file: !4, line: 460, baseType: !31, size: 64, align: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !356, file: !4, line: 461, baseType: !31, size: 64, align: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !356, file: !4, line: 462, baseType: !32, size: 32, align: 32, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !356, file: !4, line: 463, baseType: !31, size: 64, align: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !356, file: !4, line: 464, baseType: !31, size: 64, align: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !356, file: !4, line: 465, baseType: !31, size: 64, align: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !356, file: !4, line: 467, baseType: !517, size: 64, align: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !32}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !22, line: 45, baseType: !21)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !356, file: !4, line: 469, baseType: !522, size: 192, align: 32, offset: 1024)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, align: 32, elements: !523)
!523 = !{!452, !457}
!524 = !{!525}
!525 = !DISubrange(count: 100)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !348, file: !4, line: 480, baseType: !32, size: 32, align: 32, offset: 6464)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !348, file: !4, line: 481, baseType: !157, size: 32, align: 32, offset: 6496)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !348, file: !4, line: 482, baseType: !157, size: 32, align: 32, offset: 6528)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !348, file: !4, line: 483, baseType: !157, size: 32, align: 32, offset: 6560)
!530 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !346, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!531 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !346, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!532 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !346, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!533 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !346, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!534 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !91, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!535 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !209, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!536 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !30, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!537 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !188, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!538 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !188, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!539 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !32, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!540 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !32, isLocal: false, isDefinition: true, variable: i32* @me_time)
!541 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !542, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !22, line: 145, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 103, size: 1920, align: 64, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !556, !557, !558, !559, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !544, file: !22, line: 105, baseType: !520, size: 32, align: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !544, file: !22, line: 106, baseType: !188, size: 32, align: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !544, file: !22, line: 107, baseType: !188, size: 32, align: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !544, file: !22, line: 108, baseType: !520, size: 32, align: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !544, file: !22, line: 110, baseType: !520, size: 32, align: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !544, file: !22, line: 111, baseType: !520, size: 32, align: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !544, file: !22, line: 112, baseType: !553, size: 256, align: 32, offset: 192)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, align: 32, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !544, file: !22, line: 115, baseType: !520, size: 32, align: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !544, file: !22, line: 116, baseType: !188, size: 32, align: 32, offset: 480)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !544, file: !22, line: 117, baseType: !188, size: 32, align: 32, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !544, file: !22, line: 119, baseType: !560, size: 256, align: 32, offset: 544)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 256, align: 32, elements: !554)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !544, file: !22, line: 121, baseType: !560, size: 256, align: 32, offset: 800)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !544, file: !22, line: 122, baseType: !560, size: 256, align: 32, offset: 1056)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !544, file: !22, line: 124, baseType: !520, size: 32, align: 32, offset: 1312)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !544, file: !22, line: 125, baseType: !188, size: 32, align: 32, offset: 1344)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !544, file: !22, line: 127, baseType: !188, size: 32, align: 32, offset: 1376)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !544, file: !22, line: 128, baseType: !211, size: 64, align: 64, offset: 1408)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !544, file: !22, line: 130, baseType: !32, size: 32, align: 32, offset: 1472)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !544, file: !22, line: 131, baseType: !32, size: 32, align: 32, offset: 1504)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !544, file: !22, line: 132, baseType: !520, size: 32, align: 32, offset: 1536)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !544, file: !22, line: 133, baseType: !188, size: 32, align: 32, offset: 1568)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !544, file: !22, line: 134, baseType: !32, size: 32, align: 32, offset: 1600)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !544, file: !22, line: 135, baseType: !32, size: 32, align: 32, offset: 1632)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !544, file: !22, line: 136, baseType: !32, size: 32, align: 32, offset: 1664)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !544, file: !22, line: 138, baseType: !32, size: 32, align: 32, offset: 1696)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !544, file: !22, line: 139, baseType: !32, size: 32, align: 32, offset: 1728)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !544, file: !22, line: 141, baseType: !520, size: 32, align: 32, offset: 1760)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !544, file: !22, line: 142, baseType: !520, size: 32, align: 32, offset: 1792)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !544, file: !22, line: 143, baseType: !520, size: 32, align: 32, offset: 1824)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !544, file: !22, line: 144, baseType: !520, size: 32, align: 32, offset: 1856)
!580 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !581, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !22, line: 193, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 149, size: 17056, align: 32, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !583, file: !22, line: 151, baseType: !520, size: 32, align: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !583, file: !22, line: 153, baseType: !188, size: 32, align: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !583, file: !22, line: 154, baseType: !520, size: 32, align: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !583, file: !22, line: 155, baseType: !520, size: 32, align: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !583, file: !22, line: 156, baseType: !520, size: 32, align: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !583, file: !22, line: 157, baseType: !520, size: 32, align: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !583, file: !22, line: 158, baseType: !188, size: 32, align: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !583, file: !22, line: 159, baseType: !188, size: 32, align: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !583, file: !22, line: 160, baseType: !188, size: 32, align: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !583, file: !22, line: 162, baseType: !520, size: 32, align: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !583, file: !22, line: 163, baseType: !553, size: 256, align: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !583, file: !22, line: 165, baseType: !188, size: 32, align: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !583, file: !22, line: 166, baseType: !188, size: 32, align: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !583, file: !22, line: 167, baseType: !188, size: 32, align: 32, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !583, file: !22, line: 168, baseType: !188, size: 32, align: 32, offset: 672)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !583, file: !22, line: 170, baseType: !188, size: 32, align: 32, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !583, file: !22, line: 172, baseType: !520, size: 32, align: 32, offset: 736)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !583, file: !22, line: 173, baseType: !32, size: 32, align: 32, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !583, file: !22, line: 174, baseType: !32, size: 32, align: 32, offset: 800)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !583, file: !22, line: 175, baseType: !188, size: 32, align: 32, offset: 832)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !583, file: !22, line: 177, baseType: !606, size: 8192, align: 32, offset: 864)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, align: 32, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !583, file: !22, line: 178, baseType: !188, size: 32, align: 32, offset: 9056)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !583, file: !22, line: 179, baseType: !520, size: 32, align: 32, offset: 9088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !583, file: !22, line: 180, baseType: !188, size: 32, align: 32, offset: 9120)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !583, file: !22, line: 181, baseType: !188, size: 32, align: 32, offset: 9152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !583, file: !22, line: 182, baseType: !520, size: 32, align: 32, offset: 9184)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !583, file: !22, line: 184, baseType: !520, size: 32, align: 32, offset: 9216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !583, file: !22, line: 185, baseType: !520, size: 32, align: 32, offset: 9248)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !583, file: !22, line: 186, baseType: !520, size: 32, align: 32, offset: 9280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !583, file: !22, line: 187, baseType: !188, size: 32, align: 32, offset: 9312)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !583, file: !22, line: 188, baseType: !188, size: 32, align: 32, offset: 9344)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !583, file: !22, line: 189, baseType: !188, size: 32, align: 32, offset: 9376)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !583, file: !22, line: 190, baseType: !188, size: 32, align: 32, offset: 9408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !583, file: !22, line: 191, baseType: !520, size: 32, align: 32, offset: 9440)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !583, file: !22, line: 192, baseType: !623, size: 7584, align: 32, offset: 9472)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !22, line: 99, baseType: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 63, size: 7584, align: 32, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !624, file: !22, line: 65, baseType: !520, size: 32, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !624, file: !22, line: 66, baseType: !188, size: 32, align: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !624, file: !22, line: 67, baseType: !188, size: 32, align: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !624, file: !22, line: 68, baseType: !188, size: 32, align: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !624, file: !22, line: 69, baseType: !520, size: 32, align: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !624, file: !22, line: 70, baseType: !520, size: 32, align: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !624, file: !22, line: 71, baseType: !520, size: 32, align: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !624, file: !22, line: 72, baseType: !188, size: 32, align: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !624, file: !22, line: 73, baseType: !520, size: 32, align: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !624, file: !22, line: 74, baseType: !520, size: 32, align: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !624, file: !22, line: 75, baseType: !188, size: 32, align: 32, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !624, file: !22, line: 76, baseType: !188, size: 32, align: 32, offset: 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !624, file: !22, line: 77, baseType: !188, size: 32, align: 32, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !624, file: !22, line: 78, baseType: !520, size: 32, align: 32, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !624, file: !22, line: 79, baseType: !188, size: 32, align: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !624, file: !22, line: 80, baseType: !188, size: 32, align: 32, offset: 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !624, file: !22, line: 81, baseType: !520, size: 32, align: 32, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !624, file: !22, line: 82, baseType: !188, size: 32, align: 32, offset: 544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !624, file: !22, line: 83, baseType: !188, size: 32, align: 32, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !624, file: !22, line: 84, baseType: !520, size: 32, align: 32, offset: 608)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !624, file: !22, line: 85, baseType: !520, size: 32, align: 32, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !624, file: !22, line: 86, baseType: !648, size: 3296, align: 32, offset: 672)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !22, line: 60, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 48, size: 3296, align: 32, elements: !650)
!650 = !{!651, !652, !653, !654, !658, !659, !660, !661, !662, !663}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !649, file: !22, line: 50, baseType: !188, size: 32, align: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !649, file: !22, line: 51, baseType: !188, size: 32, align: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !649, file: !22, line: 52, baseType: !188, size: 32, align: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !649, file: !22, line: 53, baseType: !655, size: 1024, align: 32, offset: 96)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1024, align: 32, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !649, file: !22, line: 54, baseType: !655, size: 1024, align: 32, offset: 1120)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !649, file: !22, line: 55, baseType: !655, size: 1024, align: 32, offset: 2144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !649, file: !22, line: 56, baseType: !188, size: 32, align: 32, offset: 3168)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !649, file: !22, line: 57, baseType: !188, size: 32, align: 32, offset: 3200)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !649, file: !22, line: 58, baseType: !188, size: 32, align: 32, offset: 3232)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !649, file: !22, line: 59, baseType: !188, size: 32, align: 32, offset: 3264)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !624, file: !22, line: 87, baseType: !520, size: 32, align: 32, offset: 3968)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !624, file: !22, line: 88, baseType: !648, size: 3296, align: 32, offset: 4000)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !624, file: !22, line: 90, baseType: !520, size: 32, align: 32, offset: 7296)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !624, file: !22, line: 91, baseType: !520, size: 32, align: 32, offset: 7328)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !624, file: !22, line: 92, baseType: !520, size: 32, align: 32, offset: 7360)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !624, file: !22, line: 93, baseType: !188, size: 32, align: 32, offset: 7392)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !624, file: !22, line: 94, baseType: !188, size: 32, align: 32, offset: 7424)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !624, file: !22, line: 95, baseType: !188, size: 32, align: 32, offset: 7456)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !624, file: !22, line: 96, baseType: !188, size: 32, align: 32, offset: 7488)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !624, file: !22, line: 97, baseType: !188, size: 32, align: 32, offset: 7520)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !624, file: !22, line: 98, baseType: !188, size: 32, align: 32, offset: 7552)
!675 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !32, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!676 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !32, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!677 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !29, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!678 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !29, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!679 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !28, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!680 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !32, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!681 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !32, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!682 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !32, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!683 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !32, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!684 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !91, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!685 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !91, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!686 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !209, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!687 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !209, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!688 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !91, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!689 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !209, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!690 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !91, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!691 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !209, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!692 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !216, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!693 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !217, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!694 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !226, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!695 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !226, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!696 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !32, isLocal: false, isDefinition: true, variable: i32* @intras)
!697 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !32, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!698 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !32, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!699 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !32, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!700 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !32, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!701 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !32, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!702 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !32, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!703 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !32, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!704 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !705, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 2400, align: 8, elements: !707)
!706 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!707 = !{!708}
!708 = !DISubrange(count: 300)
!709 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !268, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!710 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !268, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!711 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !268, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!712 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !268, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!713 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !268, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!714 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !268, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!715 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !716, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 24576, align: 32, elements: !717)
!717 = !{!452, !261, !261}
!718 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, align: 32, elements: !720)
!720 = !{!457, !335, !335}
!721 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!722 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!723 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!724 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !725, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, align: 32, elements: !726)
!726 = !{!335, !335}
!727 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !259, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!728 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !729, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !731)
!731 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !731, file: !4, line: 1184, baseType: !32, size: 32, align: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !731, file: !4, line: 1185, baseType: !32, size: 32, align: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !731, file: !4, line: 1186, baseType: !32, size: 32, align: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !731, file: !4, line: 1187, baseType: !32, size: 32, align: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !731, file: !4, line: 1188, baseType: !32, size: 32, align: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !731, file: !4, line: 1189, baseType: !32, size: 32, align: 32, offset: 160)
!739 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !740, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !742)
!742 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !762, !763, !764, !765, !767, !768, !769, !770, !771, !772, !773}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !742, file: !4, line: 1147, baseType: !34, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !742, file: !4, line: 1149, baseType: !268, size: 8192, align: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !742, file: !4, line: 1150, baseType: !268, size: 8192, align: 32, offset: 8256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !742, file: !4, line: 1150, baseType: !268, size: 8192, align: 32, offset: 16448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !742, file: !4, line: 1151, baseType: !28, size: 64, align: 64, offset: 24640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !742, file: !4, line: 1152, baseType: !29, size: 64, align: 64, offset: 24704)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !742, file: !4, line: 1153, baseType: !32, size: 32, align: 32, offset: 24768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !742, file: !4, line: 1155, baseType: !32, size: 32, align: 32, offset: 24800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !742, file: !4, line: 1157, baseType: !333, size: 128, align: 32, offset: 24832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !742, file: !4, line: 1157, baseType: !333, size: 128, align: 32, offset: 24960)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !742, file: !4, line: 1158, baseType: !30, size: 64, align: 64, offset: 25088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !742, file: !4, line: 1159, baseType: !259, size: 512, align: 32, offset: 25152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !742, file: !4, line: 1160, baseType: !32, size: 32, align: 32, offset: 25664)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !742, file: !4, line: 1161, baseType: !177, size: 64, align: 64, offset: 25728)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !742, file: !4, line: 1162, baseType: !32, size: 32, align: 32, offset: 25792)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !742, file: !4, line: 1163, baseType: !760, size: 64, align: 64, offset: 25856)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !742, file: !4, line: 1164, baseType: !760, size: 64, align: 64, offset: 25920)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !742, file: !4, line: 1165, baseType: !760, size: 64, align: 64, offset: 25984)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !742, file: !4, line: 1166, baseType: !760, size: 64, align: 64, offset: 26048)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !742, file: !4, line: 1167, baseType: !766, size: 512, align: 16, offset: 26112)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 512, align: 16, elements: !720)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !742, file: !4, line: 1168, baseType: !32, size: 32, align: 32, offset: 26624)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !742, file: !4, line: 1169, baseType: !32, size: 32, align: 32, offset: 26656)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !742, file: !4, line: 1171, baseType: !32, size: 32, align: 32, offset: 26688)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !742, file: !4, line: 1172, baseType: !32, size: 32, align: 32, offset: 26720)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !742, file: !4, line: 1174, baseType: !32, size: 32, align: 32, offset: 26752)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !742, file: !4, line: 1175, baseType: !32, size: 32, align: 32, offset: 26784)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !742, file: !4, line: 1176, baseType: !32, size: 32, align: 32, offset: 26816)
!774 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!775 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!776 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!777 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!778 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !779, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !781, line: 153, baseType: !782)
!781 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !781, line: 122, size: 1216, align: 64, elements: !783)
!783 = !{!784, !786, !787, !788, !789, !790, !795, !796, !797, !801, !806, !815, !821, !822, !825, !826, !828, !832, !833, !834}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !782, file: !781, line: 123, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !782, file: !781, line: 124, baseType: !32, size: 32, align: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !782, file: !781, line: 125, baseType: !32, size: 32, align: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !782, file: !781, line: 126, baseType: !114, size: 16, align: 16, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !782, file: !781, line: 127, baseType: !114, size: 16, align: 16, offset: 144)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !782, file: !781, line: 128, baseType: !791, size: 128, align: 64, offset: 192)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !781, line: 88, size: 128, align: 64, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !791, file: !781, line: 89, baseType: !785, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !791, file: !781, line: 90, baseType: !32, size: 32, align: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !782, file: !781, line: 129, baseType: !32, size: 32, align: 32, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !782, file: !781, line: 132, baseType: !33, size: 64, align: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !782, file: !781, line: 133, baseType: !798, size: 64, align: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!32, !33}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !782, file: !781, line: 134, baseType: !802, size: 64, align: 64, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!32, !33, !805, !32}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !782, file: !781, line: 135, baseType: !807, size: 64, align: 64, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !33, !810, !32}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !781, line: 77, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !812, line: 71, baseType: !813)
!812 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !814, line: 46, baseType: !180)
!814 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !782, file: !781, line: 136, baseType: !816, size: 64, align: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64, align: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!32, !33, !819, !32}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !782, file: !781, line: 139, baseType: !791, size: 128, align: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !782, file: !781, line: 140, baseType: !823, size: 64, align: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !781, line: 94, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !782, file: !781, line: 141, baseType: !32, size: 32, align: 32, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !782, file: !781, line: 144, baseType: !827, size: 24, align: 8, offset: 928)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 24, align: 8, elements: !471)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !782, file: !781, line: 145, baseType: !829, size: 8, align: 8, offset: 952)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 8, align: 8, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 1)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !782, file: !781, line: 148, baseType: !791, size: 128, align: 64, offset: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !782, file: !781, line: 151, baseType: !32, size: 32, align: 32, offset: 1088)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !782, file: !781, line: 152, baseType: !810, size: 64, align: 64, offset: 1152)
!835 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !779, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!836 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !779, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!837 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !32, isLocal: false, isDefinition: true, variable: i32* @p_in)
!838 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !32, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!839 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !840, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 640, align: 32, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 20)
!843 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !840, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!844 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !840, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!845 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !840, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!846 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !840, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!847 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !840, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!848 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !32, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!849 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !32, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!850 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !32, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!851 = !DIGlobalVariable(name: "McostState", scope: !0, file: !852, line: 107, type: !30, isLocal: false, isDefinition: true, variable: i32*** @McostState)
!852 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/fast_me.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!853 = !DIGlobalVariable(name: "all_mincost", scope: !0, file: !852, line: 109, type: !27, isLocal: false, isDefinition: true, variable: i32****** @all_mincost)
!854 = !DIGlobalVariable(name: "all_bwmincost", scope: !0, file: !852, line: 110, type: !27, isLocal: false, isDefinition: true, variable: i32****** @all_bwmincost)
!855 = !DIGlobalVariable(name: "pred_SAD_space", scope: !0, file: !852, line: 111, type: !32, isLocal: false, isDefinition: true, variable: i32* @pred_SAD_space)
!856 = !DIGlobalVariable(name: "pred_SAD_time", scope: !0, file: !852, line: 111, type: !32, isLocal: false, isDefinition: true, variable: i32* @pred_SAD_time)
!857 = !DIGlobalVariable(name: "pred_SAD_ref", scope: !0, file: !852, line: 111, type: !32, isLocal: false, isDefinition: true, variable: i32* @pred_SAD_ref)
!858 = !DIGlobalVariable(name: "pred_SAD_uplayer", scope: !0, file: !852, line: 111, type: !32, isLocal: false, isDefinition: true, variable: i32* @pred_SAD_uplayer)
