; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/fmo.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !11, globals: !746, imports: !629)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/fmo.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !{!12, !626, !630, !635, !636, !641, !645, !649, !653, !658, !664, !667, !670, !676, !685, !690, !702, !718, !725, !734, !739}
!12 = !DISubprogram(name: "FmoInit", scope: !1, file: !1, line: 221, type: !13, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ImageParameters*, %struct.pic_parameter_set_rbsp_t*, %struct.seq_parameter_set_rbsp_t*)* @FmoInit, variables: !621)
!13 = !DISubroutineType(types: !14)
!14 = !{!10, !15, !492, !527}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageParameters", file: !17, line: 1097, baseType: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 868, size: 581888, align: 64, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !49, !50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !71, !75, !79, !84, !87, !89, !91, !92, !281, !282, !345, !349, !350, !351, !352, !353, !354, !355, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !376, !377, !378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !409, !410, !411, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !18, file: !17, line: 870, baseType: !10, size: 32, align: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !18, file: !17, line: 871, baseType: !10, size: 32, align: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nb_references", scope: !18, file: !17, line: 872, baseType: !10, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !18, file: !17, line: 873, baseType: !10, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "total_number_mb", scope: !18, file: !17, line: 874, baseType: !10, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !18, file: !17, line: 875, baseType: !10, size: 32, align: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 876, baseType: !10, size: 32, align: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !18, file: !17, line: 877, baseType: !10, size: 32, align: 32, offset: 224)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !18, file: !17, line: 878, baseType: !10, size: 32, align: 32, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_references", scope: !18, file: !17, line: 879, baseType: !10, size: 32, align: 32, offset: 288)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !18, file: !17, line: 880, baseType: !10, size: 32, align: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !18, file: !17, line: 881, baseType: !10, size: 32, align: 32, offset: 352)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !18, file: !17, line: 882, baseType: !33, size: 32, align: 32, offset: 384)
!33 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !18, file: !17, line: 883, baseType: !10, size: 32, align: 32, offset: 416)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !18, file: !17, line: 884, baseType: !10, size: 32, align: 32, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !18, file: !17, line: 885, baseType: !10, size: 32, align: 32, offset: 480)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !18, file: !17, line: 886, baseType: !10, size: 32, align: 32, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr_frame", scope: !18, file: !17, line: 887, baseType: !10, size: 32, align: 32, offset: 544)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !18, file: !17, line: 888, baseType: !10, size: 32, align: 32, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !18, file: !17, line: 889, baseType: !10, size: 32, align: 32, offset: 608)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !18, file: !17, line: 890, baseType: !10, size: 32, align: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !18, file: !17, line: 891, baseType: !10, size: 32, align: 32, offset: 672)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_upd", scope: !18, file: !17, line: 892, baseType: !10, size: 32, align: 32, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_intra", scope: !18, file: !17, line: 893, baseType: !10, size: 32, align: 32, offset: 736)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "block_c_x", scope: !18, file: !17, line: 894, baseType: !10, size: 32, align: 32, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !18, file: !17, line: 895, baseType: !47, size: 64, align: 64, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode8x8", scope: !18, file: !17, line: 896, baseType: !47, size: 64, align: 64, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !18, file: !17, line: 898, baseType: !10, size: 32, align: 32, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !18, file: !17, line: 899, baseType: !52, size: 64, align: 64, offset: 1024)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "mb_x", scope: !18, file: !17, line: 901, baseType: !10, size: 32, align: 32, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y", scope: !18, file: !17, line: 902, baseType: !10, size: 32, align: 32, offset: 1120)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !18, file: !17, line: 903, baseType: !10, size: 32, align: 32, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !18, file: !17, line: 904, baseType: !10, size: 32, align: 32, offset: 1184)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !18, file: !17, line: 905, baseType: !10, size: 32, align: 32, offset: 1216)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !18, file: !17, line: 906, baseType: !10, size: 32, align: 32, offset: 1248)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !18, file: !17, line: 907, baseType: !10, size: 32, align: 32, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !18, file: !17, line: 908, baseType: !10, size: 32, align: 32, offset: 1312)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "opix_x", scope: !18, file: !17, line: 910, baseType: !10, size: 32, align: 32, offset: 1344)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "opix_y", scope: !18, file: !17, line: 911, baseType: !10, size: 32, align: 32, offset: 1376)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_x", scope: !18, file: !17, line: 912, baseType: !10, size: 32, align: 32, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_y", scope: !18, file: !17, line: 913, baseType: !10, size: 32, align: 32, offset: 1440)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mprr", scope: !18, file: !17, line: 917, baseType: !66, size: 36864, align: 16, offset: 1472)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 36864, align: 16, elements: !68)
!67 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !70}
!69 = !DISubrange(count: 9)
!70 = !DISubrange(count: 16)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_2", scope: !18, file: !17, line: 919, baseType: !72, size: 20480, align: 16, offset: 38336)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 20480, align: 16, elements: !73)
!73 = !{!74, !70, !70}
!74 = !DISubrange(count: 5)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_3", scope: !18, file: !17, line: 920, baseType: !76, size: 9216, align: 16, offset: 58816)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 9216, align: 16, elements: !77)
!77 = !{!69, !78, !78}
!78 = !DISubrange(count: 8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_c", scope: !18, file: !17, line: 921, baseType: !80, size: 32768, align: 16, offset: 68032)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32768, align: 16, elements: !81)
!81 = !{!82, !83, !70, !70}
!82 = !DISubrange(count: 2)
!83 = !DISubrange(count: 4)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mpr", scope: !18, file: !17, line: 922, baseType: !85, size: 4096, align: 16, offset: 100800)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 4096, align: 16, elements: !86)
!86 = !{!70, !70}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "m7", scope: !18, file: !17, line: 923, baseType: !88, size: 8192, align: 32, offset: 104896)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !86)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !18, file: !17, line: 925, baseType: !90, size: 64, align: 64, offset: 113088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !18, file: !17, line: 926, baseType: !52, size: 64, align: 64, offset: 113152)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "currentPicture", scope: !18, file: !17, line: 928, baseType: !93, size: 64, align: 64, offset: 113216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !17, line: 484, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 475, size: 6592, align: 64, elements: !96)
!96 = !{!97, !98, !99, !277, !278, !279, !280}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !95, file: !17, line: 477, baseType: !10, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !95, file: !17, line: 478, baseType: !10, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !95, file: !17, line: 479, baseType: !100, size: 6400, align: 64, offset: 64)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 6400, align: 64, elements: !275)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !17, line: 471, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 443, size: 1216, align: 64, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !189, !224, !250, !259, !260, !261, !262, !263, !264, !265, !266, !267, !272}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !103, file: !17, line: 445, baseType: !10, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !103, file: !17, line: 446, baseType: !10, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !103, file: !17, line: 447, baseType: !10, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !103, file: !17, line: 448, baseType: !10, size: 32, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !103, file: !17, line: 449, baseType: !10, size: 32, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !103, file: !17, line: 450, baseType: !10, size: 32, align: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !103, file: !17, line: 451, baseType: !112, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !17, line: 440, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !17, line: 430, size: 960, align: 64, elements: !115)
!115 = !{!116, !136, !161}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !114, file: !17, line: 433, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !17, line: 427, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 411, size: 384, align: 64, elements: !120)
!120 = !{!121, !122, !123, !127, !128, !129, !130, !131, !132, !133, !135}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !119, file: !17, line: 413, baseType: !10, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !119, file: !17, line: 414, baseType: !10, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !119, file: !17, line: 415, baseType: !124, size: 8, align: 8, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !125, line: 30, baseType: !126)
!125 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!126 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !119, file: !17, line: 416, baseType: !10, size: 32, align: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !119, file: !17, line: 417, baseType: !10, size: 32, align: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !119, file: !17, line: 418, baseType: !124, size: 8, align: 8, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !119, file: !17, line: 420, baseType: !124, size: 8, align: 8, offset: 168)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !119, file: !17, line: 421, baseType: !10, size: 32, align: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !119, file: !17, line: 422, baseType: !10, size: 32, align: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !119, file: !17, line: 424, baseType: !134, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !119, file: !17, line: 425, baseType: !10, size: 32, align: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !114, file: !17, line: 434, baseType: !137, size: 832, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !17, line: 226, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 207, size: 832, align: 64, elements: !139)
!139 = !{!140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !138, file: !17, line: 209, baseType: !141, size: 32, align: 32)
!141 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !138, file: !17, line: 209, baseType: !141, size: 32, align: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !138, file: !17, line: 210, baseType: !141, size: 32, align: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !138, file: !17, line: 211, baseType: !141, size: 32, align: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !138, file: !17, line: 212, baseType: !141, size: 32, align: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !138, file: !17, line: 213, baseType: !134, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !138, file: !17, line: 214, baseType: !48, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !138, file: !17, line: 217, baseType: !141, size: 32, align: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !138, file: !17, line: 217, baseType: !141, size: 32, align: 32, offset: 352)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !138, file: !17, line: 218, baseType: !141, size: 32, align: 32, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !138, file: !17, line: 219, baseType: !141, size: 32, align: 32, offset: 416)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !138, file: !17, line: 220, baseType: !141, size: 32, align: 32, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !138, file: !17, line: 221, baseType: !134, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !138, file: !17, line: 222, baseType: !48, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !138, file: !17, line: 223, baseType: !10, size: 32, align: 32, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !138, file: !17, line: 223, baseType: !10, size: 32, align: 32, offset: 672)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !138, file: !17, line: 224, baseType: !10, size: 32, align: 32, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !138, file: !17, line: 224, baseType: !10, size: 32, align: 32, offset: 736)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !138, file: !17, line: 225, baseType: !10, size: 32, align: 32, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !138, file: !17, line: 225, baseType: !10, size: 32, align: 32, offset: 800)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !114, file: !17, line: 436, baseType: !162, size: 64, align: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!10, !165, !188}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !17, line: 348, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !17, line: 327, size: 384, align: 64, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !181}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !17, line: 329, baseType: !10, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !167, file: !17, line: 330, baseType: !10, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !167, file: !17, line: 331, baseType: !10, size: 32, align: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !167, file: !17, line: 332, baseType: !10, size: 32, align: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !167, file: !17, line: 333, baseType: !10, size: 32, align: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !167, file: !17, line: 334, baseType: !141, size: 32, align: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !167, file: !17, line: 335, baseType: !10, size: 32, align: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !167, file: !17, line: 336, baseType: !10, size: 32, align: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !167, file: !17, line: 344, baseType: !178, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !10, !10, !48, !48}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !167, file: !17, line: 346, baseType: !182, size: 64, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !185, !186}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !17, line: 228, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !103, file: !17, line: 452, baseType: !190, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !17, line: 268, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 258, size: 12032, align: 64, elements: !193)
!193 = !{!194, !206, !209, !213, !217, !220, !221}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !192, file: !17, line: 260, baseType: !195, size: 4224, align: 64)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 4224, align: 64, elements: !203)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !17, line: 238, baseType: !197)
!197 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 231, size: 128, align: 64, elements: !198)
!198 = !{!199, !200, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !197, file: !17, line: 233, baseType: !67, size: 16, align: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !197, file: !17, line: 234, baseType: !126, size: 8, align: 8, offset: 16)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !197, file: !17, line: 236, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!203 = !{!204, !205}
!204 = !DISubrange(count: 3)
!205 = !DISubrange(count: 11)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !192, file: !17, line: 261, baseType: !207, size: 2304, align: 64, offset: 4224)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 2304, align: 64, elements: !208)
!208 = !{!82, !69}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !192, file: !17, line: 262, baseType: !210, size: 2560, align: 64, offset: 6528)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 2560, align: 64, elements: !211)
!211 = !{!82, !212}
!212 = !DISubrange(count: 10)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !192, file: !17, line: 263, baseType: !214, size: 1536, align: 64, offset: 9088)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 1536, align: 64, elements: !215)
!215 = !{!82, !216}
!216 = !DISubrange(count: 6)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !192, file: !17, line: 264, baseType: !218, size: 512, align: 64, offset: 10624)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 512, align: 64, elements: !219)
!219 = !{!83}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !192, file: !17, line: 265, baseType: !218, size: 512, align: 64, offset: 11136)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !192, file: !17, line: 266, baseType: !222, size: 384, align: 64, offset: 11648)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 384, align: 64, elements: !223)
!223 = !{!204}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !103, file: !17, line: 453, baseType: !225, size: 64, align: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !17, line: 293, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 281, size: 97024, align: 64, elements: !228)
!228 = !{!229, !232, !233, !236, !239, !243, !244, !247, !248, !249}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !227, file: !17, line: 283, baseType: !230, size: 256, align: 64)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 256, align: 64, elements: !231)
!231 = !{!82}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !227, file: !17, line: 284, baseType: !218, size: 512, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !227, file: !17, line: 285, baseType: !234, size: 1536, align: 64, offset: 768)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 1536, align: 64, elements: !235)
!235 = !{!204, !83}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !227, file: !17, line: 286, baseType: !237, size: 5120, align: 64, offset: 2304)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 5120, align: 64, elements: !238)
!238 = !{!212, !83}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !227, file: !17, line: 287, baseType: !240, size: 19200, align: 64, offset: 7424)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 19200, align: 64, elements: !241)
!241 = !{!212, !242}
!242 = !DISubrange(count: 15)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !227, file: !17, line: 288, baseType: !240, size: 19200, align: 64, offset: 26624)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !227, file: !17, line: 289, baseType: !245, size: 6400, align: 64, offset: 45824)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 6400, align: 64, elements: !246)
!246 = !{!212, !74}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !227, file: !17, line: 290, baseType: !245, size: 6400, align: 64, offset: 52224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !227, file: !17, line: 291, baseType: !240, size: 19200, align: 64, offset: 58624)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !227, file: !17, line: 292, baseType: !240, size: 19200, align: 64, offset: 77824)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !103, file: !17, line: 456, baseType: !251, size: 64, align: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !17, line: 313, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !17, line: 308, size: 128, align: 64, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !253, file: !17, line: 310, baseType: !10, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !253, file: !17, line: 311, baseType: !10, size: 32, align: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !253, file: !17, line: 312, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !103, file: !17, line: 458, baseType: !10, size: 32, align: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !103, file: !17, line: 459, baseType: !48, size: 64, align: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !103, file: !17, line: 460, baseType: !48, size: 64, align: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !103, file: !17, line: 461, baseType: !48, size: 64, align: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !103, file: !17, line: 462, baseType: !10, size: 32, align: 32, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !103, file: !17, line: 463, baseType: !48, size: 64, align: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !103, file: !17, line: 464, baseType: !48, size: 64, align: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !103, file: !17, line: 465, baseType: !48, size: 64, align: 64, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !103, file: !17, line: 467, baseType: !268, size: 64, align: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !10}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !103, file: !17, line: 469, baseType: !273, size: 192, align: 32, offset: 1024)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, align: 32, elements: !274)
!274 = !{!204, !82}
!275 = !{!276}
!276 = !DISubrange(count: 100)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !95, file: !17, line: 480, baseType: !10, size: 32, align: 32, offset: 6464)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !95, file: !17, line: 481, baseType: !33, size: 32, align: 32, offset: 6496)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !95, file: !17, line: 482, baseType: !33, size: 32, align: 32, offset: 6528)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !95, file: !17, line: 483, baseType: !33, size: 32, align: 32, offset: 6560)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "currentSlice", scope: !18, file: !17, line: 929, baseType: !101, size: 64, align: 64, offset: 113280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !18, file: !17, line: 930, baseType: !283, size: 64, align: 64, offset: 113344)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !17, line: 406, baseType: !285)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !17, line: 351, size: 5056, align: 64, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !295, !297, !298, !299, !302, !305, !306, !307, !312, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !285, file: !17, line: 353, baseType: !10, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !285, file: !17, line: 354, baseType: !10, size: 32, align: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !285, file: !17, line: 355, baseType: !10, size: 32, align: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !285, file: !17, line: 356, baseType: !10, size: 32, align: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !285, file: !17, line: 357, baseType: !10, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !285, file: !17, line: 358, baseType: !293, size: 256, align: 32, offset: 160)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, align: 32, elements: !294)
!294 = !{!78}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !285, file: !17, line: 360, baseType: !296, size: 64, align: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !285, file: !17, line: 361, baseType: !296, size: 64, align: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !285, file: !17, line: 363, baseType: !10, size: 32, align: 32, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !285, file: !17, line: 364, baseType: !300, size: 2048, align: 32, offset: 608)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 32, elements: !301)
!301 = !{!82, !83, !83, !82}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !285, file: !17, line: 365, baseType: !303, size: 512, align: 32, offset: 2656)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 32, elements: !304)
!304 = !{!70}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !285, file: !17, line: 366, baseType: !303, size: 512, align: 32, offset: 3168)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !285, file: !17, line: 367, baseType: !10, size: 32, align: 32, offset: 3680)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !285, file: !17, line: 368, baseType: !308, size: 64, align: 64, offset: 3712)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !17, line: 62, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !310, line: 30, baseType: !311)
!310 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!311 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !285, file: !17, line: 369, baseType: !313, size: 128, align: 32, offset: 3776)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, align: 32, elements: !219)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !285, file: !17, line: 370, baseType: !313, size: 128, align: 32, offset: 3904)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !285, file: !17, line: 371, baseType: !202, size: 64, align: 64, offset: 4032)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !285, file: !17, line: 373, baseType: !10, size: 32, align: 32, offset: 4096)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !285, file: !17, line: 374, baseType: !10, size: 32, align: 32, offset: 4128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !285, file: !17, line: 375, baseType: !10, size: 32, align: 32, offset: 4160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !285, file: !17, line: 377, baseType: !10, size: 32, align: 32, offset: 4192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !285, file: !17, line: 378, baseType: !10, size: 32, align: 32, offset: 4224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !285, file: !17, line: 380, baseType: !10, size: 32, align: 32, offset: 4256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !285, file: !17, line: 382, baseType: !10, size: 32, align: 32, offset: 4288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !285, file: !17, line: 382, baseType: !10, size: 32, align: 32, offset: 4320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !285, file: !17, line: 382, baseType: !10, size: 32, align: 32, offset: 4352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !285, file: !17, line: 382, baseType: !10, size: 32, align: 32, offset: 4384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !285, file: !17, line: 383, baseType: !10, size: 32, align: 32, offset: 4416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !285, file: !17, line: 383, baseType: !10, size: 32, align: 32, offset: 4448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !285, file: !17, line: 383, baseType: !10, size: 32, align: 32, offset: 4480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !285, file: !17, line: 383, baseType: !10, size: 32, align: 32, offset: 4512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !285, file: !17, line: 385, baseType: !10, size: 32, align: 32, offset: 4544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !285, file: !17, line: 386, baseType: !10, size: 32, align: 32, offset: 4576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !285, file: !17, line: 387, baseType: !10, size: 32, align: 32, offset: 4608)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !285, file: !17, line: 390, baseType: !10, size: 32, align: 32, offset: 4640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !285, file: !17, line: 394, baseType: !335, size: 64, align: 64, offset: 4672)
!335 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !285, file: !17, line: 395, baseType: !10, size: 32, align: 32, offset: 4736)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !285, file: !17, line: 396, baseType: !10, size: 32, align: 32, offset: 4768)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !285, file: !17, line: 397, baseType: !10, size: 32, align: 32, offset: 4800)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !285, file: !17, line: 398, baseType: !10, size: 32, align: 32, offset: 4832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !285, file: !17, line: 399, baseType: !10, size: 32, align: 32, offset: 4864)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !285, file: !17, line: 401, baseType: !10, size: 32, align: 32, offset: 4896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !285, file: !17, line: 402, baseType: !10, size: 32, align: 32, offset: 4928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !285, file: !17, line: 403, baseType: !10, size: 32, align: 32, offset: 4960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !285, file: !17, line: 405, baseType: !10, size: 32, align: 32, offset: 4992)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "MB_SyntaxElements", scope: !18, file: !17, line: 931, baseType: !346, size: 460800, align: 64, offset: 113408)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 460800, align: 64, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 1200)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !18, file: !17, line: 933, baseType: !48, size: 64, align: 64, offset: 574208)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !18, file: !17, line: 934, baseType: !48, size: 64, align: 64, offset: 574272)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tr", scope: !18, file: !17, line: 936, baseType: !10, size: 32, align: 32, offset: 574336)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fld_type", scope: !18, file: !17, line: 937, baseType: !10, size: 32, align: 32, offset: 574368)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fld_flag", scope: !18, file: !17, line: 938, baseType: !141, size: 32, align: 32, offset: 574400)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rd_pass", scope: !18, file: !17, line: 939, baseType: !141, size: 32, align: 32, offset: 574432)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "direct_intraP_ref", scope: !18, file: !17, line: 940, baseType: !356, size: 512, align: 32, offset: 574464)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 32, elements: !357)
!357 = !{!83, !83}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pstruct_next_P", scope: !18, file: !17, line: 941, baseType: !10, size: 32, align: 32, offset: 574976)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_frm", scope: !18, file: !17, line: 942, baseType: !10, size: 32, align: 32, offset: 575008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_frm", scope: !18, file: !17, line: 943, baseType: !10, size: 32, align: 32, offset: 575040)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_fld", scope: !18, file: !17, line: 944, baseType: !10, size: 32, align: 32, offset: 575072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_fld", scope: !18, file: !17, line: 945, baseType: !10, size: 32, align: 32, offset: 575104)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_interval", scope: !18, file: !17, line: 948, baseType: !335, size: 64, align: 64, offset: 575168)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "p_interval", scope: !18, file: !17, line: 949, baseType: !10, size: 32, align: 32, offset: 575232)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_to_code", scope: !18, file: !17, line: 950, baseType: !10, size: 32, align: 32, offset: 575264)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fw_mb_mode", scope: !18, file: !17, line: 951, baseType: !10, size: 32, align: 32, offset: 575296)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bw_mb_mode", scope: !18, file: !17, line: 952, baseType: !10, size: 32, align: 32, offset: 575328)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !18, file: !17, line: 954, baseType: !369, size: 64, align: 64, offset: 575360)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !18, file: !17, line: 955, baseType: !369, size: 64, align: 64, offset: 575424)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !18, file: !17, line: 957, baseType: !369, size: 64, align: 64, offset: 575488)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !18, file: !17, line: 958, baseType: !369, size: 64, align: 64, offset: 575552)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !18, file: !17, line: 959, baseType: !380, size: 240, align: 16, offset: 575616)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 240, align: 16, elements: !381)
!381 = !{!242}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !18, file: !17, line: 963, baseType: !10, size: 32, align: 32, offset: 575872)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !18, file: !17, line: 964, baseType: !10, size: 32, align: 32, offset: 575904)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !18, file: !17, line: 965, baseType: !10, size: 32, align: 32, offset: 575936)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !18, file: !17, line: 967, baseType: !10, size: 32, align: 32, offset: 575968)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active", scope: !18, file: !17, line: 969, baseType: !10, size: 32, align: 32, offset: 576000)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active", scope: !18, file: !17, line: 970, baseType: !10, size: 32, align: 32, offset: 576032)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "field_mode", scope: !18, file: !17, line: 972, baseType: !10, size: 32, align: 32, offset: 576064)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !18, file: !17, line: 973, baseType: !10, size: 32, align: 32, offset: 576096)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mvscale", scope: !18, file: !17, line: 974, baseType: !391, size: 2880, align: 32, offset: 576128)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2880, align: 32, elements: !392)
!392 = !{!216, !242}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buf_cycle", scope: !18, file: !17, line: 975, baseType: !10, size: 32, align: 32, offset: 579008)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !18, file: !17, line: 976, baseType: !10, size: 32, align: 32, offset: 579040)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !18, file: !17, line: 978, baseType: !10, size: 32, align: 32, offset: 579072)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "old_layer", scope: !18, file: !17, line: 979, baseType: !10, size: 32, align: 32, offset: 579104)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "NoResidueDirect", scope: !18, file: !17, line: 980, baseType: !10, size: 32, align: 32, offset: 579136)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !18, file: !17, line: 982, baseType: !10, size: 32, align: 32, offset: 579168)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !18, file: !17, line: 984, baseType: !10, size: 32, align: 32, offset: 579200)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !18, file: !17, line: 988, baseType: !141, size: 32, align: 32, offset: 579232)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !18, file: !17, line: 992, baseType: !141, size: 32, align: 32, offset: 579264)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !18, file: !17, line: 993, baseType: !10, size: 32, align: 32, offset: 579296)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !18, file: !17, line: 994, baseType: !10, size: 32, align: 32, offset: 579328)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !18, file: !17, line: 995, baseType: !141, size: 32, align: 32, offset: 579360)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !18, file: !17, line: 996, baseType: !406, size: 32, align: 32, offset: 579392)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, align: 32, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 1)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !18, file: !17, line: 1001, baseType: !141, size: 32, align: 32, offset: 579424)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !18, file: !17, line: 1002, baseType: !10, size: 32, align: 32, offset: 579456)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !18, file: !17, line: 1004, baseType: !412, size: 64, align: 32, offset: 579488)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, align: 32, elements: !231)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !18, file: !17, line: 1008, baseType: !141, size: 32, align: 32, offset: 579552)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !18, file: !17, line: 1009, baseType: !10, size: 32, align: 32, offset: 579584)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !18, file: !17, line: 1010, baseType: !10, size: 32, align: 32, offset: 579616)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !18, file: !17, line: 1011, baseType: !10, size: 32, align: 32, offset: 579648)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !18, file: !17, line: 1012, baseType: !10, size: 32, align: 32, offset: 579680)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !18, file: !17, line: 1013, baseType: !141, size: 32, align: 32, offset: 579712)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !18, file: !17, line: 1015, baseType: !141, size: 32, align: 32, offset: 579744)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !18, file: !17, line: 1016, baseType: !141, size: 32, align: 32, offset: 579776)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !18, file: !17, line: 1017, baseType: !141, size: 32, align: 32, offset: 579808)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !18, file: !17, line: 1018, baseType: !141, size: 32, align: 32, offset: 579840)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !18, file: !17, line: 1019, baseType: !141, size: 32, align: 32, offset: 579872)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !18, file: !17, line: 1020, baseType: !141, size: 32, align: 32, offset: 579904)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !18, file: !17, line: 1023, baseType: !141, size: 32, align: 32, offset: 579936)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !18, file: !17, line: 1027, baseType: !10, size: 32, align: 32, offset: 579968)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !18, file: !17, line: 1029, baseType: !10, size: 32, align: 32, offset: 580000)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !18, file: !17, line: 1030, baseType: !10, size: 32, align: 32, offset: 580032)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !18, file: !17, line: 1031, baseType: !10, size: 32, align: 32, offset: 580064)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !18, file: !17, line: 1033, baseType: !431, size: 64, align: 64, offset: 580096)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !17, line: 324, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !17, line: 316, size: 256, align: 64, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !433, file: !17, line: 318, baseType: !10, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !433, file: !17, line: 319, baseType: !10, size: 32, align: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !433, file: !17, line: 320, baseType: !10, size: 32, align: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !433, file: !17, line: 321, baseType: !10, size: 32, align: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !433, file: !17, line: 322, baseType: !10, size: 32, align: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !433, file: !17, line: 323, baseType: !441, size: 64, align: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !18, file: !17, line: 1035, baseType: !10, size: 32, align: 32, offset: 580160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofHeaderBits", scope: !18, file: !17, line: 1039, baseType: !10, size: 32, align: 32, offset: 580192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofTextureBits", scope: !18, file: !17, line: 1040, baseType: !10, size: 32, align: 32, offset: 580224)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofBasicUnitHeaderBits", scope: !18, file: !17, line: 1041, baseType: !10, size: 32, align: 32, offset: 580256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofBasicUnitTextureBits", scope: !18, file: !17, line: 1042, baseType: !10, size: 32, align: 32, offset: 580288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "TotalMADBasicUnit", scope: !18, file: !17, line: 1043, baseType: !335, size: 64, align: 64, offset: 580352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofMBTextureBits", scope: !18, file: !17, line: 1044, baseType: !10, size: 32, align: 32, offset: 580416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofMBHeaderBits", scope: !18, file: !17, line: 1045, baseType: !10, size: 32, align: 32, offset: 580448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedBFrame", scope: !18, file: !17, line: 1046, baseType: !10, size: 32, align: 32, offset: 580480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedPFrame", scope: !18, file: !17, line: 1047, baseType: !10, size: 32, align: 32, offset: 580512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofGOP", scope: !18, file: !17, line: 1048, baseType: !10, size: 32, align: 32, offset: 580544)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "TotalQpforPPicture", scope: !18, file: !17, line: 1049, baseType: !10, size: 32, align: 32, offset: 580576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofPPicture", scope: !18, file: !17, line: 1050, baseType: !10, size: 32, align: 32, offset: 580608)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "MADofMB", scope: !18, file: !17, line: 1051, baseType: !456, size: 64, align: 64, offset: 580672)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "BasicUnitQP", scope: !18, file: !17, line: 1052, baseType: !10, size: 32, align: 32, offset: 580736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "TopFieldFlag", scope: !18, file: !17, line: 1053, baseType: !10, size: 32, align: 32, offset: 580768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "FieldControl", scope: !18, file: !17, line: 1054, baseType: !10, size: 32, align: 32, offset: 580800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "FieldFrame", scope: !18, file: !17, line: 1055, baseType: !10, size: 32, align: 32, offset: 580832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Frame_Total_Number_MB", scope: !18, file: !17, line: 1056, baseType: !10, size: 32, align: 32, offset: 580864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "IFLAG", scope: !18, file: !17, line: 1057, baseType: !10, size: 32, align: 32, offset: 580896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedMacroBlocks", scope: !18, file: !17, line: 1058, baseType: !10, size: 32, align: 32, offset: 580928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "BasicUnit", scope: !18, file: !17, line: 1059, baseType: !10, size: 32, align: 32, offset: 580960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "write_macroblock", scope: !18, file: !17, line: 1060, baseType: !10, size: 32, align: 32, offset: 580992)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bot_MB", scope: !18, file: !17, line: 1061, baseType: !10, size: 32, align: 32, offset: 581024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "write_macroblock_frame", scope: !18, file: !17, line: 1062, baseType: !10, size: 32, align: 32, offset: 581056)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !18, file: !17, line: 1064, baseType: !10, size: 32, align: 32, offset: 581088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !18, file: !17, line: 1066, baseType: !10, size: 32, align: 32, offset: 581120)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !18, file: !17, line: 1067, baseType: !10, size: 32, align: 32, offset: 581152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !18, file: !17, line: 1068, baseType: !10, size: 32, align: 32, offset: 581184)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !18, file: !17, line: 1070, baseType: !10, size: 32, align: 32, offset: 581216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !18, file: !17, line: 1072, baseType: !10, size: 32, align: 32, offset: 581248)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !18, file: !17, line: 1073, baseType: !10, size: 32, align: 32, offset: 581280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !18, file: !17, line: 1074, baseType: !10, size: 32, align: 32, offset: 581312)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !18, file: !17, line: 1075, baseType: !10, size: 32, align: 32, offset: 581344)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !18, file: !17, line: 1076, baseType: !10, size: 32, align: 32, offset: 581376)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_lambda_scale", scope: !18, file: !17, line: 1077, baseType: !10, size: 32, align: 32, offset: 581408)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value", scope: !18, file: !17, line: 1078, baseType: !141, size: 32, align: 32, offset: 581440)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "max_imgpel_value", scope: !18, file: !17, line: 1079, baseType: !10, size: 32, align: 32, offset: 581472)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "max_imgpel_value_uv", scope: !18, file: !17, line: 1080, baseType: !10, size: 32, align: 32, offset: 581504)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !18, file: !17, line: 1082, baseType: !10, size: 32, align: 32, offset: 581536)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !18, file: !17, line: 1083, baseType: !10, size: 32, align: 32, offset: 581568)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !18, file: !17, line: 1084, baseType: !10, size: 32, align: 32, offset: 581600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !18, file: !17, line: 1085, baseType: !10, size: 32, align: 32, offset: 581632)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !18, file: !17, line: 1086, baseType: !10, size: 32, align: 32, offset: 581664)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !18, file: !17, line: 1087, baseType: !10, size: 32, align: 32, offset: 581696)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !18, file: !17, line: 1089, baseType: !412, size: 64, align: 32, offset: 581728)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "residue_transform_flag", scope: !18, file: !17, line: 1092, baseType: !10, size: 32, align: 32, offset: 581792)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !18, file: !17, line: 1094, baseType: !10, size: 32, align: 32, offset: 581824)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !18, file: !17, line: 1095, baseType: !10, size: 32, align: 32, offset: 581856)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !494)
!494 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !494, file: !4, line: 105, baseType: !271, size: 32, align: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !494, file: !4, line: 106, baseType: !141, size: 32, align: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !494, file: !4, line: 107, baseType: !141, size: 32, align: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !494, file: !4, line: 108, baseType: !271, size: 32, align: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !494, file: !4, line: 110, baseType: !271, size: 32, align: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !494, file: !4, line: 111, baseType: !271, size: 32, align: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !494, file: !4, line: 112, baseType: !293, size: 256, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !494, file: !4, line: 115, baseType: !271, size: 32, align: 32, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !494, file: !4, line: 116, baseType: !141, size: 32, align: 32, offset: 480)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !494, file: !4, line: 117, baseType: !141, size: 32, align: 32, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !494, file: !4, line: 119, baseType: !507, size: 256, align: 32, offset: 544)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 256, align: 32, elements: !294)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !494, file: !4, line: 121, baseType: !507, size: 256, align: 32, offset: 800)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !494, file: !4, line: 122, baseType: !507, size: 256, align: 32, offset: 1056)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !494, file: !4, line: 124, baseType: !271, size: 32, align: 32, offset: 1312)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !494, file: !4, line: 125, baseType: !141, size: 32, align: 32, offset: 1344)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !494, file: !4, line: 127, baseType: !141, size: 32, align: 32, offset: 1376)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !494, file: !4, line: 128, baseType: !134, size: 64, align: 64, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !494, file: !4, line: 130, baseType: !10, size: 32, align: 32, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !494, file: !4, line: 131, baseType: !10, size: 32, align: 32, offset: 1504)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !494, file: !4, line: 132, baseType: !271, size: 32, align: 32, offset: 1536)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !494, file: !4, line: 133, baseType: !141, size: 32, align: 32, offset: 1568)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !494, file: !4, line: 134, baseType: !10, size: 32, align: 32, offset: 1600)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !494, file: !4, line: 135, baseType: !10, size: 32, align: 32, offset: 1632)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !494, file: !4, line: 136, baseType: !10, size: 32, align: 32, offset: 1664)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !494, file: !4, line: 138, baseType: !10, size: 32, align: 32, offset: 1696)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !494, file: !4, line: 139, baseType: !10, size: 32, align: 32, offset: 1728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !494, file: !4, line: 141, baseType: !271, size: 32, align: 32, offset: 1760)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !494, file: !4, line: 142, baseType: !271, size: 32, align: 32, offset: 1792)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !494, file: !4, line: 143, baseType: !271, size: 32, align: 32, offset: 1824)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !494, file: !4, line: 144, baseType: !271, size: 32, align: 32, offset: 1856)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !529)
!529 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !529, file: !4, line: 151, baseType: !271, size: 32, align: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !529, file: !4, line: 153, baseType: !141, size: 32, align: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !529, file: !4, line: 154, baseType: !271, size: 32, align: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !529, file: !4, line: 155, baseType: !271, size: 32, align: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !529, file: !4, line: 156, baseType: !271, size: 32, align: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !529, file: !4, line: 157, baseType: !271, size: 32, align: 32, offset: 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !529, file: !4, line: 158, baseType: !141, size: 32, align: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !529, file: !4, line: 159, baseType: !141, size: 32, align: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !529, file: !4, line: 160, baseType: !141, size: 32, align: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !529, file: !4, line: 162, baseType: !271, size: 32, align: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !529, file: !4, line: 163, baseType: !293, size: 256, align: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !529, file: !4, line: 165, baseType: !141, size: 32, align: 32, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !529, file: !4, line: 166, baseType: !141, size: 32, align: 32, offset: 608)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !529, file: !4, line: 167, baseType: !141, size: 32, align: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !529, file: !4, line: 168, baseType: !141, size: 32, align: 32, offset: 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !529, file: !4, line: 170, baseType: !141, size: 32, align: 32, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !529, file: !4, line: 172, baseType: !271, size: 32, align: 32, offset: 736)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !529, file: !4, line: 173, baseType: !10, size: 32, align: 32, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !529, file: !4, line: 174, baseType: !10, size: 32, align: 32, offset: 800)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !529, file: !4, line: 175, baseType: !141, size: 32, align: 32, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !529, file: !4, line: 177, baseType: !552, size: 8192, align: 32, offset: 864)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !529, file: !4, line: 178, baseType: !141, size: 32, align: 32, offset: 9056)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !529, file: !4, line: 179, baseType: !271, size: 32, align: 32, offset: 9088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !529, file: !4, line: 180, baseType: !141, size: 32, align: 32, offset: 9120)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !529, file: !4, line: 181, baseType: !141, size: 32, align: 32, offset: 9152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !529, file: !4, line: 182, baseType: !271, size: 32, align: 32, offset: 9184)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !529, file: !4, line: 184, baseType: !271, size: 32, align: 32, offset: 9216)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !529, file: !4, line: 185, baseType: !271, size: 32, align: 32, offset: 9248)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !529, file: !4, line: 186, baseType: !271, size: 32, align: 32, offset: 9280)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !529, file: !4, line: 187, baseType: !141, size: 32, align: 32, offset: 9312)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !529, file: !4, line: 188, baseType: !141, size: 32, align: 32, offset: 9344)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !529, file: !4, line: 189, baseType: !141, size: 32, align: 32, offset: 9376)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !529, file: !4, line: 190, baseType: !141, size: 32, align: 32, offset: 9408)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !529, file: !4, line: 191, baseType: !271, size: 32, align: 32, offset: 9440)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !529, file: !4, line: 192, baseType: !569, size: 7584, align: 32, offset: 9472)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !570, file: !4, line: 65, baseType: !271, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !570, file: !4, line: 66, baseType: !141, size: 32, align: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !570, file: !4, line: 67, baseType: !141, size: 32, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !570, file: !4, line: 68, baseType: !141, size: 32, align: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !570, file: !4, line: 69, baseType: !271, size: 32, align: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !570, file: !4, line: 70, baseType: !271, size: 32, align: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !570, file: !4, line: 71, baseType: !271, size: 32, align: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !570, file: !4, line: 72, baseType: !141, size: 32, align: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !570, file: !4, line: 73, baseType: !271, size: 32, align: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !570, file: !4, line: 74, baseType: !271, size: 32, align: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !570, file: !4, line: 75, baseType: !141, size: 32, align: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !570, file: !4, line: 76, baseType: !141, size: 32, align: 32, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !570, file: !4, line: 77, baseType: !141, size: 32, align: 32, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !570, file: !4, line: 78, baseType: !271, size: 32, align: 32, offset: 416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !570, file: !4, line: 79, baseType: !141, size: 32, align: 32, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !570, file: !4, line: 80, baseType: !141, size: 32, align: 32, offset: 480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !570, file: !4, line: 81, baseType: !271, size: 32, align: 32, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !570, file: !4, line: 82, baseType: !141, size: 32, align: 32, offset: 544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !570, file: !4, line: 83, baseType: !141, size: 32, align: 32, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !570, file: !4, line: 84, baseType: !271, size: 32, align: 32, offset: 608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !570, file: !4, line: 85, baseType: !271, size: 32, align: 32, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !570, file: !4, line: 86, baseType: !594, size: 3296, align: 32, offset: 672)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !595)
!595 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !596)
!596 = !{!597, !598, !599, !600, !604, !605, !606, !607, !608, !609}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !595, file: !4, line: 50, baseType: !141, size: 32, align: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !595, file: !4, line: 51, baseType: !141, size: 32, align: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !595, file: !4, line: 52, baseType: !141, size: 32, align: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !595, file: !4, line: 53, baseType: !601, size: 1024, align: 32, offset: 96)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1024, align: 32, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !595, file: !4, line: 54, baseType: !601, size: 1024, align: 32, offset: 1120)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !595, file: !4, line: 55, baseType: !601, size: 1024, align: 32, offset: 2144)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !595, file: !4, line: 56, baseType: !141, size: 32, align: 32, offset: 3168)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !595, file: !4, line: 57, baseType: !141, size: 32, align: 32, offset: 3200)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !595, file: !4, line: 58, baseType: !141, size: 32, align: 32, offset: 3232)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !595, file: !4, line: 59, baseType: !141, size: 32, align: 32, offset: 3264)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !570, file: !4, line: 87, baseType: !271, size: 32, align: 32, offset: 3968)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !570, file: !4, line: 88, baseType: !594, size: 3296, align: 32, offset: 4000)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !570, file: !4, line: 90, baseType: !271, size: 32, align: 32, offset: 7296)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !570, file: !4, line: 91, baseType: !271, size: 32, align: 32, offset: 7328)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !570, file: !4, line: 92, baseType: !271, size: 32, align: 32, offset: 7360)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !570, file: !4, line: 93, baseType: !141, size: 32, align: 32, offset: 7392)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !570, file: !4, line: 94, baseType: !141, size: 32, align: 32, offset: 7424)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !570, file: !4, line: 95, baseType: !141, size: 32, align: 32, offset: 7456)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !570, file: !4, line: 96, baseType: !141, size: 32, align: 32, offset: 7488)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !570, file: !4, line: 97, baseType: !141, size: 32, align: 32, offset: 7520)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !570, file: !4, line: 98, baseType: !141, size: 32, align: 32, offset: 7552)
!621 = !{!622, !623, !624, !625}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !12, file: !1, line: 221, type: !15)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !12, file: !1, line: 221, type: !492)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sps", arg: 3, scope: !12, file: !1, line: 221, type: !527)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !12, file: !1, line: 229, type: !10)
!626 = !DISubprogram(name: "FmoUninit", scope: !1, file: !1, line: 294, type: !627, isLocal: false, isDefinition: true, scopeLine: 295, isOptimized: true, function: void ()* @FmoUninit, variables: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{null}
!629 = !{}
!630 = !DISubprogram(name: "FmoStartPicture", scope: !1, file: !1, line: 557, type: !631, isLocal: false, isDefinition: true, scopeLine: 558, isOptimized: true, function: i32 ()* @FmoStartPicture, variables: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!10}
!633 = !{!634}
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !630, file: !1, line: 559, type: !10)
!635 = !DISubprogram(name: "FmoEndPicture", scope: !1, file: !1, line: 580, type: !631, isLocal: false, isDefinition: true, scopeLine: 581, isOptimized: true, function: i32 ()* @FmoEndPicture, variables: !629)
!636 = !DISubprogram(name: "FmoMB2SliceGroup", scope: !1, file: !1, line: 596, type: !637, isLocal: false, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoMB2SliceGroup, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!10, !10}
!639 = !{!640}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb", arg: 1, scope: !636, file: !1, line: 596, type: !10)
!641 = !DISubprogram(name: "FmoGetNextMBNr", scope: !1, file: !1, line: 613, type: !637, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoGetNextMBNr, variables: !642)
!642 = !{!643, !644}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "CurrentMbNr", arg: 1, scope: !641, file: !1, line: 613, type: !10)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SliceGroupID", scope: !641, file: !1, line: 616, type: !10)
!645 = !DISubprogram(name: "FmoGetPreviousMBNr", scope: !1, file: !1, line: 638, type: !637, isLocal: false, isDefinition: true, scopeLine: 639, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoGetPreviousMBNr, variables: !646)
!646 = !{!647, !648}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "CurrentMbNr", arg: 1, scope: !645, file: !1, line: 638, type: !10)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SliceGroupID", scope: !645, file: !1, line: 641, type: !10)
!649 = !DISubprogram(name: "FmoGetFirstMBOfSliceGroup", scope: !1, file: !1, line: 663, type: !637, isLocal: false, isDefinition: true, scopeLine: 664, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoGetFirstMBOfSliceGroup, variables: !650)
!650 = !{!651, !652}
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SliceGroupID", arg: 1, scope: !649, file: !1, line: 663, type: !10)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !649, file: !1, line: 665, type: !10)
!653 = !DISubprogram(name: "FmoGetLastCodedMBOfSliceGroup", scope: !1, file: !1, line: 689, type: !637, isLocal: false, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoGetLastCodedMBOfSliceGroup, variables: !654)
!654 = !{!655, !656, !657}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SliceGroupID", arg: 1, scope: !653, file: !1, line: 689, type: !10)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !653, file: !1, line: 691, type: !10)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LastMB", scope: !653, file: !1, line: 692, type: !10)
!658 = !DISubprogram(name: "FmoSetLastMacroblockInSlice", scope: !1, file: !1, line: 701, type: !659, isLocal: false, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @FmoSetLastMacroblockInSlice, variables: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !10}
!661 = !{!662, !663}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb", arg: 1, scope: !658, file: !1, line: 701, type: !10)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSliceGroup", scope: !658, file: !1, line: 707, type: !10)
!664 = !DISubprogram(name: "FmoGetFirstMacroblockInSlice", scope: !1, file: !1, line: 713, type: !637, isLocal: false, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoGetFirstMacroblockInSlice, variables: !665)
!665 = !{!666}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SliceGroup", arg: 1, scope: !664, file: !1, line: 713, type: !10)
!667 = !DISubprogram(name: "FmoSliceGroupCompletelyCoded", scope: !1, file: !1, line: 721, type: !637, isLocal: false, isDefinition: true, scopeLine: 722, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @FmoSliceGroupCompletelyCoded, variables: !668)
!668 = !{!669}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SliceGroupID", arg: 1, scope: !667, file: !1, line: 721, type: !10)
!670 = !DISubprogram(name: "FmoGenerateMapUnitToSliceGroupMap", scope: !1, file: !1, line: 95, type: !671, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, variables: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!10, !15, !492}
!673 = !{!674, !675}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !670, file: !1, line: 95, type: !15)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !670, file: !1, line: 95, type: !492)
!676 = !DISubprogram(name: "FmoGenerateType0MapUnitMap", scope: !1, file: !1, line: 321, type: !677, isLocal: true, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: true, variables: !679)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !15, !492}
!679 = !{!680, !681, !682, !683, !684}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !676, file: !1, line: 321, type: !15)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !676, file: !1, line: 321, type: !492)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iGroup", scope: !676, file: !1, line: 323, type: !141)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !676, file: !1, line: 323, type: !141)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !676, file: !1, line: 324, type: !141)
!685 = !DISubprogram(name: "FmoGenerateType1MapUnitMap", scope: !1, file: !1, line: 350, type: !677, isLocal: true, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: true, variables: !686)
!686 = !{!687, !688, !689}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !685, file: !1, line: 350, type: !15)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !685, file: !1, line: 350, type: !492)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !685, file: !1, line: 352, type: !141)
!690 = !DISubprogram(name: "FmoGenerateType2MapUnitMap", scope: !1, file: !1, line: 371, type: !677, isLocal: true, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true, variables: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !690, file: !1, line: 371, type: !15)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !690, file: !1, line: 371, type: !492)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iGroup", scope: !690, file: !1, line: 373, type: !10)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !690, file: !1, line: 374, type: !141)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !690, file: !1, line: 374, type: !141)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !690, file: !1, line: 374, type: !141)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yTopLeft", scope: !690, file: !1, line: 375, type: !141)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xTopLeft", scope: !690, file: !1, line: 375, type: !141)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yBottomRight", scope: !690, file: !1, line: 375, type: !141)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xBottomRight", scope: !690, file: !1, line: 375, type: !141)
!702 = !DISubprogram(name: "FmoGenerateType3MapUnitMap", scope: !1, file: !1, line: 404, type: !677, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, variables: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !702, file: !1, line: 404, type: !15)
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !702, file: !1, line: 404, type: !492)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !702, file: !1, line: 406, type: !141)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !702, file: !1, line: 406, type: !141)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftBound", scope: !702, file: !1, line: 407, type: !10)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "topBound", scope: !702, file: !1, line: 407, type: !10)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightBound", scope: !702, file: !1, line: 407, type: !10)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bottomBound", scope: !702, file: !1, line: 407, type: !10)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !702, file: !1, line: 408, type: !10)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !702, file: !1, line: 408, type: !10)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xDir", scope: !702, file: !1, line: 408, type: !10)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yDir", scope: !702, file: !1, line: 408, type: !10)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapUnitVacant", scope: !702, file: !1, line: 409, type: !10)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapUnitsInSliceGroup0", scope: !702, file: !1, line: 411, type: !141)
!718 = !DISubprogram(name: "FmoGenerateType4MapUnitMap", scope: !1, file: !1, line: 484, type: !677, isLocal: true, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, variables: !719)
!719 = !{!720, !721, !722, !723, !724}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !718, file: !1, line: 484, type: !15)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !718, file: !1, line: 484, type: !492)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapUnitsInSliceGroup0", scope: !718, file: !1, line: 487, type: !141)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizeOfUpperLeftGroup", scope: !718, file: !1, line: 488, type: !141)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !718, file: !1, line: 490, type: !141)
!725 = !DISubprogram(name: "FmoGenerateType5MapUnitMap", scope: !1, file: !1, line: 511, type: !677, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: true, variables: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !725, file: !1, line: 511, type: !15)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !725, file: !1, line: 511, type: !492)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapUnitsInSliceGroup0", scope: !725, file: !1, line: 514, type: !141)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizeOfUpperLeftGroup", scope: !725, file: !1, line: 515, type: !141)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !725, file: !1, line: 517, type: !141)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !725, file: !1, line: 517, type: !141)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !725, file: !1, line: 517, type: !141)
!734 = !DISubprogram(name: "FmoGenerateType6MapUnitMap", scope: !1, file: !1, line: 539, type: !677, isLocal: true, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: true, variables: !735)
!735 = !{!736, !737, !738}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !734, file: !1, line: 539, type: !15)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 2, scope: !734, file: !1, line: 539, type: !492)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !734, file: !1, line: 541, type: !141)
!739 = !DISubprogram(name: "FmoGenerateMBAmap", scope: !1, file: !1, line: 167, type: !740, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, variables: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{!10, !15, !527}
!742 = !{!743, !744, !745}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !739, file: !1, line: 167, type: !15)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sps", arg: 2, scope: !739, file: !1, line: 167, type: !527)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !739, file: !1, line: 169, type: !141)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !757, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !801, !802, !803, !804, !805, !806, !807, !810, !813, !814, !815, !816, !817, !818, !829, !862, !863, !864, !865, !866, !921, !922, !923, !924, !925, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!747 = !DIGlobalVariable(name: "MBAmap", scope: !0, file: !1, line: 65, type: !134, isLocal: false, isDefinition: true, variable: i8** @MBAmap)
!748 = !DIGlobalVariable(name: "MapUnitToSliceGroupMap", scope: !0, file: !1, line: 66, type: !134, isLocal: false, isDefinition: true, variable: i8** @MapUnitToSliceGroupMap)
!749 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !17, line: 558, type: !93, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!750 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !17, line: 559, type: !93, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!751 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !17, line: 560, type: !93, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!752 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !17, line: 561, type: !93, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!753 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !17, line: 562, type: !93, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!754 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !17, line: 565, type: !755, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!757 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !17, line: 566, type: !758, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!759 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !17, line: 567, type: !47, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!760 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !17, line: 569, type: !141, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!761 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !17, line: 570, type: !141, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!762 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !17, line: 572, type: !10, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!763 = !DIGlobalVariable(name: "me_time", scope: !0, file: !17, line: 572, type: !10, isLocal: false, isDefinition: true, variable: i32* @me_time)
!764 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !17, line: 573, type: !492, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!765 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !17, line: 574, type: !527, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!766 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !17, line: 578, type: !10, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!767 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !17, line: 579, type: !10, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!768 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !17, line: 583, type: !52, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
