; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/header.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !53, subprograms: !58, globals: !297, imports: !681)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/header.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !28, !33, !38, !45, !49}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 119, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!6 = !DIEnumerator(name: "SE_HEADER", value: 0)
!7 = !DIEnumerator(name: "SE_PTYPE", value: 1)
!8 = !DIEnumerator(name: "SE_MBTYPE", value: 2)
!9 = !DIEnumerator(name: "SE_REFFRAME", value: 3)
!10 = !DIEnumerator(name: "SE_INTRAPREDMODE", value: 4)
!11 = !DIEnumerator(name: "SE_MVD", value: 5)
!12 = !DIEnumerator(name: "SE_CBP_INTRA", value: 6)
!13 = !DIEnumerator(name: "SE_LUM_DC_INTRA", value: 7)
!14 = !DIEnumerator(name: "SE_CHR_DC_INTRA", value: 8)
!15 = !DIEnumerator(name: "SE_LUM_AC_INTRA", value: 9)
!16 = !DIEnumerator(name: "SE_CHR_AC_INTRA", value: 10)
!17 = !DIEnumerator(name: "SE_CBP_INTER", value: 11)
!18 = !DIEnumerator(name: "SE_LUM_DC_INTER", value: 12)
!19 = !DIEnumerator(name: "SE_CHR_DC_INTER", value: 13)
!20 = !DIEnumerator(name: "SE_LUM_AC_INTER", value: 14)
!21 = !DIEnumerator(name: "SE_CHR_AC_INTER", value: 15)
!22 = !DIEnumerator(name: "SE_DELTA_QUANT_INTER", value: 16)
!23 = !DIEnumerator(name: "SE_DELTA_QUANT_INTRA", value: 17)
!24 = !DIEnumerator(name: "SE_BFRAME", value: 18)
!25 = !DIEnumerator(name: "SE_EOS", value: 19)
!26 = !DIEnumerator(name: "SE_TRANSFORM_SIZE_FLAG", value: 20)
!27 = !DIEnumerator(name: "SE_MAX_ELEMENTS", value: 21)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 42, size: 32, align: 32, elements: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "FALSE", value: 0)
!32 = !DIEnumerator(name: "TRUE", value: 1)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 185, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "FRAME", value: 0)
!36 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!37 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !39)
!39 = !{!40, !41, !42, !43, !44}
!40 = !DIEnumerator(name: "P_SLICE", value: 0)
!41 = !DIEnumerator(name: "B_SLICE", value: 1)
!42 = !DIEnumerator(name: "I_SLICE", value: 2)
!43 = !DIEnumerator(name: "SP_SLICE", value: 3)
!44 = !DIEnumerator(name: "SI_SLICE", value: 4)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 178, size: 32, align: 32, elements: !46)
!46 = !{!47, !48}
!47 = !DIEnumerator(name: "UVLC", value: 0)
!48 = !DIEnumerator(name: "CABAC", value: 1)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 104, size: 32, align: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "PAR_OF_ANNEXB", value: 0)
!52 = !DIEnumerator(name: "PAR_OF_RTP", value: 1)
!53 = !{!54, !55, !56, !57}
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !{!59, !253, !256, !265, !272, !290}
!59 = !DISubprogram(name: "SliceHeader", scope: !1, file: !1, line: 57, type: !60, isLocal: false, isDefinition: true, scopeLine: 58, isOptimized: true, function: i32 ()* @SliceHeader, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{!56}
!62 = !{!63, !64, !142, !245, !246, !247, !248, !249, !250}
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dP_nr", scope: !59, file: !1, line: 59, type: !56)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !59, file: !1, line: 60, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !68)
!68 = !{!69, !89, !114}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !67, file: !4, line: 433, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !73)
!73 = !{!74, !75, !76, !80, !81, !82, !83, !84, !85, !86, !88}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !72, file: !4, line: 413, baseType: !56, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !72, file: !4, line: 414, baseType: !56, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !72, file: !4, line: 415, baseType: !77, size: 8, align: 8, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !78, line: 30, baseType: !79)
!78 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !72, file: !4, line: 416, baseType: !56, size: 32, align: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !72, file: !4, line: 417, baseType: !56, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !72, file: !4, line: 418, baseType: !77, size: 8, align: 8, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !72, file: !4, line: 420, baseType: !77, size: 8, align: 8, offset: 168)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !72, file: !4, line: 421, baseType: !56, size: 32, align: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !72, file: !4, line: 422, baseType: !56, size: 32, align: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !72, file: !4, line: 424, baseType: !87, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !72, file: !4, line: 425, baseType: !56, size: 32, align: 32, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !67, file: !4, line: 434, baseType: !90, size: 832, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !99, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !91, file: !4, line: 209, baseType: !54, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !91, file: !4, line: 209, baseType: !54, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !91, file: !4, line: 210, baseType: !54, size: 32, align: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !91, file: !4, line: 211, baseType: !54, size: 32, align: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !91, file: !4, line: 212, baseType: !54, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !91, file: !4, line: 213, baseType: !87, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !91, file: !4, line: 214, baseType: !100, size: 64, align: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !91, file: !4, line: 217, baseType: !54, size: 32, align: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !91, file: !4, line: 217, baseType: !54, size: 32, align: 32, offset: 352)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !91, file: !4, line: 218, baseType: !54, size: 32, align: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !91, file: !4, line: 219, baseType: !54, size: 32, align: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !91, file: !4, line: 220, baseType: !54, size: 32, align: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !91, file: !4, line: 221, baseType: !87, size: 64, align: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !91, file: !4, line: 222, baseType: !100, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !91, file: !4, line: 223, baseType: !56, size: 32, align: 32, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !91, file: !4, line: 223, baseType: !56, size: 32, align: 32, offset: 672)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !91, file: !4, line: 224, baseType: !56, size: 32, align: 32, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !91, file: !4, line: 224, baseType: !56, size: 32, align: 32, offset: 736)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !91, file: !4, line: 225, baseType: !56, size: 32, align: 32, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !91, file: !4, line: 225, baseType: !56, size: 32, align: 32, offset: 800)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !67, file: !4, line: 436, baseType: !115, size: 64, align: 64, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!56, !118, !141}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !4, line: 329, baseType: !56, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !120, file: !4, line: 330, baseType: !56, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !120, file: !4, line: 331, baseType: !56, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !120, file: !4, line: 332, baseType: !56, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !120, file: !4, line: 333, baseType: !56, size: 32, align: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !120, file: !4, line: 334, baseType: !54, size: 32, align: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !120, file: !4, line: 335, baseType: !56, size: 32, align: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !120, file: !4, line: 336, baseType: !56, size: 32, align: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !120, file: !4, line: 344, baseType: !131, size: 64, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !56, !56, !100, !100}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !120, file: !4, line: 346, baseType: !135, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, !139}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !59, file: !1, line: 61, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !193, !220, !229, !230, !231, !232, !233, !234, !235, !236, !237, !242}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !145, file: !4, line: 445, baseType: !56, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !145, file: !4, line: 446, baseType: !56, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !145, file: !4, line: 447, baseType: !56, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !145, file: !4, line: 448, baseType: !56, size: 32, align: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !145, file: !4, line: 449, baseType: !56, size: 32, align: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !145, file: !4, line: 450, baseType: !56, size: 32, align: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !145, file: !4, line: 451, baseType: !65, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !145, file: !4, line: 452, baseType: !155, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !158)
!158 = !{!159, !172, !177, !181, !185, !189, !190}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !157, file: !4, line: 260, baseType: !160, size: 4224, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 4224, align: 64, elements: !169)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !163)
!163 = !{!164, !166, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !162, file: !4, line: 233, baseType: !165, size: 16, align: 16)
!165 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !162, file: !4, line: 234, baseType: !79, size: 8, align: 8, offset: 16)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !162, file: !4, line: 236, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!169 = !{!170, !171}
!170 = !DISubrange(count: 3)
!171 = !DISubrange(count: 11)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !157, file: !4, line: 261, baseType: !173, size: 2304, align: 64, offset: 4224)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2304, align: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DISubrange(count: 2)
!176 = !DISubrange(count: 9)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !157, file: !4, line: 262, baseType: !178, size: 2560, align: 64, offset: 6528)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2560, align: 64, elements: !179)
!179 = !{!175, !180}
!180 = !DISubrange(count: 10)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !157, file: !4, line: 263, baseType: !182, size: 1536, align: 64, offset: 9088)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1536, align: 64, elements: !183)
!183 = !{!175, !184}
!184 = !DISubrange(count: 6)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !157, file: !4, line: 264, baseType: !186, size: 512, align: 64, offset: 10624)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, align: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 4)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !157, file: !4, line: 265, baseType: !186, size: 512, align: 64, offset: 11136)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !157, file: !4, line: 266, baseType: !191, size: 384, align: 64, offset: 11648)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 384, align: 64, elements: !192)
!192 = !{!170}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !145, file: !4, line: 453, baseType: !194, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !197)
!197 = !{!198, !201, !202, !205, !208, !212, !213, !217, !218, !219}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !196, file: !4, line: 283, baseType: !199, size: 256, align: 64)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 256, align: 64, elements: !200)
!200 = !{!175}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !196, file: !4, line: 284, baseType: !186, size: 512, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !196, file: !4, line: 285, baseType: !203, size: 1536, align: 64, offset: 768)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1536, align: 64, elements: !204)
!204 = !{!170, !188}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !196, file: !4, line: 286, baseType: !206, size: 5120, align: 64, offset: 2304)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 5120, align: 64, elements: !207)
!207 = !{!180, !188}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !196, file: !4, line: 287, baseType: !209, size: 19200, align: 64, offset: 7424)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 19200, align: 64, elements: !210)
!210 = !{!180, !211}
!211 = !DISubrange(count: 15)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !196, file: !4, line: 288, baseType: !209, size: 19200, align: 64, offset: 26624)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !196, file: !4, line: 289, baseType: !214, size: 6400, align: 64, offset: 45824)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 6400, align: 64, elements: !215)
!215 = !{!180, !216}
!216 = !DISubrange(count: 5)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !196, file: !4, line: 290, baseType: !214, size: 6400, align: 64, offset: 52224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !196, file: !4, line: 291, baseType: !209, size: 19200, align: 64, offset: 58624)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !196, file: !4, line: 292, baseType: !209, size: 19200, align: 64, offset: 77824)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !145, file: !4, line: 456, baseType: !221, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !223, file: !4, line: 310, baseType: !56, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !223, file: !4, line: 311, baseType: !56, size: 32, align: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !223, file: !4, line: 312, baseType: !228, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !145, file: !4, line: 458, baseType: !56, size: 32, align: 32, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !145, file: !4, line: 459, baseType: !100, size: 64, align: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !145, file: !4, line: 460, baseType: !100, size: 64, align: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !145, file: !4, line: 461, baseType: !100, size: 64, align: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !145, file: !4, line: 462, baseType: !56, size: 32, align: 32, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !145, file: !4, line: 463, baseType: !100, size: 64, align: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !145, file: !4, line: 464, baseType: !100, size: 64, align: 64, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !145, file: !4, line: 465, baseType: !100, size: 64, align: 64, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !145, file: !4, line: 467, baseType: !238, size: 64, align: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!241, !56}
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !29, line: 45, baseType: !28)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !145, file: !4, line: 469, baseType: !243, size: 192, align: 32, offset: 1024)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 192, align: 32, elements: !244)
!244 = !{!170, !175}
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !59, file: !1, line: 62, type: !56)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field_pic_flag", scope: !59, file: !1, line: 63, type: !54)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bottom_field_flag", scope: !59, file: !1, line: 63, type: !54)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_bits_slice_group_change_cycle", scope: !59, file: !1, line: 65, type: !56)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numtmp", scope: !59, file: !1, line: 66, type: !55)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "override_flag", scope: !251, file: !1, line: 146, type: !56)
!251 = distinct !DILexicalBlock(scope: !252, file: !1, line: 145, column: 3)
!252 = distinct !DILexicalBlock(scope: !59, file: !1, line: 144, column: 7)
!253 = !DISubprogram(name: "get_picture_type", scope: !1, file: !1, line: 472, type: !60, isLocal: false, isDefinition: true, scopeLine: 473, isOptimized: true, function: i32 ()* @get_picture_type, variables: !254)
!254 = !{!255}
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "same_slicetype_for_whole_frame", scope: !253, file: !1, line: 476, type: !56)
!256 = !DISubprogram(name: "Partition_BC_Header", scope: !1, file: !1, line: 529, type: !257, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @Partition_BC_Header, variables: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{!56, !56}
!259 = !{!260, !261, !262, !263, !264}
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "PartNo", arg: 1, scope: !256, file: !1, line: 529, type: !56)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !256, file: !1, line: 531, type: !65)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol", scope: !256, file: !1, line: 532, type: !119)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !256, file: !1, line: 532, type: !118)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !256, file: !1, line: 534, type: !56)
!265 = !DISubprogram(name: "ref_pic_list_reordering", scope: !1, file: !1, line: 240, type: !60, isLocal: true, isDefinition: true, scopeLine: 241, isOptimized: true, variables: !266)
!266 = !{!267, !268, !269, !270, !271}
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dP_nr", scope: !265, file: !1, line: 242, type: !56)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !265, file: !1, line: 243, type: !65)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !265, file: !1, line: 244, type: !143)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !265, file: !1, line: 246, type: !56)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !265, file: !1, line: 246, type: !56)
!272 = !DISubprogram(name: "dec_ref_pic_marking", scope: !1, file: !1, line: 314, type: !60, isLocal: true, isDefinition: true, scopeLine: 315, isOptimized: true, variables: !273)
!273 = !{!274, !275, !276, !288, !289}
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dP_nr", scope: !272, file: !1, line: 316, type: !56)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !272, file: !1, line: 317, type: !65)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_drpm", scope: !272, file: !1, line: 319, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !4, line: 324, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !4, line: 316, size: 256, align: 64, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !279, file: !4, line: 318, baseType: !56, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !279, file: !4, line: 319, baseType: !56, size: 32, align: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !279, file: !4, line: 320, baseType: !56, size: 32, align: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !279, file: !4, line: 321, baseType: !56, size: 32, align: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !279, file: !4, line: 322, baseType: !56, size: 32, align: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !279, file: !4, line: 323, baseType: !287, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !272, file: !1, line: 321, type: !56)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !272, file: !1, line: 321, type: !56)
!290 = !DISubprogram(name: "pred_weight_table", scope: !1, file: !1, line: 381, type: !60, isLocal: true, isDefinition: true, scopeLine: 382, isOptimized: true, variables: !291)
!291 = !{!292, !293, !294, !295, !296}
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dP_nr", scope: !290, file: !1, line: 383, type: !56)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !290, file: !1, line: 384, type: !65)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !290, file: !1, line: 386, type: !56)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !290, file: !1, line: 387, type: !56)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !290, file: !1, line: 387, type: !56)
!297 = !{!298, !302, !303, !318, !319, !320, !321, !322, !325, !327, !329, !330, !331, !332, !333, !372, !467, !468, !469, !471, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !491, !492, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !508, !512, !513, !514, !515, !516, !517, !520, !523, !524, !525, !526, !529, !532, !543, !585, !586, !587, !588, !589, !646, !647, !648, !649, !650, !654, !655, !656, !657, !658, !659, !660, !661, !662, !679}
!298 = !DIGlobalVariable(name: "assignSE2partition_NoDP", scope: !0, file: !1, line: 39, type: !299, isLocal: false, isDefinition: true, variable: [21 x i32]* @assignSE2partition_NoDP)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 672, align: 32, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 21)
!302 = !DIGlobalVariable(name: "assignSE2partition_DP", scope: !0, file: !1, line: 41, type: !299, isLocal: false, isDefinition: true, variable: [21 x i32]* @assignSE2partition_DP)
!303 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !304, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !307)
!307 = !{!308, !309, !310, !314, !315, !316, !317}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !306, file: !4, line: 477, baseType: !56, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !306, file: !4, line: 478, baseType: !56, size: 32, align: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !306, file: !4, line: 479, baseType: !311, size: 6400, align: 64, offset: 64)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 6400, align: 64, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 100)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !306, file: !4, line: 480, baseType: !56, size: 32, align: 32, offset: 6464)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !306, file: !4, line: 481, baseType: !55, size: 32, align: 32, offset: 6496)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !306, file: !4, line: 482, baseType: !55, size: 32, align: 32, offset: 6528)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !306, file: !4, line: 483, baseType: !55, size: 32, align: 32, offset: 6560)
!318 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !304, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!319 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !304, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!320 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !304, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!321 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !304, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!322 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!325 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!327 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !328, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!329 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !54, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!330 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !54, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!331 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !56, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!332 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !56, isLocal: false, isDefinition: true, variable: i32* @me_time)
!333 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !334, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !29, line: 145, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 103, size: 1920, align: 64, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !336, file: !29, line: 105, baseType: !241, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !336, file: !29, line: 106, baseType: !54, size: 32, align: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !336, file: !29, line: 107, baseType: !54, size: 32, align: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !336, file: !29, line: 108, baseType: !241, size: 32, align: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !336, file: !29, line: 110, baseType: !241, size: 32, align: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !336, file: !29, line: 111, baseType: !241, size: 32, align: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !336, file: !29, line: 112, baseType: !345, size: 256, align: 32, offset: 192)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 256, align: 32, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !336, file: !29, line: 115, baseType: !241, size: 32, align: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !336, file: !29, line: 116, baseType: !54, size: 32, align: 32, offset: 480)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !336, file: !29, line: 117, baseType: !54, size: 32, align: 32, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !336, file: !29, line: 119, baseType: !352, size: 256, align: 32, offset: 544)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 256, align: 32, elements: !346)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !336, file: !29, line: 121, baseType: !352, size: 256, align: 32, offset: 800)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !336, file: !29, line: 122, baseType: !352, size: 256, align: 32, offset: 1056)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !336, file: !29, line: 124, baseType: !241, size: 32, align: 32, offset: 1312)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !336, file: !29, line: 125, baseType: !54, size: 32, align: 32, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !336, file: !29, line: 127, baseType: !54, size: 32, align: 32, offset: 1376)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !336, file: !29, line: 128, baseType: !87, size: 64, align: 64, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !336, file: !29, line: 130, baseType: !56, size: 32, align: 32, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !336, file: !29, line: 131, baseType: !56, size: 32, align: 32, offset: 1504)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !336, file: !29, line: 132, baseType: !241, size: 32, align: 32, offset: 1536)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !336, file: !29, line: 133, baseType: !54, size: 32, align: 32, offset: 1568)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !336, file: !29, line: 134, baseType: !56, size: 32, align: 32, offset: 1600)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !336, file: !29, line: 135, baseType: !56, size: 32, align: 32, offset: 1632)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !336, file: !29, line: 136, baseType: !56, size: 32, align: 32, offset: 1664)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !336, file: !29, line: 138, baseType: !56, size: 32, align: 32, offset: 1696)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !336, file: !29, line: 139, baseType: !56, size: 32, align: 32, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !336, file: !29, line: 141, baseType: !241, size: 32, align: 32, offset: 1760)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !336, file: !29, line: 142, baseType: !241, size: 32, align: 32, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !336, file: !29, line: 143, baseType: !241, size: 32, align: 32, offset: 1824)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !336, file: !29, line: 144, baseType: !241, size: 32, align: 32, offset: 1856)
!372 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !373, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !29, line: 193, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 149, size: 17056, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !375, file: !29, line: 151, baseType: !241, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !375, file: !29, line: 153, baseType: !54, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !375, file: !29, line: 154, baseType: !241, size: 32, align: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !375, file: !29, line: 155, baseType: !241, size: 32, align: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !375, file: !29, line: 156, baseType: !241, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !375, file: !29, line: 157, baseType: !241, size: 32, align: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !375, file: !29, line: 158, baseType: !54, size: 32, align: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !375, file: !29, line: 159, baseType: !54, size: 32, align: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !375, file: !29, line: 160, baseType: !54, size: 32, align: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !375, file: !29, line: 162, baseType: !241, size: 32, align: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !375, file: !29, line: 163, baseType: !345, size: 256, align: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !375, file: !29, line: 165, baseType: !54, size: 32, align: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !375, file: !29, line: 166, baseType: !54, size: 32, align: 32, offset: 608)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !375, file: !29, line: 167, baseType: !54, size: 32, align: 32, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !375, file: !29, line: 168, baseType: !54, size: 32, align: 32, offset: 672)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !375, file: !29, line: 170, baseType: !54, size: 32, align: 32, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !375, file: !29, line: 172, baseType: !241, size: 32, align: 32, offset: 736)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !375, file: !29, line: 173, baseType: !56, size: 32, align: 32, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !375, file: !29, line: 174, baseType: !56, size: 32, align: 32, offset: 800)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !375, file: !29, line: 175, baseType: !54, size: 32, align: 32, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !375, file: !29, line: 177, baseType: !398, size: 8192, align: 32, offset: 864)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8192, align: 32, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !375, file: !29, line: 178, baseType: !54, size: 32, align: 32, offset: 9056)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !375, file: !29, line: 179, baseType: !241, size: 32, align: 32, offset: 9088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !375, file: !29, line: 180, baseType: !54, size: 32, align: 32, offset: 9120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !375, file: !29, line: 181, baseType: !54, size: 32, align: 32, offset: 9152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !375, file: !29, line: 182, baseType: !241, size: 32, align: 32, offset: 9184)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !375, file: !29, line: 184, baseType: !241, size: 32, align: 32, offset: 9216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !375, file: !29, line: 185, baseType: !241, size: 32, align: 32, offset: 9248)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !375, file: !29, line: 186, baseType: !241, size: 32, align: 32, offset: 9280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !375, file: !29, line: 187, baseType: !54, size: 32, align: 32, offset: 9312)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !375, file: !29, line: 188, baseType: !54, size: 32, align: 32, offset: 9344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !375, file: !29, line: 189, baseType: !54, size: 32, align: 32, offset: 9376)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !375, file: !29, line: 190, baseType: !54, size: 32, align: 32, offset: 9408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !375, file: !29, line: 191, baseType: !241, size: 32, align: 32, offset: 9440)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !375, file: !29, line: 192, baseType: !415, size: 7584, align: 32, offset: 9472)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !29, line: 99, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 63, size: 7584, align: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !416, file: !29, line: 65, baseType: !241, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !416, file: !29, line: 66, baseType: !54, size: 32, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !416, file: !29, line: 67, baseType: !54, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !416, file: !29, line: 68, baseType: !54, size: 32, align: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !416, file: !29, line: 69, baseType: !241, size: 32, align: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !416, file: !29, line: 70, baseType: !241, size: 32, align: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !416, file: !29, line: 71, baseType: !241, size: 32, align: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !416, file: !29, line: 72, baseType: !54, size: 32, align: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !416, file: !29, line: 73, baseType: !241, size: 32, align: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !416, file: !29, line: 74, baseType: !241, size: 32, align: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !416, file: !29, line: 75, baseType: !54, size: 32, align: 32, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !416, file: !29, line: 76, baseType: !54, size: 32, align: 32, offset: 352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !416, file: !29, line: 77, baseType: !54, size: 32, align: 32, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !416, file: !29, line: 78, baseType: !241, size: 32, align: 32, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !416, file: !29, line: 79, baseType: !54, size: 32, align: 32, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !416, file: !29, line: 80, baseType: !54, size: 32, align: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !416, file: !29, line: 81, baseType: !241, size: 32, align: 32, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !416, file: !29, line: 82, baseType: !54, size: 32, align: 32, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !416, file: !29, line: 83, baseType: !54, size: 32, align: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !416, file: !29, line: 84, baseType: !241, size: 32, align: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !416, file: !29, line: 85, baseType: !241, size: 32, align: 32, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !416, file: !29, line: 86, baseType: !440, size: 3296, align: 32, offset: 672)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !29, line: 60, baseType: !441)
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 48, size: 3296, align: 32, elements: !442)
!442 = !{!443, !444, !445, !446, !450, !451, !452, !453, !454, !455}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !441, file: !29, line: 50, baseType: !54, size: 32, align: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !441, file: !29, line: 51, baseType: !54, size: 32, align: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !441, file: !29, line: 52, baseType: !54, size: 32, align: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !441, file: !29, line: 53, baseType: !447, size: 1024, align: 32, offset: 96)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1024, align: 32, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !441, file: !29, line: 54, baseType: !447, size: 1024, align: 32, offset: 1120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !441, file: !29, line: 55, baseType: !447, size: 1024, align: 32, offset: 2144)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !441, file: !29, line: 56, baseType: !54, size: 32, align: 32, offset: 3168)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !441, file: !29, line: 57, baseType: !54, size: 32, align: 32, offset: 3200)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !441, file: !29, line: 58, baseType: !54, size: 32, align: 32, offset: 3232)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !441, file: !29, line: 59, baseType: !54, size: 32, align: 32, offset: 3264)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !416, file: !29, line: 87, baseType: !241, size: 32, align: 32, offset: 3968)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !416, file: !29, line: 88, baseType: !440, size: 3296, align: 32, offset: 4000)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !416, file: !29, line: 90, baseType: !241, size: 32, align: 32, offset: 7296)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !416, file: !29, line: 91, baseType: !241, size: 32, align: 32, offset: 7328)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !416, file: !29, line: 92, baseType: !241, size: 32, align: 32, offset: 7360)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !416, file: !29, line: 93, baseType: !54, size: 32, align: 32, offset: 7392)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !416, file: !29, line: 94, baseType: !54, size: 32, align: 32, offset: 7424)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !416, file: !29, line: 95, baseType: !54, size: 32, align: 32, offset: 7456)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !416, file: !29, line: 96, baseType: !54, size: 32, align: 32, offset: 7488)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !416, file: !29, line: 97, baseType: !54, size: 32, align: 32, offset: 7520)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !416, file: !29, line: 98, baseType: !54, size: 32, align: 32, offset: 7552)
!467 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !56, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!468 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !56, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!469 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !470, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!471 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !470, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!472 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !473, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!474 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !56, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!475 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !56, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!476 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !56, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!477 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !56, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!478 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!479 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!480 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!481 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!482 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!483 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!484 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !323, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!485 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !326, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!486 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !487, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!491 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !488, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!492 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !493, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!494 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !493, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!495 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !56, isLocal: false, isDefinition: true, variable: i32* @intras)
!496 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !56, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!497 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !56, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!498 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !56, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!499 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !56, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!500 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !56, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!501 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !56, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!502 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !56, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!503 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !504, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 2400, align: 8, elements: !506)
!505 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!506 = !{!507}
!507 = !DISubrange(count: 300)
!508 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8192, align: 32, elements: !510)
!510 = !{!511, !511}
!511 = !DISubrange(count: 16)
!512 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!513 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!514 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!515 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!516 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !509, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!517 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !518, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 24576, align: 32, elements: !519)
!519 = !{!170, !511, !511}
!520 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1024, align: 32, elements: !522)
!522 = !{!175, !188, !188}
!523 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!524 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!525 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !521, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!526 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !527, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, align: 32, elements: !528)
!528 = !{!188, !188}
!529 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !530, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 512, align: 32, elements: !531)
!531 = !{!511}
!532 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !533, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !535)
!535 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !535, file: !4, line: 1184, baseType: !56, size: 32, align: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !535, file: !4, line: 1185, baseType: !56, size: 32, align: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !535, file: !4, line: 1186, baseType: !56, size: 32, align: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !535, file: !4, line: 1187, baseType: !56, size: 32, align: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !535, file: !4, line: 1188, baseType: !56, size: 32, align: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !535, file: !4, line: 1189, baseType: !56, size: 32, align: 32, offset: 160)
!543 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !544, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !546)
!546 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !547)
!547 = !{!548, !550, !551, !552, !553, !554, !555, !556, !557, !559, !560, !561, !562, !563, !568, !569, !573, !574, !575, !576, !578, !579, !580, !581, !582, !583, !584}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !546, file: !4, line: 1147, baseType: !549, size: 64, align: 64)
!549 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !546, file: !4, line: 1149, baseType: !509, size: 8192, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !546, file: !4, line: 1150, baseType: !509, size: 8192, align: 32, offset: 8256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !546, file: !4, line: 1150, baseType: !509, size: 8192, align: 32, offset: 16448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !546, file: !4, line: 1151, baseType: !473, size: 64, align: 64, offset: 24640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !546, file: !4, line: 1152, baseType: !470, size: 64, align: 64, offset: 24704)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !546, file: !4, line: 1153, baseType: !56, size: 32, align: 32, offset: 24768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !546, file: !4, line: 1155, baseType: !56, size: 32, align: 32, offset: 24800)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !546, file: !4, line: 1157, baseType: !558, size: 128, align: 32, offset: 24832)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, align: 32, elements: !187)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !546, file: !4, line: 1157, baseType: !558, size: 128, align: 32, offset: 24960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !546, file: !4, line: 1158, baseType: !328, size: 64, align: 64, offset: 25088)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !546, file: !4, line: 1159, baseType: !530, size: 512, align: 32, offset: 25152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !546, file: !4, line: 1160, baseType: !56, size: 32, align: 32, offset: 25664)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !546, file: !4, line: 1161, baseType: !564, size: 64, align: 64, offset: 25728)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !566, line: 30, baseType: !567)
!566 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!567 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !546, file: !4, line: 1162, baseType: !56, size: 32, align: 32, offset: 25792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !546, file: !4, line: 1163, baseType: !570, size: 64, align: 64, offset: 25856)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !546, file: !4, line: 1164, baseType: !570, size: 64, align: 64, offset: 25920)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !546, file: !4, line: 1165, baseType: !570, size: 64, align: 64, offset: 25984)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !546, file: !4, line: 1166, baseType: !570, size: 64, align: 64, offset: 26048)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !546, file: !4, line: 1167, baseType: !577, size: 512, align: 16, offset: 26112)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 512, align: 16, elements: !522)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !546, file: !4, line: 1168, baseType: !56, size: 32, align: 32, offset: 26624)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !546, file: !4, line: 1169, baseType: !56, size: 32, align: 32, offset: 26656)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !546, file: !4, line: 1171, baseType: !56, size: 32, align: 32, offset: 26688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !546, file: !4, line: 1172, baseType: !56, size: 32, align: 32, offset: 26720)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !546, file: !4, line: 1174, baseType: !56, size: 32, align: 32, offset: 26752)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !546, file: !4, line: 1175, baseType: !56, size: 32, align: 32, offset: 26784)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !546, file: !4, line: 1176, baseType: !56, size: 32, align: 32, offset: 26816)
!585 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !545, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!586 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !545, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!587 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !545, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!588 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !545, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!589 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !590, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !592, line: 153, baseType: !593)
!592 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !592, line: 122, size: 1216, align: 64, elements: !594)
!594 = !{!595, !597, !598, !599, !600, !601, !606, !607, !608, !612, !617, !626, !632, !633, !636, !637, !639, !643, !644, !645}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !593, file: !592, line: 123, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !593, file: !592, line: 124, baseType: !56, size: 32, align: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !593, file: !592, line: 125, baseType: !56, size: 32, align: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !593, file: !592, line: 126, baseType: !490, size: 16, align: 16, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !593, file: !592, line: 127, baseType: !490, size: 16, align: 16, offset: 144)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !593, file: !592, line: 128, baseType: !602, size: 128, align: 64, offset: 192)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !592, line: 88, size: 128, align: 64, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !602, file: !592, line: 89, baseType: !596, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !602, file: !592, line: 90, baseType: !56, size: 32, align: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !593, file: !592, line: 129, baseType: !56, size: 32, align: 32, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !593, file: !592, line: 132, baseType: !57, size: 64, align: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !593, file: !592, line: 133, baseType: !609, size: 64, align: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!56, !57}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !593, file: !592, line: 134, baseType: !613, size: 64, align: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!56, !57, !616, !56}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !593, file: !592, line: 135, baseType: !618, size: 64, align: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !57, !621, !56}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !592, line: 77, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !623, line: 71, baseType: !624)
!623 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !625, line: 46, baseType: !567)
!625 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !593, file: !592, line: 136, baseType: !627, size: 64, align: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!56, !57, !630, !56}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !593, file: !592, line: 139, baseType: !602, size: 128, align: 64, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !593, file: !592, line: 140, baseType: !634, size: 64, align: 64, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !592, line: 94, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !593, file: !592, line: 141, baseType: !56, size: 32, align: 32, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !593, file: !592, line: 144, baseType: !638, size: 24, align: 8, offset: 928)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 24, align: 8, elements: !192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !593, file: !592, line: 145, baseType: !640, size: 8, align: 8, offset: 952)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, align: 8, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 1)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !593, file: !592, line: 148, baseType: !602, size: 128, align: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !593, file: !592, line: 151, baseType: !56, size: 32, align: 32, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !593, file: !592, line: 152, baseType: !621, size: 64, align: 64, offset: 1152)
!646 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !590, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!647 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !590, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!648 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !56, isLocal: false, isDefinition: true, variable: i32* @p_in)
!649 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !56, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!650 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !651, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 640, align: 32, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 20)
!654 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !651, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!655 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !651, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!656 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !651, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!657 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !651, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!658 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !651, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!659 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !56, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!660 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !56, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!661 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !56, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!662 = !DIGlobalVariable(name: "WriteNALU", scope: !0, file: !663, line: 28, type: !664, isLocal: false, isDefinition: true, variable: i32 (%struct.NALU_t*)** @WriteNALU)
!663 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!56, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALU_t", file: !669, line: 49, baseType: !670)
!669 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalucommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!670 = !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 40, size: 256, align: 64, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "startcodeprefix_len", scope: !670, file: !669, line: 42, baseType: !56, size: 32, align: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !670, file: !669, line: 43, baseType: !54, size: 32, align: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !670, file: !669, line: 44, baseType: !54, size: 32, align: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !670, file: !669, line: 45, baseType: !56, size: 32, align: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !670, file: !669, line: 46, baseType: !56, size: 32, align: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_bit", scope: !670, file: !669, line: 47, baseType: !56, size: 32, align: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !670, file: !669, line: 48, baseType: !87, size: 64, align: 64, offset: 192)
!679 = !DIGlobalVariable(name: "assignSE2partition", scope: !0, file: !1, line: 38, type: !680, isLocal: false, isDefinition: true, variable: [2 x i32*]* @assignSE2partition)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, align: 64, elements: !200)
!681 = !{}
!682 = !{i32 2, !"Dwarf Version", i32 2}
!683 = !{i32 2, !"Debug Info Version", i32 700000003}
!684 = !{i32 1, !"PIC Level", i32 2}
!685 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!686 = !DILocation(line: 59, column: 34, scope: !59)
!687 = !{!688, !688, i64 0}
!688 = !{!"any pointer", !689, i64 0}
!689 = !{!"omnipotent char", !690, i64 0}
!690 = !{!"Simple C/C++ TBAA"}
!691 = !DILocation(line: 59, column: 41, scope: !59)
!692 = !{!693, !694, i64 2364}
!693 = !{!"", !694, i64 0, !694, i64 4, !694, i64 8, !694, i64 12, !694, i64 16, !694, i64 20, !694, i64 24, !694, i64 28, !694, i64 32, !694, i64 36, !694, i64 40, !694, i64 44, !694, i64 48, !694, i64 52, !694, i64 56, !694, i64 60, !694, i64 64, !694, i64 68, !694, i64 72, !694, i64 76, !689, i64 80, !689, i64 144, !694, i64 208, !694, i64 212, !694, i64 216, !694, i64 220, !689, i64 224, !689, i64 424, !689, i64 624, !689, i64 824, !689, i64 1024, !694, i64 1224, !694, i64 1228, !694, i64 1232, !694, i64 1236, !694, i64 1240, !694, i64 1244, !694, i64 1248, !694, i64 1252, !694, i64 1256, !694, i64 1260, !694, i64 1264, !694, i64 1268, !694, i64 1272, !694, i64 1276, !694, i64 1280, !694, i64 1284, !694, i64 1288, !694, i64 1292, !694, i64 1296, !694, i64 1300, !694, i64 1304, !694, i64 1308, !694, i64 1312, !694, i64 1316, !694, i64 1320, !689, i64 1324, !694, i64 2348, !694, i64 2352, !694, i64 2356, !694, i64 2360, !694, i64 2364, !694, i64 2368, !694, i64 2372, !694, i64 2376, !694, i64 2380, !694, i64 2384, !694, i64 2388, !694, i64 2392, !694, i64 2396, !694, i64 2400, !694, i64 2404, !694, i64 2408, !694, i64 2412, !694, i64 2416, !694, i64 2420, !695, i64 2424, !694, i64 2432, !694, i64 2436, !694, i64 2440, !694, i64 2444, !694, i64 2448, !694, i64 2452, !694, i64 2456, !694, i64 2460, !694, i64 2464, !694, i64 2468, !694, i64 2472, !694, i64 2476, !689, i64 2480, !689, i64 2680, !694, i64 2880, !694, i64 2884, !694, i64 2888, !694, i64 2892, !694, i64 2896, !694, i64 2900, !694, i64 2904, !694, i64 2908, !694, i64 2912, !694, i64 2916, !694, i64 2920, !694, i64 2924, !694, i64 2928, !694, i64 2932, !694, i64 2936, !694, i64 2940, !694, i64 2944, !694, i64 2948, !689, i64 2952, !694, i64 3152, !694, i64 3156, !688, i64 3160, !688, i64 3168, !688, i64 3176, !688, i64 3184, !694, i64 3192, !694, i64 3196, !694, i64 3200, !694, i64 3204, !694, i64 3208, !694, i64 3212, !694, i64 3216, !694, i64 3220, !694, i64 3224, !694, i64 3228, !694, i64 3232, !694, i64 3236, !694, i64 3240, !694, i64 3244, !694, i64 3248, !694, i64 3252, !694, i64 3256, !689, i64 3260, !694, i64 3292, !694, i64 3296, !694, i64 3300, !694, i64 3304, !694, i64 3308, !694, i64 3312, !694, i64 3316, !694, i64 3320, !694, i64 3324, !694, i64 3328, !694, i64 3332, !689, i64 3336, !689, i64 3384, !694, i64 3584}
!694 = !{!"int", !689, i64 0}
!695 = !{!"double", !689, i64 0}
!696 = !DILocation(line: 59, column: 15, scope: !59)
!697 = !{!694, !694, i64 0}
!698 = !DIExpression()
!699 = !DILocation(line: 59, column: 7, scope: !59)
!700 = !DILocation(line: 60, column: 32, scope: !59)
!701 = !DILocation(line: 60, column: 33, scope: !59)
!702 = !DILocation(line: 60, column: 38, scope: !59)
!703 = !{!704, !688, i64 14160}
