; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/image.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.storable_picture = type { i32, i32, i32, i32, i32, i32, [6 x [33 x i64]], [6 x [33 x i64]], [6 x [33 x i64]], [6 x [33 x i64]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16**, i16*, i16*, i16**, i16**, i16***, i8*, i16***, i64***, i64***, i16****, i8**, i8**, %struct.storable_picture*, %struct.storable_picture*, %struct.storable_picture*, i32, i32, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !26, subprograms: !32, globals: !707, imports: !290)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/image.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8, !14, !21}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 185, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "FRAME", value: 0)
!12 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!13 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 192, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "P_SLICE", value: 0)
!17 = !DIEnumerator(name: "B_SLICE", value: 1)
!18 = !DIEnumerator(name: "I_SLICE", value: 2)
!19 = !DIEnumerator(name: "SP_SLICE", value: 3)
!20 = !DIEnumerator(name: "SI_SLICE", value: 4)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 111, size: 32, align: 32, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!24 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!25 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!29 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!30 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!31 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!32 = !{!33, !53, !254, !289, !291, !297, !305, !393, !396, !470, !486, !495, !514, !522, !535, !543, !549, !554, !555, !560, !570, !581, !589, !595, !601, !606, !610, !614, !618, !622, !626, !640, !641, !661, !662, !663, !664}
!33 = !DISubprogram(name: "MbAffPostProc", scope: !1, file: !1, line: 122, type: !34, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: true, function: void ()* @MbAffPostProc, variables: !36)
!34 = !DISubroutineType(types: !35)
!35 = !{null}
!36 = !{!37, !42, !45, !47, !48, !49, !50, !51, !52}
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !33, file: !1, line: 124, type: !38)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8192, align: 16, elements: !39)
!39 = !{!40, !41}
!40 = !DISubrange(count: 16)
!41 = !DISubrange(count: 32)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !33, file: !1, line: 126, type: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgUV", scope: !33, file: !1, line: 127, type: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !33, file: !1, line: 128, type: !27)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !33, file: !1, line: 128, type: !27)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !33, file: !1, line: 128, type: !27)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !33, file: !1, line: 128, type: !27)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y0", scope: !33, file: !1, line: 128, type: !27)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !33, file: !1, line: 128, type: !27)
!53 = !DISubprogram(name: "code_a_picture", scope: !1, file: !1, line: 200, type: !54, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Picture*)* @code_a_picture, variables: !249)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !59)
!59 = !{!60, !61, !62, !245, !246, !247, !248}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !58, file: !9, line: 477, baseType: !27, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !58, file: !9, line: 478, baseType: !27, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !58, file: !9, line: 479, baseType: !63, size: 6400, align: 64, offset: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 6400, align: 64, elements: !243)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !153, !191, !218, !227, !228, !229, !230, !231, !232, !233, !234, !235, !240}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !66, file: !9, line: 445, baseType: !27, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !66, file: !9, line: 446, baseType: !27, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !66, file: !9, line: 447, baseType: !27, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !66, file: !9, line: 448, baseType: !27, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !66, file: !9, line: 449, baseType: !27, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !66, file: !9, line: 450, baseType: !27, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !66, file: !9, line: 451, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !78)
!78 = !{!79, !99, !125}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !77, file: !9, line: 433, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !83)
!83 = !{!84, !85, !86, !90, !91, !92, !93, !94, !95, !96, !98}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !82, file: !9, line: 413, baseType: !27, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !82, file: !9, line: 414, baseType: !27, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !82, file: !9, line: 415, baseType: !87, size: 8, align: 8, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !88, line: 30, baseType: !89)
!88 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !82, file: !9, line: 416, baseType: !27, size: 32, align: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !82, file: !9, line: 417, baseType: !27, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !82, file: !9, line: 418, baseType: !87, size: 8, align: 8, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !82, file: !9, line: 420, baseType: !87, size: 8, align: 8, offset: 168)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !82, file: !9, line: 421, baseType: !27, size: 32, align: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !82, file: !9, line: 422, baseType: !27, size: 32, align: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !82, file: !9, line: 424, baseType: !97, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !82, file: !9, line: 425, baseType: !27, size: 32, align: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !77, file: !9, line: 434, baseType: !100, size: 832, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !102)
!102 = !{!103, !105, !106, !107, !108, !109, !110, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !101, file: !9, line: 209, baseType: !104, size: 32, align: 32)
!104 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !101, file: !9, line: 209, baseType: !104, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !101, file: !9, line: 210, baseType: !104, size: 32, align: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !101, file: !9, line: 211, baseType: !104, size: 32, align: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !101, file: !9, line: 212, baseType: !104, size: 32, align: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !101, file: !9, line: 213, baseType: !97, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !101, file: !9, line: 214, baseType: !111, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !101, file: !9, line: 217, baseType: !104, size: 32, align: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !101, file: !9, line: 217, baseType: !104, size: 32, align: 32, offset: 352)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !101, file: !9, line: 218, baseType: !104, size: 32, align: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !101, file: !9, line: 219, baseType: !104, size: 32, align: 32, offset: 416)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !101, file: !9, line: 220, baseType: !104, size: 32, align: 32, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !101, file: !9, line: 221, baseType: !97, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !101, file: !9, line: 222, baseType: !111, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !101, file: !9, line: 223, baseType: !27, size: 32, align: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !101, file: !9, line: 223, baseType: !27, size: 32, align: 32, offset: 672)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !101, file: !9, line: 224, baseType: !27, size: 32, align: 32, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !101, file: !9, line: 224, baseType: !27, size: 32, align: 32, offset: 736)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !101, file: !9, line: 225, baseType: !27, size: 32, align: 32, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !101, file: !9, line: 225, baseType: !27, size: 32, align: 32, offset: 800)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !77, file: !9, line: 436, baseType: !126, size: 64, align: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!27, !129, !152}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !145}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !9, line: 329, baseType: !27, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !131, file: !9, line: 330, baseType: !27, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !131, file: !9, line: 331, baseType: !27, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !9, line: 332, baseType: !27, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !131, file: !9, line: 333, baseType: !27, size: 32, align: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !131, file: !9, line: 334, baseType: !104, size: 32, align: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !131, file: !9, line: 335, baseType: !27, size: 32, align: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !131, file: !9, line: 336, baseType: !27, size: 32, align: 32, offset: 224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !131, file: !9, line: 344, baseType: !142, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !27, !27, !111, !111}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !131, file: !9, line: 346, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149, !150}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !66, file: !9, line: 452, baseType: !154, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !156)
!156 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !157)
!157 = !{!158, !170, !175, !179, !183, !187, !188}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !156, file: !9, line: 260, baseType: !159, size: 4224, align: 64)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 4224, align: 64, elements: !167)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !162)
!162 = !{!163, !164, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !161, file: !9, line: 233, baseType: !29, size: 16, align: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !161, file: !9, line: 234, baseType: !89, size: 8, align: 8, offset: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !161, file: !9, line: 236, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!167 = !{!168, !169}
!168 = !DISubrange(count: 3)
!169 = !DISubrange(count: 11)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !156, file: !9, line: 261, baseType: !171, size: 2304, align: 64, offset: 4224)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 2304, align: 64, elements: !172)
!172 = !{!173, !174}
!173 = !DISubrange(count: 2)
!174 = !DISubrange(count: 9)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !156, file: !9, line: 262, baseType: !176, size: 2560, align: 64, offset: 6528)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 2560, align: 64, elements: !177)
!177 = !{!173, !178}
!178 = !DISubrange(count: 10)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !156, file: !9, line: 263, baseType: !180, size: 1536, align: 64, offset: 9088)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1536, align: 64, elements: !181)
!181 = !{!173, !182}
!182 = !DISubrange(count: 6)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !156, file: !9, line: 264, baseType: !184, size: 512, align: 64, offset: 10624)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 512, align: 64, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 4)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !156, file: !9, line: 265, baseType: !184, size: 512, align: 64, offset: 11136)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !156, file: !9, line: 266, baseType: !189, size: 384, align: 64, offset: 11648)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 384, align: 64, elements: !190)
!190 = !{!168}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !66, file: !9, line: 453, baseType: !192, size: 64, align: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !195)
!195 = !{!196, !199, !200, !203, !206, !210, !211, !215, !216, !217}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !194, file: !9, line: 283, baseType: !197, size: 256, align: 64)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 256, align: 64, elements: !198)
!198 = !{!173}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !194, file: !9, line: 284, baseType: !184, size: 512, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !194, file: !9, line: 285, baseType: !201, size: 1536, align: 64, offset: 768)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1536, align: 64, elements: !202)
!202 = !{!168, !186}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !194, file: !9, line: 286, baseType: !204, size: 5120, align: 64, offset: 2304)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 5120, align: 64, elements: !205)
!205 = !{!178, !186}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !194, file: !9, line: 287, baseType: !207, size: 19200, align: 64, offset: 7424)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 19200, align: 64, elements: !208)
!208 = !{!178, !209}
!209 = !DISubrange(count: 15)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !194, file: !9, line: 288, baseType: !207, size: 19200, align: 64, offset: 26624)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !194, file: !9, line: 289, baseType: !212, size: 6400, align: 64, offset: 45824)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 6400, align: 64, elements: !213)
!213 = !{!178, !214}
!214 = !DISubrange(count: 5)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !194, file: !9, line: 290, baseType: !212, size: 6400, align: 64, offset: 52224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !194, file: !9, line: 291, baseType: !207, size: 19200, align: 64, offset: 58624)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !194, file: !9, line: 292, baseType: !207, size: 19200, align: 64, offset: 77824)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !66, file: !9, line: 456, baseType: !219, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !221, file: !9, line: 310, baseType: !27, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !221, file: !9, line: 311, baseType: !27, size: 32, align: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !221, file: !9, line: 312, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !66, file: !9, line: 458, baseType: !27, size: 32, align: 32, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !66, file: !9, line: 459, baseType: !111, size: 64, align: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !66, file: !9, line: 460, baseType: !111, size: 64, align: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !66, file: !9, line: 461, baseType: !111, size: 64, align: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !66, file: !9, line: 462, baseType: !27, size: 32, align: 32, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !66, file: !9, line: 463, baseType: !111, size: 64, align: 64, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !66, file: !9, line: 464, baseType: !111, size: 64, align: 64, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !66, file: !9, line: 465, baseType: !111, size: 64, align: 64, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !66, file: !9, line: 467, baseType: !236, size: 64, align: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !27}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !66, file: !9, line: 469, baseType: !241, size: 192, align: 32, offset: 1024)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, align: 32, elements: !242)
!242 = !{!168, !173}
!243 = !{!244}
!244 = !DISubrange(count: 100)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !58, file: !9, line: 480, baseType: !27, size: 32, align: 32, offset: 6464)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !58, file: !9, line: 481, baseType: !31, size: 32, align: 32, offset: 6496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !58, file: !9, line: 482, baseType: !31, size: 32, align: 32, offset: 6528)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !58, file: !9, line: 483, baseType: !31, size: 32, align: 32, offset: 6560)
!249 = !{!250, !251, !252, !253}
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic", arg: 1, scope: !53, file: !1, line: 200, type: !56)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NumberOfCodedMBs", scope: !53, file: !1, line: 202, type: !27)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SliceGroup", scope: !53, file: !1, line: 203, type: !27)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !53, file: !1, line: 204, type: !27)
!254 = !DISubprogram(name: "encode_one_frame", scope: !1, file: !1, line: 266, type: !255, isLocal: false, isDefinition: true, scopeLine: 267, isOptimized: true, function: i32 ()* @encode_one_frame, variables: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{!27}
!257 = !{!258, !259, !265, !266, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "FrameNumberInFile", scope: !254, file: !1, line: 270, type: !27)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ltime1", scope: !254, file: !1, line: 277, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !261, line: 30, baseType: !262)
!261 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !263, line: 120, baseType: !264)
!263 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!264 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ltime2", scope: !254, file: !1, line: 278, type: !260)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstruct1", scope: !254, file: !1, line: 284, type: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeb", file: !268, line: 82, size: 128, align: 64, elements: !269)
!268 = !DIFile(filename: "/usr/include/sys/timeb.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!269 = !{!270, !271, !272, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !267, file: !268, line: 83, baseType: !260, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "millitm", scope: !267, file: !268, line: 84, baseType: !29, size: 16, align: 16, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "timezone", scope: !267, file: !268, line: 85, baseType: !273, size: 16, align: 16, offset: 80)
!273 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "dstflag", scope: !267, file: !268, line: 86, baseType: !273, size: 16, align: 16, offset: 96)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstruct2", scope: !254, file: !1, line: 285, type: !267)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_time", scope: !254, file: !1, line: 288, type: !27)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits_frm", scope: !254, file: !1, line: 289, type: !27)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits_fld", scope: !254, file: !1, line: 289, type: !27)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_frm", scope: !254, file: !1, line: 290, type: !31)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_frm_y", scope: !254, file: !1, line: 290, type: !31)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_frm_u", scope: !254, file: !1, line: 290, type: !31)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_frm_v", scope: !254, file: !1, line: 290, type: !31)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_fld", scope: !254, file: !1, line: 291, type: !31)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_fld_y", scope: !254, file: !1, line: 291, type: !31)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_fld_u", scope: !254, file: !1, line: 291, type: !31)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dis_fld_v", scope: !254, file: !1, line: 291, type: !31)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_type", scope: !254, file: !1, line: 294, type: !27)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits", scope: !254, file: !1, line: 294, type: !27)
!289 = !DISubprogram(name: "copy_params", scope: !1, file: !1, line: 704, type: !34, isLocal: false, isDefinition: true, scopeLine: 705, isOptimized: true, function: void ()* @copy_params, variables: !290)
!290 = !{}
!291 = !DISubprogram(name: "frame_picture", scope: !1, file: !1, line: 732, type: !292, isLocal: false, isDefinition: true, scopeLine: 733, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Picture*, i32)* @frame_picture, variables: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !56, !27}
!294 = !{!295, !296}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 1, scope: !291, file: !1, line: 732, type: !56)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rd_pass", arg: 2, scope: !291, file: !1, line: 732, type: !27)
!297 = !DISubprogram(name: "field_picture", scope: !1, file: !1, line: 818, type: !298, isLocal: false, isDefinition: true, scopeLine: 819, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Picture*, %struct.Picture*)* @field_picture, variables: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !56, !56}
!300 = !{!301, !302, !303, !304}
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 1, scope: !297, file: !1, line: 818, type: !56)
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bottom", arg: 2, scope: !297, file: !1, line: 818, type: !56)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_pic_type", scope: !297, file: !1, line: 821, type: !27)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TopFieldBits", scope: !297, file: !1, line: 822, type: !27)
!305 = !DISubprogram(name: "UnifiedOneForthPix", scope: !1, file: !1, line: 1406, type: !306, isLocal: false, isDefinition: true, scopeLine: 1407, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*)* @UnifiedOneForthPix, variables: !378)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !310, line: 82, baseType: !311)
!310 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !310, line: 21, size: 52672, align: 64, elements: !312)
!312 = !{!313, !315, !316, !317, !318, !319, !320, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !357, !361, !362, !364, !366, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !311, file: !310, line: 23, baseType: !314, size: 32, align: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !9, line: 190, baseType: !8)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !311, file: !310, line: 25, baseType: !27, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !311, file: !310, line: 26, baseType: !27, size: 32, align: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !311, file: !310, line: 27, baseType: !27, size: 32, align: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !311, file: !310, line: 28, baseType: !27, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !311, file: !310, line: 29, baseType: !27, size: 32, align: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !311, file: !310, line: 30, baseType: !321, size: 12672, align: 64, offset: 192)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 12672, align: 64, elements: !326)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !324, line: 30, baseType: !325)
!324 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!325 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!326 = !{!182, !327}
!327 = !DISubrange(count: 33)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !311, file: !310, line: 31, baseType: !321, size: 12672, align: 64, offset: 12864)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !311, file: !310, line: 32, baseType: !321, size: 12672, align: 64, offset: 25536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !311, file: !310, line: 33, baseType: !321, size: 12672, align: 64, offset: 38208)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !311, file: !310, line: 34, baseType: !104, size: 32, align: 32, offset: 50880)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !311, file: !310, line: 35, baseType: !27, size: 32, align: 32, offset: 50912)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !311, file: !310, line: 36, baseType: !27, size: 32, align: 32, offset: 50944)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !311, file: !310, line: 37, baseType: !27, size: 32, align: 32, offset: 50976)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !311, file: !310, line: 39, baseType: !27, size: 32, align: 32, offset: 51008)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !311, file: !310, line: 40, baseType: !27, size: 32, align: 32, offset: 51040)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !311, file: !310, line: 41, baseType: !27, size: 32, align: 32, offset: 51072)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !311, file: !310, line: 42, baseType: !27, size: 32, align: 32, offset: 51104)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !311, file: !310, line: 44, baseType: !27, size: 32, align: 32, offset: 51136)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !311, file: !310, line: 44, baseType: !27, size: 32, align: 32, offset: 51168)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !311, file: !310, line: 44, baseType: !27, size: 32, align: 32, offset: 51200)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !311, file: !310, line: 44, baseType: !27, size: 32, align: 32, offset: 51232)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !311, file: !310, line: 45, baseType: !27, size: 32, align: 32, offset: 51264)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !311, file: !310, line: 46, baseType: !27, size: 32, align: 32, offset: 51296)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !311, file: !310, line: 47, baseType: !27, size: 32, align: 32, offset: 51328)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !311, file: !310, line: 49, baseType: !43, size: 64, align: 64, offset: 51392)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !311, file: !310, line: 50, baseType: !44, size: 64, align: 64, offset: 51456)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !311, file: !310, line: 51, baseType: !44, size: 64, align: 64, offset: 51520)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !311, file: !310, line: 52, baseType: !43, size: 64, align: 64, offset: 51584)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !311, file: !310, line: 53, baseType: !43, size: 64, align: 64, offset: 51648)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !311, file: !310, line: 54, baseType: !46, size: 64, align: 64, offset: 51712)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !311, file: !310, line: 56, baseType: !97, size: 64, align: 64, offset: 51776)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !311, file: !310, line: 58, baseType: !354, size: 64, align: 64, offset: 51840)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !311, file: !310, line: 60, baseType: !358, size: 64, align: 64, offset: 51904)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !311, file: !310, line: 63, baseType: !358, size: 64, align: 64, offset: 51968)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !311, file: !310, line: 66, baseType: !363, size: 64, align: 64, offset: 52032)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !311, file: !310, line: 68, baseType: !365, size: 64, align: 64, offset: 52096)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !311, file: !310, line: 69, baseType: !365, size: 64, align: 64, offset: 52160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !311, file: !310, line: 71, baseType: !368, size: 64, align: 64, offset: 52224)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !311, file: !310, line: 72, baseType: !368, size: 64, align: 64, offset: 52288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !311, file: !310, line: 73, baseType: !368, size: 64, align: 64, offset: 52352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !311, file: !310, line: 75, baseType: !27, size: 32, align: 32, offset: 52416)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !311, file: !310, line: 76, baseType: !27, size: 32, align: 32, offset: 52448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !311, file: !310, line: 77, baseType: !27, size: 32, align: 32, offset: 52480)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !311, file: !310, line: 78, baseType: !27, size: 32, align: 32, offset: 52512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !311, file: !310, line: 79, baseType: !27, size: 32, align: 32, offset: 52544)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !311, file: !310, line: 80, baseType: !27, size: 32, align: 32, offset: 52576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !311, file: !310, line: 81, baseType: !27, size: 32, align: 32, offset: 52608)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !305, file: !1, line: 1406, type: !308)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is", scope: !305, file: !1, line: 1408, type: !27)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !305, file: !1, line: 1409, type: !27)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !305, file: !1, line: 1409, type: !27)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j4", scope: !305, file: !1, line: 1409, type: !27)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ie2", scope: !305, file: !1, line: 1410, type: !27)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "je2", scope: !305, file: !1, line: 1410, type: !27)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !305, file: !1, line: 1410, type: !27)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxy", scope: !305, file: !1, line: 1410, type: !27)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out4Y", scope: !305, file: !1, line: 1412, type: !43)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref11", scope: !305, file: !1, line: 1413, type: !44)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !305, file: !1, line: 1414, type: !43)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !305, file: !1, line: 1416, type: !27)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !305, file: !1, line: 1417, type: !27)
!393 = !DISubprogram(name: "dummy_slice_too_big", scope: !1, file: !1, line: 1788, type: !237, isLocal: false, isDefinition: true, scopeLine: 1789, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @dummy_slice_too_big, variables: !394)
!394 = !{!395}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bits_slice", arg: 1, scope: !393, file: !1, line: 1788, type: !27)
!396 = !DISubprogram(name: "copy_rdopt_data", scope: !1, file: !1, line: 1799, type: !397, isLocal: false, isDefinition: true, scopeLine: 1800, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @copy_rdopt_data, variables: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !27}
!399 = !{!400, !401, !402, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bot_block", arg: 1, scope: !396, file: !1, line: 1799, type: !27)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !396, file: !1, line: 1801, type: !27)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !396, file: !1, line: 1802, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !9, line: 406, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !9, line: 351, size: 5056, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !416, !418, !419, !420, !423, !426, !427, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !405, file: !9, line: 353, baseType: !27, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !405, file: !9, line: 354, baseType: !27, size: 32, align: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !405, file: !9, line: 355, baseType: !27, size: 32, align: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !405, file: !9, line: 356, baseType: !27, size: 32, align: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !405, file: !9, line: 357, baseType: !27, size: 32, align: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !405, file: !9, line: 358, baseType: !413, size: 256, align: 32, offset: 160)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, align: 32, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !405, file: !9, line: 360, baseType: !417, size: 64, align: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !405, file: !9, line: 361, baseType: !417, size: 64, align: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !405, file: !9, line: 363, baseType: !27, size: 32, align: 32, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !405, file: !9, line: 364, baseType: !421, size: 2048, align: 32, offset: 608)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, align: 32, elements: !422)
!422 = !{!173, !186, !186, !173}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !405, file: !9, line: 365, baseType: !424, size: 512, align: 32, offset: 2656)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, align: 32, elements: !425)
!425 = !{!40}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !405, file: !9, line: 366, baseType: !424, size: 512, align: 32, offset: 3168)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !405, file: !9, line: 367, baseType: !27, size: 32, align: 32, offset: 3680)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !405, file: !9, line: 368, baseType: !322, size: 64, align: 64, offset: 3712)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !405, file: !9, line: 369, baseType: !430, size: 128, align: 32, offset: 3776)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, align: 32, elements: !185)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !405, file: !9, line: 370, baseType: !430, size: 128, align: 32, offset: 3904)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !405, file: !9, line: 371, baseType: !166, size: 64, align: 64, offset: 4032)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !405, file: !9, line: 373, baseType: !27, size: 32, align: 32, offset: 4096)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !405, file: !9, line: 374, baseType: !27, size: 32, align: 32, offset: 4128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !405, file: !9, line: 375, baseType: !27, size: 32, align: 32, offset: 4160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !405, file: !9, line: 377, baseType: !27, size: 32, align: 32, offset: 4192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !405, file: !9, line: 378, baseType: !27, size: 32, align: 32, offset: 4224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !405, file: !9, line: 380, baseType: !27, size: 32, align: 32, offset: 4256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !405, file: !9, line: 382, baseType: !27, size: 32, align: 32, offset: 4288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !405, file: !9, line: 382, baseType: !27, size: 32, align: 32, offset: 4320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !405, file: !9, line: 382, baseType: !27, size: 32, align: 32, offset: 4352)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !405, file: !9, line: 382, baseType: !27, size: 32, align: 32, offset: 4384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !405, file: !9, line: 383, baseType: !27, size: 32, align: 32, offset: 4416)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !405, file: !9, line: 383, baseType: !27, size: 32, align: 32, offset: 4448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !405, file: !9, line: 383, baseType: !27, size: 32, align: 32, offset: 4480)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !405, file: !9, line: 383, baseType: !27, size: 32, align: 32, offset: 4512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !405, file: !9, line: 385, baseType: !27, size: 32, align: 32, offset: 4544)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !405, file: !9, line: 386, baseType: !27, size: 32, align: 32, offset: 4576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !405, file: !9, line: 387, baseType: !27, size: 32, align: 32, offset: 4608)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !405, file: !9, line: 390, baseType: !27, size: 32, align: 32, offset: 4640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !405, file: !9, line: 394, baseType: !30, size: 64, align: 64, offset: 4672)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !405, file: !9, line: 395, baseType: !27, size: 32, align: 32, offset: 4736)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !405, file: !9, line: 396, baseType: !27, size: 32, align: 32, offset: 4768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !405, file: !9, line: 397, baseType: !27, size: 32, align: 32, offset: 4800)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !405, file: !9, line: 398, baseType: !27, size: 32, align: 32, offset: 4832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !405, file: !9, line: 399, baseType: !27, size: 32, align: 32, offset: 4864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !405, file: !9, line: 401, baseType: !27, size: 32, align: 32, offset: 4896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !405, file: !9, line: 402, baseType: !27, size: 32, align: 32, offset: 4928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !405, file: !9, line: 403, baseType: !27, size: 32, align: 32, offset: 4960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !405, file: !9, line: 405, baseType: !27, size: 32, align: 32, offset: 4992)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !396, file: !1, line: 1803, type: !27)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !396, file: !1, line: 1803, type: !27)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !396, file: !1, line: 1803, type: !27)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !396, file: !1, line: 1803, type: !27)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !396, file: !1, line: 1805, type: !27)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !396, file: !1, line: 1806, type: !27)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8mode", scope: !396, file: !1, line: 1807, type: !27)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8pdir", scope: !396, file: !1, line: 1807, type: !27)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !396, file: !1, line: 1809, type: !27)
!470 = !DISubprogram(name: "buf2img", scope: !1, file: !1, line: 2201, type: !471, isLocal: false, isDefinition: true, scopeLine: 2202, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i8*, i32, i32, i32)* @buf2img, variables: !474)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !43, !473, !27, !27, !27}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imgX", arg: 1, scope: !470, file: !1, line: 2201, type: !43)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !470, file: !1, line: 2201, type: !473)
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_x", arg: 3, scope: !470, file: !1, line: 2201, type: !27)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_y", arg: 4, scope: !470, file: !1, line: 2201, type: !27)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol_size_in_bytes", arg: 5, scope: !470, file: !1, line: 2201, type: !27)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !470, file: !1, line: 2203, type: !27)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !470, file: !1, line: 2203, type: !27)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp16", scope: !470, file: !1, line: 2205, type: !29)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ui16", scope: !470, file: !1, line: 2205, type: !29)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp32", scope: !470, file: !1, line: 2206, type: !166)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ui32", scope: !470, file: !1, line: 2206, type: !166)
!486 = !DISubprogram(name: "writeout_picture", scope: !1, file: !1, line: 680, type: !487, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Picture*)* @writeout_picture, variables: !489)
!487 = !DISubroutineType(types: !488)
!488 = !{!27, !56}
!489 = !{!490, !491, !492, !493, !494}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic", arg: 1, scope: !486, file: !1, line: 680, type: !56)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !486, file: !1, line: 682, type: !80)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !486, file: !1, line: 683, type: !27)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slice", scope: !486, file: !1, line: 683, type: !27)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !486, file: !1, line: 684, type: !64)
!495 = !DISubprogram(name: "writeUnit", scope: !1, file: !1, line: 2438, type: !496, isLocal: true, isDefinition: true, scopeLine: 2439, flags: DIFlagPrototyped, isOptimized: true, variables: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !80, !27}
!498 = !{!499, !500, !501}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currStream", arg: 1, scope: !495, file: !1, line: 2438, type: !80)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "partition", arg: 2, scope: !495, file: !1, line: 2438, type: !27)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nalu", scope: !495, file: !1, line: 2440, type: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALU_t", file: !504, line: 49, baseType: !505)
!504 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalucommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!505 = !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 40, size: 256, align: 64, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "startcodeprefix_len", scope: !505, file: !504, line: 42, baseType: !27, size: 32, align: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !505, file: !504, line: 43, baseType: !104, size: 32, align: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !505, file: !504, line: 44, baseType: !104, size: 32, align: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !505, file: !504, line: 45, baseType: !27, size: 32, align: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !505, file: !504, line: 46, baseType: !27, size: 32, align: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_bit", scope: !505, file: !504, line: 47, baseType: !27, size: 32, align: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !505, file: !504, line: 48, baseType: !97, size: 64, align: 64, offset: 192)
!514 = !DISubprogram(name: "distortion_fld", scope: !1, file: !1, line: 938, type: !515, isLocal: true, isDefinition: true, scopeLine: 939, flags: DIFlagPrototyped, isOptimized: true, variables: !518)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517, !517, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!518 = !{!519, !520, !521}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dis_fld_y", arg: 1, scope: !514, file: !1, line: 938, type: !517)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dis_fld_u", arg: 2, scope: !514, file: !1, line: 938, type: !517)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dis_fld_v", arg: 3, scope: !514, file: !1, line: 938, type: !517)
!522 = !DISubprogram(name: "picture_structure_decision", scope: !1, file: !1, line: 967, type: !523, isLocal: true, isDefinition: true, scopeLine: 968, flags: DIFlagPrototyped, isOptimized: true, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!27, !56, !56, !56}
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 1, scope: !522, file: !1, line: 967, type: !56)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !522, file: !1, line: 967, type: !56)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bot", arg: 3, scope: !522, file: !1, line: 967, type: !56)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_picture", scope: !522, file: !1, line: 969, type: !30)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !522, file: !1, line: 970, type: !27)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "snr_frame", scope: !522, file: !1, line: 971, type: !31)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "snr_field", scope: !522, file: !1, line: 971, type: !31)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_frame", scope: !522, file: !1, line: 972, type: !27)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_field", scope: !522, file: !1, line: 972, type: !27)
!535 = !DISubprogram(name: "field_mode_buffer", scope: !1, file: !1, line: 992, type: !536, isLocal: true, isDefinition: true, scopeLine: 993, flags: DIFlagPrototyped, isOptimized: true, variables: !538)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !27, !31, !31, !31}
!538 = !{!539, !540, !541, !542}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bit_field", arg: 1, scope: !535, file: !1, line: 992, type: !27)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_field_y", arg: 2, scope: !535, file: !1, line: 992, type: !31)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_field_u", arg: 3, scope: !535, file: !1, line: 992, type: !31)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_field_v", arg: 4, scope: !535, file: !1, line: 992, type: !31)
!543 = !DISubprogram(name: "frame_mode_buffer", scope: !1, file: !1, line: 1008, type: !536, isLocal: true, isDefinition: true, scopeLine: 1009, flags: DIFlagPrototyped, isOptimized: true, variables: !544)
!544 = !{!545, !546, !547, !548}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bit_frame", arg: 1, scope: !543, file: !1, line: 1008, type: !27)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_frame_y", arg: 2, scope: !543, file: !1, line: 1008, type: !31)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_frame_u", arg: 3, scope: !543, file: !1, line: 1008, type: !31)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_frame_v", arg: 4, scope: !543, file: !1, line: 1008, type: !31)
!549 = !DISubprogram(name: "init_frame", scope: !1, file: !1, line: 1056, type: !34, isLocal: true, isDefinition: true, scopeLine: 1057, isOptimized: true, variables: !550)
!550 = !{!551, !552, !553}
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !549, file: !1, line: 1058, type: !27)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevP_no", scope: !549, file: !1, line: 1059, type: !27)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nextP_no", scope: !549, file: !1, line: 1059, type: !27)
!554 = !DISubprogram(name: "init_dec_ref_pic_marking_buffer", scope: !1, file: !1, line: 1044, type: !34, isLocal: true, isDefinition: true, scopeLine: 1045, isOptimized: true, variables: !290)
!555 = !DISubprogram(name: "init_field", scope: !1, file: !1, line: 1215, type: !34, isLocal: true, isDefinition: true, scopeLine: 1216, isOptimized: true, function: void ()* @init_field, variables: !556)
!556 = !{!557, !558, !559}
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !555, file: !1, line: 1217, type: !27)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevP_no", scope: !555, file: !1, line: 1218, type: !27)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nextP_no", scope: !555, file: !1, line: 1218, type: !27)
!560 = !DISubprogram(name: "GenerateFullPelRepresentation", scope: !1, file: !1, line: 1382, type: !561, isLocal: true, isDefinition: true, scopeLine: 1385, flags: DIFlagPrototyped, isOptimized: true, variables: !563)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !43, !44, !27, !27}
!563 = !{!564, !565, !566, !567, !568, !569}
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Fourthpel", arg: 1, scope: !560, file: !1, line: 1382, type: !43)
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Fullpel", arg: 2, scope: !560, file: !1, line: 1383, type: !44)
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xsize", arg: 3, scope: !560, file: !1, line: 1383, type: !27)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ysize", arg: 4, scope: !560, file: !1, line: 1384, type: !27)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !560, file: !1, line: 1386, type: !27)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !560, file: !1, line: 1386, type: !27)
!570 = !DISubprogram(name: "find_snr", scope: !1, file: !1, line: 1548, type: !34, isLocal: true, isDefinition: true, scopeLine: 1549, isOptimized: true, variables: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580}
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !570, file: !1, line: 1550, type: !27)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !570, file: !1, line: 1550, type: !27)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_y", scope: !570, file: !1, line: 1551, type: !322)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_u", scope: !570, file: !1, line: 1551, type: !322)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_v", scope: !570, file: !1, line: 1551, type: !322)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impix", scope: !570, file: !1, line: 1552, type: !27)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impix_cr", scope: !570, file: !1, line: 1553, type: !27)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pix_value_sqd", scope: !570, file: !1, line: 1554, type: !104)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pix_value_sqd_uv", scope: !570, file: !1, line: 1555, type: !104)
!581 = !DISubprogram(name: "find_distortion", scope: !1, file: !1, line: 1706, type: !34, isLocal: true, isDefinition: true, scopeLine: 1707, isOptimized: true, function: void ()* @find_distortion, variables: !582)
!582 = !{!583, !584, !585, !586, !587, !588}
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !581, file: !1, line: 1708, type: !27)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !581, file: !1, line: 1708, type: !27)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_y", scope: !581, file: !1, line: 1709, type: !322)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_u", scope: !581, file: !1, line: 1709, type: !322)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_v", scope: !581, file: !1, line: 1709, type: !322)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "impix", scope: !581, file: !1, line: 1710, type: !27)
!589 = !DISubprogram(name: "copy_motion_vectors_MB", scope: !1, file: !1, line: 1965, type: !34, isLocal: true, isDefinition: true, scopeLine: 1966, isOptimized: true, variables: !590)
!590 = !{!591, !592, !593, !594}
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !589, file: !1, line: 1967, type: !27)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !589, file: !1, line: 1967, type: !27)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !589, file: !1, line: 1967, type: !27)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !589, file: !1, line: 1967, type: !27)
!595 = !DISubprogram(name: "ReportNALNonVLCBits", scope: !1, file: !1, line: 2012, type: !596, isLocal: true, isDefinition: true, scopeLine: 2013, flags: DIFlagPrototyped, isOptimized: true, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !27, !27}
!598 = !{!599, !600}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !595, file: !1, line: 2012, type: !27)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !595, file: !1, line: 2012, type: !27)
!601 = !DISubprogram(name: "ReportFirstframe", scope: !1, file: !1, line: 2018, type: !596, isLocal: true, isDefinition: true, scopeLine: 2019, flags: DIFlagPrototyped, isOptimized: true, variables: !602)
!602 = !{!603, !604, !605}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !601, file: !1, line: 2018, type: !27)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !601, file: !1, line: 2018, type: !27)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits", scope: !601, file: !1, line: 2021, type: !27)
!606 = !DISubprogram(name: "ReportIntra", scope: !1, file: !1, line: 2044, type: !596, isLocal: true, isDefinition: true, scopeLine: 2045, flags: DIFlagPrototyped, isOptimized: true, variables: !607)
!607 = !{!608, !609}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !606, file: !1, line: 2044, type: !27)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !606, file: !1, line: 2044, type: !27)
!610 = !DISubprogram(name: "ReportSP", scope: !1, file: !1, line: 2060, type: !596, isLocal: true, isDefinition: true, scopeLine: 2061, flags: DIFlagPrototyped, isOptimized: true, variables: !611)
!611 = !{!612, !613}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !610, file: !1, line: 2060, type: !27)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !610, file: !1, line: 2060, type: !27)
!614 = !DISubprogram(name: "ReportRB", scope: !1, file: !1, line: 2068, type: !596, isLocal: true, isDefinition: true, scopeLine: 2069, flags: DIFlagPrototyped, isOptimized: true, variables: !615)
!615 = !{!616, !617}
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !614, file: !1, line: 2068, type: !27)
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !614, file: !1, line: 2068, type: !27)
!618 = !DISubprogram(name: "ReportB", scope: !1, file: !1, line: 2076, type: !596, isLocal: true, isDefinition: true, scopeLine: 2077, flags: DIFlagPrototyped, isOptimized: true, variables: !619)
!619 = !{!620, !621}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !618, file: !1, line: 2076, type: !27)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !618, file: !1, line: 2076, type: !27)
!622 = !DISubprogram(name: "ReportP", scope: !1, file: !1, line: 2085, type: !596, isLocal: true, isDefinition: true, scopeLine: 2086, flags: DIFlagPrototyped, isOptimized: true, variables: !623)
!623 = !{!624, !625}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_time", arg: 1, scope: !622, file: !1, line: 2085, type: !27)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "me_time", arg: 2, scope: !622, file: !1, line: 2085, type: !27)
!626 = !DISubprogram(name: "PaddAutoCropBorders", scope: !1, file: !1, line: 2118, type: !627, isLocal: true, isDefinition: true, scopeLine: 2120, flags: DIFlagPrototyped, isOptimized: true, variables: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !27, !27, !27, !27, !27, !27, !27, !27}
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "org_size_x", arg: 1, scope: !626, file: !1, line: 2118, type: !27)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "org_size_y", arg: 2, scope: !626, file: !1, line: 2118, type: !27)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_size_x", arg: 3, scope: !626, file: !1, line: 2118, type: !27)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_size_y", arg: 4, scope: !626, file: !1, line: 2118, type: !27)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "org_size_x_cr", arg: 5, scope: !626, file: !1, line: 2119, type: !27)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "org_size_y_cr", arg: 6, scope: !626, file: !1, line: 2119, type: !27)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_size_x_cr", arg: 7, scope: !626, file: !1, line: 2119, type: !27)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_size_y_cr", arg: 8, scope: !626, file: !1, line: 2119, type: !27)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !626, file: !1, line: 2121, type: !27)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !626, file: !1, line: 2121, type: !27)
!640 = !DISubprogram(name: "CalculateFrameNumber", scope: !1, file: !1, line: 2166, type: !255, isLocal: true, isDefinition: true, scopeLine: 2167, isOptimized: true, variables: !290)
!641 = !DISubprogram(name: "ReadOneFrame", scope: !1, file: !1, line: 2299, type: !642, isLocal: true, isDefinition: true, scopeLine: 2300, flags: DIFlagPrototyped, isOptimized: true, variables: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !27, !27, !27, !27, !27, !27}
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !654, !655, !656, !657, !659, !660}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "FrameNoInFile", arg: 1, scope: !641, file: !1, line: 2299, type: !27)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "HeaderSize", arg: 2, scope: !641, file: !1, line: 2299, type: !27)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xs", arg: 3, scope: !641, file: !1, line: 2299, type: !27)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ys", arg: 4, scope: !641, file: !1, line: 2299, type: !27)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xs_cr", arg: 5, scope: !641, file: !1, line: 2299, type: !27)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ys_cr", arg: 6, scope: !641, file: !1, line: 2299, type: !27)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol_size_in_bytes", scope: !641, file: !1, line: 2301, type: !104)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgsize_y", scope: !641, file: !1, line: 2303, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgsize_uv", scope: !641, file: !1, line: 2304, type: !653)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_y", scope: !641, file: !1, line: 2306, type: !653)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_uv", scope: !641, file: !1, line: 2307, type: !653)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "framesize_in_bytes", scope: !641, file: !1, line: 2309, type: !658)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !641, file: !1, line: 2310, type: !473)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rgb_input", scope: !641, file: !1, line: 2312, type: !239)
!661 = !DISubprogram(name: "put_buffer_frame", scope: !1, file: !1, line: 2397, type: !34, isLocal: true, isDefinition: true, scopeLine: 2398, isOptimized: true, variables: !290)
!662 = !DISubprogram(name: "put_buffer_top", scope: !1, file: !1, line: 2409, type: !34, isLocal: true, isDefinition: true, scopeLine: 2410, isOptimized: true, variables: !290)
!663 = !DISubprogram(name: "put_buffer_bot", scope: !1, file: !1, line: 2423, type: !34, isLocal: true, isDefinition: true, scopeLine: 2424, isOptimized: true, variables: !290)
!664 = !DISubprogram(name: "rdPictureCoding", scope: !1, file: !1, line: 2508, type: !34, isLocal: true, isDefinition: true, scopeLine: 2509, isOptimized: true, variables: !665)
!665 = !{!666, !667, !668, !669, !670, !671}
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "second_qp", scope: !664, file: !1, line: 2510, type: !27)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rd_qp", scope: !664, file: !1, line: 2510, type: !27)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "previntras", scope: !664, file: !1, line: 2511, type: !27)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevtype", scope: !664, file: !1, line: 2512, type: !27)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skip_encode", scope: !664, file: !1, line: 2513, type: !27)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sec_pps", scope: !664, file: !1, line: 2514, type: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !674)
!674 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !674, file: !4, line: 105, baseType: !239, size: 32, align: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !674, file: !4, line: 106, baseType: !104, size: 32, align: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !674, file: !4, line: 107, baseType: !104, size: 32, align: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !674, file: !4, line: 108, baseType: !239, size: 32, align: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !674, file: !4, line: 110, baseType: !239, size: 32, align: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !674, file: !4, line: 111, baseType: !239, size: 32, align: 32, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !674, file: !4, line: 112, baseType: !413, size: 256, align: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !674, file: !4, line: 115, baseType: !239, size: 32, align: 32, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !674, file: !4, line: 116, baseType: !104, size: 32, align: 32, offset: 480)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !674, file: !4, line: 117, baseType: !104, size: 32, align: 32, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !674, file: !4, line: 119, baseType: !687, size: 256, align: 32, offset: 544)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 256, align: 32, elements: !414)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !674, file: !4, line: 121, baseType: !687, size: 256, align: 32, offset: 800)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !674, file: !4, line: 122, baseType: !687, size: 256, align: 32, offset: 1056)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !674, file: !4, line: 124, baseType: !239, size: 32, align: 32, offset: 1312)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !674, file: !4, line: 125, baseType: !104, size: 32, align: 32, offset: 1344)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !674, file: !4, line: 127, baseType: !104, size: 32, align: 32, offset: 1376)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !674, file: !4, line: 128, baseType: !97, size: 64, align: 64, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !674, file: !4, line: 130, baseType: !27, size: 32, align: 32, offset: 1472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !674, file: !4, line: 131, baseType: !27, size: 32, align: 32, offset: 1504)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !674, file: !4, line: 132, baseType: !239, size: 32, align: 32, offset: 1536)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !674, file: !4, line: 133, baseType: !104, size: 32, align: 32, offset: 1568)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !674, file: !4, line: 134, baseType: !27, size: 32, align: 32, offset: 1600)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !674, file: !4, line: 135, baseType: !27, size: 32, align: 32, offset: 1632)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !674, file: !4, line: 136, baseType: !27, size: 32, align: 32, offset: 1664)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !674, file: !4, line: 138, baseType: !27, size: 32, align: 32, offset: 1696)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !674, file: !4, line: 139, baseType: !27, size: 32, align: 32, offset: 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !674, file: !4, line: 141, baseType: !239, size: 32, align: 32, offset: 1760)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !674, file: !4, line: 142, baseType: !239, size: 32, align: 32, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !674, file: !4, line: 143, baseType: !239, size: 32, align: 32, offset: 1824)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !674, file: !4, line: 144, baseType: !239, size: 32, align: 32, offset: 1856)
!707 = !{!708, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !726, !820, !821, !822, !824, !825, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !856, !859, !860, !861, !862, !863, !864, !867, !870, !871, !872, !873, !876, !877, !888, !923, !924, !925, !926, !927, !982, !983, !984, !985, !986, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1000, !1008, !1009, !1019, !1020, !1029, !1034, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!708 = !DIGlobalVariable(name: "ONE_FOURTH_TAP", scope: !0, file: !1, line: 114, type: !709, isLocal: false, isDefinition: true, variable: [3 x [2 x i32]]* @ONE_FOURTH_TAP)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 192, align: 32, elements: !242)
!710 = !DIGlobalVariable(name: "prev_frame_no", scope: !254, file: !1, line: 268, type: !27, isLocal: true, isDefinition: true, variable: i32* @encode_one_frame.prev_frame_no)
!711 = !DIGlobalVariable(name: "consecutive_non_reference_pictures", scope: !254, file: !1, line: 269, type: !27, isLocal: true, isDefinition: true, variable: i32* @encode_one_frame.consecutive_non_reference_pictures)
!712 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !56, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!713 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !56, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!714 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !56, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!715 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !56, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!716 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !56, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!717 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !43, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!718 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !46, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!719 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !720, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!721 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !104, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!722 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !104, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!723 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !27, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!724 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !27, isLocal: false, isDefinition: true, variable: i32* @me_time)
!725 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !672, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!726 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !727, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !729)
!729 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !729, file: !4, line: 151, baseType: !239, size: 32, align: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !729, file: !4, line: 153, baseType: !104, size: 32, align: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !729, file: !4, line: 154, baseType: !239, size: 32, align: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !729, file: !4, line: 155, baseType: !239, size: 32, align: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !729, file: !4, line: 156, baseType: !239, size: 32, align: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !729, file: !4, line: 157, baseType: !239, size: 32, align: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !729, file: !4, line: 158, baseType: !104, size: 32, align: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !729, file: !4, line: 159, baseType: !104, size: 32, align: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !729, file: !4, line: 160, baseType: !104, size: 32, align: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !729, file: !4, line: 162, baseType: !239, size: 32, align: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !729, file: !4, line: 163, baseType: !413, size: 256, align: 32, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !729, file: !4, line: 165, baseType: !104, size: 32, align: 32, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !729, file: !4, line: 166, baseType: !104, size: 32, align: 32, offset: 608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !729, file: !4, line: 167, baseType: !104, size: 32, align: 32, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !729, file: !4, line: 168, baseType: !104, size: 32, align: 32, offset: 672)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !729, file: !4, line: 170, baseType: !104, size: 32, align: 32, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !729, file: !4, line: 172, baseType: !239, size: 32, align: 32, offset: 736)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !729, file: !4, line: 173, baseType: !27, size: 32, align: 32, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !729, file: !4, line: 174, baseType: !27, size: 32, align: 32, offset: 800)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !729, file: !4, line: 175, baseType: !104, size: 32, align: 32, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !729, file: !4, line: 177, baseType: !752, size: 8192, align: 32, offset: 864)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 32, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !729, file: !4, line: 178, baseType: !104, size: 32, align: 32, offset: 9056)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !729, file: !4, line: 179, baseType: !239, size: 32, align: 32, offset: 9088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !729, file: !4, line: 180, baseType: !104, size: 32, align: 32, offset: 9120)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !729, file: !4, line: 181, baseType: !104, size: 32, align: 32, offset: 9152)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !729, file: !4, line: 182, baseType: !239, size: 32, align: 32, offset: 9184)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !729, file: !4, line: 184, baseType: !239, size: 32, align: 32, offset: 9216)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !729, file: !4, line: 185, baseType: !239, size: 32, align: 32, offset: 9248)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !729, file: !4, line: 186, baseType: !239, size: 32, align: 32, offset: 9280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !729, file: !4, line: 187, baseType: !104, size: 32, align: 32, offset: 9312)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !729, file: !4, line: 188, baseType: !104, size: 32, align: 32, offset: 9344)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !729, file: !4, line: 189, baseType: !104, size: 32, align: 32, offset: 9376)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !729, file: !4, line: 190, baseType: !104, size: 32, align: 32, offset: 9408)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !729, file: !4, line: 191, baseType: !239, size: 32, align: 32, offset: 9440)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !729, file: !4, line: 192, baseType: !769, size: 7584, align: 32, offset: 9472)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !770)
!770 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !770, file: !4, line: 65, baseType: !239, size: 32, align: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !770, file: !4, line: 66, baseType: !104, size: 32, align: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !770, file: !4, line: 67, baseType: !104, size: 32, align: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !770, file: !4, line: 68, baseType: !104, size: 32, align: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !770, file: !4, line: 69, baseType: !239, size: 32, align: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !770, file: !4, line: 70, baseType: !239, size: 32, align: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !770, file: !4, line: 71, baseType: !239, size: 32, align: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !770, file: !4, line: 72, baseType: !104, size: 32, align: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !770, file: !4, line: 73, baseType: !239, size: 32, align: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !770, file: !4, line: 74, baseType: !239, size: 32, align: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !770, file: !4, line: 75, baseType: !104, size: 32, align: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !770, file: !4, line: 76, baseType: !104, size: 32, align: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !770, file: !4, line: 77, baseType: !104, size: 32, align: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !770, file: !4, line: 78, baseType: !239, size: 32, align: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !770, file: !4, line: 79, baseType: !104, size: 32, align: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !770, file: !4, line: 80, baseType: !104, size: 32, align: 32, offset: 480)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !770, file: !4, line: 81, baseType: !239, size: 32, align: 32, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !770, file: !4, line: 82, baseType: !104, size: 32, align: 32, offset: 544)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !770, file: !4, line: 83, baseType: !104, size: 32, align: 32, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !770, file: !4, line: 84, baseType: !239, size: 32, align: 32, offset: 608)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !770, file: !4, line: 85, baseType: !239, size: 32, align: 32, offset: 640)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !770, file: !4, line: 86, baseType: !794, size: 3296, align: 32, offset: 672)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !795)
!795 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !796)
!796 = !{!797, !798, !799, !800, !803, !804, !805, !806, !807, !808}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !795, file: !4, line: 50, baseType: !104, size: 32, align: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !795, file: !4, line: 51, baseType: !104, size: 32, align: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !795, file: !4, line: 52, baseType: !104, size: 32, align: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !795, file: !4, line: 53, baseType: !801, size: 1024, align: 32, offset: 96)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1024, align: 32, elements: !802)
!802 = !{!41}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !795, file: !4, line: 54, baseType: !801, size: 1024, align: 32, offset: 1120)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !795, file: !4, line: 55, baseType: !801, size: 1024, align: 32, offset: 2144)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !795, file: !4, line: 56, baseType: !104, size: 32, align: 32, offset: 3168)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !795, file: !4, line: 57, baseType: !104, size: 32, align: 32, offset: 3200)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !795, file: !4, line: 58, baseType: !104, size: 32, align: 32, offset: 3232)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !795, file: !4, line: 59, baseType: !104, size: 32, align: 32, offset: 3264)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !770, file: !4, line: 87, baseType: !239, size: 32, align: 32, offset: 3968)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !770, file: !4, line: 88, baseType: !794, size: 3296, align: 32, offset: 4000)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !770, file: !4, line: 90, baseType: !239, size: 32, align: 32, offset: 7296)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !770, file: !4, line: 91, baseType: !239, size: 32, align: 32, offset: 7328)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !770, file: !4, line: 92, baseType: !239, size: 32, align: 32, offset: 7360)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !770, file: !4, line: 93, baseType: !104, size: 32, align: 32, offset: 7392)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !770, file: !4, line: 94, baseType: !104, size: 32, align: 32, offset: 7424)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !770, file: !4, line: 95, baseType: !104, size: 32, align: 32, offset: 7456)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !770, file: !4, line: 96, baseType: !104, size: 32, align: 32, offset: 7488)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !770, file: !4, line: 97, baseType: !104, size: 32, align: 32, offset: 7520)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !770, file: !4, line: 98, baseType: !104, size: 32, align: 32, offset: 7552)
!820 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !27, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!821 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !27, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
