; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/lencod.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !25, subprograms: !120, globals: !552, imports: !144)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/lencod.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8, !14, !21}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 111, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!12 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!13 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 192, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "P_SLICE", value: 0)
!17 = !DIEnumerator(name: "B_SLICE", value: 1)
!18 = !DIEnumerator(name: "I_SLICE", value: 2)
!19 = !DIEnumerator(name: "SP_SLICE", value: 3)
!20 = !DIEnumerator(name: "SI_SLICE", value: 4)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 178, size: 32, align: 32, elements: !22)
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "UVLC", value: 0)
!24 = !DIEnumerator(name: "CABAC", value: 1)
!25 = !{!26, !27, !28, !29, !30, !31, !99, !89, !105, !109, !110, !111, !112, !113, !114, !115, !117, !118, !119}
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !9, line: 406, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !9, line: 351, size: 5056, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !44, !46, !47, !48, !53, !57, !58, !59, !64, !67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !33, file: !9, line: 353, baseType: !26, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !33, file: !9, line: 354, baseType: !26, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !33, file: !9, line: 355, baseType: !26, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !33, file: !9, line: 356, baseType: !26, size: 32, align: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !33, file: !9, line: 357, baseType: !26, size: 32, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !33, file: !9, line: 358, baseType: !41, size: 256, align: 32, offset: 160)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, align: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !33, file: !9, line: 360, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !33, file: !9, line: 361, baseType: !45, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !33, file: !9, line: 363, baseType: !26, size: 32, align: 32, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !33, file: !9, line: 364, baseType: !49, size: 2048, align: 32, offset: 608)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, align: 32, elements: !50)
!50 = !{!51, !52, !52, !51}
!51 = !DISubrange(count: 2)
!52 = !DISubrange(count: 4)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !33, file: !9, line: 365, baseType: !54, size: 512, align: 32, offset: 2656)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 32, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !33, file: !9, line: 366, baseType: !54, size: 512, align: 32, offset: 3168)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !33, file: !9, line: 367, baseType: !26, size: 32, align: 32, offset: 3680)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !33, file: !9, line: 368, baseType: !60, size: 64, align: 64, offset: 3712)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !62, line: 30, baseType: !63)
!62 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !33, file: !9, line: 369, baseType: !65, size: 128, align: 32, offset: 3776)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, align: 32, elements: !66)
!66 = !{!52}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !33, file: !9, line: 370, baseType: !65, size: 128, align: 32, offset: 3904)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !33, file: !9, line: 371, baseType: !69, size: 64, align: 64, offset: 4032)
!69 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !33, file: !9, line: 373, baseType: !26, size: 32, align: 32, offset: 4096)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !33, file: !9, line: 374, baseType: !26, size: 32, align: 32, offset: 4128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !33, file: !9, line: 375, baseType: !26, size: 32, align: 32, offset: 4160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !33, file: !9, line: 377, baseType: !26, size: 32, align: 32, offset: 4192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !33, file: !9, line: 378, baseType: !26, size: 32, align: 32, offset: 4224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !33, file: !9, line: 380, baseType: !26, size: 32, align: 32, offset: 4256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !33, file: !9, line: 382, baseType: !26, size: 32, align: 32, offset: 4288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !33, file: !9, line: 382, baseType: !26, size: 32, align: 32, offset: 4320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !33, file: !9, line: 382, baseType: !26, size: 32, align: 32, offset: 4352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !33, file: !9, line: 382, baseType: !26, size: 32, align: 32, offset: 4384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !33, file: !9, line: 383, baseType: !26, size: 32, align: 32, offset: 4416)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !33, file: !9, line: 383, baseType: !26, size: 32, align: 32, offset: 4448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !33, file: !9, line: 383, baseType: !26, size: 32, align: 32, offset: 4480)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !33, file: !9, line: 383, baseType: !26, size: 32, align: 32, offset: 4512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !33, file: !9, line: 385, baseType: !26, size: 32, align: 32, offset: 4544)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !33, file: !9, line: 386, baseType: !26, size: 32, align: 32, offset: 4576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !33, file: !9, line: 387, baseType: !26, size: 32, align: 32, offset: 4608)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !33, file: !9, line: 390, baseType: !26, size: 32, align: 32, offset: 4640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !33, file: !9, line: 394, baseType: !89, size: 64, align: 64, offset: 4672)
!89 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !33, file: !9, line: 395, baseType: !26, size: 32, align: 32, offset: 4736)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !33, file: !9, line: 396, baseType: !26, size: 32, align: 32, offset: 4768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !33, file: !9, line: 397, baseType: !26, size: 32, align: 32, offset: 4800)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !33, file: !9, line: 398, baseType: !26, size: 32, align: 32, offset: 4832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !33, file: !9, line: 399, baseType: !26, size: 32, align: 32, offset: 4864)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !33, file: !9, line: 401, baseType: !26, size: 32, align: 32, offset: 4896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !33, file: !9, line: 402, baseType: !26, size: 32, align: 32, offset: 4928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !33, file: !9, line: 403, baseType: !26, size: 32, align: 32, offset: 4960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !33, file: !9, line: 405, baseType: !26, size: 32, align: 32, offset: 4992)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !101, line: 30, baseType: !102)
!101 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !103, line: 120, baseType: !104)
!103 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!120 = !{!121, !141, !145, !146, !151, !156, !157, !349, !354, !438, !462, !467, !472, !476, !477, !481, !492, !502, !512, !519, !527, !534, !537, !548, !551}
!121 = !DISubprogram(name: "main", scope: !1, file: !1, line: 212, type: !122, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !127)
!122 = !DISubroutineType(types: !123)
!123 = !{!26, !26, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !121, file: !1, line: 212, type: !26)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !121, file: !1, line: 212, type: !124)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "M", scope: !121, file: !1, line: 214, type: !26)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N", scope: !121, file: !1, line: 214, type: !26)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !121, file: !1, line: 214, type: !26)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !121, file: !1, line: 214, type: !26)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !121, file: !1, line: 214, type: !26)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bi", scope: !136, file: !1, line: 353, type: !26)
!136 = distinct !DILexicalBlock(scope: !137, file: !1, line: 352, column: 5)
!137 = distinct !DILexicalBlock(scope: !138, file: !1, line: 351, column: 9)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 306, column: 3)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 305, column: 3)
!140 = distinct !DILexicalBlock(scope: !121, file: !1, line: 305, column: 3)
!141 = !DISubprogram(name: "report_stats_on_error", scope: !1, file: !1, line: 487, type: !142, isLocal: false, isDefinition: true, scopeLine: 488, isOptimized: true, function: void ()* @report_stats_on_error, variables: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{null}
!144 = !{}
!145 = !DISubprogram(name: "init_poc", scope: !1, file: !1, line: 548, type: !142, isLocal: false, isDefinition: true, scopeLine: 549, isOptimized: true, function: void ()* @init_poc, variables: !144)
!146 = !DISubprogram(name: "CAVLC_init", scope: !1, file: !1, line: 599, type: !142, isLocal: false, isDefinition: true, scopeLine: 600, isOptimized: true, function: void ()* @CAVLC_init, variables: !147)
!147 = !{!148, !149, !150}
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !146, file: !1, line: 601, type: !28)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !146, file: !1, line: 601, type: !28)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !146, file: !1, line: 601, type: !28)
!151 = !DISubprogram(name: "init_img", scope: !1, file: !1, line: 622, type: !142, isLocal: false, isDefinition: true, scopeLine: 623, isOptimized: true, function: void ()* @init_img, variables: !152)
!152 = !{!153, !154, !155}
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !151, file: !1, line: 624, type: !26)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !151, file: !1, line: 624, type: !26)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byte_abs_range", scope: !151, file: !1, line: 625, type: !26)
!156 = !DISubprogram(name: "free_img", scope: !1, file: !1, line: 846, type: !142, isLocal: false, isDefinition: true, scopeLine: 847, isOptimized: true, function: void ()* @free_img, variables: !144)
!157 = !DISubprogram(name: "malloc_picture", scope: !1, file: !1, line: 930, type: !158, isLocal: false, isDefinition: true, scopeLine: 931, isOptimized: true, function: %struct.Picture* ()* @malloc_picture, variables: !347)
!158 = !DISubroutineType(types: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !163)
!163 = !{!164, !165, !166, !343, !344, !345, !346}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !162, file: !9, line: 477, baseType: !26, size: 32, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !162, file: !9, line: 478, baseType: !26, size: 32, align: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !162, file: !9, line: 479, baseType: !167, size: 6400, align: 64, offset: 64)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 6400, align: 64, elements: !341)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !255, !289, !316, !325, !326, !327, !328, !329, !330, !331, !332, !333, !338}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !170, file: !9, line: 445, baseType: !26, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !170, file: !9, line: 446, baseType: !26, size: 32, align: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !170, file: !9, line: 447, baseType: !26, size: 32, align: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !170, file: !9, line: 448, baseType: !26, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !170, file: !9, line: 449, baseType: !26, size: 32, align: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !170, file: !9, line: 450, baseType: !26, size: 32, align: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !170, file: !9, line: 451, baseType: !179, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !182)
!182 = !{!183, !203, !227}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !181, file: !9, line: 433, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !187)
!187 = !{!188, !189, !190, !194, !195, !196, !197, !198, !199, !200, !202}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !186, file: !9, line: 413, baseType: !26, size: 32, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !186, file: !9, line: 414, baseType: !26, size: 32, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !186, file: !9, line: 415, baseType: !191, size: 8, align: 8, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !192, line: 30, baseType: !193)
!192 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!193 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !186, file: !9, line: 416, baseType: !26, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !186, file: !9, line: 417, baseType: !26, size: 32, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !186, file: !9, line: 418, baseType: !191, size: 8, align: 8, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !186, file: !9, line: 420, baseType: !191, size: 8, align: 8, offset: 168)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !186, file: !9, line: 421, baseType: !26, size: 32, align: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !186, file: !9, line: 422, baseType: !26, size: 32, align: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !186, file: !9, line: 424, baseType: !201, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !186, file: !9, line: 425, baseType: !26, size: 32, align: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !181, file: !9, line: 434, baseType: !204, size: 832, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !205, file: !9, line: 209, baseType: !28, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !205, file: !9, line: 209, baseType: !28, size: 32, align: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !205, file: !9, line: 210, baseType: !28, size: 32, align: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !205, file: !9, line: 211, baseType: !28, size: 32, align: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !205, file: !9, line: 212, baseType: !28, size: 32, align: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !205, file: !9, line: 213, baseType: !201, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !205, file: !9, line: 214, baseType: !29, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !205, file: !9, line: 217, baseType: !28, size: 32, align: 32, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !205, file: !9, line: 217, baseType: !28, size: 32, align: 32, offset: 352)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !205, file: !9, line: 218, baseType: !28, size: 32, align: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !205, file: !9, line: 219, baseType: !28, size: 32, align: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !205, file: !9, line: 220, baseType: !28, size: 32, align: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !205, file: !9, line: 221, baseType: !201, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !205, file: !9, line: 222, baseType: !29, size: 64, align: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !205, file: !9, line: 223, baseType: !26, size: 32, align: 32, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !205, file: !9, line: 223, baseType: !26, size: 32, align: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !205, file: !9, line: 224, baseType: !26, size: 32, align: 32, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !205, file: !9, line: 224, baseType: !26, size: 32, align: 32, offset: 736)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !205, file: !9, line: 225, baseType: !26, size: 32, align: 32, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !205, file: !9, line: 225, baseType: !26, size: 32, align: 32, offset: 800)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !181, file: !9, line: 436, baseType: !228, size: 64, align: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!26, !231, !254}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !247}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !9, line: 329, baseType: !26, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !233, file: !9, line: 330, baseType: !26, size: 32, align: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !233, file: !9, line: 331, baseType: !26, size: 32, align: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !233, file: !9, line: 332, baseType: !26, size: 32, align: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !233, file: !9, line: 333, baseType: !26, size: 32, align: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !233, file: !9, line: 334, baseType: !28, size: 32, align: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !233, file: !9, line: 335, baseType: !26, size: 32, align: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !233, file: !9, line: 336, baseType: !26, size: 32, align: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !233, file: !9, line: 344, baseType: !244, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !26, !26, !29, !29}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !233, file: !9, line: 346, baseType: !248, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !251, !252}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !170, file: !9, line: 452, baseType: !256, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !259)
!259 = !{!260, !271, !275, !279, !283, !285, !286}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !258, file: !9, line: 260, baseType: !261, size: 4224, align: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 4224, align: 64, elements: !268)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !264)
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !263, file: !9, line: 233, baseType: !108, size: 16, align: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !263, file: !9, line: 234, baseType: !193, size: 8, align: 8, offset: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !263, file: !9, line: 236, baseType: !69, size: 64, align: 64, offset: 64)
!268 = !{!269, !270}
!269 = !DISubrange(count: 3)
!270 = !DISubrange(count: 11)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !258, file: !9, line: 261, baseType: !272, size: 2304, align: 64, offset: 4224)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 2304, align: 64, elements: !273)
!273 = !{!51, !274}
!274 = !DISubrange(count: 9)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !258, file: !9, line: 262, baseType: !276, size: 2560, align: 64, offset: 6528)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 2560, align: 64, elements: !277)
!277 = !{!51, !278}
!278 = !DISubrange(count: 10)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !258, file: !9, line: 263, baseType: !280, size: 1536, align: 64, offset: 9088)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1536, align: 64, elements: !281)
!281 = !{!51, !282}
!282 = !DISubrange(count: 6)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !258, file: !9, line: 264, baseType: !284, size: 512, align: 64, offset: 10624)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 512, align: 64, elements: !66)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !258, file: !9, line: 265, baseType: !284, size: 512, align: 64, offset: 11136)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !258, file: !9, line: 266, baseType: !287, size: 384, align: 64, offset: 11648)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 384, align: 64, elements: !288)
!288 = !{!269}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !170, file: !9, line: 453, baseType: !290, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !293)
!293 = !{!294, !297, !298, !301, !304, !308, !309, !313, !314, !315}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !292, file: !9, line: 283, baseType: !295, size: 256, align: 64)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 256, align: 64, elements: !296)
!296 = !{!51}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !292, file: !9, line: 284, baseType: !284, size: 512, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !292, file: !9, line: 285, baseType: !299, size: 1536, align: 64, offset: 768)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1536, align: 64, elements: !300)
!300 = !{!269, !52}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !292, file: !9, line: 286, baseType: !302, size: 5120, align: 64, offset: 2304)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 5120, align: 64, elements: !303)
!303 = !{!278, !52}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !292, file: !9, line: 287, baseType: !305, size: 19200, align: 64, offset: 7424)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 19200, align: 64, elements: !306)
!306 = !{!278, !307}
!307 = !DISubrange(count: 15)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !292, file: !9, line: 288, baseType: !305, size: 19200, align: 64, offset: 26624)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !292, file: !9, line: 289, baseType: !310, size: 6400, align: 64, offset: 45824)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 6400, align: 64, elements: !311)
!311 = !{!278, !312}
!312 = !DISubrange(count: 5)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !292, file: !9, line: 290, baseType: !310, size: 6400, align: 64, offset: 52224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !292, file: !9, line: 291, baseType: !305, size: 19200, align: 64, offset: 58624)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !292, file: !9, line: 292, baseType: !305, size: 19200, align: 64, offset: 77824)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !170, file: !9, line: 456, baseType: !317, size: 64, align: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !319, file: !9, line: 310, baseType: !26, size: 32, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !319, file: !9, line: 311, baseType: !26, size: 32, align: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !319, file: !9, line: 312, baseType: !324, size: 64, align: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !170, file: !9, line: 458, baseType: !26, size: 32, align: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !170, file: !9, line: 459, baseType: !29, size: 64, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !170, file: !9, line: 460, baseType: !29, size: 64, align: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !170, file: !9, line: 461, baseType: !29, size: 64, align: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !170, file: !9, line: 462, baseType: !26, size: 32, align: 32, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !170, file: !9, line: 463, baseType: !29, size: 64, align: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !170, file: !9, line: 464, baseType: !29, size: 64, align: 64, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !170, file: !9, line: 465, baseType: !29, size: 64, align: 64, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !170, file: !9, line: 467, baseType: !334, size: 64, align: 64, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !26}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !170, file: !9, line: 469, baseType: !339, size: 192, align: 32, offset: 1024)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 32, elements: !340)
!340 = !{!269, !51}
!341 = !{!342}
!342 = !DISubrange(count: 100)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !162, file: !9, line: 480, baseType: !26, size: 32, align: 32, offset: 6464)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !162, file: !9, line: 481, baseType: !27, size: 32, align: 32, offset: 6496)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !162, file: !9, line: 482, baseType: !27, size: 32, align: 32, offset: 6528)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !162, file: !9, line: 483, baseType: !27, size: 32, align: 32, offset: 6560)
!347 = !{!348}
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic", scope: !157, file: !1, line: 932, type: !160)
!349 = !DISubprogram(name: "free_picture", scope: !1, file: !1, line: 948, type: !350, isLocal: false, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Picture*)* @free_picture, variables: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !160}
!352 = !{!353}
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic", arg: 1, scope: !349, file: !1, line: 948, type: !160)
!354 = !DISubprogram(name: "report_frame_statistic", scope: !1, file: !1, line: 964, type: !142, isLocal: false, isDefinition: true, scopeLine: 965, isOptimized: true, function: void ()* @report_frame_statistic, variables: !355)
!355 = !{!356, !411, !412, !416, !417, !418, !434}
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_stat_frm", scope: !354, file: !1, line: 966, type: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !359, line: 153, baseType: !360)
!359 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !359, line: 122, size: 1216, align: 64, elements: !361)
!361 = !{!362, !364, !365, !366, !367, !368, !373, !374, !375, !379, !383, !391, !397, !398, !401, !402, !404, !408, !409, !410}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !360, file: !359, line: 123, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !360, file: !359, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !360, file: !359, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !360, file: !359, line: 126, baseType: !116, size: 16, align: 16, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !360, file: !359, line: 127, baseType: !116, size: 16, align: 16, offset: 144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !360, file: !359, line: 128, baseType: !369, size: 128, align: 64, offset: 192)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !359, line: 88, size: 128, align: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !369, file: !359, line: 89, baseType: !363, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !369, file: !359, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !360, file: !359, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !360, file: !359, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !360, file: !359, line: 133, baseType: !376, size: 64, align: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!26, !30}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !360, file: !359, line: 134, baseType: !380, size: 64, align: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!26, !30, !125, !26}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !360, file: !359, line: 135, baseType: !384, size: 64, align: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !30, !387, !26}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !359, line: 77, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !389, line: 71, baseType: !390)
!389 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !103, line: 46, baseType: !63)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !360, file: !359, line: 136, baseType: !392, size: 64, align: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!26, !30, !395, !26}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !360, file: !359, line: 139, baseType: !369, size: 128, align: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !360, file: !359, line: 140, baseType: !399, size: 64, align: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !359, line: 94, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !360, file: !359, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !360, file: !359, line: 144, baseType: !403, size: 24, align: 8, offset: 928)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 24, align: 8, elements: !288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !360, file: !359, line: 145, baseType: !405, size: 8, align: 8, offset: 952)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 8, align: 8, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 1)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !360, file: !359, line: 148, baseType: !369, size: 128, align: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !360, file: !359, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !360, file: !359, line: 152, baseType: !387, size: 64, align: 64, offset: 1152)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !354, file: !1, line: 971, type: !26)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !354, file: !1, line: 972, type: !413)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 160, align: 8, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 20)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitcounter", scope: !354, file: !1, line: 973, type: !26)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !354, file: !1, line: 976, type: !100)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l_time", scope: !354, file: !1, line: 977, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !421, line: 73, size: 448, align: 64, elements: !422)
!421 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !420, file: !421, line: 74, baseType: !26, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !420, file: !421, line: 75, baseType: !26, size: 32, align: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !420, file: !421, line: 76, baseType: !26, size: 32, align: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !420, file: !421, line: 77, baseType: !26, size: 32, align: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !420, file: !421, line: 78, baseType: !26, size: 32, align: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !420, file: !421, line: 79, baseType: !26, size: 32, align: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !420, file: !421, line: 80, baseType: !26, size: 32, align: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !420, file: !421, line: 81, baseType: !26, size: 32, align: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !420, file: !421, line: 82, baseType: !26, size: 32, align: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !420, file: !421, line: 83, baseType: !104, size: 64, align: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !420, file: !421, line: 84, baseType: !125, size: 64, align: 64, offset: 384)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !354, file: !1, line: 978, type: !435)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8000, align: 8, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 1000)
!438 = !DISubprogram(name: "report", scope: !1, file: !1, line: 1175, type: !142, isLocal: false, isDefinition: true, scopeLine: 1176, isOptimized: true, function: void ()* @report, variables: !439)
!439 = !{!440, !443, !444, !445, !446, !447, !448, !450, !451, !452, !453, !460, !461}
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_use", scope: !438, file: !1, line: 1177, type: !441)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 320, align: 32, elements: !442)
!442 = !{!312, !51}
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !438, file: !1, line: 1178, type: !26)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !438, file: !1, line: 1178, type: !26)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !438, file: !1, line: 1179, type: !413)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total_bits", scope: !438, file: !1, line: 1180, type: !26)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_rate", scope: !438, file: !1, line: 1181, type: !27)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mean_motion_info_bit_use", scope: !438, file: !1, line: 1182, type: !449)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, align: 32, elements: !296)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !438, file: !1, line: 1185, type: !100)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l_time", scope: !438, file: !1, line: 1186, type: !419)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !438, file: !1, line: 1187, type: !435)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seqtype", scope: !454, file: !1, line: 1263, type: !457)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 1262, column: 3)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 1261, column: 11)
!456 = distinct !DILexicalBlock(scope: !438, file: !1, line: 1256, column: 6)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 640, align: 8, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 80)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !454, file: !1, line: 1264, type: !26)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !454, file: !1, line: 1264, type: !26)
!462 = !DISubprogram(name: "information_init", scope: !1, file: !1, line: 1803, type: !142, isLocal: false, isDefinition: true, scopeLine: 1804, isOptimized: true, function: void ()* @information_init, variables: !463)
!463 = !{!464}
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yuv_types", scope: !462, file: !1, line: 1805, type: !465)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, align: 8, elements: !466)
!466 = !{!52, !278}
!467 = !DISubprogram(name: "init_orig_buffers", scope: !1, file: !1, line: 1827, type: !468, isLocal: false, isDefinition: true, scopeLine: 1828, isOptimized: true, function: i32 ()* @init_orig_buffers, variables: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!26}
!470 = !{!471}
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memory_size", scope: !467, file: !1, line: 1829, type: !26)
!472 = !DISubprogram(name: "init_global_buffers", scope: !1, file: !1, line: 1871, type: !468, isLocal: false, isDefinition: true, scopeLine: 1872, isOptimized: true, function: i32 ()* @init_global_buffers, variables: !473)
!473 = !{!474, !475}
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !472, file: !1, line: 1873, type: !26)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memory_size", scope: !472, file: !1, line: 1873, type: !26)
!476 = !DISubprogram(name: "free_orig_planes", scope: !1, file: !1, line: 1958, type: !142, isLocal: false, isDefinition: true, scopeLine: 1959, isOptimized: true, function: void ()* @free_orig_planes, variables: !144)
!477 = !DISubprogram(name: "free_global_buffers", scope: !1, file: !1, line: 1994, type: !142, isLocal: false, isDefinition: true, scopeLine: 1995, isOptimized: true, function: void ()* @free_global_buffers, variables: !478)
!478 = !{!479, !480}
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !477, file: !1, line: 1996, type: !26)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !477, file: !1, line: 1996, type: !26)
!481 = !DISubprogram(name: "get_mem_mv", scope: !1, file: !1, line: 2104, type: !482, isLocal: false, isDefinition: true, scopeLine: 2105, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16*******)* @get_mem_mv, variables: !485)
!482 = !DISubroutineType(types: !483)
!483 = !{!26, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!485 = !{!486, !487, !488, !489, !490, !491}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv", arg: 1, scope: !481, file: !1, line: 2104, type: !484)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !481, file: !1, line: 2106, type: !26)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !481, file: !1, line: 2106, type: !26)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !481, file: !1, line: 2106, type: !26)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !481, file: !1, line: 2106, type: !26)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !481, file: !1, line: 2106, type: !26)
!492 = !DISubprogram(name: "free_mem_mv", scope: !1, file: !1, line: 2145, type: !493, isLocal: false, isDefinition: true, scopeLine: 2146, flags: DIFlagPrototyped, isOptimized: true, function: void (i16******)* @free_mem_mv, variables: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !110}
!495 = !{!496, !497, !498, !499, !500, !501}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv", arg: 1, scope: !492, file: !1, line: 2145, type: !110)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !492, file: !1, line: 2147, type: !26)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !492, file: !1, line: 2147, type: !26)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !492, file: !1, line: 2147, type: !26)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !492, file: !1, line: 2147, type: !26)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !492, file: !1, line: 2147, type: !26)
!502 = !DISubprogram(name: "get_mem_ACcoeff", scope: !1, file: !1, line: 2182, type: !503, isLocal: false, isDefinition: true, scopeLine: 2183, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*****)* @get_mem_ACcoeff, variables: !506)
!503 = !DISubroutineType(types: !504)
!504 = !{!26, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!506 = !{!507, !508, !509, !510, !511}
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cofAC", arg: 1, scope: !502, file: !1, line: 2182, type: !505)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !502, file: !1, line: 2184, type: !26)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !502, file: !1, line: 2184, type: !26)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !502, file: !1, line: 2184, type: !26)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_blk8x8", scope: !502, file: !1, line: 2185, type: !26)
!512 = !DISubprogram(name: "get_mem_DCcoeff", scope: !1, file: !1, line: 2209, type: !513, isLocal: false, isDefinition: true, scopeLine: 2210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32****)* @get_mem_DCcoeff, variables: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!26, !117}
!515 = !{!516, !517, !518}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cofDC", arg: 1, scope: !512, file: !1, line: 2209, type: !117)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !512, file: !1, line: 2211, type: !26)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !512, file: !1, line: 2211, type: !26)
!519 = !DISubprogram(name: "free_mem_ACcoeff", scope: !1, file: !1, line: 2232, type: !520, isLocal: false, isDefinition: true, scopeLine: 2233, flags: DIFlagPrototyped, isOptimized: true, function: void (i32****)* @free_mem_ACcoeff, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !117}
!522 = !{!523, !524, !525, !526}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cofAC", arg: 1, scope: !519, file: !1, line: 2232, type: !117)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !519, file: !1, line: 2234, type: !26)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !519, file: !1, line: 2234, type: !26)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !519, file: !1, line: 2234, type: !26)
!527 = !DISubprogram(name: "free_mem_DCcoeff", scope: !1, file: !1, line: 2257, type: !528, isLocal: false, isDefinition: true, scopeLine: 2258, flags: DIFlagPrototyped, isOptimized: true, function: void (i32***)* @free_mem_DCcoeff, variables: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !118}
!530 = !{!531, !532, !533}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cofDC", arg: 1, scope: !527, file: !1, line: 2257, type: !118)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !527, file: !1, line: 2259, type: !26)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !527, file: !1, line: 2259, type: !26)
!534 = !DISubprogram(name: "combine_field", scope: !1, file: !1, line: 2279, type: !142, isLocal: false, isDefinition: true, scopeLine: 2280, isOptimized: true, function: void ()* @combine_field, variables: !535)
!535 = !{!536}
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !534, file: !1, line: 2281, type: !26)
!537 = !DISubprogram(name: "decide_fld_frame", scope: !1, file: !1, line: 2307, type: !538, isLocal: false, isDefinition: true, scopeLine: 2308, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float, float, i32, i32, double)* @decide_fld_frame, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!26, !27, !27, !26, !26, !89}
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_frame_Y", arg: 1, scope: !537, file: !1, line: 2307, type: !27)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snr_field_Y", arg: 2, scope: !537, file: !1, line: 2307, type: !27)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bit_field", arg: 3, scope: !537, file: !1, line: 2307, type: !26)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bit_frame", arg: 4, scope: !537, file: !1, line: 2307, type: !26)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda_picture", arg: 5, scope: !537, file: !1, line: 2307, type: !89)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost_frame", scope: !537, file: !1, line: 2309, type: !89)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost_field", scope: !537, file: !1, line: 2309, type: !89)
!548 = !DISubprogram(name: "process_2nd_IGOP", scope: !1, file: !1, line: 2326, type: !142, isLocal: false, isDefinition: true, scopeLine: 2327, isOptimized: true, function: void ()* @process_2nd_IGOP, variables: !549)
!549 = !{!550}
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "FirstIGOPFinished", scope: !548, file: !1, line: 2328, type: !337)
!551 = !DISubprogram(name: "SetImgType", scope: !1, file: !1, line: 2356, type: !142, isLocal: false, isDefinition: true, scopeLine: 2357, isOptimized: true, function: void ()* @SetImgType, variables: !144)
!552 = !{!553, !716, !922, !965, !983, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1056, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1193, !1196, !1197, !1198, !1199, !1200, !1201, !1212, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1266, !1268, !1276, !1277, !1287, !1288, !1297, !1314, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1360, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424}
!553 = !DIGlobalVariable(name: "input", scope: !0, file: !1, line: 177, type: !554, isLocal: false, isDefinition: true, variable: %struct.InputParameters** @input)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !9, line: 865, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 661, size: 28736, align: 64, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !581, !582, !583, !584, !585, !586, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !714, !715}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ProfileIDC", scope: !556, file: !9, line: 663, baseType: !26, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "LevelIDC", scope: !556, file: !9, line: 664, baseType: !26, size: 32, align: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "no_frames", scope: !556, file: !9, line: 666, baseType: !26, size: 32, align: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "qp0", scope: !556, file: !9, line: 667, baseType: !26, size: 32, align: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "qpN", scope: !556, file: !9, line: 668, baseType: !26, size: 32, align: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "jumpd", scope: !556, file: !9, line: 669, baseType: !26, size: 32, align: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard", scope: !556, file: !9, line: 670, baseType: !26, size: 32, align: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "hadamardqpel", scope: !556, file: !9, line: 672, baseType: !26, size: 32, align: 32, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "search_range", scope: !556, file: !9, line: 673, baseType: !26, size: 32, align: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !556, file: !9, line: 676, baseType: !26, size: 32, align: 32, offset: 288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "P_List0_refs", scope: !556, file: !9, line: 677, baseType: !26, size: 32, align: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "B_List0_refs", scope: !556, file: !9, line: 678, baseType: !26, size: 32, align: 32, offset: 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "B_List1_refs", scope: !556, file: !9, line: 679, baseType: !26, size: 32, align: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Log2MaxFrameNum", scope: !556, file: !9, line: 680, baseType: !26, size: 32, align: 32, offset: 416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ResendPPS", scope: !556, file: !9, line: 681, baseType: !26, size: 32, align: 32, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GenerateMultiplePPS", scope: !556, file: !9, line: 682, baseType: !26, size: 32, align: 32, offset: 480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "img_width", scope: !556, file: !9, line: 684, baseType: !26, size: 32, align: 32, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "img_height", scope: !556, file: !9, line: 685, baseType: !26, size: 32, align: 32, offset: 544)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !556, file: !9, line: 686, baseType: !26, size: 32, align: 32, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "intra_upd", scope: !556, file: !9, line: 687, baseType: !26, size: 32, align: 32, offset: 608)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "blc_size", scope: !556, file: !9, line: 691, baseType: !579, size: 512, align: 32, offset: 640)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 32, elements: !580)
!580 = !{!43, !51}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "part_size", scope: !556, file: !9, line: 692, baseType: !579, size: 512, align: 32, offset: 1152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "slice_mode", scope: !556, file: !9, line: 693, baseType: !26, size: 32, align: 32, offset: 1664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "slice_argument", scope: !556, file: !9, line: 694, baseType: !26, size: 32, align: 32, offset: 1696)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "UseConstrainedIntraPred", scope: !556, file: !9, line: 695, baseType: !26, size: 32, align: 32, offset: 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "infile_header", scope: !556, file: !9, line: 696, baseType: !26, size: 32, align: 32, offset: 1760)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !556, file: !9, line: 697, baseType: !587, size: 1600, align: 8, offset: 1792)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1600, align: 8, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 200)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !556, file: !9, line: 698, baseType: !587, size: 1600, align: 8, offset: 3392)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ReconFile", scope: !556, file: !9, line: 699, baseType: !587, size: 1600, align: 8, offset: 4992)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "TraceFile", scope: !556, file: !9, line: 700, baseType: !587, size: 1600, align: 8, offset: 6592)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "QmatrixFile", scope: !556, file: !9, line: 701, baseType: !587, size: 1600, align: 8, offset: 8192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "intra_period", scope: !556, file: !9, line: 702, baseType: !26, size: 32, align: 32, offset: 9792)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "idr_enable", scope: !556, file: !9, line: 704, baseType: !26, size: 32, align: 32, offset: 9824)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !556, file: !9, line: 705, baseType: !26, size: 32, align: 32, offset: 9856)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "successive_Bframe", scope: !556, file: !9, line: 708, baseType: !26, size: 32, align: 32, offset: 9888)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "qpB", scope: !556, file: !9, line: 709, baseType: !26, size: 32, align: 32, offset: 9920)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "qpBRSOffset", scope: !556, file: !9, line: 710, baseType: !26, size: 32, align: 32, offset: 9952)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !556, file: !9, line: 711, baseType: !26, size: 32, align: 32, offset: 9984)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "directInferenceFlag", scope: !556, file: !9, line: 712, baseType: !26, size: 32, align: 32, offset: 10016)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMotionEstimation", scope: !556, file: !9, line: 714, baseType: !26, size: 32, align: 32, offset: 10048)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMERefinements", scope: !556, file: !9, line: 715, baseType: !26, size: 32, align: 32, offset: 10080)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMESearchRange", scope: !556, file: !9, line: 716, baseType: !26, size: 32, align: 32, offset: 10112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "BiPredMESubPel", scope: !556, file: !9, line: 717, baseType: !26, size: 32, align: 32, offset: 10144)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sp_periodicity", scope: !556, file: !9, line: 721, baseType: !26, size: 32, align: 32, offset: 10176)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !556, file: !9, line: 722, baseType: !26, size: 32, align: 32, offset: 10208)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp_pred", scope: !556, file: !9, line: 723, baseType: !26, size: 32, align: 32, offset: 10240)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "WeightedPrediction", scope: !556, file: !9, line: 725, baseType: !26, size: 32, align: 32, offset: 10272)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "WeightedBiprediction", scope: !556, file: !9, line: 726, baseType: !26, size: 32, align: 32, offset: 10304)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "UseWeightedReferenceME", scope: !556, file: !9, line: 727, baseType: !26, size: 32, align: 32, offset: 10336)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "RDPictureDecision", scope: !556, file: !9, line: 728, baseType: !26, size: 32, align: 32, offset: 10368)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "RDPictureIntra", scope: !556, file: !9, line: 729, baseType: !26, size: 32, align: 32, offset: 10400)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "RDPSliceWeightOnly", scope: !556, file: !9, line: 730, baseType: !26, size: 32, align: 32, offset: 10432)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "RDBSliceWeightOnly", scope: !556, file: !9, line: 731, baseType: !26, size: 32, align: 32, offset: 10464)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "SkipIntraInInterSlices", scope: !556, file: !9, line: 732, baseType: !26, size: 32, align: 32, offset: 10496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "BRefPictures", scope: !556, file: !9, line: 733, baseType: !26, size: 32, align: 32, offset: 10528)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "PyramidCoding", scope: !556, file: !9, line: 734, baseType: !26, size: 32, align: 32, offset: 10560)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ExplicitPyramidFormat", scope: !556, file: !9, line: 735, baseType: !620, size: 8192, align: 8, offset: 10592)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8192, align: 8, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 1024)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "PyramidRefReorder", scope: !556, file: !9, line: 736, baseType: !26, size: 32, align: 32, offset: 18784)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "PocMemoryManagement", scope: !556, file: !9, line: 737, baseType: !26, size: 32, align: 32, offset: 18816)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_mode", scope: !556, file: !9, line: 739, baseType: !26, size: 32, align: 32, offset: 18848)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "of_mode", scope: !556, file: !9, line: 740, baseType: !26, size: 32, align: 32, offset: 18880)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "partition_mode", scope: !556, file: !9, line: 741, baseType: !26, size: 32, align: 32, offset: 18912)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch16x16", scope: !556, file: !9, line: 743, baseType: !26, size: 32, align: 32, offset: 18944)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch16x8", scope: !556, file: !9, line: 744, baseType: !26, size: 32, align: 32, offset: 18976)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch8x16", scope: !556, file: !9, line: 745, baseType: !26, size: 32, align: 32, offset: 19008)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch8x8", scope: !556, file: !9, line: 746, baseType: !26, size: 32, align: 32, offset: 19040)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch8x4", scope: !556, file: !9, line: 747, baseType: !26, size: 32, align: 32, offset: 19072)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch4x8", scope: !556, file: !9, line: 748, baseType: !26, size: 32, align: 32, offset: 19104)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "InterSearch4x4", scope: !556, file: !9, line: 749, baseType: !26, size: 32, align: 32, offset: 19136)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "IntraDisableInterOnly", scope: !556, file: !9, line: 751, baseType: !26, size: 32, align: 32, offset: 19168)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Intra4x4ParDisable", scope: !556, file: !9, line: 752, baseType: !26, size: 32, align: 32, offset: 19200)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Intra4x4DiagDisable", scope: !556, file: !9, line: 753, baseType: !26, size: 32, align: 32, offset: 19232)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Intra4x4DirDisable", scope: !556, file: !9, line: 754, baseType: !26, size: 32, align: 32, offset: 19264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Intra16x16ParDisable", scope: !556, file: !9, line: 755, baseType: !26, size: 32, align: 32, offset: 19296)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Intra16x16PlaneDisable", scope: !556, file: !9, line: 756, baseType: !26, size: 32, align: 32, offset: 19328)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaIntraDisable", scope: !556, file: !9, line: 757, baseType: !26, size: 32, align: 32, offset: 19360)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "FrameRate", scope: !556, file: !9, line: 759, baseType: !89, size: 64, align: 64, offset: 19392)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !556, file: !9, line: 761, baseType: !26, size: 32, align: 32, offset: 19456)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "full_search", scope: !556, file: !9, line: 763, baseType: !26, size: 32, align: 32, offset: 19488)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "last_frame", scope: !556, file: !9, line: 766, baseType: !26, size: 32, align: 32, offset: 19520)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "qpN2", scope: !556, file: !9, line: 769, baseType: !26, size: 32, align: 32, offset: 19552)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "qpB2", scope: !556, file: !9, line: 769, baseType: !26, size: 32, align: 32, offset: 19584)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "qp2start", scope: !556, file: !9, line: 769, baseType: !26, size: 32, align: 32, offset: 19616)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "qp02", scope: !556, file: !9, line: 770, baseType: !26, size: 32, align: 32, offset: 19648)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "qpBRS2Offset", scope: !556, file: !9, line: 770, baseType: !26, size: 32, align: 32, offset: 19680)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rdopt", scope: !556, file: !9, line: 772, baseType: !26, size: 32, align: 32, offset: 19712)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "disthres", scope: !556, file: !9, line: 773, baseType: !26, size: 32, align: 32, offset: 19744)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nobskip", scope: !556, file: !9, line: 774, baseType: !26, size: 32, align: 32, offset: 19776)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "NumberLeakyBuckets", scope: !556, file: !9, line: 777, baseType: !26, size: 32, align: 32, offset: 19808)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "LeakyBucketRateFile", scope: !556, file: !9, line: 778, baseType: !587, size: 1600, align: 8, offset: 19840)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "LeakyBucketParamFile", scope: !556, file: !9, line: 779, baseType: !587, size: 1600, align: 8, offset: 21440)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "PicInterlace", scope: !556, file: !9, line: 782, baseType: !26, size: 32, align: 32, offset: 23040)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "MbInterlace", scope: !556, file: !9, line: 783, baseType: !26, size: 32, align: 32, offset: 23072)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "IntraBottom", scope: !556, file: !9, line: 785, baseType: !26, size: 32, align: 32, offset: 23104)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "LossRateA", scope: !556, file: !9, line: 787, baseType: !26, size: 32, align: 32, offset: 23136)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "LossRateB", scope: !556, file: !9, line: 788, baseType: !26, size: 32, align: 32, offset: 23168)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "LossRateC", scope: !556, file: !9, line: 789, baseType: !26, size: 32, align: 32, offset: 23200)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "NoOfDecoders", scope: !556, file: !9, line: 790, baseType: !26, size: 32, align: 32, offset: 23232)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RestrictRef", scope: !556, file: !9, line: 791, baseType: !26, size: 32, align: 32, offset: 23264)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "NumFramesInELSubSeq", scope: !556, file: !9, line: 792, baseType: !26, size: 32, align: 32, offset: 23296)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "NumFrameIn2ndIGOP", scope: !556, file: !9, line: 793, baseType: !26, size: 32, align: 32, offset: 23328)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RandomIntraMBRefresh", scope: !556, file: !9, line: 795, baseType: !26, size: 32, align: 32, offset: 23360)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "LFSendParameters", scope: !556, file: !9, line: 797, baseType: !26, size: 32, align: 32, offset: 23392)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !556, file: !9, line: 798, baseType: !26, size: 32, align: 32, offset: 23424)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !556, file: !9, line: 799, baseType: !26, size: 32, align: 32, offset: 23456)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !556, file: !9, line: 800, baseType: !26, size: 32, align: 32, offset: 23488)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "SparePictureOption", scope: !556, file: !9, line: 802, baseType: !26, size: 32, align: 32, offset: 23520)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "SPDetectionThreshold", scope: !556, file: !9, line: 803, baseType: !26, size: 32, align: 32, offset: 23552)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "SPPercentageThreshold", scope: !556, file: !9, line: 804, baseType: !26, size: 32, align: 32, offset: 23584)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "SliceGroupConfigFileName", scope: !556, file: !9, line: 807, baseType: !587, size: 1600, align: 8, offset: 23616)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !556, file: !9, line: 808, baseType: !26, size: 32, align: 32, offset: 25216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !556, file: !9, line: 809, baseType: !26, size: 32, align: 32, offset: 25248)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !556, file: !9, line: 811, baseType: !29, size: 64, align: 64, offset: 25280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !556, file: !9, line: 812, baseType: !29, size: 64, align: 64, offset: 25344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !556, file: !9, line: 813, baseType: !201, size: 64, align: 64, offset: 25408)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !556, file: !9, line: 814, baseType: !29, size: 64, align: 64, offset: 25472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !556, file: !9, line: 816, baseType: !26, size: 32, align: 32, offset: 25536)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !556, file: !9, line: 817, baseType: !26, size: 32, align: 32, offset: 25568)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !556, file: !9, line: 818, baseType: !26, size: 32, align: 32, offset: 25600)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_flag", scope: !556, file: !9, line: 820, baseType: !26, size: 32, align: 32, offset: 25632)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !556, file: !9, line: 821, baseType: !26, size: 32, align: 32, offset: 25664)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "context_init_method", scope: !556, file: !9, line: 823, baseType: !26, size: 32, align: 32, offset: 25696)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !556, file: !9, line: 824, baseType: !26, size: 32, align: 32, offset: 25728)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "AllowTransform8x8", scope: !556, file: !9, line: 825, baseType: !26, size: 32, align: 32, offset: 25760)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "LowPassForIntra8x8", scope: !556, file: !9, line: 826, baseType: !26, size: 32, align: 32, offset: 25792)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ReportFrameStats", scope: !556, file: !9, line: 827, baseType: !26, size: 32, align: 32, offset: 25824)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "DisplayEncParams", scope: !556, file: !9, line: 828, baseType: !26, size: 32, align: 32, offset: 25856)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RCEnable", scope: !556, file: !9, line: 831, baseType: !26, size: 32, align: 32, offset: 25888)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !556, file: !9, line: 832, baseType: !26, size: 32, align: 32, offset: 25920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "SeinitialQP", scope: !556, file: !9, line: 833, baseType: !26, size: 32, align: 32, offset: 25952)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !556, file: !9, line: 834, baseType: !26, size: 32, align: 32, offset: 25984)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "channel_type", scope: !556, file: !9, line: 835, baseType: !26, size: 32, align: 32, offset: 26016)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingMatrixPresentFlag", scope: !556, file: !9, line: 837, baseType: !26, size: 32, align: 32, offset: 26048)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingListPresentFlag", scope: !556, file: !9, line: 838, baseType: !41, size: 256, align: 32, offset: 26080)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "FMEnable", scope: !556, file: !9, line: 841, baseType: !26, size: 32, align: 32, offset: 26336)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "BitDepthLuma", scope: !556, file: !9, line: 844, baseType: !26, size: 32, align: 32, offset: 26368)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "BitDepthChroma", scope: !556, file: !9, line: 845, baseType: !26, size: 32, align: 32, offset: 26400)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "img_height_cr", scope: !556, file: !9, line: 846, baseType: !26, size: 32, align: 32, offset: 26432)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "img_width_cr", scope: !556, file: !9, line: 847, baseType: !26, size: 32, align: 32, offset: 26464)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_input_flag", scope: !556, file: !9, line: 848, baseType: !26, size: 32, align: 32, offset: 26496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !556, file: !9, line: 849, baseType: !26, size: 32, align: 32, offset: 26528)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !556, file: !9, line: 850, baseType: !26, size: 32, align: 32, offset: 26560)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_y_zero_flag", scope: !556, file: !9, line: 853, baseType: !26, size: 32, align: 32, offset: 26592)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "residue_transform_flag", scope: !556, file: !9, line: 856, baseType: !26, size: 32, align: 32, offset: 26624)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "UseExplicitLambdaParams", scope: !556, file: !9, line: 859, baseType: !26, size: 32, align: 32, offset: 26656)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "LambdaWeight", scope: !556, file: !9, line: 860, baseType: !712, size: 384, align: 64, offset: 26688)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 384, align: 64, elements: !713)
!713 = !{!282}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "QOffsetMatrixFile", scope: !556, file: !9, line: 862, baseType: !587, size: 1600, align: 8, offset: 27072)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "OffsetMatrixPresentFlag", scope: !556, file: !9, line: 863, baseType: !26, size: 32, align: 32, offset: 28672)
!716 = !DIGlobalVariable(name: "img", scope: !0, file: !1, line: 178, type: !717, isLocal: false, isDefinition: true, variable: %struct.ImageParameters** @img)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageParameters", file: !9, line: 1097, baseType: !719)
!719 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 868, size: 581888, align: 64, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !765, !768, !771, !774, !777, !779, !780, !781, !782, !783, !784, !788, !789, !790, !791, !792, !793, !794, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !814, !815, !816, !817, !818, !819, !820, !821, !822, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !839, !840, !841, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !719, file: !9, line: 870, baseType: !26, size: 32, align: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !719, file: !9, line: 871, baseType: !26, size: 32, align: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nb_references", scope: !719, file: !9, line: 872, baseType: !26, size: 32, align: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !719, file: !9, line: 873, baseType: !26, size: 32, align: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "total_number_mb", scope: !719, file: !9, line: 874, baseType: !26, size: 32, align: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !719, file: !9, line: 875, baseType: !26, size: 32, align: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !719, file: !9, line: 876, baseType: !26, size: 32, align: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !719, file: !9, line: 877, baseType: !26, size: 32, align: 32, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !719, file: !9, line: 878, baseType: !26, size: 32, align: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_references", scope: !719, file: !9, line: 879, baseType: !26, size: 32, align: 32, offset: 288)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !719, file: !9, line: 880, baseType: !26, size: 32, align: 32, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !719, file: !9, line: 881, baseType: !26, size: 32, align: 32, offset: 352)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !719, file: !9, line: 882, baseType: !27, size: 32, align: 32, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !719, file: !9, line: 883, baseType: !26, size: 32, align: 32, offset: 416)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !719, file: !9, line: 884, baseType: !26, size: 32, align: 32, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !719, file: !9, line: 885, baseType: !26, size: 32, align: 32, offset: 480)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !719, file: !9, line: 886, baseType: !26, size: 32, align: 32, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr_frame", scope: !719, file: !9, line: 887, baseType: !26, size: 32, align: 32, offset: 544)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !719, file: !9, line: 888, baseType: !26, size: 32, align: 32, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !719, file: !9, line: 889, baseType: !26, size: 32, align: 32, offset: 608)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !719, file: !9, line: 890, baseType: !26, size: 32, align: 32, offset: 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !719, file: !9, line: 891, baseType: !26, size: 32, align: 32, offset: 672)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_upd", scope: !719, file: !9, line: 892, baseType: !26, size: 32, align: 32, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_intra", scope: !719, file: !9, line: 893, baseType: !26, size: 32, align: 32, offset: 736)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "block_c_x", scope: !719, file: !9, line: 894, baseType: !26, size: 32, align: 32, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !719, file: !9, line: 895, baseType: !119, size: 64, align: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode8x8", scope: !719, file: !9, line: 896, baseType: !119, size: 64, align: 64, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !719, file: !9, line: 898, baseType: !26, size: 32, align: 32, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !719, file: !9, line: 899, baseType: !118, size: 64, align: 64, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mb_x", scope: !719, file: !9, line: 901, baseType: !26, size: 32, align: 32, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y", scope: !719, file: !9, line: 902, baseType: !26, size: 32, align: 32, offset: 1120)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !719, file: !9, line: 903, baseType: !26, size: 32, align: 32, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !719, file: !9, line: 904, baseType: !26, size: 32, align: 32, offset: 1184)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !719, file: !9, line: 905, baseType: !26, size: 32, align: 32, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !719, file: !9, line: 906, baseType: !26, size: 32, align: 32, offset: 1248)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !719, file: !9, line: 907, baseType: !26, size: 32, align: 32, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !719, file: !9, line: 908, baseType: !26, size: 32, align: 32, offset: 1312)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "opix_x", scope: !719, file: !9, line: 910, baseType: !26, size: 32, align: 32, offset: 1344)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "opix_y", scope: !719, file: !9, line: 911, baseType: !26, size: 32, align: 32, offset: 1376)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_x", scope: !719, file: !9, line: 912, baseType: !26, size: 32, align: 32, offset: 1408)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_y", scope: !719, file: !9, line: 913, baseType: !26, size: 32, align: 32, offset: 1440)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mprr", scope: !719, file: !9, line: 917, baseType: !763, size: 36864, align: 16, offset: 1472)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 36864, align: 16, elements: !764)
!764 = !{!274, !56, !56}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_2", scope: !719, file: !9, line: 919, baseType: !766, size: 20480, align: 16, offset: 38336)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 20480, align: 16, elements: !767)
!767 = !{!312, !56, !56}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_3", scope: !719, file: !9, line: 920, baseType: !769, size: 9216, align: 16, offset: 58816)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 9216, align: 16, elements: !770)
!770 = !{!274, !43, !43}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_c", scope: !719, file: !9, line: 921, baseType: !772, size: 32768, align: 16, offset: 68032)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32768, align: 16, elements: !773)
!773 = !{!51, !52, !56, !56}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mpr", scope: !719, file: !9, line: 922, baseType: !775, size: 4096, align: 16, offset: 100800)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 4096, align: 16, elements: !776)
!776 = !{!56, !56}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "m7", scope: !719, file: !9, line: 923, baseType: !778, size: 8192, align: 32, offset: 104896)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, align: 32, elements: !776)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !719, file: !9, line: 925, baseType: !117, size: 64, align: 64, offset: 113088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !719, file: !9, line: 926, baseType: !118, size: 64, align: 64, offset: 113152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "currentPicture", scope: !719, file: !9, line: 928, baseType: !160, size: 64, align: 64, offset: 113216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "currentSlice", scope: !719, file: !9, line: 929, baseType: !168, size: 64, align: 64, offset: 113280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !719, file: !9, line: 930, baseType: !31, size: 64, align: 64, offset: 113344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "MB_SyntaxElements", scope: !719, file: !9, line: 931, baseType: !785, size: 460800, align: 64, offset: 113408)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 460800, align: 64, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 1200)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !719, file: !9, line: 933, baseType: !29, size: 64, align: 64, offset: 574208)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !719, file: !9, line: 934, baseType: !29, size: 64, align: 64, offset: 574272)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tr", scope: !719, file: !9, line: 936, baseType: !26, size: 32, align: 32, offset: 574336)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fld_type", scope: !719, file: !9, line: 937, baseType: !26, size: 32, align: 32, offset: 574368)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fld_flag", scope: !719, file: !9, line: 938, baseType: !28, size: 32, align: 32, offset: 574400)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rd_pass", scope: !719, file: !9, line: 939, baseType: !28, size: 32, align: 32, offset: 574432)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "direct_intraP_ref", scope: !719, file: !9, line: 940, baseType: !795, size: 512, align: 32, offset: 574464)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 32, elements: !796)
!796 = !{!52, !52}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pstruct_next_P", scope: !719, file: !9, line: 941, baseType: !26, size: 32, align: 32, offset: 574976)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_frm", scope: !719, file: !9, line: 942, baseType: !26, size: 32, align: 32, offset: 575008)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_frm", scope: !719, file: !9, line: 943, baseType: !26, size: 32, align: 32, offset: 575040)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_fld", scope: !719, file: !9, line: 944, baseType: !26, size: 32, align: 32, offset: 575072)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_fld", scope: !719, file: !9, line: 945, baseType: !26, size: 32, align: 32, offset: 575104)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "b_interval", scope: !719, file: !9, line: 948, baseType: !89, size: 64, align: 64, offset: 575168)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "p_interval", scope: !719, file: !9, line: 949, baseType: !26, size: 32, align: 32, offset: 575232)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_to_code", scope: !719, file: !9, line: 950, baseType: !26, size: 32, align: 32, offset: 575264)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fw_mb_mode", scope: !719, file: !9, line: 951, baseType: !26, size: 32, align: 32, offset: 575296)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bw_mb_mode", scope: !719, file: !9, line: 952, baseType: !26, size: 32, align: 32, offset: 575328)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !719, file: !9, line: 954, baseType: !110, size: 64, align: 64, offset: 575360)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !719, file: !9, line: 955, baseType: !110, size: 64, align: 64, offset: 575424)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !719, file: !9, line: 957, baseType: !110, size: 64, align: 64, offset: 575488)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !719, file: !9, line: 958, baseType: !110, size: 64, align: 64, offset: 575552)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !719, file: !9, line: 959, baseType: !812, size: 240, align: 16, offset: 575616)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 240, align: 16, elements: !813)
!813 = !{!307}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !719, file: !9, line: 963, baseType: !26, size: 32, align: 32, offset: 575872)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !719, file: !9, line: 964, baseType: !26, size: 32, align: 32, offset: 575904)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !719, file: !9, line: 965, baseType: !26, size: 32, align: 32, offset: 575936)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !719, file: !9, line: 967, baseType: !26, size: 32, align: 32, offset: 575968)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active", scope: !719, file: !9, line: 969, baseType: !26, size: 32, align: 32, offset: 576000)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active", scope: !719, file: !9, line: 970, baseType: !26, size: 32, align: 32, offset: 576032)
