; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/loopFilter.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.storable_picture = type { i32, i32, i32, i32, i32, i32, [6 x [33 x i64]], [6 x [33 x i64]], [6 x [33 x i64]], [6 x [33 x i64]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16**, i16*, i16*, i16**, i16**, i16***, i8*, i16***, i64***, i64***, i16****, i8**, i8**, %struct.storable_picture*, %struct.storable_picture*, %struct.storable_picture*, i32, i32, i32, i32, i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }
%struct.Slice = type { i32, i32, i32, i32, i32, i32, %struct.datapartition*, %struct.MotionInfoContexts*, %struct.TextureInfoContexts*, %struct.RMPNIbuffer_s*, i32, i32*, i32*, i32*, i32, i32*, i32*, i32*, i32 (i32)*, [3 x [2 x i32]] }
%struct.datapartition = type { %struct.Bitstream*, %struct.EncodingEnvironment, i32 (%struct.syntaxelement*, %struct.datapartition*)* }
%struct.Bitstream = type { i32, i32, i8, i32, i32, i8, i8, i32, i32, i8*, i32 }
%struct.EncodingEnvironment = type { i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.syntaxelement = type { i32, i32, i32, i32, i32, i32, i32, i32, void (i32, i32, i32*, i32*)*, void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !25, globals: !653, imports: !984)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/loopFilter.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 185, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "FRAME", value: 0)
!12 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!13 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 192, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "P_SLICE", value: 0)
!17 = !DIEnumerator(name: "B_SLICE", value: 1)
!18 = !DIEnumerator(name: "I_SLICE", value: 2)
!19 = !DIEnumerator(name: "SP_SLICE", value: 3)
!20 = !DIEnumerator(name: "SI_SLICE", value: 4)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !{!26, !512, !536, !595}
!26 = !DISubprogram(name: "DeblockFrame", scope: !1, file: !1, line: 78, type: !27, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ImageParameters*, i16**, i16***)* @DeblockFrame, variables: !507)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29, !504, !506}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageParameters", file: !9, line: 1097, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 868, size: 581888, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !61, !62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !83, !87, !91, !96, !99, !101, !103, !104, !293, !294, !357, !361, !362, !363, !364, !365, !366, !367, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !388, !389, !390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !421, !422, !423, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !31, file: !9, line: 870, baseType: !24, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !31, file: !9, line: 871, baseType: !24, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nb_references", scope: !31, file: !9, line: 872, baseType: !24, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !31, file: !9, line: 873, baseType: !24, size: 32, align: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "total_number_mb", scope: !31, file: !9, line: 874, baseType: !24, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !31, file: !9, line: 875, baseType: !24, size: 32, align: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, file: !9, line: 876, baseType: !24, size: 32, align: 32, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !31, file: !9, line: 877, baseType: !24, size: 32, align: 32, offset: 224)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !31, file: !9, line: 878, baseType: !24, size: 32, align: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_references", scope: !31, file: !9, line: 879, baseType: !24, size: 32, align: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !31, file: !9, line: 880, baseType: !24, size: 32, align: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !31, file: !9, line: 881, baseType: !24, size: 32, align: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !31, file: !9, line: 882, baseType: !46, size: 32, align: 32, offset: 384)
!46 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !31, file: !9, line: 883, baseType: !24, size: 32, align: 32, offset: 416)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !31, file: !9, line: 884, baseType: !24, size: 32, align: 32, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !31, file: !9, line: 885, baseType: !24, size: 32, align: 32, offset: 480)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !31, file: !9, line: 886, baseType: !24, size: 32, align: 32, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr_frame", scope: !31, file: !9, line: 887, baseType: !24, size: 32, align: 32, offset: 544)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !31, file: !9, line: 888, baseType: !24, size: 32, align: 32, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !31, file: !9, line: 889, baseType: !24, size: 32, align: 32, offset: 608)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !31, file: !9, line: 890, baseType: !24, size: 32, align: 32, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !31, file: !9, line: 891, baseType: !24, size: 32, align: 32, offset: 672)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_upd", scope: !31, file: !9, line: 892, baseType: !24, size: 32, align: 32, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_intra", scope: !31, file: !9, line: 893, baseType: !24, size: 32, align: 32, offset: 736)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "block_c_x", scope: !31, file: !9, line: 894, baseType: !24, size: 32, align: 32, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !31, file: !9, line: 895, baseType: !60, size: 64, align: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode8x8", scope: !31, file: !9, line: 896, baseType: !60, size: 64, align: 64, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !31, file: !9, line: 898, baseType: !24, size: 32, align: 32, offset: 960)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !31, file: !9, line: 899, baseType: !64, size: 64, align: 64, offset: 1024)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mb_x", scope: !31, file: !9, line: 901, baseType: !24, size: 32, align: 32, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y", scope: !31, file: !9, line: 902, baseType: !24, size: 32, align: 32, offset: 1120)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !31, file: !9, line: 903, baseType: !24, size: 32, align: 32, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !31, file: !9, line: 904, baseType: !24, size: 32, align: 32, offset: 1184)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !31, file: !9, line: 905, baseType: !24, size: 32, align: 32, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !31, file: !9, line: 906, baseType: !24, size: 32, align: 32, offset: 1248)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !31, file: !9, line: 907, baseType: !24, size: 32, align: 32, offset: 1280)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !31, file: !9, line: 908, baseType: !24, size: 32, align: 32, offset: 1312)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "opix_x", scope: !31, file: !9, line: 910, baseType: !24, size: 32, align: 32, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "opix_y", scope: !31, file: !9, line: 911, baseType: !24, size: 32, align: 32, offset: 1376)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_x", scope: !31, file: !9, line: 912, baseType: !24, size: 32, align: 32, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_y", scope: !31, file: !9, line: 913, baseType: !24, size: 32, align: 32, offset: 1440)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mprr", scope: !31, file: !9, line: 917, baseType: !78, size: 36864, align: 16, offset: 1472)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 36864, align: 16, elements: !80)
!79 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!80 = !{!81, !82, !82}
!81 = !DISubrange(count: 9)
!82 = !DISubrange(count: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_2", scope: !31, file: !9, line: 919, baseType: !84, size: 20480, align: 16, offset: 38336)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 20480, align: 16, elements: !85)
!85 = !{!86, !82, !82}
!86 = !DISubrange(count: 5)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_3", scope: !31, file: !9, line: 920, baseType: !88, size: 9216, align: 16, offset: 58816)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 9216, align: 16, elements: !89)
!89 = !{!81, !90, !90}
!90 = !DISubrange(count: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_c", scope: !31, file: !9, line: 921, baseType: !92, size: 32768, align: 16, offset: 68032)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32768, align: 16, elements: !93)
!93 = !{!94, !95, !82, !82}
!94 = !DISubrange(count: 2)
!95 = !DISubrange(count: 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mpr", scope: !31, file: !9, line: 922, baseType: !97, size: 4096, align: 16, offset: 100800)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 4096, align: 16, elements: !98)
!98 = !{!82, !82}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "m7", scope: !31, file: !9, line: 923, baseType: !100, size: 8192, align: 32, offset: 104896)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 32, elements: !98)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !31, file: !9, line: 925, baseType: !102, size: 64, align: 64, offset: 113088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !31, file: !9, line: 926, baseType: !64, size: 64, align: 64, offset: 113152)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "currentPicture", scope: !31, file: !9, line: 928, baseType: !105, size: 64, align: 64, offset: 113216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !108)
!108 = !{!109, !110, !111, !289, !290, !291, !292}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !107, file: !9, line: 477, baseType: !24, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !107, file: !9, line: 478, baseType: !24, size: 32, align: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !107, file: !9, line: 479, baseType: !112, size: 6400, align: 64, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 6400, align: 64, elements: !287)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !201, !236, !262, !271, !272, !273, !274, !275, !276, !277, !278, !279, !284}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !115, file: !9, line: 445, baseType: !24, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !115, file: !9, line: 446, baseType: !24, size: 32, align: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !115, file: !9, line: 447, baseType: !24, size: 32, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !115, file: !9, line: 448, baseType: !24, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !115, file: !9, line: 449, baseType: !24, size: 32, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !115, file: !9, line: 450, baseType: !24, size: 32, align: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !115, file: !9, line: 451, baseType: !124, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !127)
!127 = !{!128, !148, !173}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !126, file: !9, line: 433, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !132)
!132 = !{!133, !134, !135, !139, !140, !141, !142, !143, !144, !145, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !131, file: !9, line: 413, baseType: !24, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !131, file: !9, line: 414, baseType: !24, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !131, file: !9, line: 415, baseType: !136, size: 8, align: 8, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !137, line: 30, baseType: !138)
!137 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!138 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !131, file: !9, line: 416, baseType: !24, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !131, file: !9, line: 417, baseType: !24, size: 32, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !131, file: !9, line: 418, baseType: !136, size: 8, align: 8, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !131, file: !9, line: 420, baseType: !136, size: 8, align: 8, offset: 168)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !131, file: !9, line: 421, baseType: !24, size: 32, align: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !131, file: !9, line: 422, baseType: !24, size: 32, align: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !131, file: !9, line: 424, baseType: !146, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !131, file: !9, line: 425, baseType: !24, size: 32, align: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !126, file: !9, line: 434, baseType: !149, size: 832, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !151)
!151 = !{!152, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !150, file: !9, line: 209, baseType: !153, size: 32, align: 32)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !150, file: !9, line: 209, baseType: !153, size: 32, align: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !150, file: !9, line: 210, baseType: !153, size: 32, align: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !150, file: !9, line: 211, baseType: !153, size: 32, align: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !150, file: !9, line: 212, baseType: !153, size: 32, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !150, file: !9, line: 213, baseType: !146, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !150, file: !9, line: 214, baseType: !23, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !150, file: !9, line: 217, baseType: !153, size: 32, align: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !150, file: !9, line: 217, baseType: !153, size: 32, align: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !150, file: !9, line: 218, baseType: !153, size: 32, align: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !150, file: !9, line: 219, baseType: !153, size: 32, align: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !150, file: !9, line: 220, baseType: !153, size: 32, align: 32, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !150, file: !9, line: 221, baseType: !146, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !150, file: !9, line: 222, baseType: !23, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !150, file: !9, line: 223, baseType: !24, size: 32, align: 32, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !150, file: !9, line: 223, baseType: !24, size: 32, align: 32, offset: 672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !150, file: !9, line: 224, baseType: !24, size: 32, align: 32, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !150, file: !9, line: 224, baseType: !24, size: 32, align: 32, offset: 736)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !150, file: !9, line: 225, baseType: !24, size: 32, align: 32, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !150, file: !9, line: 225, baseType: !24, size: 32, align: 32, offset: 800)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !126, file: !9, line: 436, baseType: !174, size: 64, align: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!24, !177, !200}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !193}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !9, line: 329, baseType: !24, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !179, file: !9, line: 330, baseType: !24, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !179, file: !9, line: 331, baseType: !24, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, file: !9, line: 332, baseType: !24, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !179, file: !9, line: 333, baseType: !24, size: 32, align: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !179, file: !9, line: 334, baseType: !153, size: 32, align: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !179, file: !9, line: 335, baseType: !24, size: 32, align: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !179, file: !9, line: 336, baseType: !24, size: 32, align: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !179, file: !9, line: 344, baseType: !190, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !24, !24, !23, !23}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !179, file: !9, line: 346, baseType: !194, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197, !198}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !115, file: !9, line: 452, baseType: !202, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !205)
!205 = !{!206, !218, !221, !225, !229, !232, !233}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !204, file: !9, line: 260, baseType: !207, size: 4224, align: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 4224, align: 64, elements: !215)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !209, file: !9, line: 233, baseType: !79, size: 16, align: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !209, file: !9, line: 234, baseType: !138, size: 8, align: 8, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !209, file: !9, line: 236, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!215 = !{!216, !217}
!216 = !DISubrange(count: 3)
!217 = !DISubrange(count: 11)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !204, file: !9, line: 261, baseType: !219, size: 2304, align: 64, offset: 4224)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 2304, align: 64, elements: !220)
!220 = !{!94, !81}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !204, file: !9, line: 262, baseType: !222, size: 2560, align: 64, offset: 6528)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 2560, align: 64, elements: !223)
!223 = !{!94, !224}
!224 = !DISubrange(count: 10)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !204, file: !9, line: 263, baseType: !226, size: 1536, align: 64, offset: 9088)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 1536, align: 64, elements: !227)
!227 = !{!94, !228}
!228 = !DISubrange(count: 6)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !204, file: !9, line: 264, baseType: !230, size: 512, align: 64, offset: 10624)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 512, align: 64, elements: !231)
!231 = !{!95}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !204, file: !9, line: 265, baseType: !230, size: 512, align: 64, offset: 11136)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !204, file: !9, line: 266, baseType: !234, size: 384, align: 64, offset: 11648)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 384, align: 64, elements: !235)
!235 = !{!216}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !115, file: !9, line: 453, baseType: !237, size: 64, align: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !240)
!240 = !{!241, !244, !245, !248, !251, !255, !256, !259, !260, !261}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !239, file: !9, line: 283, baseType: !242, size: 256, align: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, align: 64, elements: !243)
!243 = !{!94}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !239, file: !9, line: 284, baseType: !230, size: 512, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !239, file: !9, line: 285, baseType: !246, size: 1536, align: 64, offset: 768)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 1536, align: 64, elements: !247)
!247 = !{!216, !95}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !239, file: !9, line: 286, baseType: !249, size: 5120, align: 64, offset: 2304)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 5120, align: 64, elements: !250)
!250 = !{!224, !95}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !239, file: !9, line: 287, baseType: !252, size: 19200, align: 64, offset: 7424)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 19200, align: 64, elements: !253)
!253 = !{!224, !254}
!254 = !DISubrange(count: 15)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !239, file: !9, line: 288, baseType: !252, size: 19200, align: 64, offset: 26624)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !239, file: !9, line: 289, baseType: !257, size: 6400, align: 64, offset: 45824)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 6400, align: 64, elements: !258)
!258 = !{!224, !86}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !239, file: !9, line: 290, baseType: !257, size: 6400, align: 64, offset: 52224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !239, file: !9, line: 291, baseType: !252, size: 19200, align: 64, offset: 58624)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !239, file: !9, line: 292, baseType: !252, size: 19200, align: 64, offset: 77824)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !115, file: !9, line: 456, baseType: !263, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !266)
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !265, file: !9, line: 310, baseType: !24, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !265, file: !9, line: 311, baseType: !24, size: 32, align: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !265, file: !9, line: 312, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !115, file: !9, line: 458, baseType: !24, size: 32, align: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !115, file: !9, line: 459, baseType: !23, size: 64, align: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !115, file: !9, line: 460, baseType: !23, size: 64, align: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !115, file: !9, line: 461, baseType: !23, size: 64, align: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !115, file: !9, line: 462, baseType: !24, size: 32, align: 32, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !115, file: !9, line: 463, baseType: !23, size: 64, align: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !115, file: !9, line: 464, baseType: !23, size: 64, align: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !115, file: !9, line: 465, baseType: !23, size: 64, align: 64, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !115, file: !9, line: 467, baseType: !280, size: 64, align: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !24}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !115, file: !9, line: 469, baseType: !285, size: 192, align: 32, offset: 1024)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 32, elements: !286)
!286 = !{!216, !94}
!287 = !{!288}
!288 = !DISubrange(count: 100)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !107, file: !9, line: 480, baseType: !24, size: 32, align: 32, offset: 6464)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !107, file: !9, line: 481, baseType: !46, size: 32, align: 32, offset: 6496)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !107, file: !9, line: 482, baseType: !46, size: 32, align: 32, offset: 6528)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !107, file: !9, line: 483, baseType: !46, size: 32, align: 32, offset: 6560)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "currentSlice", scope: !31, file: !9, line: 929, baseType: !113, size: 64, align: 64, offset: 113280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !31, file: !9, line: 930, baseType: !295, size: 64, align: 64, offset: 113344)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !9, line: 406, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !9, line: 351, size: 5056, align: 64, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !307, !309, !310, !311, !314, !317, !318, !319, !324, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !297, file: !9, line: 353, baseType: !24, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !297, file: !9, line: 354, baseType: !24, size: 32, align: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !297, file: !9, line: 355, baseType: !24, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !297, file: !9, line: 356, baseType: !24, size: 32, align: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !297, file: !9, line: 357, baseType: !24, size: 32, align: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !297, file: !9, line: 358, baseType: !305, size: 256, align: 32, offset: 160)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 32, elements: !306)
!306 = !{!90}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !297, file: !9, line: 360, baseType: !308, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !297, file: !9, line: 361, baseType: !308, size: 64, align: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !297, file: !9, line: 363, baseType: !24, size: 32, align: 32, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !297, file: !9, line: 364, baseType: !312, size: 2048, align: 32, offset: 608)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, align: 32, elements: !313)
!313 = !{!94, !95, !95, !94}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !297, file: !9, line: 365, baseType: !315, size: 512, align: 32, offset: 2656)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 32, elements: !316)
!316 = !{!82}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !297, file: !9, line: 366, baseType: !315, size: 512, align: 32, offset: 3168)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !297, file: !9, line: 367, baseType: !24, size: 32, align: 32, offset: 3680)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !297, file: !9, line: 368, baseType: !320, size: 64, align: 64, offset: 3712)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !322, line: 30, baseType: !323)
!322 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!323 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !297, file: !9, line: 369, baseType: !325, size: 128, align: 32, offset: 3776)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, align: 32, elements: !231)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !297, file: !9, line: 370, baseType: !325, size: 128, align: 32, offset: 3904)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !297, file: !9, line: 371, baseType: !214, size: 64, align: 64, offset: 4032)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !297, file: !9, line: 373, baseType: !24, size: 32, align: 32, offset: 4096)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !297, file: !9, line: 374, baseType: !24, size: 32, align: 32, offset: 4128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !297, file: !9, line: 375, baseType: !24, size: 32, align: 32, offset: 4160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !297, file: !9, line: 377, baseType: !24, size: 32, align: 32, offset: 4192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !297, file: !9, line: 378, baseType: !24, size: 32, align: 32, offset: 4224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !297, file: !9, line: 380, baseType: !24, size: 32, align: 32, offset: 4256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !297, file: !9, line: 382, baseType: !24, size: 32, align: 32, offset: 4288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !297, file: !9, line: 382, baseType: !24, size: 32, align: 32, offset: 4320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !297, file: !9, line: 382, baseType: !24, size: 32, align: 32, offset: 4352)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !297, file: !9, line: 382, baseType: !24, size: 32, align: 32, offset: 4384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !297, file: !9, line: 383, baseType: !24, size: 32, align: 32, offset: 4416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !297, file: !9, line: 383, baseType: !24, size: 32, align: 32, offset: 4448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !297, file: !9, line: 383, baseType: !24, size: 32, align: 32, offset: 4480)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !297, file: !9, line: 383, baseType: !24, size: 32, align: 32, offset: 4512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !297, file: !9, line: 385, baseType: !24, size: 32, align: 32, offset: 4544)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !297, file: !9, line: 386, baseType: !24, size: 32, align: 32, offset: 4576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !297, file: !9, line: 387, baseType: !24, size: 32, align: 32, offset: 4608)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !297, file: !9, line: 390, baseType: !24, size: 32, align: 32, offset: 4640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !297, file: !9, line: 394, baseType: !347, size: 64, align: 64, offset: 4672)
!347 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !297, file: !9, line: 395, baseType: !24, size: 32, align: 32, offset: 4736)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !297, file: !9, line: 396, baseType: !24, size: 32, align: 32, offset: 4768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !297, file: !9, line: 397, baseType: !24, size: 32, align: 32, offset: 4800)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !297, file: !9, line: 398, baseType: !24, size: 32, align: 32, offset: 4832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !297, file: !9, line: 399, baseType: !24, size: 32, align: 32, offset: 4864)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !297, file: !9, line: 401, baseType: !24, size: 32, align: 32, offset: 4896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !297, file: !9, line: 402, baseType: !24, size: 32, align: 32, offset: 4928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !297, file: !9, line: 403, baseType: !24, size: 32, align: 32, offset: 4960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !297, file: !9, line: 405, baseType: !24, size: 32, align: 32, offset: 4992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "MB_SyntaxElements", scope: !31, file: !9, line: 931, baseType: !358, size: 460800, align: 64, offset: 113408)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 460800, align: 64, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 1200)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !31, file: !9, line: 933, baseType: !23, size: 64, align: 64, offset: 574208)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !31, file: !9, line: 934, baseType: !23, size: 64, align: 64, offset: 574272)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tr", scope: !31, file: !9, line: 936, baseType: !24, size: 32, align: 32, offset: 574336)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fld_type", scope: !31, file: !9, line: 937, baseType: !24, size: 32, align: 32, offset: 574368)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fld_flag", scope: !31, file: !9, line: 938, baseType: !153, size: 32, align: 32, offset: 574400)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rd_pass", scope: !31, file: !9, line: 939, baseType: !153, size: 32, align: 32, offset: 574432)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "direct_intraP_ref", scope: !31, file: !9, line: 940, baseType: !368, size: 512, align: 32, offset: 574464)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 32, elements: !369)
!369 = !{!95, !95}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pstruct_next_P", scope: !31, file: !9, line: 941, baseType: !24, size: 32, align: 32, offset: 574976)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_frm", scope: !31, file: !9, line: 942, baseType: !24, size: 32, align: 32, offset: 575008)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_frm", scope: !31, file: !9, line: 943, baseType: !24, size: 32, align: 32, offset: 575040)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_fld", scope: !31, file: !9, line: 944, baseType: !24, size: 32, align: 32, offset: 575072)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_fld", scope: !31, file: !9, line: 945, baseType: !24, size: 32, align: 32, offset: 575104)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_interval", scope: !31, file: !9, line: 948, baseType: !347, size: 64, align: 64, offset: 575168)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "p_interval", scope: !31, file: !9, line: 949, baseType: !24, size: 32, align: 32, offset: 575232)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_to_code", scope: !31, file: !9, line: 950, baseType: !24, size: 32, align: 32, offset: 575264)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fw_mb_mode", scope: !31, file: !9, line: 951, baseType: !24, size: 32, align: 32, offset: 575296)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bw_mb_mode", scope: !31, file: !9, line: 952, baseType: !24, size: 32, align: 32, offset: 575328)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !31, file: !9, line: 954, baseType: !381, size: 64, align: 64, offset: 575360)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !31, file: !9, line: 955, baseType: !381, size: 64, align: 64, offset: 575424)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !31, file: !9, line: 957, baseType: !381, size: 64, align: 64, offset: 575488)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !31, file: !9, line: 958, baseType: !381, size: 64, align: 64, offset: 575552)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !31, file: !9, line: 959, baseType: !392, size: 240, align: 16, offset: 575616)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 240, align: 16, elements: !393)
!393 = !{!254}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !31, file: !9, line: 963, baseType: !24, size: 32, align: 32, offset: 575872)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !31, file: !9, line: 964, baseType: !24, size: 32, align: 32, offset: 575904)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !31, file: !9, line: 965, baseType: !24, size: 32, align: 32, offset: 575936)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !31, file: !9, line: 967, baseType: !24, size: 32, align: 32, offset: 575968)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active", scope: !31, file: !9, line: 969, baseType: !24, size: 32, align: 32, offset: 576000)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active", scope: !31, file: !9, line: 970, baseType: !24, size: 32, align: 32, offset: 576032)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "field_mode", scope: !31, file: !9, line: 972, baseType: !24, size: 32, align: 32, offset: 576064)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !31, file: !9, line: 973, baseType: !24, size: 32, align: 32, offset: 576096)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mvscale", scope: !31, file: !9, line: 974, baseType: !403, size: 2880, align: 32, offset: 576128)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2880, align: 32, elements: !404)
!404 = !{!228, !254}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buf_cycle", scope: !31, file: !9, line: 975, baseType: !24, size: 32, align: 32, offset: 579008)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !31, file: !9, line: 976, baseType: !24, size: 32, align: 32, offset: 579040)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !31, file: !9, line: 978, baseType: !24, size: 32, align: 32, offset: 579072)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "old_layer", scope: !31, file: !9, line: 979, baseType: !24, size: 32, align: 32, offset: 579104)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "NoResidueDirect", scope: !31, file: !9, line: 980, baseType: !24, size: 32, align: 32, offset: 579136)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !31, file: !9, line: 982, baseType: !24, size: 32, align: 32, offset: 579168)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !31, file: !9, line: 984, baseType: !24, size: 32, align: 32, offset: 579200)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !31, file: !9, line: 988, baseType: !153, size: 32, align: 32, offset: 579232)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !31, file: !9, line: 992, baseType: !153, size: 32, align: 32, offset: 579264)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !31, file: !9, line: 993, baseType: !24, size: 32, align: 32, offset: 579296)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !31, file: !9, line: 994, baseType: !24, size: 32, align: 32, offset: 579328)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !31, file: !9, line: 995, baseType: !153, size: 32, align: 32, offset: 579360)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !31, file: !9, line: 996, baseType: !418, size: 32, align: 32, offset: 579392)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, align: 32, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !31, file: !9, line: 1001, baseType: !153, size: 32, align: 32, offset: 579424)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !31, file: !9, line: 1002, baseType: !24, size: 32, align: 32, offset: 579456)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !31, file: !9, line: 1004, baseType: !424, size: 64, align: 32, offset: 579488)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, align: 32, elements: !243)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !31, file: !9, line: 1008, baseType: !153, size: 32, align: 32, offset: 579552)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !31, file: !9, line: 1009, baseType: !24, size: 32, align: 32, offset: 579584)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !31, file: !9, line: 1010, baseType: !24, size: 32, align: 32, offset: 579616)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !31, file: !9, line: 1011, baseType: !24, size: 32, align: 32, offset: 579648)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !31, file: !9, line: 1012, baseType: !24, size: 32, align: 32, offset: 579680)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !31, file: !9, line: 1013, baseType: !153, size: 32, align: 32, offset: 579712)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !31, file: !9, line: 1015, baseType: !153, size: 32, align: 32, offset: 579744)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !31, file: !9, line: 1016, baseType: !153, size: 32, align: 32, offset: 579776)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !31, file: !9, line: 1017, baseType: !153, size: 32, align: 32, offset: 579808)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !31, file: !9, line: 1018, baseType: !153, size: 32, align: 32, offset: 579840)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !31, file: !9, line: 1019, baseType: !153, size: 32, align: 32, offset: 579872)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !31, file: !9, line: 1020, baseType: !153, size: 32, align: 32, offset: 579904)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !31, file: !9, line: 1023, baseType: !153, size: 32, align: 32, offset: 579936)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !31, file: !9, line: 1027, baseType: !24, size: 32, align: 32, offset: 579968)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !31, file: !9, line: 1029, baseType: !24, size: 32, align: 32, offset: 580000)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !31, file: !9, line: 1030, baseType: !24, size: 32, align: 32, offset: 580032)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !31, file: !9, line: 1031, baseType: !24, size: 32, align: 32, offset: 580064)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !31, file: !9, line: 1033, baseType: !443, size: 64, align: 64, offset: 580096)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !9, line: 324, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !9, line: 316, size: 256, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !445, file: !9, line: 318, baseType: !24, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !445, file: !9, line: 319, baseType: !24, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !445, file: !9, line: 320, baseType: !24, size: 32, align: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !445, file: !9, line: 321, baseType: !24, size: 32, align: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !445, file: !9, line: 322, baseType: !24, size: 32, align: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !445, file: !9, line: 323, baseType: !453, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !31, file: !9, line: 1035, baseType: !24, size: 32, align: 32, offset: 580160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofHeaderBits", scope: !31, file: !9, line: 1039, baseType: !24, size: 32, align: 32, offset: 580192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofTextureBits", scope: !31, file: !9, line: 1040, baseType: !24, size: 32, align: 32, offset: 580224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofBasicUnitHeaderBits", scope: !31, file: !9, line: 1041, baseType: !24, size: 32, align: 32, offset: 580256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofBasicUnitTextureBits", scope: !31, file: !9, line: 1042, baseType: !24, size: 32, align: 32, offset: 580288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "TotalMADBasicUnit", scope: !31, file: !9, line: 1043, baseType: !347, size: 64, align: 64, offset: 580352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofMBTextureBits", scope: !31, file: !9, line: 1044, baseType: !24, size: 32, align: 32, offset: 580416)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofMBHeaderBits", scope: !31, file: !9, line: 1045, baseType: !24, size: 32, align: 32, offset: 580448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedBFrame", scope: !31, file: !9, line: 1046, baseType: !24, size: 32, align: 32, offset: 580480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedPFrame", scope: !31, file: !9, line: 1047, baseType: !24, size: 32, align: 32, offset: 580512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofGOP", scope: !31, file: !9, line: 1048, baseType: !24, size: 32, align: 32, offset: 580544)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "TotalQpforPPicture", scope: !31, file: !9, line: 1049, baseType: !24, size: 32, align: 32, offset: 580576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofPPicture", scope: !31, file: !9, line: 1050, baseType: !24, size: 32, align: 32, offset: 580608)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "MADofMB", scope: !31, file: !9, line: 1051, baseType: !468, size: 64, align: 64, offset: 580672)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "BasicUnitQP", scope: !31, file: !9, line: 1052, baseType: !24, size: 32, align: 32, offset: 580736)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "TopFieldFlag", scope: !31, file: !9, line: 1053, baseType: !24, size: 32, align: 32, offset: 580768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "FieldControl", scope: !31, file: !9, line: 1054, baseType: !24, size: 32, align: 32, offset: 580800)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "FieldFrame", scope: !31, file: !9, line: 1055, baseType: !24, size: 32, align: 32, offset: 580832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Frame_Total_Number_MB", scope: !31, file: !9, line: 1056, baseType: !24, size: 32, align: 32, offset: 580864)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "IFLAG", scope: !31, file: !9, line: 1057, baseType: !24, size: 32, align: 32, offset: 580896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedMacroBlocks", scope: !31, file: !9, line: 1058, baseType: !24, size: 32, align: 32, offset: 580928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "BasicUnit", scope: !31, file: !9, line: 1059, baseType: !24, size: 32, align: 32, offset: 580960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_macroblock", scope: !31, file: !9, line: 1060, baseType: !24, size: 32, align: 32, offset: 580992)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bot_MB", scope: !31, file: !9, line: 1061, baseType: !24, size: 32, align: 32, offset: 581024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "write_macroblock_frame", scope: !31, file: !9, line: 1062, baseType: !24, size: 32, align: 32, offset: 581056)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !31, file: !9, line: 1064, baseType: !24, size: 32, align: 32, offset: 581088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !31, file: !9, line: 1066, baseType: !24, size: 32, align: 32, offset: 581120)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !31, file: !9, line: 1067, baseType: !24, size: 32, align: 32, offset: 581152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !31, file: !9, line: 1068, baseType: !24, size: 32, align: 32, offset: 581184)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !31, file: !9, line: 1070, baseType: !24, size: 32, align: 32, offset: 581216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !31, file: !9, line: 1072, baseType: !24, size: 32, align: 32, offset: 581248)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !31, file: !9, line: 1073, baseType: !24, size: 32, align: 32, offset: 581280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !31, file: !9, line: 1074, baseType: !24, size: 32, align: 32, offset: 581312)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !31, file: !9, line: 1075, baseType: !24, size: 32, align: 32, offset: 581344)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !31, file: !9, line: 1076, baseType: !24, size: 32, align: 32, offset: 581376)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_lambda_scale", scope: !31, file: !9, line: 1077, baseType: !24, size: 32, align: 32, offset: 581408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value", scope: !31, file: !9, line: 1078, baseType: !153, size: 32, align: 32, offset: 581440)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "max_imgpel_value", scope: !31, file: !9, line: 1079, baseType: !24, size: 32, align: 32, offset: 581472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "max_imgpel_value_uv", scope: !31, file: !9, line: 1080, baseType: !24, size: 32, align: 32, offset: 581504)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !31, file: !9, line: 1082, baseType: !24, size: 32, align: 32, offset: 581536)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !31, file: !9, line: 1083, baseType: !24, size: 32, align: 32, offset: 581568)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !31, file: !9, line: 1084, baseType: !24, size: 32, align: 32, offset: 581600)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !31, file: !9, line: 1085, baseType: !24, size: 32, align: 32, offset: 581632)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !31, file: !9, line: 1086, baseType: !24, size: 32, align: 32, offset: 581664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !31, file: !9, line: 1087, baseType: !24, size: 32, align: 32, offset: 581696)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !31, file: !9, line: 1089, baseType: !424, size: 64, align: 32, offset: 581728)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "residue_transform_flag", scope: !31, file: !9, line: 1092, baseType: !24, size: 32, align: 32, offset: 581792)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !31, file: !9, line: 1094, baseType: !24, size: 32, align: 32, offset: 581824)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !31, file: !9, line: 1095, baseType: !24, size: 32, align: 32, offset: 581856)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!507 = !{!508, !509, !510, !511}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !26, file: !1, line: 78, type: !29)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imgY", arg: 2, scope: !26, file: !1, line: 78, type: !504)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imgUV", arg: 3, scope: !26, file: !1, line: 78, type: !506)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !26, file: !1, line: 80, type: !153)
!512 = !DISubprogram(name: "DeblockMb", scope: !1, file: !1, line: 96, type: !513, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ImageParameters*, i16**, i16***, i32)* @DeblockMb, variables: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !29, !504, !506, !24}
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !512, file: !1, line: 96, type: !29)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imgY", arg: 2, scope: !512, file: !1, line: 96, type: !504)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imgUV", arg: 3, scope: !512, file: !1, line: 96, type: !506)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "MbQAddr", arg: 4, scope: !512, file: !1, line: 96, type: !24)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "EdgeCondition", scope: !512, file: !1, line: 98, type: !24)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir", scope: !512, file: !1, line: 99, type: !24)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edge", scope: !512, file: !1, line: 99, type: !24)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Strength", scope: !512, file: !1, line: 100, type: !524)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, align: 8, elements: !316)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !512, file: !1, line: 101, type: !24)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !512, file: !1, line: 101, type: !24)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filterNon8x8LumaEdgesFlag", scope: !512, file: !1, line: 103, type: !325)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filterLeftMbEdgeFlag", scope: !512, file: !1, line: 104, type: !24)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filterTopMbEdgeFlag", scope: !512, file: !1, line: 105, type: !24)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fieldModeMbFlag", scope: !512, file: !1, line: 106, type: !24)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mvlimit", scope: !512, file: !1, line: 107, type: !24)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !512, file: !1, line: 108, type: !24)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "StrengthSum", scope: !512, file: !1, line: 108, type: !24)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MbQ", scope: !512, file: !1, line: 109, type: !295)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edge_cr", scope: !512, file: !1, line: 111, type: !24)
!536 = !DISubprogram(name: "GetStrength", scope: !1, file: !1, line: 210, type: !537, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.ImageParameters*, i32, i32, i32, i32)* @GetStrength, variables: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !146, !29, !24, !24, !24, !24}
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !579, !592, !593, !594}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Strength", arg: 1, scope: !536, file: !1, line: 210, type: !146)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 2, scope: !536, file: !1, line: 210, type: !29)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "MbQAddr", arg: 3, scope: !536, file: !1, line: 210, type: !24)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 4, scope: !536, file: !1, line: 210, type: !24)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edge", arg: 5, scope: !536, file: !1, line: 210, type: !24)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mvlimit", arg: 6, scope: !536, file: !1, line: 210, type: !24)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blkP", scope: !536, file: !1, line: 212, type: !24)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blkQ", scope: !536, file: !1, line: 212, type: !24)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !536, file: !1, line: 212, type: !24)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blk_x", scope: !536, file: !1, line: 213, type: !24)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blk_x2", scope: !536, file: !1, line: 213, type: !24)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blk_y", scope: !536, file: !1, line: 213, type: !24)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blk_y2", scope: !536, file: !1, line: 213, type: !24)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list0_mv", scope: !536, file: !1, line: 214, type: !384)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list1_mv", scope: !536, file: !1, line: 215, type: !384)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list0_refIdxArr", scope: !536, file: !1, line: 216, type: !385)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list1_refIdxArr", scope: !536, file: !1, line: 217, type: !385)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list0_refPicIdArr", scope: !536, file: !1, line: 218, type: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list1_refPicIdArr", scope: !536, file: !1, line: 219, type: !558)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xQ", scope: !536, file: !1, line: 220, type: !24)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xP", scope: !536, file: !1, line: 220, type: !24)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yQ", scope: !536, file: !1, line: 220, type: !24)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yP", scope: !536, file: !1, line: 220, type: !24)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !536, file: !1, line: 221, type: !24)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !536, file: !1, line: 221, type: !24)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MbQ", scope: !536, file: !1, line: 222, type: !295)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MbP", scope: !536, file: !1, line: 223, type: !295)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixP", scope: !536, file: !1, line: 224, type: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !9, line: 305, baseType: !571)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !9, line: 297, size: 192, align: 32, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !571, file: !9, line: 299, baseType: !24, size: 32, align: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !571, file: !9, line: 300, baseType: !24, size: 32, align: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !571, file: !9, line: 301, baseType: !24, size: 32, align: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !571, file: !9, line: 302, baseType: !24, size: 32, align: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !571, file: !9, line: 303, baseType: !24, size: 32, align: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !571, file: !9, line: 304, baseType: !24, size: 32, align: 32, offset: 160)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_p0", scope: !580, file: !1, line: 276, type: !320)
!580 = distinct !DILexicalBlock(scope: !581, file: !1, line: 275, column: 11)
!581 = distinct !DILexicalBlock(scope: !582, file: !1, line: 268, column: 11)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 263, column: 15)
!583 = distinct !DILexicalBlock(scope: !584, file: !1, line: 260, column: 9)
!584 = distinct !DILexicalBlock(scope: !585, file: !1, line: 257, column: 13)
!585 = distinct !DILexicalBlock(scope: !586, file: !1, line: 256, column: 7)
!586 = distinct !DILexicalBlock(scope: !587, file: !1, line: 254, column: 12)
!587 = distinct !DILexicalBlock(scope: !588, file: !1, line: 248, column: 5)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 241, column: 9)
!589 = distinct !DILexicalBlock(scope: !590, file: !1, line: 229, column: 3)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 228, column: 3)
!591 = distinct !DILexicalBlock(scope: !536, file: !1, line: 228, column: 3)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_p1", scope: !580, file: !1, line: 276, type: !320)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_q0", scope: !580, file: !1, line: 276, type: !320)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_q1", scope: !580, file: !1, line: 276, type: !320)
!595 = !DISubprogram(name: "EdgeLoop", scope: !1, file: !1, line: 347, type: !596, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i8*, %struct.ImageParameters*, i32, i32, i32, i32, i32, i32, i32, i32)* @EdgeLoop, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !504, !146, !29, !24, !24, !24, !24, !24, !24, !24, !24}
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Img", arg: 1, scope: !595, file: !1, line: 347, type: !504)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Strength", arg: 2, scope: !595, file: !1, line: 347, type: !146)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 3, scope: !595, file: !1, line: 347, type: !29)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "MbQAddr", arg: 4, scope: !595, file: !1, line: 347, type: !24)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "AlphaC0Offset", arg: 5, scope: !595, file: !1, line: 347, type: !24)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "BetaOffset", arg: 6, scope: !595, file: !1, line: 347, type: !24)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 7, scope: !595, file: !1, line: 348, type: !24)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edge", arg: 8, scope: !595, file: !1, line: 348, type: !24)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "width", arg: 9, scope: !595, file: !1, line: 348, type: !24)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "yuv", arg: 10, scope: !595, file: !1, line: 348, type: !24)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 11, scope: !595, file: !1, line: 348, type: !24)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pel", scope: !595, file: !1, line: 350, type: !24)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !595, file: !1, line: 350, type: !24)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aq", scope: !595, file: !1, line: 350, type: !24)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Strng", scope: !595, file: !1, line: 350, type: !24)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incP", scope: !595, file: !1, line: 351, type: !24)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incQ", scope: !595, file: !1, line: 351, type: !24)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "C0", scope: !595, file: !1, line: 352, type: !24)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c0", scope: !595, file: !1, line: 352, type: !24)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Delta", scope: !595, file: !1, line: 352, type: !24)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dif", scope: !595, file: !1, line: 352, type: !24)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "AbsDelta", scope: !595, file: !1, line: 352, type: !24)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L2", scope: !595, file: !1, line: 353, type: !24)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L1", scope: !595, file: !1, line: 353, type: !24)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L0", scope: !595, file: !1, line: 353, type: !24)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R0", scope: !595, file: !1, line: 353, type: !24)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R1", scope: !595, file: !1, line: 353, type: !24)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R2", scope: !595, file: !1, line: 353, type: !24)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RL0", scope: !595, file: !1, line: 353, type: !24)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L3", scope: !595, file: !1, line: 353, type: !24)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R3", scope: !595, file: !1, line: 353, type: !24)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Alpha", scope: !595, file: !1, line: 354, type: !24)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Beta", scope: !595, file: !1, line: 354, type: !24)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ClipTab", scope: !595, file: !1, line: 355, type: !146)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "small_gap", scope: !595, file: !1, line: 356, type: !24)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexA", scope: !595, file: !1, line: 357, type: !24)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexB", scope: !595, file: !1, line: 357, type: !24)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PelNum", scope: !595, file: !1, line: 358, type: !24)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "StrengthIdx", scope: !595, file: !1, line: 359, type: !24)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SrcPtrP", scope: !595, file: !1, line: 360, type: !505)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SrcPtrQ", scope: !595, file: !1, line: 360, type: !505)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "QP", scope: !595, file: !1, line: 361, type: !24)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xP", scope: !595, file: !1, line: 362, type: !24)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xQ", scope: !595, file: !1, line: 362, type: !24)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yP", scope: !595, file: !1, line: 362, type: !24)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yQ", scope: !595, file: !1, line: 362, type: !24)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MbQ", scope: !595, file: !1, line: 363, type: !295)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MbP", scope: !595, file: !1, line: 363, type: !295)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixP", scope: !595, file: !1, line: 364, type: !570)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixQ", scope: !595, file: !1, line: 364, type: !570)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitdepth_scale", scope: !595, file: !1, line: 365, type: !24)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pelnum_cr", scope: !595, file: !1, line: 366, type: !651)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 32, elements: !652)
!652 = !{!94, !95}
!653 = !{!654, !658, !659, !662, !666, !667, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !718, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !847, !848, !849, !850, !851, !852, !853, !856, !858, !859, !860, !861, !862, !863, !874, !907, !908, !909, !910, !911, !966, !967, !968, !969, !970, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983}
!654 = !DIGlobalVariable(name: "ALPHA_TABLE", scope: !0, file: !1, line: 41, type: !655, isLocal: false, isDefinition: true, variable: [52 x i8]* @ALPHA_TABLE)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 416, align: 8, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 52)
!658 = !DIGlobalVariable(name: "BETA_TABLE", scope: !0, file: !1, line: 42, type: !655, isLocal: false, isDefinition: true, variable: [52 x i8]* @BETA_TABLE)
!659 = !DIGlobalVariable(name: "CLIP_TAB", scope: !0, file: !1, line: 43, type: !660, isLocal: false, isDefinition: true, variable: [52 x [5 x i8]]* @CLIP_TAB)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2080, align: 8, elements: !661)
!661 = !{!657, !86}
!662 = !DIGlobalVariable(name: "chroma_edge", scope: !0, file: !1, line: 55, type: !663, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i8]]]* @chroma_edge)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 256, align: 8, elements: !665)
!664 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!665 = !{!94, !95, !95}
!666 = !DIGlobalVariable(name: "ININT_STRENGTH", scope: !0, file: !1, line: 205, type: !325, isLocal: false, isDefinition: true, variable: [4 x i32]* @ININT_STRENGTH)
!667 = !DIGlobalVariable(name: "BLK_NUM", scope: !0, file: !1, line: 206, type: !668, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i8]]]* @BLK_NUM)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 256, align: 8, elements: !665)
!669 = !DIGlobalVariable(name: "BLK_4_TO_8", scope: !0, file: !1, line: 207, type: !524, isLocal: false, isDefinition: true, variable: [16 x i8]* @BLK_4_TO_8)
!670 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !105, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!671 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !105, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!672 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !105, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!673 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !105, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!674 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !105, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!675 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !504, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!676 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !506, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!677 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !60, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!678 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !153, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!679 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !153, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!680 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !24, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!681 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !24, isLocal: false, isDefinition: true, variable: i32* @me_time)
!682 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !683, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !685, file: !4, line: 105, baseType: !283, size: 32, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !685, file: !4, line: 106, baseType: !153, size: 32, align: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !685, file: !4, line: 107, baseType: !153, size: 32, align: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !685, file: !4, line: 108, baseType: !283, size: 32, align: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !685, file: !4, line: 110, baseType: !283, size: 32, align: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !685, file: !4, line: 111, baseType: !283, size: 32, align: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !685, file: !4, line: 112, baseType: !305, size: 256, align: 32, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !685, file: !4, line: 115, baseType: !283, size: 32, align: 32, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !685, file: !4, line: 116, baseType: !153, size: 32, align: 32, offset: 480)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !685, file: !4, line: 117, baseType: !153, size: 32, align: 32, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !685, file: !4, line: 119, baseType: !698, size: 256, align: 32, offset: 544)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 256, align: 32, elements: !306)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !685, file: !4, line: 121, baseType: !698, size: 256, align: 32, offset: 800)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !685, file: !4, line: 122, baseType: !698, size: 256, align: 32, offset: 1056)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !685, file: !4, line: 124, baseType: !283, size: 32, align: 32, offset: 1312)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !685, file: !4, line: 125, baseType: !153, size: 32, align: 32, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !685, file: !4, line: 127, baseType: !153, size: 32, align: 32, offset: 1376)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !685, file: !4, line: 128, baseType: !146, size: 64, align: 64, offset: 1408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !685, file: !4, line: 130, baseType: !24, size: 32, align: 32, offset: 1472)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !685, file: !4, line: 131, baseType: !24, size: 32, align: 32, offset: 1504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !685, file: !4, line: 132, baseType: !283, size: 32, align: 32, offset: 1536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !685, file: !4, line: 133, baseType: !153, size: 32, align: 32, offset: 1568)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !685, file: !4, line: 134, baseType: !24, size: 32, align: 32, offset: 1600)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !685, file: !4, line: 135, baseType: !24, size: 32, align: 32, offset: 1632)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !685, file: !4, line: 136, baseType: !24, size: 32, align: 32, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !685, file: !4, line: 138, baseType: !24, size: 32, align: 32, offset: 1696)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !685, file: !4, line: 139, baseType: !24, size: 32, align: 32, offset: 1728)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !685, file: !4, line: 141, baseType: !283, size: 32, align: 32, offset: 1760)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !685, file: !4, line: 142, baseType: !283, size: 32, align: 32, offset: 1792)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !685, file: !4, line: 143, baseType: !283, size: 32, align: 32, offset: 1824)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !685, file: !4, line: 144, baseType: !283, size: 32, align: 32, offset: 1856)
!718 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !719, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !721)
!721 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !721, file: !4, line: 151, baseType: !283, size: 32, align: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !721, file: !4, line: 153, baseType: !153, size: 32, align: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !721, file: !4, line: 154, baseType: !283, size: 32, align: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !721, file: !4, line: 155, baseType: !283, size: 32, align: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !721, file: !4, line: 156, baseType: !283, size: 32, align: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !721, file: !4, line: 157, baseType: !283, size: 32, align: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !721, file: !4, line: 158, baseType: !153, size: 32, align: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !721, file: !4, line: 159, baseType: !153, size: 32, align: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !721, file: !4, line: 160, baseType: !153, size: 32, align: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !721, file: !4, line: 162, baseType: !283, size: 32, align: 32, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !721, file: !4, line: 163, baseType: !305, size: 256, align: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !721, file: !4, line: 165, baseType: !153, size: 32, align: 32, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !721, file: !4, line: 166, baseType: !153, size: 32, align: 32, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !721, file: !4, line: 167, baseType: !153, size: 32, align: 32, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !721, file: !4, line: 168, baseType: !153, size: 32, align: 32, offset: 672)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !721, file: !4, line: 170, baseType: !153, size: 32, align: 32, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !721, file: !4, line: 172, baseType: !283, size: 32, align: 32, offset: 736)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !721, file: !4, line: 173, baseType: !24, size: 32, align: 32, offset: 768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !721, file: !4, line: 174, baseType: !24, size: 32, align: 32, offset: 800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !721, file: !4, line: 175, baseType: !153, size: 32, align: 32, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !721, file: !4, line: 177, baseType: !744, size: 8192, align: 32, offset: 864)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 32, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !721, file: !4, line: 178, baseType: !153, size: 32, align: 32, offset: 9056)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !721, file: !4, line: 179, baseType: !283, size: 32, align: 32, offset: 9088)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !721, file: !4, line: 180, baseType: !153, size: 32, align: 32, offset: 9120)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !721, file: !4, line: 181, baseType: !153, size: 32, align: 32, offset: 9152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !721, file: !4, line: 182, baseType: !283, size: 32, align: 32, offset: 9184)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !721, file: !4, line: 184, baseType: !283, size: 32, align: 32, offset: 9216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !721, file: !4, line: 185, baseType: !283, size: 32, align: 32, offset: 9248)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !721, file: !4, line: 186, baseType: !283, size: 32, align: 32, offset: 9280)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !721, file: !4, line: 187, baseType: !153, size: 32, align: 32, offset: 9312)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !721, file: !4, line: 188, baseType: !153, size: 32, align: 32, offset: 9344)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !721, file: !4, line: 189, baseType: !153, size: 32, align: 32, offset: 9376)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !721, file: !4, line: 190, baseType: !153, size: 32, align: 32, offset: 9408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !721, file: !4, line: 191, baseType: !283, size: 32, align: 32, offset: 9440)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !721, file: !4, line: 192, baseType: !761, size: 7584, align: 32, offset: 9472)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !762, file: !4, line: 65, baseType: !283, size: 32, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !762, file: !4, line: 66, baseType: !153, size: 32, align: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !762, file: !4, line: 67, baseType: !153, size: 32, align: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !762, file: !4, line: 68, baseType: !153, size: 32, align: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !762, file: !4, line: 69, baseType: !283, size: 32, align: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !762, file: !4, line: 70, baseType: !283, size: 32, align: 32, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !762, file: !4, line: 71, baseType: !283, size: 32, align: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !762, file: !4, line: 72, baseType: !153, size: 32, align: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !762, file: !4, line: 73, baseType: !283, size: 32, align: 32, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !762, file: !4, line: 74, baseType: !283, size: 32, align: 32, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !762, file: !4, line: 75, baseType: !153, size: 32, align: 32, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !762, file: !4, line: 76, baseType: !153, size: 32, align: 32, offset: 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !762, file: !4, line: 77, baseType: !153, size: 32, align: 32, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !762, file: !4, line: 78, baseType: !283, size: 32, align: 32, offset: 416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !762, file: !4, line: 79, baseType: !153, size: 32, align: 32, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !762, file: !4, line: 80, baseType: !153, size: 32, align: 32, offset: 480)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !762, file: !4, line: 81, baseType: !283, size: 32, align: 32, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !762, file: !4, line: 82, baseType: !153, size: 32, align: 32, offset: 544)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !762, file: !4, line: 83, baseType: !153, size: 32, align: 32, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !762, file: !4, line: 84, baseType: !283, size: 32, align: 32, offset: 608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !762, file: !4, line: 85, baseType: !283, size: 32, align: 32, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !762, file: !4, line: 86, baseType: !786, size: 3296, align: 32, offset: 672)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !787)
