; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/macroblock.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "P_SLICE", value: 0)
!18 = !DIEnumerator(name: "B_SLICE", value: 1)
!19 = !DIEnumerator(name: "I_SLICE", value: 2)
!20 = !DIEnumerator(name: "SP_SLICE", value: 3)
!21 = !DIEnumerator(name: "SI_SLICE", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 168, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "NO_SLICES", value: 0)
!25 = !DIEnumerator(name: "FIXED_MB", value: 1)
!26 = !DIEnumerator(name: "FIXED_RATE", value: 2)
!27 = !DIEnumerator(name: "CALLBACK", value: 3)
!28 = !DIEnumerator(name: "FMO", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 42, size: 32, align: 32, elements: !31)
!30 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!31 = !{!32, !33}
!32 = !DIEnumerator(name: "FALSE", value: 0)
!33 = !DIEnumerator(name: "TRUE", value: 1)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 178, size: 32, align: 32, elements: !35)
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "UVLC", value: 0)
!37 = !DIEnumerator(name: "CABAC", value: 1)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 111, size: 32, align: 32, elements: !39)
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!41 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!42 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 119, size: 32, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!45 = !DIEnumerator(name: "SE_HEADER", value: 0)
!46 = !DIEnumerator(name: "SE_PTYPE", value: 1)
!47 = !DIEnumerator(name: "SE_MBTYPE", value: 2)
!48 = !DIEnumerator(name: "SE_REFFRAME", value: 3)
!49 = !DIEnumerator(name: "SE_INTRAPREDMODE", value: 4)
!50 = !DIEnumerator(name: "SE_MVD", value: 5)
!51 = !DIEnumerator(name: "SE_CBP_INTRA", value: 6)
!52 = !DIEnumerator(name: "SE_LUM_DC_INTRA", value: 7)
!53 = !DIEnumerator(name: "SE_CHR_DC_INTRA", value: 8)
!54 = !DIEnumerator(name: "SE_LUM_AC_INTRA", value: 9)
!55 = !DIEnumerator(name: "SE_CHR_AC_INTRA", value: 10)
!56 = !DIEnumerator(name: "SE_CBP_INTER", value: 11)
!57 = !DIEnumerator(name: "SE_LUM_DC_INTER", value: 12)
!58 = !DIEnumerator(name: "SE_CHR_DC_INTER", value: 13)
!59 = !DIEnumerator(name: "SE_LUM_AC_INTER", value: 14)
!60 = !DIEnumerator(name: "SE_CHR_AC_INTER", value: 15)
!61 = !DIEnumerator(name: "SE_DELTA_QUANT_INTER", value: 16)
!62 = !DIEnumerator(name: "SE_DELTA_QUANT_INTRA", value: 17)
!63 = !DIEnumerator(name: "SE_BFRAME", value: 18)
!64 = !DIEnumerator(name: "SE_EOS", value: 19)
!65 = !DIEnumerator(name: "SE_TRANSFORM_SIZE_FLAG", value: 20)
!66 = !DIEnumerator(name: "SE_MAX_ELEMENTS", value: 21)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 185, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "FRAME", value: 0)
!70 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!71 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!72 = !{}
!73 = !{!74, !80, !85, !88, !164, !363, !381, !390, !487, !494, !521, !547, !581, !594, !611, !640, !676, !686, !707, !732, !791, !798, !804, !826, !832, !852, !860, !871, !874, !881, !884, !903, !932, !943, !967, !986, !1002, !1010, !1034, !1042, !1055, !1102}
!74 = !DISubprogram(name: "set_MB_parameters", scope: !1, file: !1, line: 56, type: !75, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @set_MB_parameters, variables: !78)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77}
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !{!79}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_addr", arg: 1, scope: !74, file: !1, line: 56, type: !77)
!80 = !DISubprogram(name: "clip1a", scope: !1, file: !1, line: 105, type: !81, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @clip1a, variables: !83)
!81 = !DISubroutineType(types: !82)
!82 = !{!77, !77}
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !80, file: !1, line: 105, type: !77)
!85 = !DISubprogram(name: "clip1a_chr", scope: !1, file: !1, line: 110, type: !81, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @clip1a_chr, variables: !86)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !85, file: !1, line: 110, type: !77)
!88 = !DISubprogram(name: "proceed2nextMacroblock", scope: !1, file: !1, line: 122, type: !89, isLocal: false, isDefinition: true, scopeLine: 123, isOptimized: true, function: void ()* @proceed2nextMacroblock, variables: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{null}
!91 = !{!92, !161, !163}
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !88, file: !1, line: 127, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !4, line: 406, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !4, line: 351, size: 5056, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !106, !108, !109, !110, !115, !119, !120, !121, !126, !129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !95, file: !4, line: 353, baseType: !77, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !95, file: !4, line: 354, baseType: !77, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !95, file: !4, line: 355, baseType: !77, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !95, file: !4, line: 356, baseType: !77, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !95, file: !4, line: 357, baseType: !77, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !95, file: !4, line: 358, baseType: !103, size: 256, align: 32, offset: 160)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, align: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !95, file: !4, line: 360, baseType: !107, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !95, file: !4, line: 361, baseType: !107, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !95, file: !4, line: 363, baseType: !77, size: 32, align: 32, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !95, file: !4, line: 364, baseType: !111, size: 2048, align: 32, offset: 608)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2048, align: 32, elements: !112)
!112 = !{!113, !114, !114, !113}
!113 = !DISubrange(count: 2)
!114 = !DISubrange(count: 4)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !95, file: !4, line: 365, baseType: !116, size: 512, align: 32, offset: 2656)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 512, align: 32, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !95, file: !4, line: 366, baseType: !116, size: 512, align: 32, offset: 3168)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !95, file: !4, line: 367, baseType: !77, size: 32, align: 32, offset: 3680)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !95, file: !4, line: 368, baseType: !122, size: 64, align: 64, offset: 3712)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !124, line: 30, baseType: !125)
!124 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!125 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !95, file: !4, line: 369, baseType: !127, size: 128, align: 32, offset: 3776)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, align: 32, elements: !128)
!128 = !{!114}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !95, file: !4, line: 370, baseType: !127, size: 128, align: 32, offset: 3904)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !95, file: !4, line: 371, baseType: !131, size: 64, align: 64, offset: 4032)
!131 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !95, file: !4, line: 373, baseType: !77, size: 32, align: 32, offset: 4096)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !95, file: !4, line: 374, baseType: !77, size: 32, align: 32, offset: 4128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !95, file: !4, line: 375, baseType: !77, size: 32, align: 32, offset: 4160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !95, file: !4, line: 377, baseType: !77, size: 32, align: 32, offset: 4192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !95, file: !4, line: 378, baseType: !77, size: 32, align: 32, offset: 4224)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !95, file: !4, line: 380, baseType: !77, size: 32, align: 32, offset: 4256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !95, file: !4, line: 382, baseType: !77, size: 32, align: 32, offset: 4288)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !95, file: !4, line: 382, baseType: !77, size: 32, align: 32, offset: 4320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !95, file: !4, line: 382, baseType: !77, size: 32, align: 32, offset: 4352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !95, file: !4, line: 382, baseType: !77, size: 32, align: 32, offset: 4384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !95, file: !4, line: 383, baseType: !77, size: 32, align: 32, offset: 4416)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !95, file: !4, line: 383, baseType: !77, size: 32, align: 32, offset: 4448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !95, file: !4, line: 383, baseType: !77, size: 32, align: 32, offset: 4480)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !95, file: !4, line: 383, baseType: !77, size: 32, align: 32, offset: 4512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !95, file: !4, line: 385, baseType: !77, size: 32, align: 32, offset: 4544)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !95, file: !4, line: 386, baseType: !77, size: 32, align: 32, offset: 4576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !95, file: !4, line: 387, baseType: !77, size: 32, align: 32, offset: 4608)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !95, file: !4, line: 390, baseType: !77, size: 32, align: 32, offset: 4640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !95, file: !4, line: 394, baseType: !151, size: 64, align: 64, offset: 4672)
!151 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !95, file: !4, line: 395, baseType: !77, size: 32, align: 32, offset: 4736)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !95, file: !4, line: 396, baseType: !77, size: 32, align: 32, offset: 4768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !95, file: !4, line: 397, baseType: !77, size: 32, align: 32, offset: 4800)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !95, file: !4, line: 398, baseType: !77, size: 32, align: 32, offset: 4832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !95, file: !4, line: 399, baseType: !77, size: 32, align: 32, offset: 4864)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !95, file: !4, line: 401, baseType: !77, size: 32, align: 32, offset: 4896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !95, file: !4, line: 402, baseType: !77, size: 32, align: 32, offset: 4928)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !95, file: !4, line: 403, baseType: !77, size: 32, align: 32, offset: 4960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !95, file: !4, line: 405, baseType: !77, size: 32, align: 32, offset: 4992)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !88, file: !1, line: 128, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !88, file: !1, line: 129, type: !77)
!164 = !DISubprogram(name: "start_macroblock", scope: !1, file: !1, line: 210, type: !165, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @start_macroblock, variables: !167)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !77, !77}
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !352, !353, !354, !355, !356, !357, !360, !362}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_addr", arg: 1, scope: !164, file: !1, line: 210, type: !77)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_field", arg: 2, scope: !164, file: !1, line: 210, type: !77)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !164, file: !1, line: 212, type: !77)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !164, file: !1, line: 212, type: !77)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !164, file: !1, line: 212, type: !77)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !164, file: !1, line: 212, type: !77)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_bitstream_backing", scope: !164, file: !1, line: 213, type: !77)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !164, file: !1, line: 214, type: !93)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_slice", scope: !164, file: !1, line: 215, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !265, !300, !327, !336, !337, !338, !339, !340, !341, !342, !343, !344, !349}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !179, file: !4, line: 445, baseType: !77, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !179, file: !4, line: 446, baseType: !77, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !179, file: !4, line: 447, baseType: !77, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !179, file: !4, line: 448, baseType: !77, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !179, file: !4, line: 449, baseType: !77, size: 32, align: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !179, file: !4, line: 450, baseType: !77, size: 32, align: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !179, file: !4, line: 451, baseType: !188, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !191)
!191 = !{!192, !212, !237}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !190, file: !4, line: 433, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !196)
!196 = !{!197, !198, !199, !203, !204, !205, !206, !207, !208, !209, !211}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !195, file: !4, line: 413, baseType: !77, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !195, file: !4, line: 414, baseType: !77, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !195, file: !4, line: 415, baseType: !200, size: 8, align: 8, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !201, line: 30, baseType: !202)
!201 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!202 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !195, file: !4, line: 416, baseType: !77, size: 32, align: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !195, file: !4, line: 417, baseType: !77, size: 32, align: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !195, file: !4, line: 418, baseType: !200, size: 8, align: 8, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !195, file: !4, line: 420, baseType: !200, size: 8, align: 8, offset: 168)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !195, file: !4, line: 421, baseType: !77, size: 32, align: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !195, file: !4, line: 422, baseType: !77, size: 32, align: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !195, file: !4, line: 424, baseType: !210, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !195, file: !4, line: 425, baseType: !77, size: 32, align: 32, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !190, file: !4, line: 434, baseType: !213, size: 832, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !215)
!215 = !{!216, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !214, file: !4, line: 209, baseType: !217, size: 32, align: 32)
!217 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !214, file: !4, line: 209, baseType: !217, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !214, file: !4, line: 210, baseType: !217, size: 32, align: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !214, file: !4, line: 211, baseType: !217, size: 32, align: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !214, file: !4, line: 212, baseType: !217, size: 32, align: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !214, file: !4, line: 213, baseType: !210, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !214, file: !4, line: 214, baseType: !162, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !214, file: !4, line: 217, baseType: !217, size: 32, align: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !214, file: !4, line: 217, baseType: !217, size: 32, align: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !214, file: !4, line: 218, baseType: !217, size: 32, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !214, file: !4, line: 219, baseType: !217, size: 32, align: 32, offset: 416)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !214, file: !4, line: 220, baseType: !217, size: 32, align: 32, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !214, file: !4, line: 221, baseType: !210, size: 64, align: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !214, file: !4, line: 222, baseType: !162, size: 64, align: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !214, file: !4, line: 223, baseType: !77, size: 32, align: 32, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !214, file: !4, line: 223, baseType: !77, size: 32, align: 32, offset: 672)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !214, file: !4, line: 224, baseType: !77, size: 32, align: 32, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !214, file: !4, line: 224, baseType: !77, size: 32, align: 32, offset: 736)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !214, file: !4, line: 225, baseType: !77, size: 32, align: 32, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !214, file: !4, line: 225, baseType: !77, size: 32, align: 32, offset: 800)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !190, file: !4, line: 436, baseType: !238, size: 64, align: 64, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!77, !241, !264}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !257}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !4, line: 329, baseType: !77, size: 32, align: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !243, file: !4, line: 330, baseType: !77, size: 32, align: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !243, file: !4, line: 331, baseType: !77, size: 32, align: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !4, line: 332, baseType: !77, size: 32, align: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !243, file: !4, line: 333, baseType: !77, size: 32, align: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !243, file: !4, line: 334, baseType: !217, size: 32, align: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !243, file: !4, line: 335, baseType: !77, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !243, file: !4, line: 336, baseType: !77, size: 32, align: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !243, file: !4, line: 344, baseType: !254, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !77, !77, !162, !162}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !243, file: !4, line: 346, baseType: !258, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261, !262}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !179, file: !4, line: 452, baseType: !266, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !268)
!268 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !269)
!269 = !{!270, !282, !286, !290, !294, !296, !297}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !268, file: !4, line: 260, baseType: !271, size: 4224, align: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 4224, align: 64, elements: !279)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !274)
!274 = !{!275, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !273, file: !4, line: 233, baseType: !276, size: 16, align: 16)
!276 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !273, file: !4, line: 234, baseType: !202, size: 8, align: 8, offset: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !273, file: !4, line: 236, baseType: !131, size: 64, align: 64, offset: 64)
!279 = !{!280, !281}
!280 = !DISubrange(count: 3)
!281 = !DISubrange(count: 11)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !268, file: !4, line: 261, baseType: !283, size: 2304, align: 64, offset: 4224)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 2304, align: 64, elements: !284)
!284 = !{!113, !285}
!285 = !DISubrange(count: 9)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !268, file: !4, line: 262, baseType: !287, size: 2560, align: 64, offset: 6528)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 2560, align: 64, elements: !288)
!288 = !{!113, !289}
!289 = !DISubrange(count: 10)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !268, file: !4, line: 263, baseType: !291, size: 1536, align: 64, offset: 9088)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 1536, align: 64, elements: !292)
!292 = !{!113, !293}
!293 = !DISubrange(count: 6)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !268, file: !4, line: 264, baseType: !295, size: 512, align: 64, offset: 10624)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 512, align: 64, elements: !128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !268, file: !4, line: 265, baseType: !295, size: 512, align: 64, offset: 11136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !268, file: !4, line: 266, baseType: !298, size: 384, align: 64, offset: 11648)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 384, align: 64, elements: !299)
!299 = !{!280}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !179, file: !4, line: 453, baseType: !301, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !304)
!304 = !{!305, !308, !309, !312, !315, !319, !320, !324, !325, !326}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !303, file: !4, line: 283, baseType: !306, size: 256, align: 64)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 256, align: 64, elements: !307)
!307 = !{!113}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !303, file: !4, line: 284, baseType: !295, size: 512, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !303, file: !4, line: 285, baseType: !310, size: 1536, align: 64, offset: 768)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 1536, align: 64, elements: !311)
!311 = !{!280, !114}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !303, file: !4, line: 286, baseType: !313, size: 5120, align: 64, offset: 2304)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 5120, align: 64, elements: !314)
!314 = !{!289, !114}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !303, file: !4, line: 287, baseType: !316, size: 19200, align: 64, offset: 7424)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 19200, align: 64, elements: !317)
!317 = !{!289, !318}
!318 = !DISubrange(count: 15)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !303, file: !4, line: 288, baseType: !316, size: 19200, align: 64, offset: 26624)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !303, file: !4, line: 289, baseType: !321, size: 6400, align: 64, offset: 45824)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 6400, align: 64, elements: !322)
!322 = !{!289, !323}
!323 = !DISubrange(count: 5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !303, file: !4, line: 290, baseType: !321, size: 6400, align: 64, offset: 52224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !303, file: !4, line: 291, baseType: !316, size: 19200, align: 64, offset: 58624)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !303, file: !4, line: 292, baseType: !316, size: 19200, align: 64, offset: 77824)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !179, file: !4, line: 456, baseType: !328, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !330, file: !4, line: 310, baseType: !77, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !330, file: !4, line: 311, baseType: !77, size: 32, align: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !330, file: !4, line: 312, baseType: !335, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !179, file: !4, line: 458, baseType: !77, size: 32, align: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !179, file: !4, line: 459, baseType: !162, size: 64, align: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !179, file: !4, line: 460, baseType: !162, size: 64, align: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !179, file: !4, line: 461, baseType: !162, size: 64, align: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !179, file: !4, line: 462, baseType: !77, size: 32, align: 32, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !179, file: !4, line: 463, baseType: !162, size: 64, align: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !179, file: !4, line: 464, baseType: !162, size: 64, align: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !179, file: !4, line: 465, baseType: !162, size: 64, align: 64, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !179, file: !4, line: 467, baseType: !345, size: 64, align: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !77}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !30, line: 45, baseType: !29)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !179, file: !4, line: 469, baseType: !350, size: 192, align: 32, offset: 1024)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 192, align: 32, elements: !351)
!351 = !{!280, !113}
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !164, file: !1, line: 216, type: !188)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !164, file: !1, line: 217, type: !193)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep", scope: !164, file: !1, line: 218, type: !262)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_qp_delta", scope: !164, file: !1, line: 219, type: !77)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_qp_delta", scope: !164, file: !1, line: 220, type: !77)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev_mb", scope: !358, file: !1, line: 266, type: !77)
!358 = distinct !DILexicalBlock(scope: !359, file: !1, line: 265, column: 3)
!359 = distinct !DILexicalBlock(scope: !164, file: !1, line: 264, column: 6)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !361, file: !1, line: 469, type: !177)
!361 = distinct !DILexicalBlock(scope: !359, file: !1, line: 468, column: 3)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev_mb", scope: !361, file: !1, line: 471, type: !77)
!363 = !DISubprogram(name: "terminate_macroblock", scope: !1, file: !1, line: 599, type: !364, isLocal: false, isDefinition: true, scopeLine: 600, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @terminate_macroblock, variables: !367)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !366, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end_of_slice", arg: 1, scope: !363, file: !1, line: 599, type: !366)
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recode_macroblock", arg: 2, scope: !363, file: !1, line: 599, type: !366)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !363, file: !1, line: 601, type: !77)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !363, file: !1, line: 602, type: !177)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !363, file: !1, line: 603, type: !93)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !363, file: !1, line: 604, type: !241)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !363, file: !1, line: 605, type: !162)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !363, file: !1, line: 606, type: !188)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !363, file: !1, line: 607, type: !193)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rlc_bits", scope: !363, file: !1, line: 608, type: !77)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep", scope: !363, file: !1, line: 609, type: !262)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_bitstream_backing", scope: !363, file: !1, line: 610, type: !77)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_slice", scope: !363, file: !1, line: 611, type: !77)
!381 = !DISubprogram(name: "slice_too_big", scope: !1, file: !1, line: 835, type: !81, isLocal: false, isDefinition: true, scopeLine: 836, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @slice_too_big, variables: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rlc_bits", arg: 1, scope: !381, file: !1, line: 835, type: !77)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !381, file: !1, line: 837, type: !177)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !381, file: !1, line: 838, type: !188)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !381, file: !1, line: 839, type: !193)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep", scope: !381, file: !1, line: 840, type: !262)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !381, file: !1, line: 841, type: !77)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_in_bytes", scope: !381, file: !1, line: 842, type: !77)
!390 = !DISubprogram(name: "OneComponentLumaPrediction4x4", scope: !1, file: !1, line: 884, type: !391, isLocal: false, isDefinition: true, scopeLine: 890, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32, i32, i16*, i16, %struct.storable_picture**)* @OneComponentLumaPrediction4x4, variables: !464)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !162, !77, !77, !393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !398, line: 82, baseType: !399)
!398 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !398, line: 21, size: 52672, align: 64, elements: !400)
!400 = !{!401, !403, !404, !405, !406, !407, !408, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !433, !434, !435, !436, !437, !439, !440, !443, !447, !448, !450, !452, !453, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !399, file: !398, line: 23, baseType: !402, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !4, line: 190, baseType: !67)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !399, file: !398, line: 25, baseType: !77, size: 32, align: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !399, file: !398, line: 26, baseType: !77, size: 32, align: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !399, file: !398, line: 27, baseType: !77, size: 32, align: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !399, file: !398, line: 28, baseType: !77, size: 32, align: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !399, file: !398, line: 29, baseType: !77, size: 32, align: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !399, file: !398, line: 30, baseType: !409, size: 12672, align: 64, offset: 192)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 12672, align: 64, elements: !410)
!410 = !{!293, !411}
!411 = !DISubrange(count: 33)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !399, file: !398, line: 31, baseType: !409, size: 12672, align: 64, offset: 12864)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !399, file: !398, line: 32, baseType: !409, size: 12672, align: 64, offset: 25536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !399, file: !398, line: 33, baseType: !409, size: 12672, align: 64, offset: 38208)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !399, file: !398, line: 34, baseType: !217, size: 32, align: 32, offset: 50880)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !399, file: !398, line: 35, baseType: !77, size: 32, align: 32, offset: 50912)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !399, file: !398, line: 36, baseType: !77, size: 32, align: 32, offset: 50944)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !399, file: !398, line: 37, baseType: !77, size: 32, align: 32, offset: 50976)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !399, file: !398, line: 39, baseType: !77, size: 32, align: 32, offset: 51008)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !399, file: !398, line: 40, baseType: !77, size: 32, align: 32, offset: 51040)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !399, file: !398, line: 41, baseType: !77, size: 32, align: 32, offset: 51072)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !399, file: !398, line: 42, baseType: !77, size: 32, align: 32, offset: 51104)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !399, file: !398, line: 44, baseType: !77, size: 32, align: 32, offset: 51136)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !399, file: !398, line: 44, baseType: !77, size: 32, align: 32, offset: 51168)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !399, file: !398, line: 44, baseType: !77, size: 32, align: 32, offset: 51200)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !399, file: !398, line: 44, baseType: !77, size: 32, align: 32, offset: 51232)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !399, file: !398, line: 45, baseType: !77, size: 32, align: 32, offset: 51264)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !399, file: !398, line: 46, baseType: !77, size: 32, align: 32, offset: 51296)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !399, file: !398, line: 47, baseType: !77, size: 32, align: 32, offset: 51328)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !399, file: !398, line: 49, baseType: !431, size: 64, align: 64, offset: 51392)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !399, file: !398, line: 50, baseType: !432, size: 64, align: 64, offset: 51456)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !399, file: !398, line: 51, baseType: !432, size: 64, align: 64, offset: 51520)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !399, file: !398, line: 52, baseType: !431, size: 64, align: 64, offset: 51584)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !399, file: !398, line: 53, baseType: !431, size: 64, align: 64, offset: 51648)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !399, file: !398, line: 54, baseType: !438, size: 64, align: 64, offset: 51712)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !399, file: !398, line: 56, baseType: !210, size: 64, align: 64, offset: 51776)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !399, file: !398, line: 58, baseType: !441, size: 64, align: 64, offset: 51840)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !399, file: !398, line: 60, baseType: !444, size: 64, align: 64, offset: 51904)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !399, file: !398, line: 63, baseType: !444, size: 64, align: 64, offset: 51968)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !399, file: !398, line: 66, baseType: !449, size: 64, align: 64, offset: 52032)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !399, file: !398, line: 68, baseType: !451, size: 64, align: 64, offset: 52096)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !399, file: !398, line: 69, baseType: !451, size: 64, align: 64, offset: 52160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !399, file: !398, line: 71, baseType: !454, size: 64, align: 64, offset: 52224)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !399, file: !398, line: 72, baseType: !454, size: 64, align: 64, offset: 52288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !399, file: !398, line: 73, baseType: !454, size: 64, align: 64, offset: 52352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !399, file: !398, line: 75, baseType: !77, size: 32, align: 32, offset: 52416)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !399, file: !398, line: 76, baseType: !77, size: 32, align: 32, offset: 52448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !399, file: !398, line: 77, baseType: !77, size: 32, align: 32, offset: 52480)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !399, file: !398, line: 78, baseType: !77, size: 32, align: 32, offset: 52512)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !399, file: !398, line: 79, baseType: !77, size: 32, align: 32, offset: 52544)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !399, file: !398, line: 80, baseType: !77, size: 32, align: 32, offset: 52576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !399, file: !398, line: 81, baseType: !77, size: 32, align: 32, offset: 52608)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !485, !486}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mpred", arg: 1, scope: !390, file: !1, line: 884, type: !162)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 2, scope: !390, file: !1, line: 885, type: !77)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 3, scope: !390, file: !1, line: 886, type: !77)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv", arg: 4, scope: !390, file: !1, line: 887, type: !393)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 5, scope: !390, file: !1, line: 888, type: !394)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 6, scope: !390, file: !1, line: 889, type: !395)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !390, file: !1, line: 891, type: !431)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_add", scope: !390, file: !1, line: 892, type: !77)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !390, file: !1, line: 893, type: !77)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !390, file: !1, line: 893, type: !77)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j2", scope: !390, file: !1, line: 893, type: !77)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j3", scope: !390, file: !1, line: 893, type: !77)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !390, file: !1, line: 894, type: !77)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !390, file: !1, line: 894, type: !77)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2", scope: !390, file: !1, line: 894, type: !77)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i3", scope: !390, file: !1, line: 894, type: !77)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_pel", scope: !390, file: !1, line: 896, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!276, !431, !77, !77, !77, !77}
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !390, file: !1, line: 898, type: !77)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !390, file: !1, line: 899, type: !77)
!487 = !DISubprogram(name: "copyblock4x4", scope: !1, file: !1, line: 930, type: !488, isLocal: false, isDefinition: true, scopeLine: 932, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, [4 x i32]*)* @copyblock4x4, variables: !491)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !162, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!491 = !{!492, !493}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mpred", arg: 1, scope: !487, file: !1, line: 930, type: !162)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 2, scope: !487, file: !1, line: 931, type: !490)
!494 = !DISubprogram(name: "LumaPrediction4x4", scope: !1, file: !1, line: 958, type: !495, isLocal: false, isDefinition: true, scopeLine: 965, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i16, i16)* @LumaPrediction4x4, variables: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !77, !77, !77, !77, !77, !394, !394}
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 1, scope: !494, file: !1, line: 958, type: !77)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 2, scope: !494, file: !1, line: 959, type: !77)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_dir", arg: 3, scope: !494, file: !1, line: 960, type: !77)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_mode", arg: 4, scope: !494, file: !1, line: 961, type: !77)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_mode", arg: 5, scope: !494, file: !1, line: 962, type: !77)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref_idx", arg: 6, scope: !494, file: !1, line: 963, type: !394)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref_idx", arg: 7, scope: !494, file: !1, line: 964, type: !394)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !494, file: !1, line: 969, type: !77)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !494, file: !1, line: 969, type: !77)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x4", scope: !494, file: !1, line: 970, type: !77)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y4", scope: !494, file: !1, line: 971, type: !77)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_x", scope: !494, file: !1, line: 972, type: !77)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_y", scope: !494, file: !1, line: 973, type: !77)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx", scope: !494, file: !1, line: 974, type: !77)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by", scope: !494, file: !1, line: 975, type: !77)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fpred", scope: !494, file: !1, line: 976, type: !162)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bpred", scope: !494, file: !1, line: 977, type: !162)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !494, file: !1, line: 978, type: !93)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !494, file: !1, line: 980, type: !77)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_array", scope: !494, file: !1, line: 982, type: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !494, file: !1, line: 984, type: !77)
!521 = !DISubprogram(name: "LumaPrediction4x4Bi", scope: !1, file: !1, line: 1060, type: !522, isLocal: false, isDefinition: true, scopeLine: 1068, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i16, i16, i32)* @LumaPrediction4x4Bi, variables: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !77, !77, !77, !77, !77, !394, !394, !77}
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 1, scope: !521, file: !1, line: 1060, type: !77)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 2, scope: !521, file: !1, line: 1061, type: !77)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_dir", arg: 3, scope: !521, file: !1, line: 1062, type: !77)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_mode", arg: 4, scope: !521, file: !1, line: 1063, type: !77)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_mode", arg: 5, scope: !521, file: !1, line: 1064, type: !77)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref_idx", arg: 6, scope: !521, file: !1, line: 1065, type: !394)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref_idx", arg: 7, scope: !521, file: !1, line: 1066, type: !394)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 8, scope: !521, file: !1, line: 1067, type: !77)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !521, file: !1, line: 1072, type: !77)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !521, file: !1, line: 1072, type: !77)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x4", scope: !521, file: !1, line: 1073, type: !77)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y4", scope: !521, file: !1, line: 1074, type: !77)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_x", scope: !521, file: !1, line: 1075, type: !77)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_y", scope: !521, file: !1, line: 1076, type: !77)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx", scope: !521, file: !1, line: 1077, type: !77)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by", scope: !521, file: !1, line: 1078, type: !77)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fpred", scope: !521, file: !1, line: 1079, type: !162)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bpred", scope: !521, file: !1, line: 1080, type: !162)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !521, file: !1, line: 1081, type: !93)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !521, file: !1, line: 1084, type: !77)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !521, file: !1, line: 1087, type: !77)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !521, file: !1, line: 1089, type: !518)
!547 = !DISubprogram(name: "LumaResidualCoding8x8", scope: !1, file: !1, line: 1158, type: !548, isLocal: false, isDefinition: true, scopeLine: 1167, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i64*, i32, i16, i32, i32, i16, i16)* @LumaResidualCoding8x8, variables: !550)
!548 = !DISubroutineType(types: !549)
!549 = !{!77, !162, !446, !77, !394, !77, !77, !394, !394}
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp", arg: 1, scope: !547, file: !1, line: 1158, type: !162)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp_blk", arg: 2, scope: !547, file: !1, line: 1159, type: !446)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 3, scope: !547, file: !1, line: 1160, type: !77)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_dir", arg: 4, scope: !547, file: !1, line: 1161, type: !394)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_mode", arg: 5, scope: !547, file: !1, line: 1162, type: !77)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_mode", arg: 6, scope: !547, file: !1, line: 1163, type: !77)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_refframe", arg: 7, scope: !547, file: !1, line: 1164, type: !394)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_refframe", arg: 8, scope: !547, file: !1, line: 1165, type: !394)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !547, file: !1, line: 1168, type: !77)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !547, file: !1, line: 1168, type: !77)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !547, file: !1, line: 1168, type: !77)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !547, file: !1, line: 1168, type: !77)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !547, file: !1, line: 1168, type: !77)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !547, file: !1, line: 1168, type: !77)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !547, file: !1, line: 1168, type: !77)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp_blk_mask", scope: !547, file: !1, line: 1168, type: !77)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_cost", scope: !547, file: !1, line: 1169, type: !77)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !547, file: !1, line: 1170, type: !77)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !547, file: !1, line: 1171, type: !77)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp_mask", scope: !547, file: !1, line: 1172, type: !77)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bxx", scope: !547, file: !1, line: 1173, type: !77)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byy", scope: !547, file: !1, line: 1173, type: !77)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scrFlag", scope: !547, file: !1, line: 1174, type: !77)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skipped", scope: !547, file: !1, line: 1175, type: !77)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !547, file: !1, line: 1176, type: !93)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "need_8x8_transform", scope: !547, file: !1, line: 1178, type: !77)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !547, file: !1, line: 1180, type: !77)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !547, file: !1, line: 1180, type: !77)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !547, file: !1, line: 1180, type: !77)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !547, file: !1, line: 1180, type: !77)
!581 = !DISubprogram(name: "SetModesAndRefframe", scope: !1, file: !1, line: 1375, type: !582, isLocal: false, isDefinition: true, scopeLine: 1376, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i16*, i32*, i32*, i16*, i16*)* @SetModesAndRefframe, variables: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !77, !393, !162, !162, !393, !393}
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !581, file: !1, line: 1375, type: !77)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_dir", arg: 2, scope: !581, file: !1, line: 1375, type: !393)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_mode", arg: 3, scope: !581, file: !1, line: 1375, type: !162)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_mode", arg: 4, scope: !581, file: !1, line: 1375, type: !162)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref", arg: 5, scope: !581, file: !1, line: 1375, type: !393)
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref", arg: 6, scope: !581, file: !1, line: 1375, type: !393)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !581, file: !1, line: 1377, type: !93)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !581, file: !1, line: 1378, type: !77)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !581, file: !1, line: 1379, type: !77)
!594 = !DISubprogram(name: "LumaResidualCoding", scope: !1, file: !1, line: 1433, type: !89, isLocal: false, isDefinition: true, scopeLine: 1434, isOptimized: true, function: void ()* @LumaResidualCoding, variables: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !594, file: !1, line: 1435, type: !77)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !594, file: !1, line: 1435, type: !77)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8", scope: !594, file: !1, line: 1435, type: !77)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8_x", scope: !594, file: !1, line: 1435, type: !77)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8_y", scope: !594, file: !1, line: 1435, type: !77)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_mode", scope: !594, file: !1, line: 1436, type: !77)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_mode", scope: !594, file: !1, line: 1436, type: !77)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_dir", scope: !594, file: !1, line: 1437, type: !394)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refframe", scope: !594, file: !1, line: 1437, type: !394)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum_cnt_nonz", scope: !594, file: !1, line: 1438, type: !77)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !594, file: !1, line: 1439, type: !93)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_ref", scope: !608, file: !1, line: 1447, type: !394)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 1446, column: 3)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 1445, column: 3)
!610 = distinct !DILexicalBlock(scope: !594, file: !1, line: 1445, column: 3)
!611 = !DISubprogram(name: "TransformDecision", scope: !1, file: !1, line: 1491, type: !612, isLocal: false, isDefinition: true, scopeLine: 1492, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*)* @TransformDecision, variables: !614)
!612 = !DISubroutineType(types: !613)
!613 = !{!77, !77, !162}
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !639}
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_check", arg: 1, scope: !611, file: !1, line: 1491, type: !77)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cost", arg: 2, scope: !611, file: !1, line: 1491, type: !162)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !611, file: !1, line: 1493, type: !77)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !611, file: !1, line: 1493, type: !77)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !611, file: !1, line: 1493, type: !77)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !611, file: !1, line: 1493, type: !77)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !611, file: !1, line: 1493, type: !77)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !611, file: !1, line: 1493, type: !77)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !611, file: !1, line: 1493, type: !77)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !611, file: !1, line: 1494, type: !77)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !611, file: !1, line: 1494, type: !77)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8", scope: !611, file: !1, line: 1494, type: !77)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_mode", scope: !611, file: !1, line: 1495, type: !77)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_mode", scope: !611, file: !1, line: 1495, type: !77)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_dir", scope: !611, file: !1, line: 1496, type: !394)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_ref", scope: !611, file: !1, line: 1496, type: !394)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_ref", scope: !611, file: !1, line: 1496, type: !394)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_blks", scope: !611, file: !1, line: 1497, type: !77)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8", scope: !611, file: !1, line: 1498, type: !77)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost4x4", scope: !611, file: !1, line: 1498, type: !77)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !611, file: !1, line: 1499, type: !636)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2048, align: 32, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 64)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_ptr", scope: !611, file: !1, line: 1499, type: !162)
!640 = !DISubprogram(name: "OneComponentChromaPrediction4x4", scope: !1, file: !1, line: 1569, type: !641, isLocal: false, isDefinition: true, scopeLine: 1577, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32, i32, i16******, i32, i16, i32, i32)* @OneComponentChromaPrediction4x4, variables: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !162, !77, !77, !518, !77, !394, !77, !77}
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mpred", arg: 1, scope: !640, file: !1, line: 1569, type: !162)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_c_x", arg: 2, scope: !640, file: !1, line: 1570, type: !77)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_c_y", arg: 3, scope: !640, file: !1, line: 1571, type: !77)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv", arg: 4, scope: !640, file: !1, line: 1572, type: !518)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list_idx", arg: 5, scope: !640, file: !1, line: 1573, type: !77)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 6, scope: !640, file: !1, line: 1574, type: !394)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 7, scope: !640, file: !1, line: 1575, type: !77)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 8, scope: !640, file: !1, line: 1576, type: !77)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !640, file: !1, line: 1578, type: !77)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !640, file: !1, line: 1578, type: !77)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !640, file: !1, line: 1578, type: !77)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !640, file: !1, line: 1578, type: !77)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii0", scope: !640, file: !1, line: 1578, type: !77)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj0", scope: !640, file: !1, line: 1578, type: !77)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii1", scope: !640, file: !1, line: 1578, type: !77)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj1", scope: !640, file: !1, line: 1578, type: !77)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "if0", scope: !640, file: !1, line: 1578, type: !77)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "if1", scope: !640, file: !1, line: 1578, type: !77)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jf0", scope: !640, file: !1, line: 1578, type: !77)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jf1", scope: !640, file: !1, line: 1578, type: !77)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mvb", scope: !640, file: !1, line: 1579, type: !393)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refimage", scope: !640, file: !1, line: 1580, type: !431)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f1_x", scope: !640, file: !1, line: 1581, type: !77)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f2_x", scope: !640, file: !1, line: 1582, type: !77)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f1_y", scope: !640, file: !1, line: 1584, type: !77)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f2_y", scope: !640, file: !1, line: 1585, type: !77)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f3", scope: !640, file: !1, line: 1587, type: !77)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f4", scope: !640, file: !1, line: 1587, type: !77)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !640, file: !1, line: 1589, type: !77)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_y_cr", scope: !640, file: !1, line: 1590, type: !77)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !640, file: !1, line: 1592, type: !395)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_mb_field", scope: !640, file: !1, line: 1594, type: !77)
!676 = !DISubprogram(name: "IntraChromaPrediction4x4", scope: !1, file: !1, line: 1647, type: !677, isLocal: false, isDefinition: true, scopeLine: 1650, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32)* @IntraChromaPrediction4x4, variables: !679)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !77, !77, !77}
!679 = !{!680, !681, !682, !683, !684, !685}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 1, scope: !676, file: !1, line: 1647, type: !77)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 2, scope: !676, file: !1, line: 1648, type: !77)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 3, scope: !676, file: !1, line: 1649, type: !77)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !676, file: !1, line: 1651, type: !77)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !676, file: !1, line: 1652, type: !77)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !676, file: !1, line: 1652, type: !77)
!686 = !DISubprogram(name: "ChromaPrediction4x4", scope: !1, file: !1, line: 1671, type: !687, isLocal: false, isDefinition: true, scopeLine: 1679, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32, i16, i16)* @ChromaPrediction4x4, variables: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !77, !77, !77, !77, !77, !77, !394, !394}
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 1, scope: !686, file: !1, line: 1671, type: !77)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 2, scope: !686, file: !1, line: 1672, type: !77)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 3, scope: !686, file: !1, line: 1673, type: !77)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_dir", arg: 4, scope: !686, file: !1, line: 1674, type: !77)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_mode", arg: 5, scope: !686, file: !1, line: 1675, type: !77)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_mode", arg: 6, scope: !686, file: !1, line: 1676, type: !77)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref_idx", arg: 7, scope: !686, file: !1, line: 1677, type: !394)
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref_idx", arg: 8, scope: !686, file: !1, line: 1678, type: !394)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !686, file: !1, line: 1683, type: !77)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !686, file: !1, line: 1683, type: !77)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x4", scope: !686, file: !1, line: 1684, type: !77)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y4", scope: !686, file: !1, line: 1685, type: !77)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fpred", scope: !686, file: !1, line: 1686, type: !162)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bpred", scope: !686, file: !1, line: 1687, type: !162)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_array", scope: !686, file: !1, line: 1688, type: !518)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !686, file: !1, line: 1690, type: !93)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !686, file: !1, line: 1692, type: !77)
!707 = !DISubprogram(name: "ChromaResidualCoding", scope: !1, file: !1, line: 1769, type: !708, isLocal: false, isDefinition: true, scopeLine: 1770, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @ChromaResidualCoding, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !162}
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !728, !729, !730, !731}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr_cbp", arg: 1, scope: !707, file: !1, line: 1769, type: !162)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !707, file: !1, line: 1771, type: !77)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8", scope: !707, file: !1, line: 1771, type: !77)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !707, file: !1, line: 1771, type: !77)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !707, file: !1, line: 1771, type: !77)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !707, file: !1, line: 1771, type: !77)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !707, file: !1, line: 1771, type: !77)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_mode", scope: !707, file: !1, line: 1772, type: !77)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_mode", scope: !707, file: !1, line: 1772, type: !77)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_dir", scope: !707, file: !1, line: 1773, type: !394)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refframe", scope: !707, file: !1, line: 1773, type: !394)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_ref", scope: !707, file: !1, line: 1773, type: !394)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skipped", scope: !707, file: !1, line: 1774, type: !77)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yuv", scope: !707, file: !1, line: 1775, type: !77)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8_idx", scope: !707, file: !1, line: 1777, type: !726)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1536, align: 32, elements: !727)
!727 = !{!280, !114, !114}
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !707, file: !1, line: 1793, type: !77)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !707, file: !1, line: 1793, type: !77)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !707, file: !1, line: 1793, type: !77)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !707, file: !1, line: 1793, type: !77)
!732 = !DISubprogram(name: "IntraChromaPrediction", scope: !1, file: !1, line: 1927, type: !733, isLocal: false, isDefinition: true, scopeLine: 1928, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i32*)* @IntraChromaPrediction, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !162, !162, !162}
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !779, !783, !784, !785, !786, !787, !788, !789, !790}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_up", arg: 1, scope: !732, file: !1, line: 1927, type: !162)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_left", arg: 2, scope: !732, file: !1, line: 1927, type: !162)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_up_left", arg: 3, scope: !732, file: !1, line: 1927, type: !162)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !732, file: !1, line: 1930, type: !93)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !732, file: !1, line: 1931, type: !77)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !732, file: !1, line: 1931, type: !77)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !732, file: !1, line: 1931, type: !77)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !732, file: !1, line: 1931, type: !77)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s3", scope: !732, file: !1, line: 1931, type: !77)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !732, file: !1, line: 1931, type: !77)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !732, file: !1, line: 1931, type: !77)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !732, file: !1, line: 1931, type: !77)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "image", scope: !732, file: !1, line: 1932, type: !431)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !732, file: !1, line: 1933, type: !77)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !732, file: !1, line: 1933, type: !77)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !732, file: !1, line: 1934, type: !77)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_available_up", scope: !732, file: !1, line: 1935, type: !77)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_available_left", scope: !732, file: !1, line: 1936, type: !754)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, align: 32, elements: !307)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_available_up_left", scope: !732, file: !1, line: 1937, type: !77)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ih", scope: !732, file: !1, line: 1938, type: !77)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !732, file: !1, line: 1938, type: !77)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ib", scope: !732, file: !1, line: 1939, type: !77)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ic", scope: !732, file: !1, line: 1939, type: !77)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iaa", scope: !732, file: !1, line: 1939, type: !77)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !732, file: !1, line: 1940, type: !77)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hline", scope: !732, file: !1, line: 1941, type: !116)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vline", scope: !732, file: !1, line: 1941, type: !116)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !732, file: !1, line: 1942, type: !77)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_mode", scope: !732, file: !1, line: 1943, type: !77)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !732, file: !1, line: 1944, type: !77)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_cost", scope: !732, file: !1, line: 1945, type: !77)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !732, file: !1, line: 1946, type: !116)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !732, file: !1, line: 1947, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !4, line: 305, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !4, line: 297, size: 192, align: 32, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !771, file: !4, line: 299, baseType: !77, size: 32, align: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !771, file: !4, line: 300, baseType: !77, size: 32, align: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !771, file: !4, line: 301, baseType: !77, size: 32, align: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !771, file: !4, line: 302, baseType: !77, size: 32, align: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !771, file: !4, line: 303, baseType: !77, size: 32, align: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !771, file: !4, line: 304, baseType: !77, size: 32, align: 32, offset: 160)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !732, file: !1, line: 1948, type: !780)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 3264, align: 32, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 17)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_MB_x", scope: !732, file: !1, line: 1949, type: !77)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_MB_y", scope: !732, file: !1, line: 1950, type: !77)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blk_x", scope: !732, file: !1, line: 1953, type: !77)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blk_y", scope: !732, file: !1, line: 1954, type: !77)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !732, file: !1, line: 1955, type: !77)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !732, file: !1, line: 1955, type: !77)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yuv", scope: !732, file: !1, line: 1956, type: !77)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_pos", scope: !732, file: !1, line: 1958, type: !726)
!791 = !DISubprogram(name: "ZeroRef", scope: !1, file: !1, line: 2151, type: !792, isLocal: false, isDefinition: true, scopeLine: 2152, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.macroblock*)* @ZeroRef, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!77, !93}
!794 = !{!795, !796, !797}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !791, file: !1, line: 2151, type: !93)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !791, file: !1, line: 2153, type: !77)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !791, file: !1, line: 2153, type: !77)
!798 = !DISubprogram(name: "MBType2Value", scope: !1, file: !1, line: 2174, type: !792, isLocal: false, isDefinition: true, scopeLine: 2175, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.macroblock*)* @MBType2Value, variables: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !798, file: !1, line: 2174, type: !93)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbtype", scope: !798, file: !1, line: 2181, type: !77)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdir0", scope: !798, file: !1, line: 2181, type: !77)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdir1", scope: !798, file: !1, line: 2181, type: !77)
!804 = !DISubprogram(name: "writeIntra4x4Modes", scope: !1, file: !1, line: 2220, type: !81, isLocal: false, isDefinition: true, scopeLine: 2221, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @writeIntra4x4Modes, variables: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "only_this_block", arg: 1, scope: !804, file: !1, line: 2220, type: !77)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !804, file: !1, line: 2222, type: !77)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !804, file: !1, line: 2222, type: !77)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bs_x", scope: !804, file: !1, line: 2222, type: !77)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bs_y", scope: !804, file: !1, line: 2222, type: !77)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !804, file: !1, line: 2222, type: !77)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !804, file: !1, line: 2222, type: !77)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8", scope: !804, file: !1, line: 2223, type: !77)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !804, file: !1, line: 2224, type: !77)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipred_array", scope: !804, file: !1, line: 2225, type: !116)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cont_array", scope: !804, file: !1, line: 2225, type: !116)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipred_number", scope: !804, file: !1, line: 2225, type: !77)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !804, file: !1, line: 2226, type: !93)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !804, file: !1, line: 2227, type: !241)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !804, file: !1, line: 2228, type: !162)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !804, file: !1, line: 2229, type: !177)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !804, file: !1, line: 2230, type: !188)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !804, file: !1, line: 2231, type: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!826 = !DISubprogram(name: "B8Mode2Value", scope: !1, file: !1, line: 2294, type: !827, isLocal: false, isDefinition: true, scopeLine: 2295, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @B8Mode2Value, variables: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!77, !77, !77}
!829 = !{!830, !831}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8mode", arg: 1, scope: !826, file: !1, line: 2294, type: !77)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8pdir", arg: 2, scope: !826, file: !1, line: 2294, type: !77)
!832 = !DISubprogram(name: "writeMBLayer", scope: !1, file: !1, line: 2315, type: !81, isLocal: false, isDefinition: true, scopeLine: 2316, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @writeMBLayer, variables: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rdopt", arg: 1, scope: !832, file: !1, line: 2315, type: !77)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !832, file: !1, line: 2317, type: !77)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !832, file: !1, line: 2317, type: !77)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !832, file: !1, line: 2318, type: !77)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !832, file: !1, line: 2319, type: !93)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevMB", scope: !832, file: !1, line: 2320, type: !93)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !832, file: !1, line: 2321, type: !241)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !832, file: !1, line: 2322, type: !162)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !832, file: !1, line: 2323, type: !177)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !832, file: !1, line: 2324, type: !188)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !832, file: !1, line: 2325, type: !824)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_bits", scope: !832, file: !1, line: 2326, type: !77)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skip", scope: !832, file: !1, line: 2327, type: !77)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_type", scope: !832, file: !1, line: 2328, type: !77)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevMbSkipped", scope: !832, file: !1, line: 2329, type: !77)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_field_tmp", scope: !832, file: !1, line: 2330, type: !77)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "topMB", scope: !832, file: !1, line: 2331, type: !93)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "WriteFrameFieldMBInHeader", scope: !832, file: !1, line: 2333, type: !77)
!852 = !DISubprogram(name: "write_terminating_bit", scope: !1, file: !1, line: 2682, type: !853, isLocal: false, isDefinition: true, scopeLine: 2683, flags: DIFlagPrototyped, isOptimized: true, function: void (i16)* @write_terminating_bit, variables: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !394}
!855 = !{!856, !857, !858, !859}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bit", arg: 1, scope: !852, file: !1, line: 2682, type: !394)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !852, file: !1, line: 2684, type: !188)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !852, file: !1, line: 2685, type: !824)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep_dp", scope: !852, file: !1, line: 2686, type: !262)
!860 = !DISubprogram(name: "writeChromaIntraPredMode", scope: !1, file: !1, line: 2707, type: !861, isLocal: false, isDefinition: true, scopeLine: 2708, isOptimized: true, function: i32 ()* @writeChromaIntraPredMode, variables: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{!77}
!863 = !{!864, !865, !866, !867, !868, !869, !870}
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !860, file: !1, line: 2709, type: !93)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !860, file: !1, line: 2710, type: !241)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !860, file: !1, line: 2711, type: !177)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !860, file: !1, line: 2712, type: !162)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !860, file: !1, line: 2713, type: !824)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !860, file: !1, line: 2714, type: !77)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !860, file: !1, line: 2715, type: !188)
!871 = !DISubprogram(name: "set_last_dquant", scope: !1, file: !1, line: 2748, type: !89, isLocal: false, isDefinition: true, scopeLine: 2749, isOptimized: true, function: void ()* @set_last_dquant, variables: !872)
!872 = !{!873}
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !871, file: !1, line: 2750, type: !93)
!874 = !DISubprogram(name: "write_one_macroblock", scope: !1, file: !1, line: 2772, type: !75, isLocal: false, isDefinition: true, scopeLine: 2773, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @write_one_macroblock, variables: !875)
!875 = !{!876, !877, !878, !879, !880}
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eos_bit", arg: 1, scope: !874, file: !1, line: 2772, type: !77)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !874, file: !1, line: 2774, type: !93)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !874, file: !1, line: 2775, type: !162)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !874, file: !1, line: 2776, type: !77)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !874, file: !1, line: 2776, type: !77)
!881 = !DISubprogram(name: "BType2CtxRef", scope: !1, file: !1, line: 2846, type: !81, isLocal: false, isDefinition: true, scopeLine: 2847, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @BType2CtxRef, variables: !882)
!882 = !{!883}
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "btype", arg: 1, scope: !881, file: !1, line: 2846, type: !77)
!884 = !DISubprogram(name: "writeReferenceFrame", scope: !1, file: !1, line: 2859, type: !885, isLocal: false, isDefinition: true, scopeLine: 2860, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32, i32)* @writeReferenceFrame, variables: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{!77, !77, !77, !77, !77, !77}
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!888 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !884, file: !1, line: 2859, type: !77)
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !884, file: !1, line: 2859, type: !77)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "j", arg: 3, scope: !884, file: !1, line: 2859, type: !77)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fwd_flag", arg: 4, scope: !884, file: !1, line: 2859, type: !77)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 5, scope: !884, file: !1, line: 2859, type: !77)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !884, file: !1, line: 2861, type: !93)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !884, file: !1, line: 2862, type: !241)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !884, file: !1, line: 2863, type: !177)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !884, file: !1, line: 2864, type: !162)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !884, file: !1, line: 2865, type: !824)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !884, file: !1, line: 2866, type: !77)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !884, file: !1, line: 2867, type: !188)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !884, file: !1, line: 2868, type: !77)
