; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mb_access.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !10, globals: !171, imports: !695)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mb_access.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9}
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !{!11, !17, !93, !101, !106, !129, !140, !149, !161}
!11 = !DISubprogram(name: "mb_is_available", scope: !1, file: !1, line: 24, type: !12, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @mb_is_available, variables: !14)
!12 = !DISubroutineType(types: !13)
!13 = !{!9, !9, !9}
!14 = !{!15, !16}
!15 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbAddr", arg: 1, scope: !11, file: !1, line: 24, type: !9)
!16 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMbAddr", arg: 2, scope: !11, file: !1, line: 24, type: !9)
!17 = !DISubprogram(name: "CheckAvailabilityOfNeighbors", scope: !1, file: !1, line: 47, type: !18, isLocal: false, isDefinition: true, scopeLine: 48, isOptimized: true, function: void ()* @CheckAvailabilityOfNeighbors, variables: !20)
!18 = !DISubroutineType(types: !19)
!19 = !{null}
!20 = !{!21, !23}
!21 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !17, file: !1, line: 49, type: !22)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !17, file: !1, line: 50, type: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !26, line: 406, baseType: !27)
!26 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !26, line: 351, size: 5056, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !38, !40, !41, !42, !47, !51, !52, !53, !58, !61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !27, file: !26, line: 353, baseType: !9, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !27, file: !26, line: 354, baseType: !9, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !27, file: !26, line: 355, baseType: !9, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !27, file: !26, line: 356, baseType: !9, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !27, file: !26, line: 357, baseType: !9, size: 32, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !27, file: !26, line: 358, baseType: !35, size: 256, align: 32, offset: 160)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 32, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !27, file: !26, line: 360, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !27, file: !26, line: 361, baseType: !39, size: 64, align: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !27, file: !26, line: 363, baseType: !9, size: 32, align: 32, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !27, file: !26, line: 364, baseType: !43, size: 2048, align: 32, offset: 608)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, align: 32, elements: !44)
!44 = !{!45, !46, !46, !45}
!45 = !DISubrange(count: 2)
!46 = !DISubrange(count: 4)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !27, file: !26, line: 365, baseType: !48, size: 512, align: 32, offset: 2656)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 32, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !27, file: !26, line: 366, baseType: !48, size: 512, align: 32, offset: 3168)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !27, file: !26, line: 367, baseType: !9, size: 32, align: 32, offset: 3680)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !27, file: !26, line: 368, baseType: !54, size: 64, align: 64, offset: 3712)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !26, line: 62, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 30, baseType: !57)
!56 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !27, file: !26, line: 369, baseType: !59, size: 128, align: 32, offset: 3776)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, align: 32, elements: !60)
!60 = !{!46}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !27, file: !26, line: 370, baseType: !59, size: 128, align: 32, offset: 3904)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !27, file: !26, line: 371, baseType: !63, size: 64, align: 64, offset: 4032)
!63 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !27, file: !26, line: 373, baseType: !9, size: 32, align: 32, offset: 4096)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !27, file: !26, line: 374, baseType: !9, size: 32, align: 32, offset: 4128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !27, file: !26, line: 375, baseType: !9, size: 32, align: 32, offset: 4160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !27, file: !26, line: 377, baseType: !9, size: 32, align: 32, offset: 4192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !27, file: !26, line: 378, baseType: !9, size: 32, align: 32, offset: 4224)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !27, file: !26, line: 380, baseType: !9, size: 32, align: 32, offset: 4256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !27, file: !26, line: 382, baseType: !9, size: 32, align: 32, offset: 4288)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !27, file: !26, line: 382, baseType: !9, size: 32, align: 32, offset: 4320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !27, file: !26, line: 382, baseType: !9, size: 32, align: 32, offset: 4352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !27, file: !26, line: 382, baseType: !9, size: 32, align: 32, offset: 4384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !27, file: !26, line: 383, baseType: !9, size: 32, align: 32, offset: 4416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !27, file: !26, line: 383, baseType: !9, size: 32, align: 32, offset: 4448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !27, file: !26, line: 383, baseType: !9, size: 32, align: 32, offset: 4480)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !27, file: !26, line: 383, baseType: !9, size: 32, align: 32, offset: 4512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !27, file: !26, line: 385, baseType: !9, size: 32, align: 32, offset: 4544)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !27, file: !26, line: 386, baseType: !9, size: 32, align: 32, offset: 4576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !27, file: !26, line: 387, baseType: !9, size: 32, align: 32, offset: 4608)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !27, file: !26, line: 390, baseType: !9, size: 32, align: 32, offset: 4640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !27, file: !26, line: 394, baseType: !83, size: 64, align: 64, offset: 4672)
!83 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !27, file: !26, line: 395, baseType: !9, size: 32, align: 32, offset: 4736)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !27, file: !26, line: 396, baseType: !9, size: 32, align: 32, offset: 4768)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !27, file: !26, line: 397, baseType: !9, size: 32, align: 32, offset: 4800)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !27, file: !26, line: 398, baseType: !9, size: 32, align: 32, offset: 4832)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !27, file: !26, line: 399, baseType: !9, size: 32, align: 32, offset: 4864)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !27, file: !26, line: 401, baseType: !9, size: 32, align: 32, offset: 4896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !27, file: !26, line: 402, baseType: !9, size: 32, align: 32, offset: 4928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !27, file: !26, line: 403, baseType: !9, size: 32, align: 32, offset: 4960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !27, file: !26, line: 405, baseType: !9, size: 32, align: 32, offset: 4992)
!93 = !DISubprogram(name: "get_mb_block_pos", scope: !1, file: !1, line: 92, type: !94, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*)* @get_mb_block_pos, variables: !97)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !9, !96, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!97 = !{!98, !99, !100}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_addr", arg: 1, scope: !93, file: !1, line: 92, type: !9)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !93, file: !1, line: 92, type: !96)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !93, file: !1, line: 92, type: !96)
!101 = !DISubprogram(name: "get_mb_pos", scope: !1, file: !1, line: 114, type: !94, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*)* @get_mb_pos, variables: !102)
!102 = !{!103, !104, !105}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_addr", arg: 1, scope: !101, file: !1, line: 114, type: !9)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !101, file: !1, line: 114, type: !96)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !101, file: !1, line: 114, type: !96)
!106 = !DISubprogram(name: "getNonAffNeighbour", scope: !1, file: !1, line: 139, type: !107, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, %struct.pix_pos*)* @getNonAffNeighbour, variables: !120)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !109, !9, !9, !9, !110}
!109 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !26, line: 305, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !26, line: 297, size: 192, align: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !112, file: !26, line: 299, baseType: !9, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !112, file: !26, line: 300, baseType: !9, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !112, file: !26, line: 301, baseType: !9, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !112, file: !26, line: 302, baseType: !9, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !112, file: !26, line: 303, baseType: !9, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !112, file: !26, line: 304, baseType: !9, size: 32, align: 32, offset: 160)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curr_mb_nr", arg: 1, scope: !106, file: !1, line: 139, type: !109)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xN", arg: 2, scope: !106, file: !1, line: 139, type: !9)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "yN", arg: 3, scope: !106, file: !1, line: 139, type: !9)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "luma", arg: 4, scope: !106, file: !1, line: 139, type: !9)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pix", arg: 5, scope: !106, file: !1, line: 139, type: !110)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMb", scope: !106, file: !1, line: 141, type: !24)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxW", scope: !106, file: !1, line: 142, type: !9)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxH", scope: !106, file: !1, line: 142, type: !9)
!129 = !DISubprogram(name: "getAffNeighbour", scope: !1, file: !1, line: 220, type: !107, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, %struct.pix_pos*)* @getAffNeighbour, variables: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curr_mb_nr", arg: 1, scope: !129, file: !1, line: 220, type: !109)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xN", arg: 2, scope: !129, file: !1, line: 220, type: !9)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "yN", arg: 3, scope: !129, file: !1, line: 220, type: !9)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "luma", arg: 4, scope: !129, file: !1, line: 220, type: !9)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pix", arg: 5, scope: !129, file: !1, line: 220, type: !110)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMb", scope: !129, file: !1, line: 222, type: !24)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxW", scope: !129, file: !1, line: 223, type: !9)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxH", scope: !129, file: !1, line: 223, type: !9)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yM", scope: !129, file: !1, line: 224, type: !9)
!140 = !DISubprogram(name: "getNeighbour", scope: !1, file: !1, line: 598, type: !141, isLocal: false, isDefinition: true, scopeLine: 599, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, %struct.pix_pos*)* @getNeighbour, variables: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !9, !9, !9, !9, !110}
!143 = !{!144, !145, !146, !147, !148}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curr_mb_nr", arg: 1, scope: !140, file: !1, line: 598, type: !9)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xN", arg: 2, scope: !140, file: !1, line: 598, type: !9)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "yN", arg: 3, scope: !140, file: !1, line: 598, type: !9)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "luma", arg: 4, scope: !140, file: !1, line: 598, type: !9)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pix", arg: 5, scope: !140, file: !1, line: 598, type: !110)
!149 = !DISubprogram(name: "getLuma4x4Neighbour", scope: !1, file: !1, line: 628, type: !150, isLocal: false, isDefinition: true, scopeLine: 629, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, %struct.pix_pos*)* @getLuma4x4Neighbour, variables: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !9, !9, !9, !9, !9, !110}
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curr_mb_nr", arg: 1, scope: !149, file: !1, line: 628, type: !9)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 2, scope: !149, file: !1, line: 628, type: !9)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 3, scope: !149, file: !1, line: 628, type: !9)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rel_x", arg: 4, scope: !149, file: !1, line: 628, type: !9)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rel_y", arg: 5, scope: !149, file: !1, line: 628, type: !9)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pix", arg: 6, scope: !149, file: !1, line: 628, type: !110)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !149, file: !1, line: 630, type: !9)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !149, file: !1, line: 631, type: !9)
!161 = !DISubprogram(name: "getChroma4x4Neighbour", scope: !1, file: !1, line: 663, type: !150, isLocal: false, isDefinition: true, scopeLine: 664, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, %struct.pix_pos*)* @getChroma4x4Neighbour, variables: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curr_mb_nr", arg: 1, scope: !161, file: !1, line: 663, type: !9)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 2, scope: !161, file: !1, line: 663, type: !9)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 3, scope: !161, file: !1, line: 663, type: !9)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rel_x", arg: 4, scope: !161, file: !1, line: 663, type: !9)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rel_y", arg: 5, scope: !161, file: !1, line: 663, type: !9)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pix", arg: 6, scope: !161, file: !1, line: 663, type: !110)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !161, file: !1, line: 665, type: !9)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !161, file: !1, line: 666, type: !9)
!171 = !{!172, !362, !363, !364, !365, !366, !369, !371, !373, !374, !375, !376, !377, !413, !508, !509, !510, !512, !513, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !549, !552, !553, !554, !555, !556, !557, !560, !563, !564, !565, !566, !569, !570, !581, !617, !618, !619, !620, !621, !679, !680, !681, !682, !683, !687, !688, !689, !690, !691, !692, !693, !694}
!172 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !26, line: 558, type: !173, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !26, line: 484, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 475, size: 6592, align: 64, elements: !176)
!176 = !{!177, !178, !179, !357, !358, !360, !361}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !175, file: !26, line: 477, baseType: !9, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !175, file: !26, line: 478, baseType: !9, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !175, file: !26, line: 479, baseType: !180, size: 6400, align: 64, offset: 64)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 6400, align: 64, elements: !355)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !26, line: 471, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 443, size: 1216, align: 64, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !268, !303, !330, !339, !340, !341, !342, !343, !344, !345, !346, !347, !352}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !183, file: !26, line: 445, baseType: !9, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !183, file: !26, line: 446, baseType: !9, size: 32, align: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !183, file: !26, line: 447, baseType: !9, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !183, file: !26, line: 448, baseType: !9, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !183, file: !26, line: 449, baseType: !9, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !183, file: !26, line: 450, baseType: !9, size: 32, align: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !183, file: !26, line: 451, baseType: !192, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !26, line: 440, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !26, line: 430, size: 960, align: 64, elements: !195)
!195 = !{!196, !216, !240}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !194, file: !26, line: 433, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !26, line: 427, baseType: !199)
!199 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 411, size: 384, align: 64, elements: !200)
!200 = !{!201, !202, !203, !207, !208, !209, !210, !211, !212, !213, !215}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !199, file: !26, line: 413, baseType: !9, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !199, file: !26, line: 414, baseType: !9, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !199, file: !26, line: 415, baseType: !204, size: 8, align: 8, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !205, line: 30, baseType: !206)
!205 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!206 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !199, file: !26, line: 416, baseType: !9, size: 32, align: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !199, file: !26, line: 417, baseType: !9, size: 32, align: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !199, file: !26, line: 418, baseType: !204, size: 8, align: 8, offset: 160)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !199, file: !26, line: 420, baseType: !204, size: 8, align: 8, offset: 168)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !199, file: !26, line: 421, baseType: !9, size: 32, align: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !199, file: !26, line: 422, baseType: !9, size: 32, align: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !199, file: !26, line: 424, baseType: !214, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !199, file: !26, line: 425, baseType: !9, size: 32, align: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !194, file: !26, line: 434, baseType: !217, size: 832, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !26, line: 226, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 207, size: 832, align: 64, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !218, file: !26, line: 209, baseType: !109, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !218, file: !26, line: 209, baseType: !109, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !218, file: !26, line: 210, baseType: !109, size: 32, align: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !218, file: !26, line: 211, baseType: !109, size: 32, align: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !218, file: !26, line: 212, baseType: !109, size: 32, align: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !218, file: !26, line: 213, baseType: !214, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !218, file: !26, line: 214, baseType: !96, size: 64, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !218, file: !26, line: 217, baseType: !109, size: 32, align: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !218, file: !26, line: 217, baseType: !109, size: 32, align: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !218, file: !26, line: 218, baseType: !109, size: 32, align: 32, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !218, file: !26, line: 219, baseType: !109, size: 32, align: 32, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !218, file: !26, line: 220, baseType: !109, size: 32, align: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !218, file: !26, line: 221, baseType: !214, size: 64, align: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !218, file: !26, line: 222, baseType: !96, size: 64, align: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !218, file: !26, line: 223, baseType: !9, size: 32, align: 32, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !218, file: !26, line: 223, baseType: !9, size: 32, align: 32, offset: 672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !218, file: !26, line: 224, baseType: !9, size: 32, align: 32, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !218, file: !26, line: 224, baseType: !9, size: 32, align: 32, offset: 736)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !218, file: !26, line: 225, baseType: !9, size: 32, align: 32, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !218, file: !26, line: 225, baseType: !9, size: 32, align: 32, offset: 800)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !194, file: !26, line: 436, baseType: !241, size: 64, align: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!9, !244, !267}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !26, line: 348, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !26, line: 327, size: 384, align: 64, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !260}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !26, line: 329, baseType: !9, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !246, file: !26, line: 330, baseType: !9, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !246, file: !26, line: 331, baseType: !9, size: 32, align: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !246, file: !26, line: 332, baseType: !9, size: 32, align: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !246, file: !26, line: 333, baseType: !9, size: 32, align: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !246, file: !26, line: 334, baseType: !109, size: 32, align: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !246, file: !26, line: 335, baseType: !9, size: 32, align: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !246, file: !26, line: 336, baseType: !9, size: 32, align: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !246, file: !26, line: 344, baseType: !257, size: 64, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !9, !9, !96, !96}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !246, file: !26, line: 346, baseType: !261, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !264, !265}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !26, line: 228, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !183, file: !26, line: 452, baseType: !269, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !26, line: 268, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 258, size: 12032, align: 64, elements: !272)
!272 = !{!273, !285, !289, !293, !297, !299, !300}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !271, file: !26, line: 260, baseType: !274, size: 4224, align: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 4224, align: 64, elements: !282)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !26, line: 238, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 231, size: 128, align: 64, elements: !277)
!277 = !{!278, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !276, file: !26, line: 233, baseType: !279, size: 16, align: 16)
!279 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !276, file: !26, line: 234, baseType: !206, size: 8, align: 8, offset: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !276, file: !26, line: 236, baseType: !63, size: 64, align: 64, offset: 64)
!282 = !{!283, !284}
!283 = !DISubrange(count: 3)
!284 = !DISubrange(count: 11)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !271, file: !26, line: 261, baseType: !286, size: 2304, align: 64, offset: 4224)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 2304, align: 64, elements: !287)
!287 = !{!45, !288}
!288 = !DISubrange(count: 9)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !271, file: !26, line: 262, baseType: !290, size: 2560, align: 64, offset: 6528)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 2560, align: 64, elements: !291)
!291 = !{!45, !292}
!292 = !DISubrange(count: 10)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !271, file: !26, line: 263, baseType: !294, size: 1536, align: 64, offset: 9088)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 1536, align: 64, elements: !295)
!295 = !{!45, !296}
!296 = !DISubrange(count: 6)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !271, file: !26, line: 264, baseType: !298, size: 512, align: 64, offset: 10624)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 512, align: 64, elements: !60)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !271, file: !26, line: 265, baseType: !298, size: 512, align: 64, offset: 11136)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !271, file: !26, line: 266, baseType: !301, size: 384, align: 64, offset: 11648)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 384, align: 64, elements: !302)
!302 = !{!283}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !183, file: !26, line: 453, baseType: !304, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !26, line: 293, baseType: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 281, size: 97024, align: 64, elements: !307)
!307 = !{!308, !311, !312, !315, !318, !322, !323, !327, !328, !329}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !306, file: !26, line: 283, baseType: !309, size: 256, align: 64)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 256, align: 64, elements: !310)
!310 = !{!45}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !306, file: !26, line: 284, baseType: !298, size: 512, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !306, file: !26, line: 285, baseType: !313, size: 1536, align: 64, offset: 768)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 1536, align: 64, elements: !314)
!314 = !{!283, !46}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !306, file: !26, line: 286, baseType: !316, size: 5120, align: 64, offset: 2304)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 5120, align: 64, elements: !317)
!317 = !{!292, !46}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !306, file: !26, line: 287, baseType: !319, size: 19200, align: 64, offset: 7424)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 19200, align: 64, elements: !320)
!320 = !{!292, !321}
!321 = !DISubrange(count: 15)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !306, file: !26, line: 288, baseType: !319, size: 19200, align: 64, offset: 26624)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !306, file: !26, line: 289, baseType: !324, size: 6400, align: 64, offset: 45824)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 6400, align: 64, elements: !325)
!325 = !{!292, !326}
!326 = !DISubrange(count: 5)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !306, file: !26, line: 290, baseType: !324, size: 6400, align: 64, offset: 52224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !306, file: !26, line: 291, baseType: !319, size: 19200, align: 64, offset: 58624)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !306, file: !26, line: 292, baseType: !319, size: 19200, align: 64, offset: 77824)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !183, file: !26, line: 456, baseType: !331, size: 64, align: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !26, line: 313, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !26, line: 308, size: 128, align: 64, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !333, file: !26, line: 310, baseType: !9, size: 32, align: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !333, file: !26, line: 311, baseType: !9, size: 32, align: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !333, file: !26, line: 312, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !183, file: !26, line: 458, baseType: !9, size: 32, align: 32, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !183, file: !26, line: 459, baseType: !96, size: 64, align: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !183, file: !26, line: 460, baseType: !96, size: 64, align: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !183, file: !26, line: 461, baseType: !96, size: 64, align: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !183, file: !26, line: 462, baseType: !9, size: 32, align: 32, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !183, file: !26, line: 463, baseType: !96, size: 64, align: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !183, file: !26, line: 464, baseType: !96, size: 64, align: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !183, file: !26, line: 465, baseType: !96, size: 64, align: 64, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !183, file: !26, line: 467, baseType: !348, size: 64, align: 64, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !9}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !183, file: !26, line: 469, baseType: !353, size: 192, align: 32, offset: 1024)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 32, elements: !354)
!354 = !{!283, !45}
!355 = !{!356}
!356 = !DISubrange(count: 100)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !175, file: !26, line: 480, baseType: !9, size: 32, align: 32, offset: 6464)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !175, file: !26, line: 481, baseType: !359, size: 32, align: 32, offset: 6496)
!359 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !175, file: !26, line: 482, baseType: !359, size: 32, align: 32, offset: 6528)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !175, file: !26, line: 483, baseType: !359, size: 32, align: 32, offset: 6560)
!362 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !26, line: 559, type: !173, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!363 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !26, line: 560, type: !173, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!364 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !26, line: 561, type: !173, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!365 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !26, line: 562, type: !173, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!366 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !26, line: 565, type: !367, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!369 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !26, line: 566, type: !370, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!371 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !26, line: 567, type: !372, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!373 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !26, line: 569, type: !109, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!374 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !26, line: 570, type: !109, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!375 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !26, line: 572, type: !9, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!376 = !DIGlobalVariable(name: "me_time", scope: !0, file: !26, line: 572, type: !9, isLocal: false, isDefinition: true, variable: i32* @me_time)
!377 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !26, line: 573, type: !378, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !380, file: !4, line: 105, baseType: !351, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !380, file: !4, line: 106, baseType: !109, size: 32, align: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !380, file: !4, line: 107, baseType: !109, size: 32, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !380, file: !4, line: 108, baseType: !351, size: 32, align: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !380, file: !4, line: 110, baseType: !351, size: 32, align: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !380, file: !4, line: 111, baseType: !351, size: 32, align: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !380, file: !4, line: 112, baseType: !35, size: 256, align: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !380, file: !4, line: 115, baseType: !351, size: 32, align: 32, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !380, file: !4, line: 116, baseType: !109, size: 32, align: 32, offset: 480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !380, file: !4, line: 117, baseType: !109, size: 32, align: 32, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !380, file: !4, line: 119, baseType: !393, size: 256, align: 32, offset: 544)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 256, align: 32, elements: !36)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !380, file: !4, line: 121, baseType: !393, size: 256, align: 32, offset: 800)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !380, file: !4, line: 122, baseType: !393, size: 256, align: 32, offset: 1056)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !380, file: !4, line: 124, baseType: !351, size: 32, align: 32, offset: 1312)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !380, file: !4, line: 125, baseType: !109, size: 32, align: 32, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !380, file: !4, line: 127, baseType: !109, size: 32, align: 32, offset: 1376)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !380, file: !4, line: 128, baseType: !214, size: 64, align: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !380, file: !4, line: 130, baseType: !9, size: 32, align: 32, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !380, file: !4, line: 131, baseType: !9, size: 32, align: 32, offset: 1504)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !380, file: !4, line: 132, baseType: !351, size: 32, align: 32, offset: 1536)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !380, file: !4, line: 133, baseType: !109, size: 32, align: 32, offset: 1568)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !380, file: !4, line: 134, baseType: !9, size: 32, align: 32, offset: 1600)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !380, file: !4, line: 135, baseType: !9, size: 32, align: 32, offset: 1632)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !380, file: !4, line: 136, baseType: !9, size: 32, align: 32, offset: 1664)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !380, file: !4, line: 138, baseType: !9, size: 32, align: 32, offset: 1696)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !380, file: !4, line: 139, baseType: !9, size: 32, align: 32, offset: 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !380, file: !4, line: 141, baseType: !351, size: 32, align: 32, offset: 1760)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !380, file: !4, line: 142, baseType: !351, size: 32, align: 32, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !380, file: !4, line: 143, baseType: !351, size: 32, align: 32, offset: 1824)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !380, file: !4, line: 144, baseType: !351, size: 32, align: 32, offset: 1856)
!413 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !26, line: 574, type: !414, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !416, file: !4, line: 151, baseType: !351, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !416, file: !4, line: 153, baseType: !109, size: 32, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !416, file: !4, line: 154, baseType: !351, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !416, file: !4, line: 155, baseType: !351, size: 32, align: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !416, file: !4, line: 156, baseType: !351, size: 32, align: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !416, file: !4, line: 157, baseType: !351, size: 32, align: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !416, file: !4, line: 158, baseType: !109, size: 32, align: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !416, file: !4, line: 159, baseType: !109, size: 32, align: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !416, file: !4, line: 160, baseType: !109, size: 32, align: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !416, file: !4, line: 162, baseType: !351, size: 32, align: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !416, file: !4, line: 163, baseType: !35, size: 256, align: 32, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !416, file: !4, line: 165, baseType: !109, size: 32, align: 32, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !416, file: !4, line: 166, baseType: !109, size: 32, align: 32, offset: 608)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !416, file: !4, line: 167, baseType: !109, size: 32, align: 32, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !416, file: !4, line: 168, baseType: !109, size: 32, align: 32, offset: 672)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !416, file: !4, line: 170, baseType: !109, size: 32, align: 32, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !416, file: !4, line: 172, baseType: !351, size: 32, align: 32, offset: 736)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !416, file: !4, line: 173, baseType: !9, size: 32, align: 32, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !416, file: !4, line: 174, baseType: !9, size: 32, align: 32, offset: 800)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !416, file: !4, line: 175, baseType: !109, size: 32, align: 32, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !416, file: !4, line: 177, baseType: !439, size: 8192, align: 32, offset: 864)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8192, align: 32, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !416, file: !4, line: 178, baseType: !109, size: 32, align: 32, offset: 9056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !416, file: !4, line: 179, baseType: !351, size: 32, align: 32, offset: 9088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !416, file: !4, line: 180, baseType: !109, size: 32, align: 32, offset: 9120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !416, file: !4, line: 181, baseType: !109, size: 32, align: 32, offset: 9152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !416, file: !4, line: 182, baseType: !351, size: 32, align: 32, offset: 9184)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !416, file: !4, line: 184, baseType: !351, size: 32, align: 32, offset: 9216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !416, file: !4, line: 185, baseType: !351, size: 32, align: 32, offset: 9248)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !416, file: !4, line: 186, baseType: !351, size: 32, align: 32, offset: 9280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !416, file: !4, line: 187, baseType: !109, size: 32, align: 32, offset: 9312)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !416, file: !4, line: 188, baseType: !109, size: 32, align: 32, offset: 9344)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !416, file: !4, line: 189, baseType: !109, size: 32, align: 32, offset: 9376)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !416, file: !4, line: 190, baseType: !109, size: 32, align: 32, offset: 9408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !416, file: !4, line: 191, baseType: !351, size: 32, align: 32, offset: 9440)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !416, file: !4, line: 192, baseType: !456, size: 7584, align: 32, offset: 9472)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !457)
!457 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !457, file: !4, line: 65, baseType: !351, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !457, file: !4, line: 66, baseType: !109, size: 32, align: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !457, file: !4, line: 67, baseType: !109, size: 32, align: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !457, file: !4, line: 68, baseType: !109, size: 32, align: 32, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !457, file: !4, line: 69, baseType: !351, size: 32, align: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !457, file: !4, line: 70, baseType: !351, size: 32, align: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !457, file: !4, line: 71, baseType: !351, size: 32, align: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !457, file: !4, line: 72, baseType: !109, size: 32, align: 32, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !457, file: !4, line: 73, baseType: !351, size: 32, align: 32, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !457, file: !4, line: 74, baseType: !351, size: 32, align: 32, offset: 288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !457, file: !4, line: 75, baseType: !109, size: 32, align: 32, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !457, file: !4, line: 76, baseType: !109, size: 32, align: 32, offset: 352)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !457, file: !4, line: 77, baseType: !109, size: 32, align: 32, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !457, file: !4, line: 78, baseType: !351, size: 32, align: 32, offset: 416)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !457, file: !4, line: 79, baseType: !109, size: 32, align: 32, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !457, file: !4, line: 80, baseType: !109, size: 32, align: 32, offset: 480)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !457, file: !4, line: 81, baseType: !351, size: 32, align: 32, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !457, file: !4, line: 82, baseType: !109, size: 32, align: 32, offset: 544)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !457, file: !4, line: 83, baseType: !109, size: 32, align: 32, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !457, file: !4, line: 84, baseType: !351, size: 32, align: 32, offset: 608)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !457, file: !4, line: 85, baseType: !351, size: 32, align: 32, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !457, file: !4, line: 86, baseType: !481, size: 3296, align: 32, offset: 672)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !482)
!482 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !491, !492, !493, !494, !495, !496}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !482, file: !4, line: 50, baseType: !109, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !482, file: !4, line: 51, baseType: !109, size: 32, align: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !482, file: !4, line: 52, baseType: !109, size: 32, align: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !482, file: !4, line: 53, baseType: !488, size: 1024, align: 32, offset: 96)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 1024, align: 32, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !482, file: !4, line: 54, baseType: !488, size: 1024, align: 32, offset: 1120)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !482, file: !4, line: 55, baseType: !488, size: 1024, align: 32, offset: 2144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !482, file: !4, line: 56, baseType: !109, size: 32, align: 32, offset: 3168)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !482, file: !4, line: 57, baseType: !109, size: 32, align: 32, offset: 3200)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !482, file: !4, line: 58, baseType: !109, size: 32, align: 32, offset: 3232)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !482, file: !4, line: 59, baseType: !109, size: 32, align: 32, offset: 3264)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !457, file: !4, line: 87, baseType: !351, size: 32, align: 32, offset: 3968)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !457, file: !4, line: 88, baseType: !481, size: 3296, align: 32, offset: 4000)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !457, file: !4, line: 90, baseType: !351, size: 32, align: 32, offset: 7296)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !457, file: !4, line: 91, baseType: !351, size: 32, align: 32, offset: 7328)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !457, file: !4, line: 92, baseType: !351, size: 32, align: 32, offset: 7360)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !457, file: !4, line: 93, baseType: !109, size: 32, align: 32, offset: 7392)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !457, file: !4, line: 94, baseType: !109, size: 32, align: 32, offset: 7424)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !457, file: !4, line: 95, baseType: !109, size: 32, align: 32, offset: 7456)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !457, file: !4, line: 96, baseType: !109, size: 32, align: 32, offset: 7488)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !457, file: !4, line: 97, baseType: !109, size: 32, align: 32, offset: 7520)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !457, file: !4, line: 98, baseType: !109, size: 32, align: 32, offset: 7552)
!508 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !26, line: 578, type: !9, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!509 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !26, line: 579, type: !9, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!510 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !26, line: 583, type: !511, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!512 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !26, line: 584, type: !511, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!513 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !26, line: 585, type: !514, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!515 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !26, line: 586, type: !9, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!516 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !26, line: 587, type: !9, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!517 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !26, line: 588, type: !9, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!518 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !26, line: 589, type: !9, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!519 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !26, line: 592, type: !367, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!520 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !26, line: 593, type: !367, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!521 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !26, line: 595, type: !370, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!522 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !26, line: 596, type: !370, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!523 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !26, line: 598, type: !367, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!524 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !26, line: 599, type: !370, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!525 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !26, line: 601, type: !367, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!526 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !26, line: 602, type: !370, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!527 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !26, line: 604, type: !528, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!532 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !26, line: 605, type: !529, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!533 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !26, line: 608, type: !534, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!535 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !26, line: 609, type: !534, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!536 = !DIGlobalVariable(name: "intras", scope: !0, file: !26, line: 610, type: !9, isLocal: false, isDefinition: true, variable: i32* @intras)
!537 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !26, line: 612, type: !9, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!538 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !26, line: 612, type: !9, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!539 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !26, line: 612, type: !9, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!540 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !26, line: 613, type: !9, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!541 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !26, line: 613, type: !9, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!542 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !26, line: 613, type: !9, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!543 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !26, line: 614, type: !9, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!544 = !DIGlobalVariable(name: "errortext", scope: !0, file: !26, line: 617, type: !545, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 2400, align: 8, elements: !547)
!546 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!547 = !{!548}
!548 = !DISubrange(count: 300)
!549 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !26, line: 620, type: !550, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8192, align: 32, elements: !551)
!551 = !{!50, !50}
!552 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !26, line: 620, type: !550, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!553 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !26, line: 620, type: !550, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!554 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !26, line: 621, type: !550, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!555 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !26, line: 621, type: !550, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!556 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !26, line: 621, type: !550, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!557 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !26, line: 622, type: !558, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 24576, align: 32, elements: !559)
!559 = !{!283, !50, !50}
!560 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !26, line: 623, type: !561, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, align: 32, elements: !562)
!562 = !{!45, !46, !46}
!563 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !26, line: 623, type: !561, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!564 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !26, line: 624, type: !561, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!565 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !26, line: 624, type: !561, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!566 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !26, line: 625, type: !567, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 32, elements: !568)
!568 = !{!46, !46}
!569 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !26, line: 625, type: !48, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!570 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !26, line: 1201, type: !571, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !26, line: 1190, baseType: !573)
!573 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 1182, size: 192, align: 32, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !573, file: !26, line: 1184, baseType: !9, size: 32, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !573, file: !26, line: 1185, baseType: !9, size: 32, align: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !573, file: !26, line: 1186, baseType: !9, size: 32, align: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !573, file: !26, line: 1187, baseType: !9, size: 32, align: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !573, file: !26, line: 1188, baseType: !9, size: 32, align: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !573, file: !26, line: 1189, baseType: !9, size: 32, align: 32, offset: 160)
!581 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !26, line: 1202, type: !582, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !26, line: 1177, baseType: !584)
!584 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 1145, size: 26880, align: 64, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !605, !606, !607, !608, !610, !611, !612, !613, !614, !615, !616}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !584, file: !26, line: 1147, baseType: !83, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !584, file: !26, line: 1149, baseType: !550, size: 8192, align: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !584, file: !26, line: 1150, baseType: !550, size: 8192, align: 32, offset: 8256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !584, file: !26, line: 1150, baseType: !550, size: 8192, align: 32, offset: 16448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !584, file: !26, line: 1151, baseType: !514, size: 64, align: 64, offset: 24640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !584, file: !26, line: 1152, baseType: !511, size: 64, align: 64, offset: 24704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !584, file: !26, line: 1153, baseType: !9, size: 32, align: 32, offset: 24768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !584, file: !26, line: 1155, baseType: !9, size: 32, align: 32, offset: 24800)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !584, file: !26, line: 1157, baseType: !59, size: 128, align: 32, offset: 24832)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !584, file: !26, line: 1157, baseType: !59, size: 128, align: 32, offset: 24960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !584, file: !26, line: 1158, baseType: !372, size: 64, align: 64, offset: 25088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !584, file: !26, line: 1159, baseType: !48, size: 512, align: 32, offset: 25152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !584, file: !26, line: 1160, baseType: !9, size: 32, align: 32, offset: 25664)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !584, file: !26, line: 1161, baseType: !54, size: 64, align: 64, offset: 25728)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !584, file: !26, line: 1162, baseType: !9, size: 32, align: 32, offset: 25792)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !584, file: !26, line: 1163, baseType: !602, size: 64, align: 64, offset: 25856)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !584, file: !26, line: 1164, baseType: !602, size: 64, align: 64, offset: 25920)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !584, file: !26, line: 1165, baseType: !602, size: 64, align: 64, offset: 25984)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !584, file: !26, line: 1166, baseType: !602, size: 64, align: 64, offset: 26048)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !584, file: !26, line: 1167, baseType: !609, size: 512, align: 16, offset: 26112)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 512, align: 16, elements: !562)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !584, file: !26, line: 1168, baseType: !9, size: 32, align: 32, offset: 26624)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !584, file: !26, line: 1169, baseType: !9, size: 32, align: 32, offset: 26656)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !584, file: !26, line: 1171, baseType: !9, size: 32, align: 32, offset: 26688)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !584, file: !26, line: 1172, baseType: !9, size: 32, align: 32, offset: 26720)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !584, file: !26, line: 1174, baseType: !9, size: 32, align: 32, offset: 26752)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !584, file: !26, line: 1175, baseType: !9, size: 32, align: 32, offset: 26784)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !584, file: !26, line: 1176, baseType: !9, size: 32, align: 32, offset: 26816)
!617 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !26, line: 1203, type: !583, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!618 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !26, line: 1203, type: !583, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!619 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !26, line: 1204, type: !583, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!620 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !26, line: 1204, type: !583, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!621 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !26, line: 1230, type: !622, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !624, line: 153, baseType: !625)
!624 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !624, line: 122, size: 1216, align: 64, elements: !626)
!626 = !{!627, !629, !630, !631, !632, !633, !638, !639, !641, !645, !650, !659, !665, !666, !669, !670, !672, !676, !677, !678}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !625, file: !624, line: 123, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !625, file: !624, line: 124, baseType: !9, size: 32, align: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !625, file: !624, line: 125, baseType: !9, size: 32, align: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !625, file: !624, line: 126, baseType: !531, size: 16, align: 16, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !625, file: !624, line: 127, baseType: !531, size: 16, align: 16, offset: 144)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !625, file: !624, line: 128, baseType: !634, size: 128, align: 64, offset: 192)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !624, line: 88, size: 128, align: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !634, file: !624, line: 89, baseType: !628, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !634, file: !624, line: 90, baseType: !9, size: 32, align: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !625, file: !624, line: 129, baseType: !9, size: 32, align: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !625, file: !624, line: 132, baseType: !640, size: 64, align: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !625, file: !624, line: 133, baseType: !642, size: 64, align: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!9, !640}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !625, file: !624, line: 134, baseType: !646, size: 64, align: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!9, !640, !649, !9}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !625, file: !624, line: 135, baseType: !651, size: 64, align: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!654, !640, !654, !9}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !624, line: 77, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !656, line: 71, baseType: !657)
!656 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !658, line: 46, baseType: !57)
!658 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !625, file: !624, line: 136, baseType: !660, size: 64, align: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!9, !640, !663, !9}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !625, file: !624, line: 139, baseType: !634, size: 128, align: 64, offset: 704)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !625, file: !624, line: 140, baseType: !667, size: 64, align: 64, offset: 832)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !624, line: 94, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !625, file: !624, line: 141, baseType: !9, size: 32, align: 32, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !625, file: !624, line: 144, baseType: !671, size: 24, align: 8, offset: 928)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 24, align: 8, elements: !302)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !625, file: !624, line: 145, baseType: !673, size: 8, align: 8, offset: 952)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 8, align: 8, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 1)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !625, file: !624, line: 148, baseType: !634, size: 128, align: 64, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !625, file: !624, line: 151, baseType: !9, size: 32, align: 32, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !625, file: !624, line: 152, baseType: !654, size: 64, align: 64, offset: 1152)
!679 = !DIGlobalVariable(name: "p_log", scope: !0, file: !26, line: 1231, type: !622, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!680 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !26, line: 1232, type: !622, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!681 = !DIGlobalVariable(name: "p_in", scope: !0, file: !26, line: 1233, type: !9, isLocal: false, isDefinition: true, variable: i32* @p_in)
!682 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !26, line: 1234, type: !9, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!683 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !26, line: 1237, type: !684, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 32, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 20)
!687 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !26, line: 1238, type: !684, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!688 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !26, line: 1239, type: !684, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!689 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !26, line: 1240, type: !684, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!690 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !26, line: 1241, type: !684, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!691 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !26, line: 1242, type: !684, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!692 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !26, line: 1456, type: !9, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!693 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !26, line: 1465, type: !9, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!694 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !26, line: 1466, type: !9, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!695 = !{}
!696 = !{i32 2, !"Dwarf Version", i32 2}
!697 = !{i32 2, !"Debug Info Version", i32 700000003}
!698 = !{i32 1, !"PIC Level", i32 2}
!699 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!700 = !DIExpression()
!701 = !DILocation(line: 24, column: 25, scope: !11)
!702 = !DILocation(line: 24, column: 37, scope: !11)
!703 = !DILocation(line: 26, column: 15, scope: !704)
!704 = distinct !DILexicalBlock(scope: !11, file: !1, line: 26, column: 7)
!705 = !DILocation(line: 26, column: 20, scope: !704)
!706 = !DILocation(line: 26, column: 39, scope: !704)
!707 = !{!708, !708, i64 0}
!708 = !{!"any pointer", !709, i64 0}
!709 = !{!"omnipotent char", !710, i64 0}
!710 = !{!"Simple C/C++ TBAA"}
!711 = !DILocation(line: 26, column: 44, scope: !704)
!712 = !{!713, !714, i64 72484}
