; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.colocated_params = type { i32, i32, i32, [6 x [33 x i64]], i16***, i64***, i16****, i8**, [6 x [33 x i64]], i16***, i64***, i16****, i8**, [6 x [33 x i64]], i16***, i64***, i16****, i8**, i32, i8** }
%struct.seq_parameter_set_rbsp_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.vui_seq_parameters_t }
%struct.vui_seq_parameters_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.hrd_parameters_t, i32, %struct.hrd_parameters_t, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.hrd_parameters_t = type { i32, i32, i32, [32 x i32], [32 x i32], [32 x i32], i32, i32, i32, i32 }
%struct.decoded_picture_buffer = type { %struct.frame_store**, %struct.frame_store**, %struct.frame_store**, i32, i32, i32, i32, i32, i32, i32, %struct.frame_store* }
%struct.frame_store = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.storable_picture*, %struct.storable_picture*, %struct.storable_picture* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !21, subprograms: !124, globals: !1048, imports: !999)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !9, !16}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 185, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FRAME", value: 0)
!7 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!8 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 192, size: 32, align: 32, elements: !10)
!10 = !{!11, !12, !13, !14, !15}
!11 = !DIEnumerator(name: "P_SLICE", value: 0)
!12 = !DIEnumerator(name: "B_SLICE", value: 1)
!13 = !DIEnumerator(name: "I_SLICE", value: 2)
!14 = !DIEnumerator(name: "SP_SLICE", value: 3)
!15 = !DIEnumerator(name: "SI_SLICE", value: 4)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 42, size: 32, align: 32, elements: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !{!19, !20}
!19 = !DIEnumerator(name: "FALSE", value: 0)
!20 = !DIEnumerator(name: "TRUE", value: 1)
!21 = !{!22, !23, !24, !25, !106}
!22 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !28, line: 82, baseType: !29)
!28 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !28, line: 21, size: 52672, align: 64, elements: !30)
!30 = !{!31, !33, !34, !35, !36, !37, !38, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !69, !70, !71, !72, !73, !75, !80, !85, !89, !90, !92, !94, !95, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !29, file: !28, line: 23, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !4, line: 190, baseType: !3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !29, file: !28, line: 25, baseType: !24, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !29, file: !28, line: 26, baseType: !24, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !29, file: !28, line: 27, baseType: !24, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !29, file: !28, line: 28, baseType: !24, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !29, file: !28, line: 29, baseType: !24, size: 32, align: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !29, file: !28, line: 30, baseType: !39, size: 12672, align: 64, offset: 192)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 12672, align: 64, elements: !44)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !42, line: 30, baseType: !43)
!42 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!43 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!44 = !{!45, !46}
!45 = !DISubrange(count: 6)
!46 = !DISubrange(count: 33)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !29, file: !28, line: 31, baseType: !39, size: 12672, align: 64, offset: 12864)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !29, file: !28, line: 32, baseType: !39, size: 12672, align: 64, offset: 25536)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !29, file: !28, line: 33, baseType: !39, size: 12672, align: 64, offset: 38208)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !29, file: !28, line: 34, baseType: !22, size: 32, align: 32, offset: 50880)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !29, file: !28, line: 35, baseType: !24, size: 32, align: 32, offset: 50912)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !29, file: !28, line: 36, baseType: !24, size: 32, align: 32, offset: 50944)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !29, file: !28, line: 37, baseType: !24, size: 32, align: 32, offset: 50976)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !29, file: !28, line: 39, baseType: !24, size: 32, align: 32, offset: 51008)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !29, file: !28, line: 40, baseType: !24, size: 32, align: 32, offset: 51040)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !29, file: !28, line: 41, baseType: !24, size: 32, align: 32, offset: 51072)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !29, file: !28, line: 42, baseType: !24, size: 32, align: 32, offset: 51104)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !29, file: !28, line: 44, baseType: !24, size: 32, align: 32, offset: 51136)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !29, file: !28, line: 44, baseType: !24, size: 32, align: 32, offset: 51168)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !29, file: !28, line: 44, baseType: !24, size: 32, align: 32, offset: 51200)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !29, file: !28, line: 44, baseType: !24, size: 32, align: 32, offset: 51232)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !29, file: !28, line: 45, baseType: !24, size: 32, align: 32, offset: 51264)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !29, file: !28, line: 46, baseType: !24, size: 32, align: 32, offset: 51296)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !29, file: !28, line: 47, baseType: !24, size: 32, align: 32, offset: 51328)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !29, file: !28, line: 49, baseType: !66, size: 64, align: 64, offset: 51392)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !29, file: !28, line: 50, baseType: !67, size: 64, align: 64, offset: 51456)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !29, file: !28, line: 51, baseType: !67, size: 64, align: 64, offset: 51520)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !29, file: !28, line: 52, baseType: !66, size: 64, align: 64, offset: 51584)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !29, file: !28, line: 53, baseType: !66, size: 64, align: 64, offset: 51648)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !29, file: !28, line: 54, baseType: !74, size: 64, align: 64, offset: 51712)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !29, file: !28, line: 56, baseType: !76, size: 64, align: 64, offset: 51776)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !78, line: 30, baseType: !79)
!78 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !29, file: !28, line: 58, baseType: !81, size: 64, align: 64, offset: 51840)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !29, file: !28, line: 60, baseType: !86, size: 64, align: 64, offset: 51904)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !29, file: !28, line: 63, baseType: !86, size: 64, align: 64, offset: 51968)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !29, file: !28, line: 66, baseType: !91, size: 64, align: 64, offset: 52032)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !29, file: !28, line: 68, baseType: !93, size: 64, align: 64, offset: 52096)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !29, file: !28, line: 69, baseType: !93, size: 64, align: 64, offset: 52160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !29, file: !28, line: 71, baseType: !96, size: 64, align: 64, offset: 52224)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !29, file: !28, line: 72, baseType: !96, size: 64, align: 64, offset: 52288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !29, file: !28, line: 73, baseType: !96, size: 64, align: 64, offset: 52352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !29, file: !28, line: 75, baseType: !24, size: 32, align: 32, offset: 52416)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !29, file: !28, line: 76, baseType: !24, size: 32, align: 32, offset: 52448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !29, file: !28, line: 77, baseType: !24, size: 32, align: 32, offset: 52480)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !29, file: !28, line: 78, baseType: !24, size: 32, align: 32, offset: 52512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !29, file: !28, line: 79, baseType: !24, size: 32, align: 32, offset: 52544)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !29, file: !28, line: 80, baseType: !24, size: 32, align: 32, offset: 52576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !29, file: !28, line: 81, baseType: !24, size: 32, align: 32, offset: 52608)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !28, line: 137, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !28, line: 118, size: 512, align: 64, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !109, file: !28, line: 120, baseType: !24, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !109, file: !28, line: 121, baseType: !24, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !109, file: !28, line: 122, baseType: !24, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !109, file: !28, line: 123, baseType: !24, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !109, file: !28, line: 125, baseType: !24, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !109, file: !28, line: 127, baseType: !22, size: 32, align: 32, offset: 160)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !109, file: !28, line: 128, baseType: !24, size: 32, align: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !109, file: !28, line: 129, baseType: !24, size: 32, align: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !109, file: !28, line: 130, baseType: !24, size: 32, align: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !109, file: !28, line: 131, baseType: !24, size: 32, align: 32, offset: 288)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !109, file: !28, line: 133, baseType: !26, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !109, file: !28, line: 134, baseType: !26, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !109, file: !28, line: 135, baseType: !26, size: 64, align: 64, offset: 448)
!124 = !{!125, !130, !136, !140, !143, !148, !158, !163, !168, !173, !176, !195, !199, !218, !222, !226, !232, !238, !244, !247, !254, !304, !311, !489, !492, !789, !821, !826, !849, !857, !861, !865, !879, !883, !887, !891, !895, !899, !910, !916, !925, !929, !932, !936, !940, !948, !955, !960, !972, !976, !987, !995, !998, !1000, !1004, !1008, !1014, !1019, !1022, !1029, !1032, !1035, !1041, !1045}
!125 = !DISubprogram(name: "dump_dpb", scope: !1, file: !1, line: 55, type: !126, isLocal: false, isDefinition: true, scopeLine: 56, isOptimized: true, function: void ()* @dump_dpb, variables: !128)
!126 = !DISubroutineType(types: !127)
!127 = !{null}
!128 = !{!129}
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !125, file: !1, line: 57, type: !22)
!130 = !DISubprogram(name: "getDpbSize", scope: !1, file: !1, line: 101, type: !131, isLocal: false, isDefinition: true, scopeLine: 102, isOptimized: true, function: i32 ()* @getDpbSize, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!24}
!133 = !{!134, !135}
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_size", scope: !130, file: !1, line: 103, type: !24)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !130, file: !1, line: 105, type: !24)
!136 = !DISubprogram(name: "init_dpb", scope: !1, file: !1, line: 170, type: !126, isLocal: false, isDefinition: true, scopeLine: 171, isOptimized: true, function: void ()* @init_dpb, variables: !137)
!137 = !{!138, !139}
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !136, file: !1, line: 172, type: !22)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !136, file: !1, line: 172, type: !22)
!140 = !DISubprogram(name: "free_dpb", scope: !1, file: !1, line: 241, type: !126, isLocal: false, isDefinition: true, scopeLine: 242, isOptimized: true, function: void ()* @free_dpb, variables: !141)
!141 = !{!142}
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !140, file: !1, line: 243, type: !22)
!143 = !DISubprogram(name: "alloc_frame_store", scope: !1, file: !1, line: 283, type: !144, isLocal: false, isDefinition: true, scopeLine: 284, isOptimized: true, function: %struct.frame_store* ()* @alloc_frame_store, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{!107}
!146 = !{!147}
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !143, file: !1, line: 285, type: !107)
!148 = !DISubprogram(name: "alloc_storable_picture", scope: !1, file: !1, line: 325, type: !149, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: %struct.storable_picture* (i32, i32, i32, i32, i32)* @alloc_storable_picture, variables: !151)
!149 = !DISubroutineType(types: !150)
!150 = !{!26, !32, !24, !24, !24, !24}
!151 = !{!152, !153, !154, !155, !156, !157}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "structure", arg: 1, scope: !148, file: !1, line: 325, type: !32)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_x", arg: 2, scope: !148, file: !1, line: 325, type: !24)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_y", arg: 3, scope: !148, file: !1, line: 325, type: !24)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_x_cr", arg: 4, scope: !148, file: !1, line: 325, type: !24)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_y_cr", arg: 5, scope: !148, file: !1, line: 325, type: !24)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !148, file: !1, line: 327, type: !26)
!158 = !DISubprogram(name: "free_frame_store", scope: !1, file: !1, line: 398, type: !159, isLocal: false, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.frame_store*)* @free_frame_store, variables: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !107}
!161 = !{!162}
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !158, file: !1, line: 398, type: !107)
!163 = !DISubprogram(name: "free_storable_picture", scope: !1, file: !1, line: 431, type: !164, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*)* @free_storable_picture, variables: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !26}
!166 = !{!167}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !163, file: !1, line: 431, type: !26)
!168 = !DISubprogram(name: "is_short_ref", scope: !1, file: !1, line: 758, type: !169, isLocal: false, isDefinition: true, scopeLine: 759, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.storable_picture*)* @is_short_ref, variables: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!24, !26}
!171 = !{!172}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !168, file: !1, line: 758, type: !26)
!173 = !DISubprogram(name: "is_long_ref", scope: !1, file: !1, line: 771, type: !169, isLocal: false, isDefinition: true, scopeLine: 772, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.storable_picture*)* @is_long_ref, variables: !174)
!174 = !{!175}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !173, file: !1, line: 771, type: !26)
!176 = !DISubprogram(name: "init_lists", scope: !1, file: !1, line: 874, type: !177, isLocal: false, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @init_lists, variables: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !24, !32}
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currSliceType", arg: 1, scope: !176, file: !1, line: 874, type: !24)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currPicStructure", arg: 2, scope: !176, file: !1, line: 874, type: !32)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "add_top", scope: !176, file: !1, line: 876, type: !24)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "add_bottom", scope: !176, file: !1, line: 876, type: !24)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !176, file: !1, line: 877, type: !22)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !176, file: !1, line: 878, type: !24)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MaxFrameNum", scope: !176, file: !1, line: 879, type: !24)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !176, file: !1, line: 880, type: !24)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list0idx", scope: !176, file: !1, line: 882, type: !24)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list0idx_1", scope: !176, file: !1, line: 883, type: !24)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "listltidx", scope: !176, file: !1, line: 884, type: !24)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fs_list0", scope: !176, file: !1, line: 886, type: !106)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fs_list1", scope: !176, file: !1, line: 887, type: !106)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fs_listlt", scope: !176, file: !1, line: 888, type: !106)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_s", scope: !176, file: !1, line: 890, type: !26)
!195 = !DISubprogram(name: "init_mbaff_lists", scope: !1, file: !1, line: 1239, type: !126, isLocal: false, isDefinition: true, scopeLine: 1240, isOptimized: true, function: void ()* @init_mbaff_lists, variables: !196)
!196 = !{!197, !198}
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !195, file: !1, line: 1241, type: !22)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !195, file: !1, line: 1242, type: !24)
!199 = !DISubprogram(name: "reorder_ref_pic_list", scope: !1, file: !1, line: 1401, type: !200, isLocal: false, isDefinition: true, scopeLine: 1402, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture**, i32*, i32, i32*, i32*, i32*)* @reorder_ref_pic_list, variables: !203)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !25, !202, !24, !202, !202, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !199, file: !1, line: 1401, type: !25)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list_size", arg: 2, scope: !199, file: !1, line: 1401, type: !202)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_ref_idx_lX_active_minus1", arg: 3, scope: !199, file: !1, line: 1401, type: !24)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "remapping_of_pic_nums_idc", arg: 4, scope: !199, file: !1, line: 1401, type: !202)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "abs_diff_pic_num_minus1", arg: 5, scope: !199, file: !1, line: 1401, type: !202)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "long_term_pic_idx", arg: 6, scope: !199, file: !1, line: 1401, type: !202)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !199, file: !1, line: 1403, type: !24)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxPicNum", scope: !199, file: !1, line: 1405, type: !24)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currPicNum", scope: !199, file: !1, line: 1405, type: !24)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "picNumLXNoWrap", scope: !199, file: !1, line: 1405, type: !24)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "picNumLXPred", scope: !199, file: !1, line: 1405, type: !24)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "picNumLX", scope: !199, file: !1, line: 1405, type: !24)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refIdxLX", scope: !199, file: !1, line: 1406, type: !24)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MaxFrameNum", scope: !199, file: !1, line: 1407, type: !24)
!218 = !DISubprogram(name: "update_ref_list", scope: !1, file: !1, line: 1471, type: !126, isLocal: false, isDefinition: true, scopeLine: 1472, isOptimized: true, function: void ()* @update_ref_list, variables: !219)
!219 = !{!220, !221}
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !218, file: !1, line: 1473, type: !22)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !218, file: !1, line: 1473, type: !22)
!222 = !DISubprogram(name: "update_ltref_list", scope: !1, file: !1, line: 1499, type: !126, isLocal: false, isDefinition: true, scopeLine: 1500, isOptimized: true, function: void ()* @update_ltref_list, variables: !223)
!223 = !{!224, !225}
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !222, file: !1, line: 1501, type: !22)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !222, file: !1, line: 1501, type: !22)
!226 = !DISubprogram(name: "mm_update_max_long_term_frame_idx", scope: !1, file: !1, line: 2012, type: !227, isLocal: false, isDefinition: true, scopeLine: 2013, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @mm_update_max_long_term_frame_idx, variables: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !24}
!229 = !{!230, !231}
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_long_term_frame_idx_plus1", arg: 1, scope: !226, file: !1, line: 2012, type: !24)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !226, file: !1, line: 2014, type: !22)
!232 = !DISubprogram(name: "store_picture_in_dpb", scope: !1, file: !1, line: 2180, type: !164, isLocal: false, isDefinition: true, scopeLine: 2181, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*)* @store_picture_in_dpb, variables: !233)
!233 = !{!234, !235, !236, !237}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !232, file: !1, line: 2180, type: !26)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !232, file: !1, line: 2182, type: !22)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "poc", scope: !232, file: !1, line: 2183, type: !24)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !232, file: !1, line: 2183, type: !24)
!238 = !DISubprogram(name: "replace_top_pic_with_frame", scope: !1, file: !1, line: 2302, type: !164, isLocal: false, isDefinition: true, scopeLine: 2303, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*)* @replace_top_pic_with_frame, variables: !239)
!239 = !{!240, !241, !242, !243}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !238, file: !1, line: 2302, type: !26)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fs", scope: !238, file: !1, line: 2304, type: !107)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !238, file: !1, line: 2305, type: !22)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !238, file: !1, line: 2305, type: !22)
!244 = !DISubprogram(name: "flush_dpb", scope: !1, file: !1, line: 2718, type: !126, isLocal: false, isDefinition: true, scopeLine: 2719, isOptimized: true, function: void ()* @flush_dpb, variables: !245)
!245 = !{!246}
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !244, file: !1, line: 2720, type: !22)
!247 = !DISubprogram(name: "gen_field_ref_ids", scope: !1, file: !1, line: 2745, type: !164, isLocal: false, isDefinition: true, scopeLine: 2746, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*)* @gen_field_ref_ids, variables: !248)
!248 = !{!249, !250, !251, !252, !253}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !247, file: !1, line: 2745, type: !26)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !247, file: !1, line: 2747, type: !24)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !247, file: !1, line: 2747, type: !24)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummylist0", scope: !247, file: !1, line: 2747, type: !24)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummylist1", scope: !247, file: !1, line: 2747, type: !24)
!254 = !DISubprogram(name: "dpb_split_field", scope: !1, file: !1, line: 2769, type: !159, isLocal: false, isDefinition: true, scopeLine: 2770, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.frame_store*)* @dpb_split_field, variables: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !268, !269, !270, !273, !282, !283, !284, !291, !292, !293, !302, !303}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fs", arg: 1, scope: !254, file: !1, line: 2769, type: !107)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !254, file: !1, line: 2771, type: !24)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !254, file: !1, line: 2771, type: !24)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummylist0", scope: !254, file: !1, line: 2772, type: !24)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummylist1", scope: !254, file: !1, line: 2772, type: !24)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idiv4", scope: !262, file: !1, line: 2870, type: !24)
!262 = distinct !DILexicalBlock(scope: !263, file: !1, line: 2869, column: 5)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 2868, column: 5)
!264 = distinct !DILexicalBlock(scope: !265, file: !1, line: 2868, column: 5)
!265 = distinct !DILexicalBlock(scope: !266, file: !1, line: 2867, column: 3)
!266 = distinct !DILexicalBlock(scope: !267, file: !1, line: 2866, column: 3)
!267 = distinct !DILexicalBlock(scope: !254, file: !1, line: 2866, column: 3)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jdiv4", scope: !262, file: !1, line: 2870, type: !24)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentmb", scope: !262, file: !1, line: 2871, type: !24)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !271, file: !1, line: 2874, type: !24)
!271 = distinct !DILexicalBlock(scope: !272, file: !1, line: 2873, column: 7)
!272 = distinct !DILexicalBlock(scope: !262, file: !1, line: 2872, column: 11)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idiv4", scope: !274, file: !1, line: 2901, type: !24)
!274 = distinct !DILexicalBlock(scope: !275, file: !1, line: 2900, column: 7)
!275 = distinct !DILexicalBlock(scope: !276, file: !1, line: 2899, column: 7)
!276 = distinct !DILexicalBlock(scope: !277, file: !1, line: 2899, column: 7)
!277 = distinct !DILexicalBlock(scope: !278, file: !1, line: 2898, column: 5)
!278 = distinct !DILexicalBlock(scope: !279, file: !1, line: 2897, column: 5)
!279 = distinct !DILexicalBlock(scope: !280, file: !1, line: 2897, column: 5)
!280 = distinct !DILexicalBlock(scope: !281, file: !1, line: 2896, column: 3)
!281 = distinct !DILexicalBlock(scope: !254, file: !1, line: 2895, column: 7)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jdiv4", scope: !274, file: !1, line: 2901, type: !24)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentmb", scope: !274, file: !1, line: 2903, type: !24)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idiv4", scope: !285, file: !1, line: 2939, type: !24)
!285 = distinct !DILexicalBlock(scope: !286, file: !1, line: 2938, column: 5)
!286 = distinct !DILexicalBlock(scope: !287, file: !1, line: 2937, column: 5)
!287 = distinct !DILexicalBlock(scope: !288, file: !1, line: 2937, column: 5)
!288 = distinct !DILexicalBlock(scope: !289, file: !1, line: 2936, column: 3)
!289 = distinct !DILexicalBlock(scope: !290, file: !1, line: 2935, column: 3)
!290 = distinct !DILexicalBlock(scope: !254, file: !1, line: 2935, column: 3)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jdiv4", scope: !285, file: !1, line: 2939, type: !24)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentmb", scope: !285, file: !1, line: 2941, type: !24)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idiv4", scope: !294, file: !1, line: 2998, type: !24)
!294 = distinct !DILexicalBlock(scope: !295, file: !1, line: 2997, column: 7)
!295 = distinct !DILexicalBlock(scope: !296, file: !1, line: 2996, column: 7)
!296 = distinct !DILexicalBlock(scope: !297, file: !1, line: 2996, column: 7)
!297 = distinct !DILexicalBlock(scope: !298, file: !1, line: 2995, column: 5)
!298 = distinct !DILexicalBlock(scope: !299, file: !1, line: 2994, column: 5)
!299 = distinct !DILexicalBlock(scope: !300, file: !1, line: 2994, column: 5)
!300 = distinct !DILexicalBlock(scope: !301, file: !1, line: 2993, column: 3)
!301 = distinct !DILexicalBlock(scope: !254, file: !1, line: 2992, column: 7)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jdiv4", scope: !294, file: !1, line: 2998, type: !24)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentmb", scope: !294, file: !1, line: 2999, type: !24)
!304 = !DISubprogram(name: "dpb_combine_field", scope: !1, file: !1, line: 3014, type: !159, isLocal: false, isDefinition: true, scopeLine: 3015, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.frame_store*)* @dpb_combine_field, variables: !305)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fs", arg: 1, scope: !304, file: !1, line: 3014, type: !107)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !304, file: !1, line: 3016, type: !24)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !304, file: !1, line: 3016, type: !24)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummylist0", scope: !304, file: !1, line: 3017, type: !24)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummylist1", scope: !304, file: !1, line: 3017, type: !24)
!311 = !DISubprogram(name: "alloc_ref_pic_list_reordering_buffer", scope: !1, file: !1, line: 3144, type: !312, isLocal: false, isDefinition: true, scopeLine: 3145, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Slice*)* @alloc_ref_pic_list_reordering_buffer, variables: !486)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !316)
!316 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !397, !434, !461, !470, !471, !472, !473, !474, !475, !476, !477, !478, !483}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !316, file: !4, line: 445, baseType: !24, size: 32, align: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !316, file: !4, line: 446, baseType: !24, size: 32, align: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !316, file: !4, line: 447, baseType: !24, size: 32, align: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !316, file: !4, line: 448, baseType: !24, size: 32, align: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !316, file: !4, line: 449, baseType: !24, size: 32, align: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !316, file: !4, line: 450, baseType: !24, size: 32, align: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !316, file: !4, line: 451, baseType: !325, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !327)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !328)
!328 = !{!329, !345, !369}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !327, file: !4, line: 433, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !332, file: !4, line: 413, baseType: !24, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !332, file: !4, line: 414, baseType: !24, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !332, file: !4, line: 415, baseType: !77, size: 8, align: 8, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !332, file: !4, line: 416, baseType: !24, size: 32, align: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !332, file: !4, line: 417, baseType: !24, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !332, file: !4, line: 418, baseType: !77, size: 8, align: 8, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !332, file: !4, line: 420, baseType: !77, size: 8, align: 8, offset: 168)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !332, file: !4, line: 421, baseType: !24, size: 32, align: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !332, file: !4, line: 422, baseType: !24, size: 32, align: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !332, file: !4, line: 424, baseType: !76, size: 64, align: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !332, file: !4, line: 425, baseType: !24, size: 32, align: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !327, file: !4, line: 434, baseType: !346, size: 832, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !347)
!347 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !347, file: !4, line: 209, baseType: !22, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !347, file: !4, line: 209, baseType: !22, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !347, file: !4, line: 210, baseType: !22, size: 32, align: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !347, file: !4, line: 211, baseType: !22, size: 32, align: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !347, file: !4, line: 212, baseType: !22, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !347, file: !4, line: 213, baseType: !76, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !347, file: !4, line: 214, baseType: !202, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !347, file: !4, line: 217, baseType: !22, size: 32, align: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !347, file: !4, line: 217, baseType: !22, size: 32, align: 32, offset: 352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !347, file: !4, line: 218, baseType: !22, size: 32, align: 32, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !347, file: !4, line: 219, baseType: !22, size: 32, align: 32, offset: 416)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !347, file: !4, line: 220, baseType: !22, size: 32, align: 32, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !347, file: !4, line: 221, baseType: !76, size: 64, align: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !347, file: !4, line: 222, baseType: !202, size: 64, align: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !347, file: !4, line: 223, baseType: !24, size: 32, align: 32, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !347, file: !4, line: 223, baseType: !24, size: 32, align: 32, offset: 672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !347, file: !4, line: 224, baseType: !24, size: 32, align: 32, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !347, file: !4, line: 224, baseType: !24, size: 32, align: 32, offset: 736)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !347, file: !4, line: 225, baseType: !24, size: 32, align: 32, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !347, file: !4, line: 225, baseType: !24, size: 32, align: 32, offset: 800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !327, file: !4, line: 436, baseType: !370, size: 64, align: 64, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!24, !373, !396}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !389}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !4, line: 329, baseType: !24, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !375, file: !4, line: 330, baseType: !24, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !375, file: !4, line: 331, baseType: !24, size: 32, align: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !375, file: !4, line: 332, baseType: !24, size: 32, align: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !375, file: !4, line: 333, baseType: !24, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !375, file: !4, line: 334, baseType: !22, size: 32, align: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !375, file: !4, line: 335, baseType: !24, size: 32, align: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !375, file: !4, line: 336, baseType: !24, size: 32, align: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !375, file: !4, line: 344, baseType: !386, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !24, !24, !202, !202}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !375, file: !4, line: 346, baseType: !390, size: 64, align: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !393, !394}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !316, file: !4, line: 452, baseType: !398, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !401)
!401 = !{!402, !414, !419, !423, !426, !430, !431}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !400, file: !4, line: 260, baseType: !403, size: 4224, align: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 4224, align: 64, elements: !411)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !405, file: !4, line: 233, baseType: !68, size: 16, align: 16)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !405, file: !4, line: 234, baseType: !79, size: 8, align: 8, offset: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !405, file: !4, line: 236, baseType: !410, size: 64, align: 64, offset: 64)
!410 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!411 = !{!412, !413}
!412 = !DISubrange(count: 3)
!413 = !DISubrange(count: 11)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !400, file: !4, line: 261, baseType: !415, size: 2304, align: 64, offset: 4224)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 2304, align: 64, elements: !416)
!416 = !{!417, !418}
!417 = !DISubrange(count: 2)
!418 = !DISubrange(count: 9)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !400, file: !4, line: 262, baseType: !420, size: 2560, align: 64, offset: 6528)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 2560, align: 64, elements: !421)
!421 = !{!417, !422}
!422 = !DISubrange(count: 10)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !400, file: !4, line: 263, baseType: !424, size: 1536, align: 64, offset: 9088)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 1536, align: 64, elements: !425)
!425 = !{!417, !45}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !400, file: !4, line: 264, baseType: !427, size: 512, align: 64, offset: 10624)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 512, align: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 4)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !400, file: !4, line: 265, baseType: !427, size: 512, align: 64, offset: 11136)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !400, file: !4, line: 266, baseType: !432, size: 384, align: 64, offset: 11648)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 384, align: 64, elements: !433)
!433 = !{!412}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !316, file: !4, line: 453, baseType: !435, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !438)
!438 = !{!439, !442, !443, !446, !449, !453, !454, !458, !459, !460}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !437, file: !4, line: 283, baseType: !440, size: 256, align: 64)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 256, align: 64, elements: !441)
!441 = !{!417}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !437, file: !4, line: 284, baseType: !427, size: 512, align: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !437, file: !4, line: 285, baseType: !444, size: 1536, align: 64, offset: 768)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 1536, align: 64, elements: !445)
!445 = !{!412, !429}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !437, file: !4, line: 286, baseType: !447, size: 5120, align: 64, offset: 2304)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 5120, align: 64, elements: !448)
!448 = !{!422, !429}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !437, file: !4, line: 287, baseType: !450, size: 19200, align: 64, offset: 7424)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 19200, align: 64, elements: !451)
!451 = !{!422, !452}
!452 = !DISubrange(count: 15)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !437, file: !4, line: 288, baseType: !450, size: 19200, align: 64, offset: 26624)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !437, file: !4, line: 289, baseType: !455, size: 6400, align: 64, offset: 45824)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 6400, align: 64, elements: !456)
!456 = !{!422, !457}
!457 = !DISubrange(count: 5)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !437, file: !4, line: 290, baseType: !455, size: 6400, align: 64, offset: 52224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !437, file: !4, line: 291, baseType: !450, size: 19200, align: 64, offset: 58624)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !437, file: !4, line: 292, baseType: !450, size: 19200, align: 64, offset: 77824)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !316, file: !4, line: 456, baseType: !462, size: 64, align: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !464, file: !4, line: 310, baseType: !24, size: 32, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !464, file: !4, line: 311, baseType: !24, size: 32, align: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !464, file: !4, line: 312, baseType: !469, size: 64, align: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !316, file: !4, line: 458, baseType: !24, size: 32, align: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !316, file: !4, line: 459, baseType: !202, size: 64, align: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !316, file: !4, line: 460, baseType: !202, size: 64, align: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !316, file: !4, line: 461, baseType: !202, size: 64, align: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !316, file: !4, line: 462, baseType: !24, size: 32, align: 32, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !316, file: !4, line: 463, baseType: !202, size: 64, align: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !316, file: !4, line: 464, baseType: !202, size: 64, align: 64, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !316, file: !4, line: 465, baseType: !202, size: 64, align: 64, offset: 896)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !316, file: !4, line: 467, baseType: !479, size: 64, align: 64, offset: 960)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!482, !24}
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !17, line: 45, baseType: !16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !316, file: !4, line: 469, baseType: !484, size: 192, align: 32, offset: 1024)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 32, elements: !485)
!485 = !{!412, !417}
!486 = !{!487, !488}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currSlice", arg: 1, scope: !311, file: !1, line: 3144, type: !314)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !311, file: !1, line: 3146, type: !24)
!489 = !DISubprogram(name: "free_ref_pic_list_reordering_buffer", scope: !1, file: !1, line: 3184, type: !312, isLocal: false, isDefinition: true, scopeLine: 3185, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Slice*)* @free_ref_pic_list_reordering_buffer, variables: !490)
!490 = !{!491}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currSlice", arg: 1, scope: !489, file: !1, line: 3184, type: !314)
!492 = !DISubprogram(name: "fill_frame_num_gap", scope: !1, file: !1, line: 3221, type: !493, isLocal: false, isDefinition: true, scopeLine: 3222, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ImageParameters*)* @fill_frame_num_gap, variables: !782)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageParameters", file: !4, line: 1097, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 868, size: 581888, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !527, !528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !547, !550, !554, !557, !560, !562, !564, !565, !580, !581, !640, !644, !645, !646, !647, !648, !649, !650, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !666, !667, !668, !669, !672, !673, !674, !675, !676, !677, !678, !679, !680, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !699, !700, !701, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !497, file: !4, line: 870, baseType: !24, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !497, file: !4, line: 871, baseType: !24, size: 32, align: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nb_references", scope: !497, file: !4, line: 872, baseType: !24, size: 32, align: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !497, file: !4, line: 873, baseType: !24, size: 32, align: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "total_number_mb", scope: !497, file: !4, line: 874, baseType: !24, size: 32, align: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !497, file: !4, line: 875, baseType: !24, size: 32, align: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !497, file: !4, line: 876, baseType: !24, size: 32, align: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !497, file: !4, line: 877, baseType: !24, size: 32, align: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !497, file: !4, line: 878, baseType: !24, size: 32, align: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_references", scope: !497, file: !4, line: 879, baseType: !24, size: 32, align: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !497, file: !4, line: 880, baseType: !24, size: 32, align: 32, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !497, file: !4, line: 881, baseType: !24, size: 32, align: 32, offset: 352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !497, file: !4, line: 882, baseType: !512, size: 32, align: 32, offset: 384)
!512 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !497, file: !4, line: 883, baseType: !24, size: 32, align: 32, offset: 416)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !497, file: !4, line: 884, baseType: !24, size: 32, align: 32, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !497, file: !4, line: 885, baseType: !24, size: 32, align: 32, offset: 480)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !497, file: !4, line: 886, baseType: !24, size: 32, align: 32, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr_frame", scope: !497, file: !4, line: 887, baseType: !24, size: 32, align: 32, offset: 544)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !497, file: !4, line: 888, baseType: !24, size: 32, align: 32, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !497, file: !4, line: 889, baseType: !24, size: 32, align: 32, offset: 608)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !497, file: !4, line: 890, baseType: !24, size: 32, align: 32, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !497, file: !4, line: 891, baseType: !24, size: 32, align: 32, offset: 672)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_upd", scope: !497, file: !4, line: 892, baseType: !24, size: 32, align: 32, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y_intra", scope: !497, file: !4, line: 893, baseType: !24, size: 32, align: 32, offset: 736)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "block_c_x", scope: !497, file: !4, line: 894, baseType: !24, size: 32, align: 32, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !497, file: !4, line: 895, baseType: !526, size: 64, align: 64, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode8x8", scope: !497, file: !4, line: 896, baseType: !526, size: 64, align: 64, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !497, file: !4, line: 898, baseType: !24, size: 32, align: 32, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !497, file: !4, line: 899, baseType: !530, size: 64, align: 64, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mb_x", scope: !497, file: !4, line: 901, baseType: !24, size: 32, align: 32, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mb_y", scope: !497, file: !4, line: 902, baseType: !24, size: 32, align: 32, offset: 1120)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !497, file: !4, line: 903, baseType: !24, size: 32, align: 32, offset: 1152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !497, file: !4, line: 904, baseType: !24, size: 32, align: 32, offset: 1184)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !497, file: !4, line: 905, baseType: !24, size: 32, align: 32, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !497, file: !4, line: 906, baseType: !24, size: 32, align: 32, offset: 1248)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !497, file: !4, line: 907, baseType: !24, size: 32, align: 32, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !497, file: !4, line: 908, baseType: !24, size: 32, align: 32, offset: 1312)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "opix_x", scope: !497, file: !4, line: 910, baseType: !24, size: 32, align: 32, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "opix_y", scope: !497, file: !4, line: 911, baseType: !24, size: 32, align: 32, offset: 1376)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_x", scope: !497, file: !4, line: 912, baseType: !24, size: 32, align: 32, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "opix_c_y", scope: !497, file: !4, line: 913, baseType: !24, size: 32, align: 32, offset: 1440)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mprr", scope: !497, file: !4, line: 917, baseType: !544, size: 36864, align: 16, offset: 1472)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 36864, align: 16, elements: !545)
!545 = !{!418, !546, !546}
!546 = !DISubrange(count: 16)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_2", scope: !497, file: !4, line: 919, baseType: !548, size: 20480, align: 16, offset: 38336)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 20480, align: 16, elements: !549)
!549 = !{!457, !546, !546}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_3", scope: !497, file: !4, line: 920, baseType: !551, size: 9216, align: 16, offset: 58816)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 9216, align: 16, elements: !552)
!552 = !{!418, !553, !553}
!553 = !DISubrange(count: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mprr_c", scope: !497, file: !4, line: 921, baseType: !555, size: 32768, align: 16, offset: 68032)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32768, align: 16, elements: !556)
!556 = !{!417, !429, !546, !546}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mpr", scope: !497, file: !4, line: 922, baseType: !558, size: 4096, align: 16, offset: 100800)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 4096, align: 16, elements: !559)
!559 = !{!546, !546}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "m7", scope: !497, file: !4, line: 923, baseType: !561, size: 8192, align: 32, offset: 104896)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 32, elements: !559)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !497, file: !4, line: 925, baseType: !563, size: 64, align: 64, offset: 113088)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !497, file: !4, line: 926, baseType: !530, size: 64, align: 64, offset: 113152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "currentPicture", scope: !497, file: !4, line: 928, baseType: !566, size: 64, align: 64, offset: 113216)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !569)
!569 = !{!570, !571, !572, !576, !577, !578, !579}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !568, file: !4, line: 477, baseType: !24, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !568, file: !4, line: 478, baseType: !24, size: 32, align: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !568, file: !4, line: 479, baseType: !573, size: 6400, align: 64, offset: 64)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 6400, align: 64, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 100)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !568, file: !4, line: 480, baseType: !24, size: 32, align: 32, offset: 6464)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !568, file: !4, line: 481, baseType: !512, size: 32, align: 32, offset: 6496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !568, file: !4, line: 482, baseType: !512, size: 32, align: 32, offset: 6528)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !568, file: !4, line: 483, baseType: !512, size: 32, align: 32, offset: 6560)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "currentSlice", scope: !497, file: !4, line: 929, baseType: !314, size: 64, align: 64, offset: 113280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !497, file: !4, line: 930, baseType: !582, size: 64, align: 64, offset: 113344)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !4, line: 406, baseType: !584)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !4, line: 351, size: 5056, align: 64, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !594, !596, !597, !598, !601, !604, !605, !606, !607, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !584, file: !4, line: 353, baseType: !24, size: 32, align: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !584, file: !4, line: 354, baseType: !24, size: 32, align: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !584, file: !4, line: 355, baseType: !24, size: 32, align: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !584, file: !4, line: 356, baseType: !24, size: 32, align: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !584, file: !4, line: 357, baseType: !24, size: 32, align: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !584, file: !4, line: 358, baseType: !592, size: 256, align: 32, offset: 160)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 32, elements: !593)
!593 = !{!553}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !584, file: !4, line: 360, baseType: !595, size: 64, align: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !584, file: !4, line: 361, baseType: !595, size: 64, align: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !584, file: !4, line: 363, baseType: !24, size: 32, align: 32, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !584, file: !4, line: 364, baseType: !599, size: 2048, align: 32, offset: 608)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, align: 32, elements: !600)
!600 = !{!417, !429, !429, !417}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !584, file: !4, line: 365, baseType: !602, size: 512, align: 32, offset: 2656)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 32, elements: !603)
!603 = !{!546}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !584, file: !4, line: 366, baseType: !602, size: 512, align: 32, offset: 3168)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !584, file: !4, line: 367, baseType: !24, size: 32, align: 32, offset: 3680)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !584, file: !4, line: 368, baseType: !40, size: 64, align: 64, offset: 3712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !584, file: !4, line: 369, baseType: !608, size: 128, align: 32, offset: 3776)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, align: 32, elements: !428)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !584, file: !4, line: 370, baseType: !608, size: 128, align: 32, offset: 3904)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !584, file: !4, line: 371, baseType: !410, size: 64, align: 64, offset: 4032)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !584, file: !4, line: 373, baseType: !24, size: 32, align: 32, offset: 4096)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !584, file: !4, line: 374, baseType: !24, size: 32, align: 32, offset: 4128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !584, file: !4, line: 375, baseType: !24, size: 32, align: 32, offset: 4160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !584, file: !4, line: 377, baseType: !24, size: 32, align: 32, offset: 4192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !584, file: !4, line: 378, baseType: !24, size: 32, align: 32, offset: 4224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !584, file: !4, line: 380, baseType: !24, size: 32, align: 32, offset: 4256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !584, file: !4, line: 382, baseType: !24, size: 32, align: 32, offset: 4288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !584, file: !4, line: 382, baseType: !24, size: 32, align: 32, offset: 4320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !584, file: !4, line: 382, baseType: !24, size: 32, align: 32, offset: 4352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !584, file: !4, line: 382, baseType: !24, size: 32, align: 32, offset: 4384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !584, file: !4, line: 383, baseType: !24, size: 32, align: 32, offset: 4416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !584, file: !4, line: 383, baseType: !24, size: 32, align: 32, offset: 4448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !584, file: !4, line: 383, baseType: !24, size: 32, align: 32, offset: 4480)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !584, file: !4, line: 383, baseType: !24, size: 32, align: 32, offset: 4512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !584, file: !4, line: 385, baseType: !24, size: 32, align: 32, offset: 4544)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !584, file: !4, line: 386, baseType: !24, size: 32, align: 32, offset: 4576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !584, file: !4, line: 387, baseType: !24, size: 32, align: 32, offset: 4608)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !584, file: !4, line: 390, baseType: !24, size: 32, align: 32, offset: 4640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !584, file: !4, line: 394, baseType: !630, size: 64, align: 64, offset: 4672)
!630 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !584, file: !4, line: 395, baseType: !24, size: 32, align: 32, offset: 4736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !584, file: !4, line: 396, baseType: !24, size: 32, align: 32, offset: 4768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !584, file: !4, line: 397, baseType: !24, size: 32, align: 32, offset: 4800)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !584, file: !4, line: 398, baseType: !24, size: 32, align: 32, offset: 4832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !584, file: !4, line: 399, baseType: !24, size: 32, align: 32, offset: 4864)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !584, file: !4, line: 401, baseType: !24, size: 32, align: 32, offset: 4896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !584, file: !4, line: 402, baseType: !24, size: 32, align: 32, offset: 4928)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !584, file: !4, line: 403, baseType: !24, size: 32, align: 32, offset: 4960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !584, file: !4, line: 405, baseType: !24, size: 32, align: 32, offset: 4992)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "MB_SyntaxElements", scope: !497, file: !4, line: 931, baseType: !641, size: 460800, align: 64, offset: 113408)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 460800, align: 64, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 1200)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !497, file: !4, line: 933, baseType: !202, size: 64, align: 64, offset: 574208)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !497, file: !4, line: 934, baseType: !202, size: 64, align: 64, offset: 574272)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tr", scope: !497, file: !4, line: 936, baseType: !24, size: 32, align: 32, offset: 574336)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fld_type", scope: !497, file: !4, line: 937, baseType: !24, size: 32, align: 32, offset: 574368)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fld_flag", scope: !497, file: !4, line: 938, baseType: !22, size: 32, align: 32, offset: 574400)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rd_pass", scope: !497, file: !4, line: 939, baseType: !22, size: 32, align: 32, offset: 574432)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "direct_intraP_ref", scope: !497, file: !4, line: 940, baseType: !651, size: 512, align: 32, offset: 574464)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 32, elements: !652)
!652 = !{!429, !429}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pstruct_next_P", scope: !497, file: !4, line: 941, baseType: !24, size: 32, align: 32, offset: 574976)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_frm", scope: !497, file: !4, line: 942, baseType: !24, size: 32, align: 32, offset: 575008)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_frm", scope: !497, file: !4, line: 943, baseType: !24, size: 32, align: 32, offset: 575040)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_next_P_fld", scope: !497, file: !4, line: 944, baseType: !24, size: 32, align: 32, offset: 575072)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "imgtr_last_P_fld", scope: !497, file: !4, line: 945, baseType: !24, size: 32, align: 32, offset: 575104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "b_interval", scope: !497, file: !4, line: 948, baseType: !630, size: 64, align: 64, offset: 575168)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "p_interval", scope: !497, file: !4, line: 949, baseType: !24, size: 32, align: 32, offset: 575232)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_to_code", scope: !497, file: !4, line: 950, baseType: !24, size: 32, align: 32, offset: 575264)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fw_mb_mode", scope: !497, file: !4, line: 951, baseType: !24, size: 32, align: 32, offset: 575296)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bw_mb_mode", scope: !497, file: !4, line: 952, baseType: !24, size: 32, align: 32, offset: 575328)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !497, file: !4, line: 954, baseType: !664, size: 64, align: 64, offset: 575360)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !497, file: !4, line: 955, baseType: !664, size: 64, align: 64, offset: 575424)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !497, file: !4, line: 957, baseType: !664, size: 64, align: 64, offset: 575488)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !497, file: !4, line: 958, baseType: !664, size: 64, align: 64, offset: 575552)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !497, file: !4, line: 959, baseType: !670, size: 240, align: 16, offset: 575616)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 240, align: 16, elements: !671)
!671 = !{!452}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !497, file: !4, line: 963, baseType: !24, size: 32, align: 32, offset: 575872)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !497, file: !4, line: 964, baseType: !24, size: 32, align: 32, offset: 575904)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !497, file: !4, line: 965, baseType: !24, size: 32, align: 32, offset: 575936)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !497, file: !4, line: 967, baseType: !24, size: 32, align: 32, offset: 575968)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active", scope: !497, file: !4, line: 969, baseType: !24, size: 32, align: 32, offset: 576000)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active", scope: !497, file: !4, line: 970, baseType: !24, size: 32, align: 32, offset: 576032)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "field_mode", scope: !497, file: !4, line: 972, baseType: !24, size: 32, align: 32, offset: 576064)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !497, file: !4, line: 973, baseType: !24, size: 32, align: 32, offset: 576096)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mvscale", scope: !497, file: !4, line: 974, baseType: !681, size: 2880, align: 32, offset: 576128)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2880, align: 32, elements: !682)
!682 = !{!45, !452}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "buf_cycle", scope: !497, file: !4, line: 975, baseType: !24, size: 32, align: 32, offset: 579008)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !497, file: !4, line: 976, baseType: !24, size: 32, align: 32, offset: 579040)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !497, file: !4, line: 978, baseType: !24, size: 32, align: 32, offset: 579072)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "old_layer", scope: !497, file: !4, line: 979, baseType: !24, size: 32, align: 32, offset: 579104)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "NoResidueDirect", scope: !497, file: !4, line: 980, baseType: !24, size: 32, align: 32, offset: 579136)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !497, file: !4, line: 982, baseType: !24, size: 32, align: 32, offset: 579168)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !497, file: !4, line: 984, baseType: !24, size: 32, align: 32, offset: 579200)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !497, file: !4, line: 988, baseType: !22, size: 32, align: 32, offset: 579232)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !497, file: !4, line: 992, baseType: !22, size: 32, align: 32, offset: 579264)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !497, file: !4, line: 993, baseType: !24, size: 32, align: 32, offset: 579296)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !497, file: !4, line: 994, baseType: !24, size: 32, align: 32, offset: 579328)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !497, file: !4, line: 995, baseType: !22, size: 32, align: 32, offset: 579360)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !497, file: !4, line: 996, baseType: !696, size: 32, align: 32, offset: 579392)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, align: 32, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 1)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !497, file: !4, line: 1001, baseType: !22, size: 32, align: 32, offset: 579424)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !497, file: !4, line: 1002, baseType: !24, size: 32, align: 32, offset: 579456)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !497, file: !4, line: 1004, baseType: !702, size: 64, align: 32, offset: 579488)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, align: 32, elements: !441)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !497, file: !4, line: 1008, baseType: !22, size: 32, align: 32, offset: 579552)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !497, file: !4, line: 1009, baseType: !24, size: 32, align: 32, offset: 579584)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !497, file: !4, line: 1010, baseType: !24, size: 32, align: 32, offset: 579616)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !497, file: !4, line: 1011, baseType: !24, size: 32, align: 32, offset: 579648)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !497, file: !4, line: 1012, baseType: !24, size: 32, align: 32, offset: 579680)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !497, file: !4, line: 1013, baseType: !22, size: 32, align: 32, offset: 579712)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !497, file: !4, line: 1015, baseType: !22, size: 32, align: 32, offset: 579744)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !497, file: !4, line: 1016, baseType: !22, size: 32, align: 32, offset: 579776)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !497, file: !4, line: 1017, baseType: !22, size: 32, align: 32, offset: 579808)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !497, file: !4, line: 1018, baseType: !22, size: 32, align: 32, offset: 579840)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !497, file: !4, line: 1019, baseType: !22, size: 32, align: 32, offset: 579872)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !497, file: !4, line: 1020, baseType: !22, size: 32, align: 32, offset: 579904)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !497, file: !4, line: 1023, baseType: !22, size: 32, align: 32, offset: 579936)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !497, file: !4, line: 1027, baseType: !24, size: 32, align: 32, offset: 579968)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !497, file: !4, line: 1029, baseType: !24, size: 32, align: 32, offset: 580000)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !497, file: !4, line: 1030, baseType: !24, size: 32, align: 32, offset: 580032)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !497, file: !4, line: 1031, baseType: !24, size: 32, align: 32, offset: 580064)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !497, file: !4, line: 1033, baseType: !721, size: 64, align: 64, offset: 580096)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !4, line: 324, baseType: !723)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !4, line: 316, size: 256, align: 64, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !723, file: !4, line: 318, baseType: !24, size: 32, align: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !723, file: !4, line: 319, baseType: !24, size: 32, align: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !723, file: !4, line: 320, baseType: !24, size: 32, align: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !723, file: !4, line: 321, baseType: !24, size: 32, align: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !723, file: !4, line: 322, baseType: !24, size: 32, align: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !723, file: !4, line: 323, baseType: !731, size: 64, align: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !497, file: !4, line: 1035, baseType: !24, size: 32, align: 32, offset: 580160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofHeaderBits", scope: !497, file: !4, line: 1039, baseType: !24, size: 32, align: 32, offset: 580192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofTextureBits", scope: !497, file: !4, line: 1040, baseType: !24, size: 32, align: 32, offset: 580224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofBasicUnitHeaderBits", scope: !497, file: !4, line: 1041, baseType: !24, size: 32, align: 32, offset: 580256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofBasicUnitTextureBits", scope: !497, file: !4, line: 1042, baseType: !24, size: 32, align: 32, offset: 580288)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "TotalMADBasicUnit", scope: !497, file: !4, line: 1043, baseType: !630, size: 64, align: 64, offset: 580352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofMBTextureBits", scope: !497, file: !4, line: 1044, baseType: !24, size: 32, align: 32, offset: 580416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofMBHeaderBits", scope: !497, file: !4, line: 1045, baseType: !24, size: 32, align: 32, offset: 580448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedBFrame", scope: !497, file: !4, line: 1046, baseType: !24, size: 32, align: 32, offset: 580480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedPFrame", scope: !497, file: !4, line: 1047, baseType: !24, size: 32, align: 32, offset: 580512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofGOP", scope: !497, file: !4, line: 1048, baseType: !24, size: 32, align: 32, offset: 580544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "TotalQpforPPicture", scope: !497, file: !4, line: 1049, baseType: !24, size: 32, align: 32, offset: 580576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofPPicture", scope: !497, file: !4, line: 1050, baseType: !24, size: 32, align: 32, offset: 580608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "MADofMB", scope: !497, file: !4, line: 1051, baseType: !746, size: 64, align: 64, offset: 580672)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "BasicUnitQP", scope: !497, file: !4, line: 1052, baseType: !24, size: 32, align: 32, offset: 580736)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "TopFieldFlag", scope: !497, file: !4, line: 1053, baseType: !24, size: 32, align: 32, offset: 580768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "FieldControl", scope: !497, file: !4, line: 1054, baseType: !24, size: 32, align: 32, offset: 580800)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "FieldFrame", scope: !497, file: !4, line: 1055, baseType: !24, size: 32, align: 32, offset: 580832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Frame_Total_Number_MB", scope: !497, file: !4, line: 1056, baseType: !24, size: 32, align: 32, offset: 580864)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "IFLAG", scope: !497, file: !4, line: 1057, baseType: !24, size: 32, align: 32, offset: 580896)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "NumberofCodedMacroBlocks", scope: !497, file: !4, line: 1058, baseType: !24, size: 32, align: 32, offset: 580928)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "BasicUnit", scope: !497, file: !4, line: 1059, baseType: !24, size: 32, align: 32, offset: 580960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "write_macroblock", scope: !497, file: !4, line: 1060, baseType: !24, size: 32, align: 32, offset: 580992)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bot_MB", scope: !497, file: !4, line: 1061, baseType: !24, size: 32, align: 32, offset: 581024)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "write_macroblock_frame", scope: !497, file: !4, line: 1062, baseType: !24, size: 32, align: 32, offset: 581056)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !497, file: !4, line: 1064, baseType: !24, size: 32, align: 32, offset: 581088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !497, file: !4, line: 1066, baseType: !24, size: 32, align: 32, offset: 581120)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !497, file: !4, line: 1067, baseType: !24, size: 32, align: 32, offset: 581152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !497, file: !4, line: 1068, baseType: !24, size: 32, align: 32, offset: 581184)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !497, file: !4, line: 1070, baseType: !24, size: 32, align: 32, offset: 581216)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !497, file: !4, line: 1072, baseType: !24, size: 32, align: 32, offset: 581248)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !497, file: !4, line: 1073, baseType: !24, size: 32, align: 32, offset: 581280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !497, file: !4, line: 1074, baseType: !24, size: 32, align: 32, offset: 581312)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !497, file: !4, line: 1075, baseType: !24, size: 32, align: 32, offset: 581344)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !497, file: !4, line: 1076, baseType: !24, size: 32, align: 32, offset: 581376)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_lambda_scale", scope: !497, file: !4, line: 1077, baseType: !24, size: 32, align: 32, offset: 581408)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value", scope: !497, file: !4, line: 1078, baseType: !22, size: 32, align: 32, offset: 581440)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_imgpel_value", scope: !497, file: !4, line: 1079, baseType: !24, size: 32, align: 32, offset: 581472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_imgpel_value_uv", scope: !497, file: !4, line: 1080, baseType: !24, size: 32, align: 32, offset: 581504)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !497, file: !4, line: 1082, baseType: !24, size: 32, align: 32, offset: 581536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !497, file: !4, line: 1083, baseType: !24, size: 32, align: 32, offset: 581568)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !497, file: !4, line: 1084, baseType: !24, size: 32, align: 32, offset: 581600)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !497, file: !4, line: 1085, baseType: !24, size: 32, align: 32, offset: 581632)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !497, file: !4, line: 1086, baseType: !24, size: 32, align: 32, offset: 581664)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !497, file: !4, line: 1087, baseType: !24, size: 32, align: 32, offset: 581696)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !497, file: !4, line: 1089, baseType: !702, size: 64, align: 32, offset: 581728)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "residue_transform_flag", scope: !497, file: !4, line: 1092, baseType: !24, size: 32, align: 32, offset: 581792)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !497, file: !4, line: 1094, baseType: !24, size: 32, align: 32, offset: 581824)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !497, file: !4, line: 1095, baseType: !24, size: 32, align: 32, offset: 581856)
!782 = !{!783, !784, !785, !786, !787, !788}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img", arg: 1, scope: !492, file: !1, line: 3221, type: !495)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CurrFrameNum", scope: !492, file: !1, line: 3223, type: !24)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "UnusedShortTermFrameNum", scope: !492, file: !1, line: 3224, type: !24)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "picture", scope: !492, file: !1, line: 3225, type: !26)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nal_ref_idc_bak", scope: !492, file: !1, line: 3226, type: !24)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MaxFrameNum", scope: !492, file: !1, line: 3227, type: !24)
!789 = !DISubprogram(name: "alloc_colocated", scope: !1, file: !1, line: 3272, type: !790, isLocal: false, isDefinition: true, scopeLine: 3273, flags: DIFlagPrototyped, isOptimized: true, function: %struct.colocated_params* (i32, i32, i32)* @alloc_colocated, variables: !816)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !24, !24, !24}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColocatedParams", file: !28, line: 115, baseType: !794)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "colocated_params", file: !28, line: 86, size: 39040, align: 64, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !794, file: !28, line: 88, baseType: !24, size: 32, align: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !794, file: !28, line: 89, baseType: !24, size: 32, align: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !794, file: !28, line: 89, baseType: !24, size: 32, align: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !794, file: !28, line: 91, baseType: !39, size: 12672, align: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !794, file: !28, line: 93, baseType: !81, size: 64, align: 64, offset: 12800)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !794, file: !28, line: 94, baseType: !86, size: 64, align: 64, offset: 12864)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !794, file: !28, line: 95, baseType: !91, size: 64, align: 64, offset: 12928)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !794, file: !28, line: 96, baseType: !93, size: 64, align: 64, offset: 12992)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !794, file: !28, line: 99, baseType: !39, size: 12672, align: 64, offset: 13056)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_idx", scope: !794, file: !28, line: 100, baseType: !81, size: 64, align: 64, offset: 25728)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_id", scope: !794, file: !28, line: 101, baseType: !86, size: 64, align: 64, offset: 25792)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "top_mv", scope: !794, file: !28, line: 102, baseType: !91, size: 64, align: 64, offset: 25856)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "top_moving_block", scope: !794, file: !28, line: 103, baseType: !93, size: 64, align: 64, offset: 25920)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !794, file: !28, line: 106, baseType: !39, size: 12672, align: 64, offset: 25984)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_idx", scope: !794, file: !28, line: 107, baseType: !81, size: 64, align: 64, offset: 38656)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_id", scope: !794, file: !28, line: 108, baseType: !86, size: 64, align: 64, offset: 38720)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_mv", scope: !794, file: !28, line: 109, baseType: !91, size: 64, align: 64, offset: 38784)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_moving_block", scope: !794, file: !28, line: 110, baseType: !93, size: 64, align: 64, offset: 38848)
