; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/memalloc.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }
%struct.Slice = type { i32, i32, i32, i32, i32, i32, %struct.datapartition*, %struct.MotionInfoContexts*, %struct.TextureInfoContexts*, %struct.RMPNIbuffer_s*, i32, i32*, i32*, i32*, i32, i32*, i32*, i32*, i32 (i32)*, [3 x [2 x i32]] }
%struct.datapartition = type { %struct.Bitstream*, %struct.EncodingEnvironment, i32 (%struct.syntaxelement*, %struct.datapartition*)* }
%struct.Bitstream = type { i32, i32, i8, i32, i32, i8, i8, i32, i32, i8*, i32 }
%struct.EncodingEnvironment = type { i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.syntaxelement = type { i32, i32, i32, i32, i32, i32, i32, i32, void (i32, i32, i32*, i32*)*, void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* }
%struct.MotionInfoContexts = type { [3 x [11 x %struct.BiContextType]], [2 x [9 x %struct.BiContextType]], [2 x [10 x %struct.BiContextType]], [2 x [6 x %struct.BiContextType]], [4 x %struct.BiContextType], [4 x %struct.BiContextType], [3 x %struct.BiContextType] }
%struct.BiContextType = type { i16, i8, i64 }

!200 = !DISubprogram(name: "get_mem2Dshort", scope: !1, file: !1, line: 502, type: !201, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16***, i32, i32)* @get_mem2Dshort, variables: !203)
!201 = !DISubroutineType(types: !202)
!202 = !{!21, !36, !21, !21}
!203 = !{!204, !205, !206, !207}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "array2D", arg: 1, scope: !200, file: !1, line: 502, type: !36)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rows", arg: 2, scope: !200, file: !1, line: 502, type: !21)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "columns", arg: 3, scope: !200, file: !1, line: 502, type: !21)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !200, file: !1, line: 504, type: !21)
!208 = !DISubprogram(name: "get_mem3Dshort", scope: !1, file: !1, line: 526, type: !209, isLocal: false, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16****, i32, i32, i32)* @get_mem3Dshort, variables: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{!21, !37, !21, !21, !21}
!211 = !{!212, !213, !214, !215, !216}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "array3D", arg: 1, scope: !208, file: !1, line: 526, type: !37)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frames", arg: 2, scope: !208, file: !1, line: 526, type: !21)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rows", arg: 3, scope: !208, file: !1, line: 526, type: !21)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "columns", arg: 4, scope: !208, file: !1, line: 526, type: !21)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !208, file: !1, line: 528, type: !21)
!217 = !DISubprogram(name: "get_mem4Dshort", scope: !1, file: !1, line: 548, type: !218, isLocal: false, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16*****, i32, i32, i32, i32)* @get_mem4Dshort, variables: !221)
!218 = !DISubroutineType(types: !219)
!219 = !{!21, !220, !21, !21, !21, !21}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!221 = !{!222, !223, !224, !225, !226, !227}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "array4D", arg: 1, scope: !217, file: !1, line: 548, type: !220)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 2, scope: !217, file: !1, line: 548, type: !21)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frames", arg: 3, scope: !217, file: !1, line: 548, type: !21)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rows", arg: 4, scope: !217, file: !1, line: 548, type: !21)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "columns", arg: 5, scope: !217, file: !1, line: 548, type: !21)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !217, file: !1, line: 550, type: !21)
!228 = !DISubprogram(name: "free_mem2Dshort", scope: !1, file: !1, line: 568, type: !229, isLocal: false, isDefinition: true, scopeLine: 569, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**)* @free_mem2Dshort, variables: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !33}
!231 = !{!232}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "array2D", arg: 1, scope: !228, file: !1, line: 568, type: !33)
!233 = !DISubprogram(name: "free_mem3Dshort", scope: !1, file: !1, line: 591, type: !234, isLocal: false, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: true, function: void (i16***, i32)* @free_mem3Dshort, variables: !236)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !36, !21}
!236 = !{!237, !238, !239}
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "array3D", arg: 1, scope: !233, file: !1, line: 591, type: !36)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frames", arg: 2, scope: !233, file: !1, line: 591, type: !21)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !233, file: !1, line: 593, type: !21)
!240 = !DISubprogram(name: "free_mem4Dshort", scope: !1, file: !1, line: 615, type: !241, isLocal: false, isDefinition: true, scopeLine: 616, flags: DIFlagPrototyped, isOptimized: true, function: void (i16****, i32, i32)* @free_mem4Dshort, variables: !243)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !37, !21, !21}
!243 = !{!244, !245, !246, !247}
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "array4D", arg: 1, scope: !240, file: !1, line: 615, type: !37)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 2, scope: !240, file: !1, line: 615, type: !21)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frames", arg: 3, scope: !240, file: !1, line: 615, type: !21)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !240, file: !1, line: 617, type: !21)
!248 = !{!249, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !489, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !617, !621, !622, !623, !624, !625, !626, !629, !632, !633, !634, !635, !638, !641, !652, !688, !689, !690, !691, !692, !748, !749, !750, !751, !752, !756, !757, !758, !759, !760, !761, !762, !763}
!249 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !25, line: 558, type: !250, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !25, line: 484, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 475, size: 6592, align: 64, elements: !253)
!253 = !{!254, !255, !256, !434, !435, !437, !438}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !252, file: !25, line: 477, baseType: !21, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !252, file: !25, line: 478, baseType: !21, size: 32, align: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !252, file: !25, line: 479, baseType: !257, size: 6400, align: 64, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 6400, align: 64, elements: !432)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !25, line: 471, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 443, size: 1216, align: 64, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !342, !380, !407, !416, !417, !418, !419, !420, !421, !422, !423, !424, !429}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !260, file: !25, line: 445, baseType: !21, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !260, file: !25, line: 446, baseType: !21, size: 32, align: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !260, file: !25, line: 447, baseType: !21, size: 32, align: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !260, file: !25, line: 448, baseType: !21, size: 32, align: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !260, file: !25, line: 449, baseType: !21, size: 32, align: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !260, file: !25, line: 450, baseType: !21, size: 32, align: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !260, file: !25, line: 451, baseType: !269, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !25, line: 440, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !25, line: 430, size: 960, align: 64, elements: !272)
!272 = !{!273, !289, !314}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !271, file: !25, line: 433, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !25, line: 427, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 411, size: 384, align: 64, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !276, file: !25, line: 413, baseType: !21, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !276, file: !25, line: 414, baseType: !21, size: 32, align: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !276, file: !25, line: 415, baseType: !16, size: 8, align: 8, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !276, file: !25, line: 416, baseType: !21, size: 32, align: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !276, file: !25, line: 417, baseType: !21, size: 32, align: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !276, file: !25, line: 418, baseType: !16, size: 8, align: 8, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !276, file: !25, line: 420, baseType: !16, size: 8, align: 8, offset: 168)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !276, file: !25, line: 421, baseType: !21, size: 32, align: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !276, file: !25, line: 422, baseType: !21, size: 32, align: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !276, file: !25, line: 424, baseType: !15, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !276, file: !25, line: 425, baseType: !21, size: 32, align: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !271, file: !25, line: 434, baseType: !290, size: 832, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !25, line: 226, baseType: !291)
!291 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 207, size: 832, align: 64, elements: !292)
!292 = !{!293, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !291, file: !25, line: 209, baseType: !294, size: 32, align: 32)
!294 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !291, file: !25, line: 209, baseType: !294, size: 32, align: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !291, file: !25, line: 210, baseType: !294, size: 32, align: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !291, file: !25, line: 211, baseType: !294, size: 32, align: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !291, file: !25, line: 212, baseType: !294, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !291, file: !25, line: 213, baseType: !15, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !291, file: !25, line: 214, baseType: !20, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !291, file: !25, line: 217, baseType: !294, size: 32, align: 32, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !291, file: !25, line: 217, baseType: !294, size: 32, align: 32, offset: 352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !291, file: !25, line: 218, baseType: !294, size: 32, align: 32, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !291, file: !25, line: 219, baseType: !294, size: 32, align: 32, offset: 416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !291, file: !25, line: 220, baseType: !294, size: 32, align: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !291, file: !25, line: 221, baseType: !15, size: 64, align: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !291, file: !25, line: 222, baseType: !20, size: 64, align: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !291, file: !25, line: 223, baseType: !21, size: 32, align: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !291, file: !25, line: 223, baseType: !21, size: 32, align: 32, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !291, file: !25, line: 224, baseType: !21, size: 32, align: 32, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !291, file: !25, line: 224, baseType: !21, size: 32, align: 32, offset: 736)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !291, file: !25, line: 225, baseType: !21, size: 32, align: 32, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !291, file: !25, line: 225, baseType: !21, size: 32, align: 32, offset: 800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !271, file: !25, line: 436, baseType: !315, size: 64, align: 64, offset: 896)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!21, !318, !341}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !25, line: 348, baseType: !320)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !25, line: 327, size: 384, align: 64, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !334}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !25, line: 329, baseType: !21, size: 32, align: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !320, file: !25, line: 330, baseType: !21, size: 32, align: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !320, file: !25, line: 331, baseType: !21, size: 32, align: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !320, file: !25, line: 332, baseType: !21, size: 32, align: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !320, file: !25, line: 333, baseType: !21, size: 32, align: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !320, file: !25, line: 334, baseType: !294, size: 32, align: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !320, file: !25, line: 335, baseType: !21, size: 32, align: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !320, file: !25, line: 336, baseType: !21, size: 32, align: 32, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !320, file: !25, line: 344, baseType: !331, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !21, !21, !20, !20}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !320, file: !25, line: 346, baseType: !335, size: 64, align: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338, !339}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !25, line: 228, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !260, file: !25, line: 452, baseType: !343, size: 64, align: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !25, line: 268, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 258, size: 12032, align: 64, elements: !346)
!346 = !{!347, !359, !364, !368, !372, !376, !377}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !345, file: !25, line: 260, baseType: !348, size: 4224, align: 64)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 4224, align: 64, elements: !356)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !25, line: 238, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 231, size: 128, align: 64, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !350, file: !25, line: 233, baseType: !11, size: 16, align: 16)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !350, file: !25, line: 234, baseType: !18, size: 8, align: 8, offset: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !350, file: !25, line: 236, baseType: !355, size: 64, align: 64, offset: 64)
!355 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!356 = !{!357, !358}
!357 = !DISubrange(count: 3)
!358 = !DISubrange(count: 11)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !345, file: !25, line: 261, baseType: !360, size: 2304, align: 64, offset: 4224)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 2304, align: 64, elements: !361)
!361 = !{!362, !363}
!362 = !DISubrange(count: 2)
!363 = !DISubrange(count: 9)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !345, file: !25, line: 262, baseType: !365, size: 2560, align: 64, offset: 6528)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 2560, align: 64, elements: !366)
!366 = !{!362, !367}
!367 = !DISubrange(count: 10)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !345, file: !25, line: 263, baseType: !369, size: 1536, align: 64, offset: 9088)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1536, align: 64, elements: !370)
!370 = !{!362, !371}
!371 = !DISubrange(count: 6)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !345, file: !25, line: 264, baseType: !373, size: 512, align: 64, offset: 10624)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 512, align: 64, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 4)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !345, file: !25, line: 265, baseType: !373, size: 512, align: 64, offset: 11136)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !345, file: !25, line: 266, baseType: !378, size: 384, align: 64, offset: 11648)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 384, align: 64, elements: !379)
!379 = !{!357}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !260, file: !25, line: 453, baseType: !381, size: 64, align: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !25, line: 293, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 281, size: 97024, align: 64, elements: !384)
!384 = !{!385, !388, !389, !392, !395, !399, !400, !404, !405, !406}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !383, file: !25, line: 283, baseType: !386, size: 256, align: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 256, align: 64, elements: !387)
!387 = !{!362}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !383, file: !25, line: 284, baseType: !373, size: 512, align: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !383, file: !25, line: 285, baseType: !390, size: 1536, align: 64, offset: 768)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1536, align: 64, elements: !391)
!391 = !{!357, !375}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !383, file: !25, line: 286, baseType: !393, size: 5120, align: 64, offset: 2304)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 5120, align: 64, elements: !394)
!394 = !{!367, !375}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !383, file: !25, line: 287, baseType: !396, size: 19200, align: 64, offset: 7424)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 19200, align: 64, elements: !397)
!397 = !{!367, !398}
!398 = !DISubrange(count: 15)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !383, file: !25, line: 288, baseType: !396, size: 19200, align: 64, offset: 26624)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !383, file: !25, line: 289, baseType: !401, size: 6400, align: 64, offset: 45824)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 6400, align: 64, elements: !402)
!402 = !{!367, !403}
!403 = !DISubrange(count: 5)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !383, file: !25, line: 290, baseType: !401, size: 6400, align: 64, offset: 52224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !383, file: !25, line: 291, baseType: !396, size: 19200, align: 64, offset: 58624)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !383, file: !25, line: 292, baseType: !396, size: 19200, align: 64, offset: 77824)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !260, file: !25, line: 456, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !25, line: 313, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !25, line: 308, size: 128, align: 64, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !410, file: !25, line: 310, baseType: !21, size: 32, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !410, file: !25, line: 311, baseType: !21, size: 32, align: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !410, file: !25, line: 312, baseType: !415, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !260, file: !25, line: 458, baseType: !21, size: 32, align: 32, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !260, file: !25, line: 459, baseType: !20, size: 64, align: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !260, file: !25, line: 460, baseType: !20, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !260, file: !25, line: 461, baseType: !20, size: 64, align: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !260, file: !25, line: 462, baseType: !21, size: 32, align: 32, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !260, file: !25, line: 463, baseType: !20, size: 64, align: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !260, file: !25, line: 464, baseType: !20, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !260, file: !25, line: 465, baseType: !20, size: 64, align: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !260, file: !25, line: 467, baseType: !425, size: 64, align: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!428, !21}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !260, file: !25, line: 469, baseType: !430, size: 192, align: 32, offset: 1024)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, align: 32, elements: !431)
!431 = !{!357, !362}
!432 = !{!433}
!433 = !DISubrange(count: 100)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !252, file: !25, line: 480, baseType: !21, size: 32, align: 32, offset: 6464)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !252, file: !25, line: 481, baseType: !436, size: 32, align: 32, offset: 6496)
!436 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !252, file: !25, line: 482, baseType: !436, size: 32, align: 32, offset: 6528)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !252, file: !25, line: 483, baseType: !436, size: 32, align: 32, offset: 6560)
!439 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !25, line: 559, type: !250, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!440 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !25, line: 560, type: !250, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!441 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !25, line: 561, type: !250, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!442 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !25, line: 562, type: !250, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!443 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !25, line: 565, type: !9, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!444 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !25, line: 566, type: !13, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!445 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !25, line: 567, type: !19, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!446 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !25, line: 569, type: !294, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!447 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !25, line: 570, type: !294, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!448 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !25, line: 572, type: !21, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!449 = !DIGlobalVariable(name: "me_time", scope: !0, file: !25, line: 572, type: !21, isLocal: false, isDefinition: true, variable: i32* @me_time)
!450 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !25, line: 573, type: !451, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !465, !466, !467, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !453, file: !4, line: 105, baseType: !428, size: 32, align: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !453, file: !4, line: 106, baseType: !294, size: 32, align: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !453, file: !4, line: 107, baseType: !294, size: 32, align: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !453, file: !4, line: 108, baseType: !428, size: 32, align: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !453, file: !4, line: 110, baseType: !428, size: 32, align: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !453, file: !4, line: 111, baseType: !428, size: 32, align: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !453, file: !4, line: 112, baseType: !462, size: 256, align: 32, offset: 192)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, align: 32, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !453, file: !4, line: 115, baseType: !428, size: 32, align: 32, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !453, file: !4, line: 116, baseType: !294, size: 32, align: 32, offset: 480)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !453, file: !4, line: 117, baseType: !294, size: 32, align: 32, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !453, file: !4, line: 119, baseType: !469, size: 256, align: 32, offset: 544)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 256, align: 32, elements: !463)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !453, file: !4, line: 121, baseType: !469, size: 256, align: 32, offset: 800)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !453, file: !4, line: 122, baseType: !469, size: 256, align: 32, offset: 1056)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !453, file: !4, line: 124, baseType: !428, size: 32, align: 32, offset: 1312)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !453, file: !4, line: 125, baseType: !294, size: 32, align: 32, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !453, file: !4, line: 127, baseType: !294, size: 32, align: 32, offset: 1376)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !453, file: !4, line: 128, baseType: !15, size: 64, align: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !453, file: !4, line: 130, baseType: !21, size: 32, align: 32, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !453, file: !4, line: 131, baseType: !21, size: 32, align: 32, offset: 1504)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !453, file: !4, line: 132, baseType: !428, size: 32, align: 32, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !453, file: !4, line: 133, baseType: !294, size: 32, align: 32, offset: 1568)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !453, file: !4, line: 134, baseType: !21, size: 32, align: 32, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !453, file: !4, line: 135, baseType: !21, size: 32, align: 32, offset: 1632)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !453, file: !4, line: 136, baseType: !21, size: 32, align: 32, offset: 1664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !453, file: !4, line: 138, baseType: !21, size: 32, align: 32, offset: 1696)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !453, file: !4, line: 139, baseType: !21, size: 32, align: 32, offset: 1728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !453, file: !4, line: 141, baseType: !428, size: 32, align: 32, offset: 1760)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !453, file: !4, line: 142, baseType: !428, size: 32, align: 32, offset: 1792)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !453, file: !4, line: 143, baseType: !428, size: 32, align: 32, offset: 1824)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !453, file: !4, line: 144, baseType: !428, size: 32, align: 32, offset: 1856)
!489 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !25, line: 574, type: !490, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !492, file: !4, line: 151, baseType: !428, size: 32, align: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !492, file: !4, line: 153, baseType: !294, size: 32, align: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !492, file: !4, line: 154, baseType: !428, size: 32, align: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !492, file: !4, line: 155, baseType: !428, size: 32, align: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !492, file: !4, line: 156, baseType: !428, size: 32, align: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !492, file: !4, line: 157, baseType: !428, size: 32, align: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !492, file: !4, line: 158, baseType: !294, size: 32, align: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !492, file: !4, line: 159, baseType: !294, size: 32, align: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !492, file: !4, line: 160, baseType: !294, size: 32, align: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !492, file: !4, line: 162, baseType: !428, size: 32, align: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !492, file: !4, line: 163, baseType: !462, size: 256, align: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !492, file: !4, line: 165, baseType: !294, size: 32, align: 32, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !492, file: !4, line: 166, baseType: !294, size: 32, align: 32, offset: 608)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !492, file: !4, line: 167, baseType: !294, size: 32, align: 32, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !492, file: !4, line: 168, baseType: !294, size: 32, align: 32, offset: 672)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !492, file: !4, line: 170, baseType: !294, size: 32, align: 32, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !492, file: !4, line: 172, baseType: !428, size: 32, align: 32, offset: 736)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !492, file: !4, line: 173, baseType: !21, size: 32, align: 32, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !492, file: !4, line: 174, baseType: !21, size: 32, align: 32, offset: 800)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !492, file: !4, line: 175, baseType: !294, size: 32, align: 32, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !492, file: !4, line: 177, baseType: !515, size: 8192, align: 32, offset: 864)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, align: 32, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !492, file: !4, line: 178, baseType: !294, size: 32, align: 32, offset: 9056)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !492, file: !4, line: 179, baseType: !428, size: 32, align: 32, offset: 9088)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !492, file: !4, line: 180, baseType: !294, size: 32, align: 32, offset: 9120)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !492, file: !4, line: 181, baseType: !294, size: 32, align: 32, offset: 9152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !492, file: !4, line: 182, baseType: !428, size: 32, align: 32, offset: 9184)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !492, file: !4, line: 184, baseType: !428, size: 32, align: 32, offset: 9216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !492, file: !4, line: 185, baseType: !428, size: 32, align: 32, offset: 9248)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !492, file: !4, line: 186, baseType: !428, size: 32, align: 32, offset: 9280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !492, file: !4, line: 187, baseType: !294, size: 32, align: 32, offset: 9312)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !492, file: !4, line: 188, baseType: !294, size: 32, align: 32, offset: 9344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !492, file: !4, line: 189, baseType: !294, size: 32, align: 32, offset: 9376)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !492, file: !4, line: 190, baseType: !294, size: 32, align: 32, offset: 9408)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !492, file: !4, line: 191, baseType: !428, size: 32, align: 32, offset: 9440)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !492, file: !4, line: 192, baseType: !532, size: 7584, align: 32, offset: 9472)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !533)
!533 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !533, file: !4, line: 65, baseType: !428, size: 32, align: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !533, file: !4, line: 66, baseType: !294, size: 32, align: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !533, file: !4, line: 67, baseType: !294, size: 32, align: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !533, file: !4, line: 68, baseType: !294, size: 32, align: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !533, file: !4, line: 69, baseType: !428, size: 32, align: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !533, file: !4, line: 70, baseType: !428, size: 32, align: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !533, file: !4, line: 71, baseType: !428, size: 32, align: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !533, file: !4, line: 72, baseType: !294, size: 32, align: 32, offset: 224)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !533, file: !4, line: 73, baseType: !428, size: 32, align: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !533, file: !4, line: 74, baseType: !428, size: 32, align: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !533, file: !4, line: 75, baseType: !294, size: 32, align: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !533, file: !4, line: 76, baseType: !294, size: 32, align: 32, offset: 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !533, file: !4, line: 77, baseType: !294, size: 32, align: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !533, file: !4, line: 78, baseType: !428, size: 32, align: 32, offset: 416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !533, file: !4, line: 79, baseType: !294, size: 32, align: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !533, file: !4, line: 80, baseType: !294, size: 32, align: 32, offset: 480)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !533, file: !4, line: 81, baseType: !428, size: 32, align: 32, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !533, file: !4, line: 82, baseType: !294, size: 32, align: 32, offset: 544)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !533, file: !4, line: 83, baseType: !294, size: 32, align: 32, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !533, file: !4, line: 84, baseType: !428, size: 32, align: 32, offset: 608)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !533, file: !4, line: 85, baseType: !428, size: 32, align: 32, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !533, file: !4, line: 86, baseType: !557, size: 3296, align: 32, offset: 672)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !558)
!558 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !559)
!559 = !{!560, !561, !562, !563, !567, !568, !569, !570, !571, !572}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !558, file: !4, line: 50, baseType: !294, size: 32, align: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !558, file: !4, line: 51, baseType: !294, size: 32, align: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !558, file: !4, line: 52, baseType: !294, size: 32, align: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !558, file: !4, line: 53, baseType: !564, size: 1024, align: 32, offset: 96)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1024, align: 32, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !558, file: !4, line: 54, baseType: !564, size: 1024, align: 32, offset: 1120)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !558, file: !4, line: 55, baseType: !564, size: 1024, align: 32, offset: 2144)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !558, file: !4, line: 56, baseType: !294, size: 32, align: 32, offset: 3168)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !558, file: !4, line: 57, baseType: !294, size: 32, align: 32, offset: 3200)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !558, file: !4, line: 58, baseType: !294, size: 32, align: 32, offset: 3232)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !558, file: !4, line: 59, baseType: !294, size: 32, align: 32, offset: 3264)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !533, file: !4, line: 87, baseType: !428, size: 32, align: 32, offset: 3968)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !533, file: !4, line: 88, baseType: !557, size: 3296, align: 32, offset: 4000)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !533, file: !4, line: 90, baseType: !428, size: 32, align: 32, offset: 7296)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !533, file: !4, line: 91, baseType: !428, size: 32, align: 32, offset: 7328)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !533, file: !4, line: 92, baseType: !428, size: 32, align: 32, offset: 7360)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !533, file: !4, line: 93, baseType: !294, size: 32, align: 32, offset: 7392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !533, file: !4, line: 94, baseType: !294, size: 32, align: 32, offset: 7424)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !533, file: !4, line: 95, baseType: !294, size: 32, align: 32, offset: 7456)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !533, file: !4, line: 96, baseType: !294, size: 32, align: 32, offset: 7488)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !533, file: !4, line: 97, baseType: !294, size: 32, align: 32, offset: 7520)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !533, file: !4, line: 98, baseType: !294, size: 32, align: 32, offset: 7552)
!584 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !25, line: 578, type: !21, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!585 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !25, line: 579, type: !21, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!586 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !25, line: 583, type: !30, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!587 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !25, line: 584, type: !30, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!588 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !25, line: 585, type: !32, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!589 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !25, line: 586, type: !21, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!590 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !25, line: 587, type: !21, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!591 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !25, line: 588, type: !21, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!592 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !25, line: 589, type: !21, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!593 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !25, line: 592, type: !9, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!594 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !25, line: 593, type: !9, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!595 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !25, line: 595, type: !13, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!596 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !25, line: 596, type: !13, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!597 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !25, line: 598, type: !9, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!598 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !25, line: 599, type: !13, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!599 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !25, line: 601, type: !9, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!600 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !25, line: 602, type: !13, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!601 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !25, line: 604, type: !36, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!602 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !25, line: 605, type: !33, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!603 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !25, line: 608, type: !14, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!604 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !25, line: 609, type: !14, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!605 = !DIGlobalVariable(name: "intras", scope: !0, file: !25, line: 610, type: !21, isLocal: false, isDefinition: true, variable: i32* @intras)
!606 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !25, line: 612, type: !21, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!607 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !25, line: 612, type: !21, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!608 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !25, line: 612, type: !21, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!609 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !25, line: 613, type: !21, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!610 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !25, line: 613, type: !21, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!611 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !25, line: 613, type: !21, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!612 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !25, line: 614, type: !21, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!613 = !DIGlobalVariable(name: "errortext", scope: !0, file: !25, line: 617, type: !614, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2400, align: 8, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 300)
!617 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !25, line: 620, type: !618, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, align: 32, elements: !619)
!619 = !{!620, !620}
!620 = !DISubrange(count: 16)
!621 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !25, line: 620, type: !618, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!622 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !25, line: 620, type: !618, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!623 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !25, line: 621, type: !618, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!624 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !25, line: 621, type: !618, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!625 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !25, line: 621, type: !618, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!626 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !25, line: 622, type: !627, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 24576, align: 32, elements: !628)
!628 = !{!357, !620, !620}
!629 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !25, line: 623, type: !630, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, align: 32, elements: !631)
!631 = !{!362, !375, !375}
!632 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !25, line: 623, type: !630, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!633 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !25, line: 624, type: !630, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!634 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !25, line: 624, type: !630, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!635 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !25, line: 625, type: !636, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 32, elements: !637)
!637 = !{!375, !375}
!638 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !25, line: 625, type: !639, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 32, elements: !640)
!640 = !{!620}
!641 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !25, line: 1201, type: !642, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !25, line: 1190, baseType: !644)
!644 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 1182, size: 192, align: 32, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !644, file: !25, line: 1184, baseType: !21, size: 32, align: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !644, file: !25, line: 1185, baseType: !21, size: 32, align: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !644, file: !25, line: 1186, baseType: !21, size: 32, align: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !644, file: !25, line: 1187, baseType: !21, size: 32, align: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !644, file: !25, line: 1188, baseType: !21, size: 32, align: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !644, file: !25, line: 1189, baseType: !21, size: 32, align: 32, offset: 160)
!652 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !25, line: 1202, type: !653, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !25, line: 1177, baseType: !655)
!655 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 1145, size: 26880, align: 64, elements: !656)
!656 = !{!657, !659, !660, !661, !662, !663, !664, !665, !666, !668, !669, !670, !671, !672, !673, !674, !676, !677, !678, !679, !681, !682, !683, !684, !685, !686, !687}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !655, file: !25, line: 1147, baseType: !658, size: 64, align: 64)
!658 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !655, file: !25, line: 1149, baseType: !618, size: 8192, align: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !655, file: !25, line: 1150, baseType: !618, size: 8192, align: 32, offset: 8256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !655, file: !25, line: 1150, baseType: !618, size: 8192, align: 32, offset: 16448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !655, file: !25, line: 1151, baseType: !32, size: 64, align: 64, offset: 24640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !655, file: !25, line: 1152, baseType: !30, size: 64, align: 64, offset: 24704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !655, file: !25, line: 1153, baseType: !21, size: 32, align: 32, offset: 24768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !655, file: !25, line: 1155, baseType: !21, size: 32, align: 32, offset: 24800)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !655, file: !25, line: 1157, baseType: !667, size: 128, align: 32, offset: 24832)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, align: 32, elements: !374)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !655, file: !25, line: 1157, baseType: !667, size: 128, align: 32, offset: 24960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !655, file: !25, line: 1158, baseType: !19, size: 64, align: 64, offset: 25088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !655, file: !25, line: 1159, baseType: !639, size: 512, align: 32, offset: 25152)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !655, file: !25, line: 1160, baseType: !21, size: 32, align: 32, offset: 25664)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !655, file: !25, line: 1161, baseType: !24, size: 64, align: 64, offset: 25728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !655, file: !25, line: 1162, baseType: !21, size: 32, align: 32, offset: 25792)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !655, file: !25, line: 1163, baseType: !675, size: 64, align: 64, offset: 25856)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !655, file: !25, line: 1164, baseType: !675, size: 64, align: 64, offset: 25920)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !655, file: !25, line: 1165, baseType: !675, size: 64, align: 64, offset: 25984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !655, file: !25, line: 1166, baseType: !675, size: 64, align: 64, offset: 26048)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !655, file: !25, line: 1167, baseType: !680, size: 512, align: 16, offset: 26112)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, align: 16, elements: !631)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !655, file: !25, line: 1168, baseType: !21, size: 32, align: 32, offset: 26624)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !655, file: !25, line: 1169, baseType: !21, size: 32, align: 32, offset: 26656)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !655, file: !25, line: 1171, baseType: !21, size: 32, align: 32, offset: 26688)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !655, file: !25, line: 1172, baseType: !21, size: 32, align: 32, offset: 26720)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !655, file: !25, line: 1174, baseType: !21, size: 32, align: 32, offset: 26752)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !655, file: !25, line: 1175, baseType: !21, size: 32, align: 32, offset: 26784)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !655, file: !25, line: 1176, baseType: !21, size: 32, align: 32, offset: 26816)
!688 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !25, line: 1203, type: !654, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!689 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !25, line: 1203, type: !654, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!690 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !25, line: 1204, type: !654, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!691 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !25, line: 1204, type: !654, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!692 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !25, line: 1230, type: !693, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !695, line: 153, baseType: !696)
!695 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !695, line: 122, size: 1216, align: 64, elements: !697)
!697 = !{!698, !700, !701, !702, !703, !704, !709, !710, !711, !715, !719, !728, !734, !735, !738, !739, !741, !745, !746, !747}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !696, file: !695, line: 123, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !696, file: !695, line: 124, baseType: !21, size: 32, align: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !696, file: !695, line: 125, baseType: !21, size: 32, align: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !696, file: !695, line: 126, baseType: !35, size: 16, align: 16, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !696, file: !695, line: 127, baseType: !35, size: 16, align: 16, offset: 144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !696, file: !695, line: 128, baseType: !705, size: 128, align: 64, offset: 192)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !695, line: 88, size: 128, align: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !705, file: !695, line: 89, baseType: !699, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !705, file: !695, line: 90, baseType: !21, size: 32, align: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !696, file: !695, line: 129, baseType: !21, size: 32, align: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !696, file: !695, line: 132, baseType: !12, size: 64, align: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !696, file: !695, line: 133, baseType: !712, size: 64, align: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!21, !12}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !696, file: !695, line: 134, baseType: !716, size: 64, align: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!21, !12, !196, !21}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !696, file: !695, line: 135, baseType: !720, size: 64, align: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !12, !723, !21}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !695, line: 77, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !725, line: 71, baseType: !726)
!725 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !727, line: 46, baseType: !28)
!727 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !696, file: !695, line: 136, baseType: !729, size: 64, align: 64, offset: 640)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!21, !12, !732, !21}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !696, file: !695, line: 139, baseType: !705, size: 128, align: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !696, file: !695, line: 140, baseType: !736, size: 64, align: 64, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !695, line: 94, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !696, file: !695, line: 141, baseType: !21, size: 32, align: 32, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !696, file: !695, line: 144, baseType: !740, size: 24, align: 8, offset: 928)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !379)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !696, file: !695, line: 145, baseType: !742, size: 8, align: 8, offset: 952)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 1)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !696, file: !695, line: 148, baseType: !705, size: 128, align: 64, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !696, file: !695, line: 151, baseType: !21, size: 32, align: 32, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !696, file: !695, line: 152, baseType: !723, size: 64, align: 64, offset: 1152)
!748 = !DIGlobalVariable(name: "p_log", scope: !0, file: !25, line: 1231, type: !693, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!749 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !25, line: 1232, type: !693, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!750 = !DIGlobalVariable(name: "p_in", scope: !0, file: !25, line: 1233, type: !21, isLocal: false, isDefinition: true, variable: i32* @p_in)
!751 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !25, line: 1234, type: !21, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!752 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !25, line: 1237, type: !753, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 640, align: 32, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 20)
!756 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !25, line: 1238, type: !753, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!757 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !25, line: 1239, type: !753, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!758 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !25, line: 1240, type: !753, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!759 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !25, line: 1241, type: !753, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!760 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !25, line: 1242, type: !753, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!761 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !25, line: 1456, type: !21, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!762 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !25, line: 1465, type: !21, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!763 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !25, line: 1466, type: !21, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!764 = !{}
!765 = !{i32 2, !"Dwarf Version", i32 2}
!766 = !{i32 2, !"Debug Info Version", i32 700000003}
!767 = !{i32 1, !"PIC Level", i32 2}
!768 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!769 = !DIExpression()
!770 = !DILocation(line: 28, column: 34, scope: !39)
!771 = !DILocation(line: 28, column: 48, scope: !39)
!772 = !DILocation(line: 28, column: 58, scope: !39)
!773 = !DILocation(line: 28, column: 77, scope: !39)
!774 = !DILocation(line: 28, column: 100, scope: !39)
!775 = !DILocation(line: 32, column: 45, scope: !776)
!776 = distinct !DILexicalBlock(scope: !39, file: !1, line: 32, column: 6)
!777 = !DILocation(line: 32, column: 41, scope: !776)
!778 = !DILocation(line: 32, column: 34, scope: !776)
!779 = !DILocation(line: 32, column: 22, scope: !776)
!780 = !{!781, !781, i64 0}
!781 = !{!"any pointer", !782, i64 0}
!782 = !{!"omnipotent char", !783, i64 0}
!783 = !{!"Simple C/C++ TBAA"}
!784 = !DILocation(line: 32, column: 74, scope: !776)
!785 = !DILocation(line: 32, column: 6, scope: !39)
!786 = !DILocation(line: 486, column: 24, scope: !193, inlinedAt: !787)
!787 = distinct !DILocation(line: 33, column: 5, scope: !776)
!788 = !DILocation(line: 488, column: 4, scope: !193, inlinedAt: !787)
!789 = !DILocation(line: 489, column: 4, scope: !193, inlinedAt: !787)
!790 = !DILocation(line: 33, column: 5, scope: !776)
!791 = !DILocation(line: 35, column: 34, scope: !792)
