; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mv-search.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }

!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_pos", arg: 3, scope: !57, file: !1, line: 234, type: !32)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !57, file: !1, line: 239, type: !32)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_bo", scope: !57, file: !1, line: 239, type: !30)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_bi", scope: !57, file: !1, line: 239, type: !30)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_bj", scope: !57, file: !1, line: 239, type: !30)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_o", scope: !57, file: !1, line: 240, type: !31)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_i", scope: !57, file: !1, line: 240, type: !31)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_j", scope: !57, file: !1, line: 240, type: !31)
!71 = !DISubprogram(name: "SetupFastFullPelSearch", scope: !1, file: !1, line: 305, type: !72, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: void (i16, i32)* @SetupFastFullPelSearch, variables: !75)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !32}
!74 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!75 = !{!76, !77, !78, !82, !87, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !189, !190, !191, !192, !193, !194}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 1, scope: !71, file: !1, line: 305, type: !74)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !71, file: !1, line: 305, type: !32)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmv", scope: !71, file: !1, line: 307, type: !79)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, align: 16, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 2)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_blocks", scope: !71, file: !1, line: 308, type: !83)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 4096, align: 16, elements: !85)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !{!86}
!86 = !DISubrange(count: 256)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orgptr", scope: !71, file: !1, line: 308, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refptr", scope: !71, file: !1, line: 308, type: !88)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset_x", scope: !71, file: !1, line: 309, type: !32)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset_y", scope: !71, file: !1, line: 309, type: !32)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !71, file: !1, line: 309, type: !32)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !71, file: !1, line: 309, type: !32)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range_partly_outside", scope: !71, file: !1, line: 309, type: !32)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_x", scope: !71, file: !1, line: 309, type: !32)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_y", scope: !71, file: !1, line: 309, type: !32)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !71, file: !1, line: 309, type: !32)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_x", scope: !71, file: !1, line: 309, type: !32)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_y", scope: !71, file: !1, line: 309, type: !32)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bindex", scope: !71, file: !1, line: 309, type: !32)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blky", scope: !71, file: !1, line: 309, type: !32)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LineSadBlk0", scope: !71, file: !1, line: 310, type: !32)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LineSadBlk1", scope: !71, file: !1, line: 310, type: !32)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LineSadBlk2", scope: !71, file: !1, line: 310, type: !32)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LineSadBlk3", scope: !71, file: !1, line: 310, type: !32)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_width", scope: !71, file: !1, line: 311, type: !32)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_height", scope: !71, file: !1, line: 311, type: !32)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !71, file: !1, line: 312, type: !32)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !71, file: !1, line: 312, type: !32)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_picture", scope: !71, file: !1, line: 314, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !113, line: 82, baseType: !114)
!113 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !113, line: 21, size: 52672, align: 64, elements: !115)
!115 = !{!116, !118, !119, !120, !121, !122, !123, !132, !133, !134, !135, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !156, !157, !159, !164, !168, !172, !173, !175, !177, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !114, file: !113, line: 23, baseType: !117, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !4, line: 190, baseType: !3)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !114, file: !113, line: 25, baseType: !32, size: 32, align: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !114, file: !113, line: 26, baseType: !32, size: 32, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !114, file: !113, line: 27, baseType: !32, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !114, file: !113, line: 28, baseType: !32, size: 32, align: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !114, file: !113, line: 29, baseType: !32, size: 32, align: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !114, file: !113, line: 30, baseType: !124, size: 12672, align: 64, offset: 192)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 12672, align: 64, elements: !129)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !127, line: 30, baseType: !128)
!127 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!128 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!129 = !{!130, !131}
!130 = !DISubrange(count: 6)
!131 = !DISubrange(count: 33)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !114, file: !113, line: 31, baseType: !124, size: 12672, align: 64, offset: 12864)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !114, file: !113, line: 32, baseType: !124, size: 12672, align: 64, offset: 25536)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !114, file: !113, line: 33, baseType: !124, size: 12672, align: 64, offset: 38208)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !114, file: !113, line: 34, baseType: !136, size: 32, align: 32, offset: 50880)
!136 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !114, file: !113, line: 35, baseType: !32, size: 32, align: 32, offset: 50912)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !114, file: !113, line: 36, baseType: !32, size: 32, align: 32, offset: 50944)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !114, file: !113, line: 37, baseType: !32, size: 32, align: 32, offset: 50976)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !114, file: !113, line: 39, baseType: !32, size: 32, align: 32, offset: 51008)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !114, file: !113, line: 40, baseType: !32, size: 32, align: 32, offset: 51040)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !114, file: !113, line: 41, baseType: !32, size: 32, align: 32, offset: 51072)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !114, file: !113, line: 42, baseType: !32, size: 32, align: 32, offset: 51104)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !114, file: !113, line: 44, baseType: !32, size: 32, align: 32, offset: 51136)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !114, file: !113, line: 44, baseType: !32, size: 32, align: 32, offset: 51168)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !114, file: !113, line: 44, baseType: !32, size: 32, align: 32, offset: 51200)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !114, file: !113, line: 44, baseType: !32, size: 32, align: 32, offset: 51232)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !114, file: !113, line: 45, baseType: !32, size: 32, align: 32, offset: 51264)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !114, file: !113, line: 46, baseType: !32, size: 32, align: 32, offset: 51296)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !114, file: !113, line: 47, baseType: !32, size: 32, align: 32, offset: 51328)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !114, file: !113, line: 49, baseType: !152, size: 64, align: 64, offset: 51392)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !114, file: !113, line: 50, baseType: !88, size: 64, align: 64, offset: 51456)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !114, file: !113, line: 51, baseType: !88, size: 64, align: 64, offset: 51520)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !114, file: !113, line: 52, baseType: !152, size: 64, align: 64, offset: 51584)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !114, file: !113, line: 53, baseType: !152, size: 64, align: 64, offset: 51648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !114, file: !113, line: 54, baseType: !158, size: 64, align: 64, offset: 51712)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !114, file: !113, line: 56, baseType: !160, size: 64, align: 64, offset: 51776)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !162, line: 30, baseType: !163)
!162 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!163 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !114, file: !113, line: 58, baseType: !165, size: 64, align: 64, offset: 51840)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !114, file: !113, line: 60, baseType: !169, size: 64, align: 64, offset: 51904)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !114, file: !113, line: 63, baseType: !169, size: 64, align: 64, offset: 51968)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !114, file: !113, line: 66, baseType: !174, size: 64, align: 64, offset: 52032)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !114, file: !113, line: 68, baseType: !176, size: 64, align: 64, offset: 52096)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !114, file: !113, line: 69, baseType: !176, size: 64, align: 64, offset: 52160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !114, file: !113, line: 71, baseType: !179, size: 64, align: 64, offset: 52224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !114, file: !113, line: 72, baseType: !179, size: 64, align: 64, offset: 52288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !114, file: !113, line: 73, baseType: !179, size: 64, align: 64, offset: 52352)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !114, file: !113, line: 75, baseType: !32, size: 32, align: 32, offset: 52416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !114, file: !113, line: 76, baseType: !32, size: 32, align: 32, offset: 52448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !114, file: !113, line: 77, baseType: !32, size: 32, align: 32, offset: 52480)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !114, file: !113, line: 78, baseType: !32, size: 32, align: 32, offset: 52512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !114, file: !113, line: 79, baseType: !32, size: 32, align: 32, offset: 52544)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !114, file: !113, line: 80, baseType: !32, size: 32, align: 32, offset: 52576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !114, file: !113, line: 81, baseType: !32, size: 32, align: 32, offset: 52608)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !71, file: !1, line: 315, type: !88)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_sad", scope: !71, file: !1, line: 317, type: !30)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_range", scope: !71, file: !1, line: 318, type: !32)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos", scope: !71, file: !1, line: 319, type: !32)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !71, file: !1, line: 321, type: !32)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !71, file: !1, line: 323, type: !32)
!195 = !DISubprogram(name: "SetMotionVectorPredictor", scope: !1, file: !1, line: 461, type: !196, isLocal: false, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: true, function: void (i16*, i16***, i16****, i16, i32, i32, i32, i32, i32)* @SetMotionVectorPredictor, variables: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !167, !165, !174, !74, !32, !32, !32, !32, !32}
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !230, !231, !232, !233, !234, !235, !236, !237}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pmv", arg: 1, scope: !195, file: !1, line: 461, type: !167)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "refPic", arg: 2, scope: !195, file: !1, line: 462, type: !165)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmp_mv", arg: 3, scope: !195, file: !1, line: 463, type: !174)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref_frame", arg: 4, scope: !195, file: !1, line: 464, type: !74)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 5, scope: !195, file: !1, line: 465, type: !32)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_x", arg: 6, scope: !195, file: !1, line: 466, type: !32)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_y", arg: 7, scope: !195, file: !1, line: 467, type: !32)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blockshape_x", arg: 8, scope: !195, file: !1, line: 468, type: !32)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blockshape_y", arg: 9, scope: !195, file: !1, line: 469, type: !32)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !195, file: !1, line: 471, type: !32)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !195, file: !1, line: 472, type: !32)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !195, file: !1, line: 473, type: !32)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_a", scope: !195, file: !1, line: 475, type: !32)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_b", scope: !195, file: !1, line: 475, type: !32)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_c", scope: !195, file: !1, line: 475, type: !32)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_vec", scope: !195, file: !1, line: 475, type: !32)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mvPredType", scope: !195, file: !1, line: 476, type: !32)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rFrameL", scope: !195, file: !1, line: 476, type: !32)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rFrameU", scope: !195, file: !1, line: 476, type: !32)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rFrameUR", scope: !195, file: !1, line: 476, type: !32)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hv", scope: !195, file: !1, line: 477, type: !32)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_a", scope: !195, file: !1, line: 479, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !4, line: 305, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !4, line: 297, size: 192, align: 32, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !222, file: !4, line: 299, baseType: !32, size: 32, align: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !222, file: !4, line: 300, baseType: !32, size: 32, align: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !222, file: !4, line: 301, baseType: !32, size: 32, align: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !222, file: !4, line: 302, baseType: !32, size: 32, align: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !222, file: !4, line: 303, baseType: !32, size: 32, align: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !222, file: !4, line: 304, baseType: !32, size: 32, align: 32, offset: 160)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_b", scope: !195, file: !1, line: 479, type: !221)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_c", scope: !195, file: !1, line: 479, type: !221)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_d", scope: !195, file: !1, line: 479, type: !221)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SAD_a", scope: !195, file: !1, line: 481, type: !32)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SAD_b", scope: !195, file: !1, line: 481, type: !32)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SAD_c", scope: !195, file: !1, line: 481, type: !32)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SAD_d", scope: !195, file: !1, line: 481, type: !32)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp_pred_SAD", scope: !195, file: !1, line: 482, type: !238)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, align: 32, elements: !80)
!239 = !DISubprogram(name: "Init_Motion_Search_Module", scope: !1, file: !1, line: 699, type: !38, isLocal: false, isDefinition: true, scopeLine: 700, isOptimized: true, function: void ()* @Init_Motion_Search_Module, variables: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits", scope: !239, file: !1, line: 701, type: !32)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !239, file: !1, line: 701, type: !32)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imin", scope: !239, file: !1, line: 701, type: !32)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imax", scope: !239, file: !1, line: 701, type: !32)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !239, file: !1, line: 701, type: !32)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !239, file: !1, line: 701, type: !32)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byte_abs_range", scope: !239, file: !1, line: 703, type: !32)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_range", scope: !239, file: !1, line: 704, type: !32)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "number_of_reference_frames", scope: !239, file: !1, line: 705, type: !32)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_search_points", scope: !239, file: !1, line: 706, type: !32)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_ref_bits", scope: !239, file: !1, line: 707, type: !32)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_ref", scope: !239, file: !1, line: 708, type: !32)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "number_of_subpel_positions", scope: !239, file: !1, line: 709, type: !32)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_mv_bits", scope: !239, file: !1, line: 710, type: !32)
!255 = !DISubprogram(name: "Clear_Motion_Search_Module", scope: !1, file: !1, line: 787, type: !38, isLocal: false, isDefinition: true, scopeLine: 788, isOptimized: true, function: void ()* @Clear_Motion_Search_Module, variables: !256)
!256 = !{}
!257 = !DISubprogram(name: "FullPelBlockMotionSearch", scope: !1, file: !1, line: 816, type: !258, isLocal: false, isDefinition: true, scopeLine: 829, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16**, i16, i32, i32, i32, i32, i16, i16, i16*, i16*, i32, i32, double)* @FullPelBlockMotionSearch, variables: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!32, !152, !74, !32, !32, !32, !32, !74, !74, !167, !167, !32, !32, !34}
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 1, scope: !257, file: !1, line: 816, type: !152)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 2, scope: !257, file: !1, line: 817, type: !74)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !257, file: !1, line: 818, type: !32)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !257, file: !1, line: 819, type: !32)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !257, file: !1, line: 820, type: !32)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !257, file: !1, line: 821, type: !32)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x", arg: 7, scope: !257, file: !1, line: 822, type: !74)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y", arg: 8, scope: !257, file: !1, line: 823, type: !74)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 9, scope: !257, file: !1, line: 824, type: !167)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 10, scope: !257, file: !1, line: 825, type: !167)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_range", arg: 11, scope: !257, file: !1, line: 826, type: !32)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 12, scope: !257, file: !1, line: 827, type: !32)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 13, scope: !257, file: !1, line: 828, type: !34)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !257, file: !1, line: 830, type: !32)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_x", scope: !257, file: !1, line: 830, type: !32)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_y", scope: !257, file: !1, line: 830, type: !32)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !257, file: !1, line: 830, type: !32)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x4", scope: !257, file: !1, line: 830, type: !32)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !257, file: !1, line: 830, type: !32)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_line", scope: !257, file: !1, line: 832, type: !88)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_line", scope: !257, file: !1, line: 832, type: !88)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_ref_line", scope: !257, file: !1, line: 833, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!88, !32, !88, !32, !32, !32, !32}
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !257, file: !1, line: 835, type: !32)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !257, file: !1, line: 836, type: !88)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !257, file: !1, line: 837, type: !32)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !257, file: !1, line: 838, type: !32)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_pos", scope: !257, file: !1, line: 840, type: !32)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos", scope: !257, file: !1, line: 841, type: !32)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !257, file: !1, line: 842, type: !32)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_y", scope: !257, file: !1, line: 843, type: !32)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x", scope: !257, file: !1, line: 844, type: !32)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x4", scope: !257, file: !1, line: 845, type: !32)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_x", scope: !257, file: !1, line: 846, type: !32)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_y", scope: !257, file: !1, line: 847, type: !32)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "center_x", scope: !257, file: !1, line: 848, type: !32)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "center_y", scope: !257, file: !1, line: 849, type: !32)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "check_for_00", scope: !257, file: !1, line: 850, type: !32)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !257, file: !1, line: 852, type: !32)
!302 = !DISubprogram(name: "FastFullPelBlockMotionSearch", scope: !1, file: !1, line: 935, type: !258, isLocal: false, isDefinition: true, scopeLine: 948, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16**, i16, i32, i32, i32, i32, i16, i16, i16*, i16*, i32, i32, double)* @FastFullPelBlockMotionSearch, variables: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 1, scope: !302, file: !1, line: 935, type: !152)
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 2, scope: !302, file: !1, line: 936, type: !74)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !302, file: !1, line: 937, type: !32)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !302, file: !1, line: 938, type: !32)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !302, file: !1, line: 939, type: !32)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !302, file: !1, line: 940, type: !32)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x", arg: 7, scope: !302, file: !1, line: 941, type: !74)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y", arg: 8, scope: !302, file: !1, line: 942, type: !74)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 9, scope: !302, file: !1, line: 943, type: !167)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 10, scope: !302, file: !1, line: 944, type: !167)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_range", arg: 11, scope: !302, file: !1, line: 945, type: !32)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 12, scope: !302, file: !1, line: 946, type: !32)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 13, scope: !302, file: !1, line: 947, type: !34)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !302, file: !1, line: 949, type: !32)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset_x", scope: !302, file: !1, line: 949, type: !32)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset_y", scope: !302, file: !1, line: 949, type: !32)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_x", scope: !302, file: !1, line: 949, type: !32)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_y", scope: !302, file: !1, line: 949, type: !32)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !302, file: !1, line: 949, type: !32)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos", scope: !302, file: !1, line: 951, type: !32)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !302, file: !1, line: 952, type: !32)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_pos", scope: !302, file: !1, line: 953, type: !32)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_index", scope: !302, file: !1, line: 954, type: !32)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_sad", scope: !302, file: !1, line: 955, type: !31)
!328 = !DISubprogram(name: "SATD", scope: !1, file: !1, line: 1017, type: !329, isLocal: false, isDefinition: true, scopeLine: 1018, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32)* @SATD, variables: !331)
!329 = !DISubroutineType(types: !330)
!330 = !{!32, !31, !32}
!331 = !{!332, !333, !334, !335, !336, !340, !341}
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "diff", arg: 1, scope: !328, file: !1, line: 1017, type: !31)
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "use_hadamard", arg: 2, scope: !328, file: !1, line: 1017, type: !32)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !328, file: !1, line: 1019, type: !32)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "satd", scope: !328, file: !1, line: 1019, type: !32)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !328, file: !1, line: 1019, type: !337)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, align: 32, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 16)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dd", scope: !328, file: !1, line: 1019, type: !32)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !328, file: !1, line: 1019, type: !337)
!342 = !DISubprogram(name: "SATD8X8", scope: !1, file: !1, line: 1118, type: !329, isLocal: false, isDefinition: true, scopeLine: 1119, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32)* @SATD8X8, variables: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !353, !354}
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "diff", arg: 1, scope: !342, file: !1, line: 1118, type: !31)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "use_hadamard", arg: 2, scope: !342, file: !1, line: 1118, type: !32)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !342, file: !1, line: 1120, type: !32)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !342, file: !1, line: 1120, type: !32)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sad", scope: !342, file: !1, line: 1120, type: !32)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m1", scope: !342, file: !1, line: 1121, type: !350)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, align: 32, elements: !351)
!351 = !{!352, !352}
!352 = !DISubrange(count: 8)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m2", scope: !342, file: !1, line: 1121, type: !350)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m3", scope: !342, file: !1, line: 1121, type: !350)
!355 = !DISubprogram(name: "find_SATD", scope: !1, file: !1, line: 1207, type: !356, isLocal: false, isDefinition: true, scopeLine: 1208, flags: DIFlagPrototyped, isOptimized: true, function: i32 ([16 x i32]*, i32, i32)* @find_SATD, variables: !359)
!356 = !DISubroutineType(types: !357)
!357 = !{!32, !358, !32, !32}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curr_diff", arg: 1, scope: !355, file: !1, line: 1207, type: !358)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "use_hadamard", arg: 2, scope: !355, file: !1, line: 1207, type: !32)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 3, scope: !355, file: !1, line: 1207, type: !32)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !355, file: !1, line: 1209, type: !32)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !355, file: !1, line: 1209, type: !32)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !355, file: !1, line: 1209, type: !32)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !355, file: !1, line: 1209, type: !32)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !355, file: !1, line: 1209, type: !32)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sad", scope: !355, file: !1, line: 1209, type: !32)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_size_x", scope: !355, file: !1, line: 1210, type: !32)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_size_y", scope: !355, file: !1, line: 1211, type: !32)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_size", scope: !355, file: !1, line: 1212, type: !32)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !355, file: !1, line: 1213, type: !373)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, align: 32, elements: !85)
!374 = !DISubprogram(name: "SubPelBlockMotionSearch", scope: !1, file: !1, line: 1269, type: !375, isLocal: false, isDefinition: true, scopeLine: 1284, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16**, i16, i32, i32, i32, i32, i16, i16, i16*, i16*, i32, i32, i32, double)* @SubPelBlockMotionSearch, variables: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{!32, !152, !74, !32, !32, !32, !32, !74, !74, !167, !167, !32, !32, !32, !34}
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 1, scope: !374, file: !1, line: 1269, type: !152)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 2, scope: !374, file: !1, line: 1270, type: !74)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !374, file: !1, line: 1271, type: !32)
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !374, file: !1, line: 1272, type: !32)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !374, file: !1, line: 1273, type: !32)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !374, file: !1, line: 1274, type: !32)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x", arg: 7, scope: !374, file: !1, line: 1275, type: !74)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y", arg: 8, scope: !374, file: !1, line: 1276, type: !74)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 9, scope: !374, file: !1, line: 1277, type: !167)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 10, scope: !374, file: !1, line: 1278, type: !167)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_pos2", arg: 11, scope: !374, file: !1, line: 1279, type: !32)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_pos4", arg: 12, scope: !374, file: !1, line: 1280, type: !32)
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 13, scope: !374, file: !1, line: 1281, type: !32)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 14, scope: !374, file: !1, line: 1282, type: !34)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_diff", scope: !374, file: !1, line: 1285, type: !393)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, align: 32, elements: !394)
!394 = !{!339, !339}
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !374, file: !1, line: 1285, type: !32)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !374, file: !1, line: 1285, type: !32)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !374, file: !1, line: 1285, type: !32)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !374, file: !1, line: 1286, type: !337)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !374, file: !1, line: 1286, type: !31)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !374, file: !1, line: 1287, type: !32)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_pos", scope: !374, file: !1, line: 1287, type: !32)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !374, file: !1, line: 1287, type: !32)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abort_search", scope: !374, file: !1, line: 1287, type: !32)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y0", scope: !374, file: !1, line: 1288, type: !32)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !374, file: !1, line: 1288, type: !32)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry0", scope: !374, file: !1, line: 1288, type: !32)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rx0", scope: !374, file: !1, line: 1288, type: !32)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry", scope: !374, file: !1, line: 1288, type: !32)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_mv_x", scope: !374, file: !1, line: 1289, type: !32)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_mv_y", scope: !374, file: !1, line: 1289, type: !32)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos_x4", scope: !374, file: !1, line: 1290, type: !32)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos_y4", scope: !374, file: !1, line: 1290, type: !32)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_line", scope: !374, file: !1, line: 1291, type: !88)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !374, file: !1, line: 1292, type: !152)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_picture", scope: !374, file: !1, line: 1293, type: !111)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !374, file: !1, line: 1294, type: !32)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_shift", scope: !374, file: !1, line: 1295, type: !32)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "check_position0", scope: !374, file: !1, line: 1296, type: !32)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x", scope: !374, file: !1, line: 1297, type: !32)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_y", scope: !374, file: !1, line: 1298, type: !32)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic4_pix_x", scope: !374, file: !1, line: 1299, type: !32)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic4_pix_y", scope: !374, file: !1, line: 1300, type: !32)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_pos2", scope: !374, file: !1, line: 1301, type: !32)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos2", scope: !374, file: !1, line: 1302, type: !32)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !374, file: !1, line: 1303, type: !32)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !374, file: !1, line: 1305, type: !32)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !374, file: !1, line: 1308, type: !32)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !374, file: !1, line: 1308, type: !32)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfpelhadamard", scope: !374, file: !1, line: 1310, type: !32)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qpelstart", scope: !374, file: !1, line: 1311, type: !32)
!431 = !DISubprogram(name: "FullPelBlockMotionBiPred", scope: !1, file: !1, line: 1537, type: !432, isLocal: false, isDefinition: true, scopeLine: 1555, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16**, i16, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i32, i32, double)* @FullPelBlockMotionBiPred, variables: !434)
!432 = !DISubroutineType(types: !433)
!433 = !{!32, !152, !74, !32, !32, !32, !32, !32, !74, !74, !74, !74, !167, !167, !167, !167, !32, !32, !34}
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 1, scope: !431, file: !1, line: 1537, type: !152)
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 2, scope: !431, file: !1, line: 1538, type: !74)
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !431, file: !1, line: 1539, type: !32)
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !431, file: !1, line: 1540, type: !32)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !431, file: !1, line: 1541, type: !32)
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !431, file: !1, line: 1542, type: !32)
!441 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iteration", arg: 7, scope: !431, file: !1, line: 1543, type: !32)
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x1", arg: 8, scope: !431, file: !1, line: 1544, type: !74)
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y1", arg: 9, scope: !431, file: !1, line: 1545, type: !74)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x2", arg: 10, scope: !431, file: !1, line: 1546, type: !74)
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y2", arg: 11, scope: !431, file: !1, line: 1547, type: !74)
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 12, scope: !431, file: !1, line: 1548, type: !167)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 13, scope: !431, file: !1, line: 1549, type: !167)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_mv_x", arg: 14, scope: !431, file: !1, line: 1550, type: !167)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_mv_y", arg: 15, scope: !431, file: !1, line: 1551, type: !167)
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_range", arg: 16, scope: !431, file: !1, line: 1552, type: !32)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 17, scope: !431, file: !1, line: 1553, type: !32)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 18, scope: !431, file: !1, line: 1554, type: !34)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !431, file: !1, line: 1556, type: !32)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_x", scope: !431, file: !1, line: 1556, type: !32)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_y", scope: !431, file: !1, line: 1556, type: !32)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !431, file: !1, line: 1556, type: !32)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x4", scope: !431, file: !1, line: 1556, type: !32)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !431, file: !1, line: 1556, type: !32)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_line", scope: !431, file: !1, line: 1558, type: !88)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref2_line", scope: !431, file: !1, line: 1558, type: !88)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref1_line", scope: !431, file: !1, line: 1558, type: !88)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_ref_line1", scope: !431, file: !1, line: 1559, type: !283)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_ref_line2", scope: !431, file: !1, line: 1560, type: !283)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !431, file: !1, line: 1562, type: !32)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref1_pic", scope: !431, file: !1, line: 1563, type: !88)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref2_pic", scope: !431, file: !1, line: 1564, type: !88)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !431, file: !1, line: 1565, type: !32)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !431, file: !1, line: 1566, type: !32)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_pos", scope: !431, file: !1, line: 1568, type: !32)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos", scope: !431, file: !1, line: 1569, type: !32)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !431, file: !1, line: 1570, type: !32)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_y", scope: !431, file: !1, line: 1571, type: !32)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x", scope: !431, file: !1, line: 1572, type: !32)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x4", scope: !431, file: !1, line: 1573, type: !32)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_x1", scope: !431, file: !1, line: 1574, type: !32)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_y1", scope: !431, file: !1, line: 1575, type: !32)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_x2", scope: !431, file: !1, line: 1576, type: !32)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_y2", scope: !431, file: !1, line: 1577, type: !32)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "center_x", scope: !431, file: !1, line: 1578, type: !74)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "center_y", scope: !431, file: !1, line: 1579, type: !74)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref1_center_x", scope: !431, file: !1, line: 1580, type: !74)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref1_center_y", scope: !431, file: !1, line: 1581, type: !74)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bi_diff", scope: !431, file: !1, line: 1584, type: !32)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !431, file: !1, line: 1585, type: !74)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weightSpic", scope: !431, file: !1, line: 1586, type: !74)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weightRpic", scope: !431, file: !1, line: 1587, type: !74)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetSpic", scope: !431, file: !1, line: 1588, type: !74)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetRpic", scope: !431, file: !1, line: 1589, type: !74)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weightedpel", scope: !431, file: !1, line: 1590, type: !74)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixel1", scope: !431, file: !1, line: 1590, type: !74)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixel2", scope: !431, file: !1, line: 1590, type: !74)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetBi", scope: !431, file: !1, line: 1591, type: !74)
!493 = !DISubprogram(name: "SubPelBlockSearchBiPred", scope: !1, file: !1, line: 1725, type: !494, isLocal: false, isDefinition: true, scopeLine: 1742, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16**, i16, i32, i32, i32, i32, i16, i16, i16*, i16*, i16*, i16*, i32, i32, i32, double)* @SubPelBlockSearchBiPred, variables: !496)
!494 = !DISubroutineType(types: !495)
!495 = !{!32, !152, !74, !32, !32, !32, !32, !74, !74, !167, !167, !167, !167, !32, !32, !32, !34}
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "orig_pic", arg: 1, scope: !493, file: !1, line: 1725, type: !152)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 2, scope: !493, file: !1, line: 1726, type: !74)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 3, scope: !493, file: !1, line: 1727, type: !32)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_x", arg: 4, scope: !493, file: !1, line: 1728, type: !32)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic_pix_y", arg: 5, scope: !493, file: !1, line: 1729, type: !32)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 6, scope: !493, file: !1, line: 1730, type: !32)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_x", arg: 7, scope: !493, file: !1, line: 1731, type: !74)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pred_mv_y", arg: 8, scope: !493, file: !1, line: 1732, type: !74)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_x", arg: 9, scope: !493, file: !1, line: 1733, type: !167)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv_y", arg: 10, scope: !493, file: !1, line: 1734, type: !167)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_mv_x", arg: 11, scope: !493, file: !1, line: 1735, type: !167)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s_mv_y", arg: 12, scope: !493, file: !1, line: 1736, type: !167)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_pos2", arg: 13, scope: !493, file: !1, line: 1737, type: !32)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_pos4", arg: 14, scope: !493, file: !1, line: 1738, type: !32)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_mcost", arg: 15, scope: !493, file: !1, line: 1739, type: !32)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 16, scope: !493, file: !1, line: 1740, type: !34)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_diff", scope: !493, file: !1, line: 1743, type: !393)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !493, file: !1, line: 1743, type: !32)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !493, file: !1, line: 1743, type: !32)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !493, file: !1, line: 1743, type: !32)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !493, file: !1, line: 1744, type: !337)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !493, file: !1, line: 1744, type: !31)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !493, file: !1, line: 1745, type: !74)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_pos", scope: !493, file: !1, line: 1745, type: !74)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !493, file: !1, line: 1745, type: !74)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abort_search", scope: !493, file: !1, line: 1745, type: !74)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y0", scope: !493, file: !1, line: 1746, type: !74)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x0", scope: !493, file: !1, line: 1746, type: !74)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry0", scope: !493, file: !1, line: 1746, type: !74)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rx0", scope: !493, file: !1, line: 1746, type: !74)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ry", scope: !493, file: !1, line: 1746, type: !74)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sy0", scope: !493, file: !1, line: 1747, type: !74)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sy", scope: !493, file: !1, line: 1747, type: !74)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sx0", scope: !493, file: !1, line: 1747, type: !74)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_mv_x", scope: !493, file: !1, line: 1748, type: !74)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cand_mv_y", scope: !493, file: !1, line: 1748, type: !74)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos_x4", scope: !493, file: !1, line: 1749, type: !74)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos_y4", scope: !493, file: !1, line: 1749, type: !74)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_line", scope: !493, file: !1, line: 1750, type: !88)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_picture", scope: !493, file: !1, line: 1752, type: !111)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_factor", scope: !493, file: !1, line: 1754, type: !32)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_shift", scope: !493, file: !1, line: 1755, type: !74)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_x", scope: !493, file: !1, line: 1756, type: !74)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocksize_y", scope: !493, file: !1, line: 1757, type: !74)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic4_pix_x", scope: !493, file: !1, line: 1758, type: !74)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic4_pix_y", scope: !493, file: !1, line: 1759, type: !74)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_pos2", scope: !493, file: !1, line: 1760, type: !74)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_pos2", scope: !493, file: !1, line: 1761, type: !74)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !493, file: !1, line: 1762, type: !74)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "apply_weights", scope: !493, file: !1, line: 1764, type: !74)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weightSpic", scope: !493, file: !1, line: 1765, type: !74)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weightRpic", scope: !493, file: !1, line: 1766, type: !74)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetSpic", scope: !493, file: !1, line: 1767, type: !74)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetRpic", scope: !493, file: !1, line: 1768, type: !74)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetBi", scope: !493, file: !1, line: 1770, type: !74)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weightedpel", scope: !493, file: !1, line: 1771, type: !32)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_width", scope: !493, file: !1, line: 1773, type: !32)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "img_height", scope: !493, file: !1, line: 1773, type: !32)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfpelhadamard", scope: !493, file: !1, line: 1775, type: !32)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qpelstart", scope: !493, file: !1, line: 1776, type: !32)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref1_pic", scope: !493, file: !1, line: 1778, type: !152)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref2_pic", scope: !493, file: !1, line: 1779, type: !152)
!559 = !DISubprogram(name: "BPredPartitionCost", scope: !1, file: !1, line: 2255, type: !560, isLocal: false, isDefinition: true, scopeLine: 2261, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i16, i16, i32, i32)* @BPredPartitionCost, variables: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{!32, !32, !32, !74, !74, !32, !32}
!562 = !{!563, !564, !565, !566, !567, !568, !569, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597}
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 1, scope: !559, file: !1, line: 2255, type: !32)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 2, scope: !559, file: !1, line: 2256, type: !32)
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref", arg: 3, scope: !559, file: !1, line: 2257, type: !74)
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref", arg: 4, scope: !559, file: !1, line: 2258, type: !74)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda_factor", arg: 5, scope: !559, file: !1, line: 2259, type: !32)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 6, scope: !559, file: !1, line: 2260, type: !32)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !559, file: !1, line: 2265, type: !570)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, align: 32, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 64)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_blk", scope: !559, file: !1, line: 2266, type: !393)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsx", scope: !559, file: !1, line: 2267, type: !32)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsy", scope: !559, file: !1, line: 2268, type: !32)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !559, file: !1, line: 2270, type: !32)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !559, file: !1, line: 2270, type: !32)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !559, file: !1, line: 2270, type: !32)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !559, file: !1, line: 2270, type: !32)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !559, file: !1, line: 2271, type: !32)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !559, file: !1, line: 2271, type: !32)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !559, file: !1, line: 2271, type: !32)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !559, file: !1, line: 2271, type: !32)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !559, file: !1, line: 2271, type: !32)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !559, file: !1, line: 2271, type: !32)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mvd_bits", scope: !559, file: !1, line: 2272, type: !32)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parttype", scope: !559, file: !1, line: 2273, type: !32)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_h0", scope: !559, file: !1, line: 2274, type: !32)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_v0", scope: !559, file: !1, line: 2275, type: !32)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_h", scope: !559, file: !1, line: 2276, type: !32)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_v", scope: !559, file: !1, line: 2277, type: !32)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bxx", scope: !559, file: !1, line: 2278, type: !32)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byy", scope: !559, file: !1, line: 2278, type: !32)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !559, file: !1, line: 2280, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_mv", scope: !559, file: !1, line: 2281, type: !595)
!598 = !DISubprogram(name: "BlockMotionSearch", scope: !1, file: !1, line: 2348, type: !599, isLocal: false, isDefinition: true, scopeLine: 2356, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16, i32, i32, i32, i32, i32, double)* @BlockMotionSearch, variables: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{!32, !74, !32, !32, !32, !32, !32, !34}
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !639, !640, !641, !642, !643, !648, !651, !652, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 1, scope: !598, file: !1, line: 2348, type: !74)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !598, file: !1, line: 2349, type: !32)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_x", arg: 3, scope: !598, file: !1, line: 2350, type: !32)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mb_y", arg: 4, scope: !598, file: !1, line: 2351, type: !32)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 5, scope: !598, file: !1, line: 2352, type: !32)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_range", arg: 6, scope: !598, file: !1, line: 2353, type: !32)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 7, scope: !598, file: !1, line: 2354, type: !34)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_x", scope: !598, file: !1, line: 2363, type: !74)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_y", scope: !598, file: !1, line: 2363, type: !74)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_x", scope: !598, file: !1, line: 2363, type: !74)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_y", scope: !598, file: !1, line: 2363, type: !74)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !598, file: !1, line: 2364, type: !32)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !598, file: !1, line: 2364, type: !32)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_value", scope: !598, file: !1, line: 2366, type: !32)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_mcost", scope: !598, file: !1, line: 2367, type: !32)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !598, file: !1, line: 2369, type: !32)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !598, file: !1, line: 2370, type: !32)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsx", scope: !598, file: !1, line: 2372, type: !32)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsy", scope: !598, file: !1, line: 2373, type: !32)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !598, file: !1, line: 2375, type: !32)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !598, file: !1, line: 2376, type: !32)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv", scope: !598, file: !1, line: 2378, type: !167)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_array", scope: !598, file: !1, line: 2380, type: !165)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !598, file: !1, line: 2381, type: !595)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstruct1", scope: !598, file: !1, line: 2387, type: !627)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeb", file: !628, line: 82, size: 128, align: 64, elements: !629)
!628 = !DIFile(filename: "/usr/include/sys/timeb.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!629 = !{!630, !636, !637, !638}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !627, file: !628, line: 83, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !632, line: 30, baseType: !633)
!632 = !DIFile(filename: "/usr/include/sys/_types/_time_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !634, line: 120, baseType: !635)
!634 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!635 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "millitm", scope: !627, file: !628, line: 84, baseType: !84, size: 16, align: 16, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "timezone", scope: !627, file: !628, line: 85, baseType: !74, size: 16, align: 16, offset: 80)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dstflag", scope: !627, file: !628, line: 86, baseType: !74, size: 16, align: 16, offset: 96)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstruct2", scope: !598, file: !1, line: 2388, type: !627)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "me_tmp_time", scope: !598, file: !1, line: 2391, type: !32)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N_Bframe", scope: !598, file: !1, line: 2393, type: !32)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_Bframe", scope: !598, file: !1, line: 2393, type: !32)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !644, file: !1, line: 2682, type: !32)
!644 = distinct !DILexicalBlock(scope: !645, file: !1, line: 2681, column: 5)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 2680, column: 9)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 2678, column: 3)
!647 = distinct !DILexicalBlock(scope: !598, file: !1, line: 2677, column: 7)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h4x4blkno", scope: !649, file: !1, line: 2704, type: !32)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 2703, column: 3)
!650 = distinct !DILexicalBlock(scope: !598, file: !1, line: 2702, column: 6)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v4x4blkno", scope: !649, file: !1, line: 2705, type: !32)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !653, file: !1, line: 2732, type: !595)
!653 = distinct !DILexicalBlock(scope: !654, file: !1, line: 2730, column: 3)
!654 = distinct !DILexicalBlock(scope: !598, file: !1, line: 2729, column: 7)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_mcostbi", scope: !653, file: !1, line: 2733, type: !32)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bimv_x", scope: !653, file: !1, line: 2734, type: !74)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bimv_y", scope: !653, file: !1, line: 2734, type: !74)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tempmv_x", scope: !653, file: !1, line: 2734, type: !74)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tempmv_y", scope: !653, file: !1, line: 2734, type: !74)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_x1", scope: !653, file: !1, line: 2735, type: !74)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_y1", scope: !653, file: !1, line: 2735, type: !74)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_x2", scope: !653, file: !1, line: 2736, type: !74)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_y2", scope: !653, file: !1, line: 2736, type: !74)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterlist", scope: !653, file: !1, line: 2737, type: !74)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv_bi", scope: !653, file: !1, line: 2738, type: !79)
!666 = !DISubprogram(name: "BIDPartitionCost", scope: !1, file: !1, line: 2872, type: !667, isLocal: false, isDefinition: true, scopeLine: 2877, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i16, i16, i32)* @BIDPartitionCost, variables: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{!32, !32, !32, !74, !74, !32}
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 1, scope: !666, file: !1, line: 2872, type: !32)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 2, scope: !666, file: !1, line: 2873, type: !32)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref", arg: 3, scope: !666, file: !1, line: 2874, type: !74)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref", arg: 4, scope: !666, file: !1, line: 2875, type: !74)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda_factor", arg: 5, scope: !666, file: !1, line: 2876, type: !32)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !666, file: !1, line: 2882, type: !570)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_blk", scope: !666, file: !1, line: 2883, type: !393)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsx", scope: !666, file: !1, line: 2884, type: !32)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bsy", scope: !666, file: !1, line: 2885, type: !32)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !666, file: !1, line: 2887, type: !32)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !666, file: !1, line: 2887, type: !32)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !666, file: !1, line: 2887, type: !32)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !666, file: !1, line: 2887, type: !32)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !666, file: !1, line: 2888, type: !32)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !666, file: !1, line: 2888, type: !32)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !666, file: !1, line: 2888, type: !32)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !666, file: !1, line: 2888, type: !32)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !666, file: !1, line: 2888, type: !32)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !666, file: !1, line: 2888, type: !32)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mvd_bits", scope: !666, file: !1, line: 2889, type: !32)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parttype", scope: !666, file: !1, line: 2890, type: !32)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_h0", scope: !666, file: !1, line: 2891, type: !32)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_v0", scope: !666, file: !1, line: 2892, type: !32)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_h", scope: !666, file: !1, line: 2893, type: !32)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_v", scope: !666, file: !1, line: 2894, type: !32)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bxx", scope: !666, file: !1, line: 2895, type: !32)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byy", scope: !666, file: !1, line: 2895, type: !32)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !666, file: !1, line: 2897, type: !595)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_mv", scope: !666, file: !1, line: 2898, type: !595)
!699 = !DISubprogram(name: "GetSkipCostMB", scope: !1, file: !1, line: 2957, type: !700, isLocal: false, isDefinition: true, scopeLine: 2958, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @GetSkipCostMB, variables: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{!32, !34}
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 1, scope: !699, file: !1, line: 2957, type: !34)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !699, file: !1, line: 2959, type: !32)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !699, file: !1, line: 2959, type: !32)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !699, file: !1, line: 2959, type: !32)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !699, file: !1, line: 2959, type: !32)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !699, file: !1, line: 2959, type: !32)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !699, file: !1, line: 2959, type: !32)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !699, file: !1, line: 2959, type: !32)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !699, file: !1, line: 2960, type: !337)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !699, file: !1, line: 2961, type: !32)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_diff", scope: !699, file: !1, line: 2964, type: !350)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff8x8", scope: !699, file: !1, line: 2964, type: !570)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !699, file: !1, line: 2965, type: !32)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !699, file: !1, line: 2965, type: !32)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !699, file: !1, line: 2966, type: !32)
!718 = !DISubprogram(name: "FindSkipModeMotionVector", scope: !1, file: !1, line: 3015, type: !38, isLocal: false, isDefinition: true, scopeLine: 3016, isOptimized: true, function: void ()* @FindSkipModeMotionVector, variables: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx", scope: !718, file: !1, line: 3017, type: !32)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by", scope: !718, file: !1, line: 3017, type: !32)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !718, file: !1, line: 3018, type: !595)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmv", scope: !718, file: !1, line: 3020, type: !79)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zeroMotionAbove", scope: !718, file: !1, line: 3022, type: !32)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zeroMotionLeft", scope: !718, file: !1, line: 3023, type: !32)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_a", scope: !718, file: !1, line: 3024, type: !221)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_b", scope: !718, file: !1, line: 3024, type: !221)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a_mv_y", scope: !718, file: !1, line: 3025, type: !32)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a_ref_idx", scope: !718, file: !1, line: 3026, type: !32)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b_mv_y", scope: !718, file: !1, line: 3027, type: !32)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b_ref_idx", scope: !718, file: !1, line: 3028, type: !32)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !718, file: !1, line: 3030, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !4, line: 406, baseType: !735)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !4, line: 351, size: 5056, align: 64, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !745, !747, !748, !749, !753, !754, !755, !756, !757, !760, !761, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !735, file: !4, line: 353, baseType: !32, size: 32, align: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !735, file: !4, line: 354, baseType: !32, size: 32, align: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !735, file: !4, line: 355, baseType: !32, size: 32, align: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !735, file: !4, line: 356, baseType: !32, size: 32, align: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !735, file: !4, line: 357, baseType: !32, size: 32, align: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !735, file: !4, line: 358, baseType: !743, size: 256, align: 32, offset: 160)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, align: 32, elements: !744)
!744 = !{!352}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !735, file: !4, line: 360, baseType: !746, size: 64, align: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !735, file: !4, line: 361, baseType: !746, size: 64, align: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !735, file: !4, line: 363, baseType: !32, size: 32, align: 32, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !735, file: !4, line: 364, baseType: !750, size: 2048, align: 32, offset: 608)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, align: 32, elements: !751)
!751 = !{!81, !752, !752, !81}
!752 = !DISubrange(count: 4)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !735, file: !4, line: 365, baseType: !337, size: 512, align: 32, offset: 2656)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !735, file: !4, line: 366, baseType: !337, size: 512, align: 32, offset: 3168)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !735, file: !4, line: 367, baseType: !32, size: 32, align: 32, offset: 3680)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !735, file: !4, line: 368, baseType: !125, size: 64, align: 64, offset: 3712)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !735, file: !4, line: 369, baseType: !758, size: 128, align: 32, offset: 3776)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, align: 32, elements: !759)
!759 = !{!752}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !735, file: !4, line: 370, baseType: !758, size: 128, align: 32, offset: 3904)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !735, file: !4, line: 371, baseType: !762, size: 64, align: 64, offset: 4032)
!762 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !735, file: !4, line: 373, baseType: !32, size: 32, align: 32, offset: 4096)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !735, file: !4, line: 374, baseType: !32, size: 32, align: 32, offset: 4128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !735, file: !4, line: 375, baseType: !32, size: 32, align: 32, offset: 4160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !735, file: !4, line: 377, baseType: !32, size: 32, align: 32, offset: 4192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !735, file: !4, line: 378, baseType: !32, size: 32, align: 32, offset: 4224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !735, file: !4, line: 380, baseType: !32, size: 32, align: 32, offset: 4256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !735, file: !4, line: 382, baseType: !32, size: 32, align: 32, offset: 4288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !735, file: !4, line: 382, baseType: !32, size: 32, align: 32, offset: 4320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !735, file: !4, line: 382, baseType: !32, size: 32, align: 32, offset: 4352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !735, file: !4, line: 382, baseType: !32, size: 32, align: 32, offset: 4384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !735, file: !4, line: 383, baseType: !32, size: 32, align: 32, offset: 4416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !735, file: !4, line: 383, baseType: !32, size: 32, align: 32, offset: 4448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !735, file: !4, line: 383, baseType: !32, size: 32, align: 32, offset: 4480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !735, file: !4, line: 383, baseType: !32, size: 32, align: 32, offset: 4512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !735, file: !4, line: 385, baseType: !32, size: 32, align: 32, offset: 4544)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !735, file: !4, line: 386, baseType: !32, size: 32, align: 32, offset: 4576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !735, file: !4, line: 387, baseType: !32, size: 32, align: 32, offset: 4608)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !735, file: !4, line: 390, baseType: !32, size: 32, align: 32, offset: 4640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !735, file: !4, line: 394, baseType: !34, size: 64, align: 64, offset: 4672)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !735, file: !4, line: 395, baseType: !32, size: 32, align: 32, offset: 4736)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !735, file: !4, line: 396, baseType: !32, size: 32, align: 32, offset: 4768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !735, file: !4, line: 397, baseType: !32, size: 32, align: 32, offset: 4800)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !735, file: !4, line: 398, baseType: !32, size: 32, align: 32, offset: 4832)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !735, file: !4, line: 399, baseType: !32, size: 32, align: 32, offset: 4864)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !735, file: !4, line: 401, baseType: !32, size: 32, align: 32, offset: 4896)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !735, file: !4, line: 402, baseType: !32, size: 32, align: 32, offset: 4928)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !735, file: !4, line: 403, baseType: !32, size: 32, align: 32, offset: 4960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !735, file: !4, line: 405, baseType: !32, size: 32, align: 32, offset: 4992)
!791 = !DISubprogram(name: "Get_Direct_Cost8x8", scope: !1, file: !1, line: 3099, type: !792, isLocal: false, isDefinition: true, scopeLine: 3100, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*)* @Get_Direct_Cost8x8, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!32, !32, !31}
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 1, scope: !791, file: !1, line: 3099, type: !32)
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cost8x8", arg: 2, scope: !791, file: !1, line: 3099, type: !31)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !791, file: !1, line: 3101, type: !32)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !791, file: !1, line: 3101, type: !32)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !791, file: !1, line: 3101, type: !32)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !791, file: !1, line: 3101, type: !32)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !791, file: !1, line: 3101, type: !32)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !791, file: !1, line: 3101, type: !32)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !791, file: !1, line: 3101, type: !32)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_diff", scope: !791, file: !1, line: 3102, type: !350)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff8x8", scope: !791, file: !1, line: 3102, type: !570)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !791, file: !1, line: 3103, type: !337)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !791, file: !1, line: 3104, type: !32)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !791, file: !1, line: 3105, type: !32)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !791, file: !1, line: 3106, type: !32)
!810 = !DISubprogram(name: "Get_Direct_CostMB", scope: !1, file: !1, line: 3161, type: !700, isLocal: false, isDefinition: true, scopeLine: 3162, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @Get_Direct_CostMB, variables: !811)
!811 = !{!812, !813, !814, !815}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 1, scope: !810, file: !1, line: 3161, type: !34)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !810, file: !1, line: 3163, type: !32)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !810, file: !1, line: 3164, type: !32)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8", scope: !810, file: !1, line: 3165, type: !32)
!816 = !DISubprogram(name: "PartitionMotionSearch", scope: !1, file: !1, line: 3205, type: !817, isLocal: false, isDefinition: true, scopeLine: 3208, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, double)* @PartitionMotionSearch, variables: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !32, !32, !34}
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "blocktype", arg: 1, scope: !816, file: !1, line: 3205, type: !32)
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 2, scope: !816, file: !1, line: 3206, type: !32)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 3, scope: !816, file: !1, line: 3207, type: !34)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_array", scope: !816, file: !1, line: 3212, type: !166)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_array", scope: !816, file: !1, line: 3212, type: !165)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !816, file: !1, line: 3213, type: !74)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !816, file: !1, line: 3214, type: !32)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !816, file: !1, line: 3214, type: !32)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !816, file: !1, line: 3214, type: !32)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_range", scope: !816, file: !1, line: 3214, type: !32)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !816, file: !1, line: 3214, type: !32)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !816, file: !1, line: 3214, type: !32)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_x", scope: !816, file: !1, line: 3215, type: !32)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_y", scope: !816, file: !1, line: 3215, type: !32)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bslice", scope: !816, file: !1, line: 3216, type: !32)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parttype", scope: !816, file: !1, line: 3217, type: !32)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_h0", scope: !816, file: !1, line: 3218, type: !32)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_v0", scope: !816, file: !1, line: 3219, type: !32)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_h", scope: !816, file: !1, line: 3220, type: !32)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step_v", scope: !816, file: !1, line: 3221, type: !32)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !816, file: !1, line: 3222, type: !32)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numlists", scope: !816, file: !1, line: 3223, type: !32)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !816, file: !1, line: 3224, type: !32)
!843 = !DISubprogram(name: "Get_Direct_Motion_Vectors", scope: !1, file: !1, line: 3299, type: !38, isLocal: false, isDefinition: true, scopeLine: 3300, isOptimized: true, function: void ()* @Get_Direct_Motion_Vectors, variables: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !884, !885, !886, !889}
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !843, file: !1, line: 3302, type: !32)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !843, file: !1, line: 3302, type: !32)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_x", scope: !843, file: !1, line: 3302, type: !32)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_y", scope: !843, file: !1, line: 3302, type: !32)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opic_block_x", scope: !843, file: !1, line: 3302, type: !32)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opic_block_y", scope: !843, file: !1, line: 3302, type: !32)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mvs", scope: !843, file: !1, line: 3303, type: !595)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv_scale", scope: !843, file: !1, line: 3304, type: !32)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moving_block", scope: !843, file: !1, line: 3305, type: !176)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co_located_mv", scope: !843, file: !1, line: 3306, type: !174)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co_located_ref_idx", scope: !843, file: !1, line: 3307, type: !165)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co_located_ref_id", scope: !843, file: !1, line: 3308, type: !169)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !843, file: !1, line: 3309, type: !733)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_rFrameL", scope: !859, file: !1, line: 3339, type: !74)
!859 = distinct !DILexicalBlock(scope: !860, file: !1, line: 3337, column: 3)
!860 = distinct !DILexicalBlock(scope: !843, file: !1, line: 3336, column: 7)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_rFrameU", scope: !859, file: !1, line: 3339, type: !74)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_rFrameUL", scope: !859, file: !1, line: 3339, type: !74)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_rFrameUR", scope: !859, file: !1, line: 3339, type: !74)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_rFrameL", scope: !859, file: !1, line: 3340, type: !74)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_rFrameU", scope: !859, file: !1, line: 3340, type: !74)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_rFrameUL", scope: !859, file: !1, line: 3340, type: !74)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_rFrameUR", scope: !859, file: !1, line: 3340, type: !74)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_rFrame", scope: !859, file: !1, line: 3341, type: !74)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_rFrame", scope: !859, file: !1, line: 3341, type: !74)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmvfw", scope: !859, file: !1, line: 3342, type: !79)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmvbw", scope: !859, file: !1, line: 3342, type: !79)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_left", scope: !859, file: !1, line: 3344, type: !221)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_up", scope: !859, file: !1, line: 3344, type: !221)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_upleft", scope: !859, file: !1, line: 3344, type: !221)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_upright", scope: !859, file: !1, line: 3344, type: !221)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refList", scope: !877, file: !1, line: 3540, type: !32)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 3539, column: 7)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 3538, column: 7)
!879 = distinct !DILexicalBlock(scope: !880, file: !1, line: 3538, column: 7)
!880 = distinct !DILexicalBlock(scope: !881, file: !1, line: 3534, column: 5)
!881 = distinct !DILexicalBlock(scope: !882, file: !1, line: 3533, column: 5)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 3533, column: 5)
!883 = distinct !DILexicalBlock(scope: !860, file: !1, line: 3531, column: 3)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_idx", scope: !877, file: !1, line: 3541, type: !32)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !877, file: !1, line: 3543, type: !32)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapped_idx", scope: !887, file: !1, line: 3565, type: !32)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 3564, column: 9)
!888 = distinct !DILexicalBlock(scope: !877, file: !1, line: 3552, column: 13)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iref", scope: !887, file: !1, line: 3566, type: !32)
!890 = !DISubprogram(name: "sign", scope: !1, file: !1, line: 3626, type: !891, isLocal: false, isDefinition: true, scopeLine: 3627, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @sign, variables: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{!32, !32, !32}
!893 = !{!894, !895, !896}
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !890, file: !1, line: 3626, type: !32)
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !890, file: !1, line: 3626, type: !32)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !890, file: !1, line: 3628, type: !32)
