; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }
%struct.Slice = type { i32, i32, i32, i32, i32, i32, %struct.datapartition*, %struct.MotionInfoContexts*, %struct.TextureInfoContexts*, %struct.RMPNIbuffer_s*, i32, i32*, i32*, i32*, i32, i32*, i32*, i32*, i32 (i32)*, [3 x [2 x i32]] }
%struct.datapartition = type { %struct.Bitstream*, %struct.EncodingEnvironment, i32 (%struct.syntaxelement*, %struct.datapartition*)* }
%struct.Bitstream = type { i32, i32, i8, i32, i32, i8, i8, i32, i32, i8*, i32 }
%struct.EncodingEnvironment = type { i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.syntaxelement = type { i32, i32, i32, i32, i32, i32, i32, i32, void (i32, i32, i32*, i32*)*, void (%struct.syntaxelement*, %struct.EncodingEnvironment*)* }
%struct.MotionInfoContexts = type { [3 x [11 x %struct.BiContextType]], [2 x [9 x %struct.BiContextType]], [2 x [10 x %struct.BiContextType]], [2 x [6 x %struct.BiContextType]], [4 x %struct.BiContextType], [4 x %struct.BiContextType], [3 x %struct.BiContextType] }
%struct.BiContextType = type { i16, i8, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !10, globals: !43, imports: !583)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !{!11}
!11 = !DISubprogram(name: "RBSPtoNALU", scope: !1, file: !1, line: 52, type: !12, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.NALU_t*, i32, i32, i32, i32, i32)* @RBSPtoNALU, variables: !34)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15, !17, !14, !14, !14, !14, !14}
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALU_t", file: !19, line: 49, baseType: !20)
!19 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalucommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 40, size: 256, align: 64, elements: !21)
!21 = !{!22, !23, !25, !26, !27, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "startcodeprefix_len", scope: !20, file: !19, line: 42, baseType: !14, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !20, file: !19, line: 43, baseType: !24, size: 32, align: 32, offset: 32)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !20, file: !19, line: 44, baseType: !24, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !20, file: !19, line: 45, baseType: !14, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !20, file: !19, line: 46, baseType: !14, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_bit", scope: !20, file: !19, line: 47, baseType: !14, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !20, file: !19, line: 48, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !32, line: 30, baseType: !33)
!32 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rbsp", arg: 1, scope: !11, file: !1, line: 52, type: !15)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nalu", arg: 2, scope: !11, file: !1, line: 52, type: !17)
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rbsp_size", arg: 3, scope: !11, file: !1, line: 52, type: !14)
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nal_unit_type", arg: 4, scope: !11, file: !1, line: 52, type: !14)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nal_reference_idc", arg: 5, scope: !11, file: !1, line: 52, type: !14)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_num_bytes", arg: 6, scope: !11, file: !1, line: 53, type: !14)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "UseAnnexbLongStartcode", arg: 7, scope: !11, file: !1, line: 53, type: !14)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !11, file: !1, line: 55, type: !14)
!43 = !{!44, !236, !237, !238, !239, !240, !243, !245, !247, !248, !249, !250, !251, !290, !385, !386, !387, !389, !390, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !409, !410, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !429, !430, !431, !432, !433, !434, !437, !440, !441, !442, !443, !446, !449, !460, !502, !503, !504, !505, !506, !562, !563, !564, !565, !566, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!44 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !45, line: 558, type: !46, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!45 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !45, line: 484, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 475, size: 6592, align: 64, elements: !49)
!49 = !{!50, !51, !52, !231, !232, !234, !235}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !48, file: !45, line: 477, baseType: !14, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !48, file: !45, line: 478, baseType: !14, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !48, file: !45, line: 479, baseType: !53, size: 6400, align: 64, offset: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 6400, align: 64, elements: !229)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !45, line: 471, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 443, size: 1216, align: 64, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !138, !177, !204, !213, !214, !215, !216, !217, !218, !219, !220, !221, !226}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !56, file: !45, line: 445, baseType: !14, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !56, file: !45, line: 446, baseType: !14, size: 32, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !56, file: !45, line: 447, baseType: !14, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !56, file: !45, line: 448, baseType: !14, size: 32, align: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !56, file: !45, line: 449, baseType: !14, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !56, file: !45, line: 450, baseType: !14, size: 32, align: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !56, file: !45, line: 451, baseType: !65, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !45, line: 440, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !45, line: 430, size: 960, align: 64, elements: !68)
!68 = !{!69, !85, !110}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !67, file: !45, line: 433, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !45, line: 427, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 411, size: 384, align: 64, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !72, file: !45, line: 413, baseType: !14, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !72, file: !45, line: 414, baseType: !14, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !72, file: !45, line: 415, baseType: !31, size: 8, align: 8, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !72, file: !45, line: 416, baseType: !14, size: 32, align: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !72, file: !45, line: 417, baseType: !14, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !72, file: !45, line: 418, baseType: !31, size: 8, align: 8, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !72, file: !45, line: 420, baseType: !31, size: 8, align: 8, offset: 168)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !72, file: !45, line: 421, baseType: !14, size: 32, align: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !72, file: !45, line: 422, baseType: !14, size: 32, align: 32, offset: 224)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !72, file: !45, line: 424, baseType: !30, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !72, file: !45, line: 425, baseType: !14, size: 32, align: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !67, file: !45, line: 434, baseType: !86, size: 832, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !45, line: 226, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 207, size: 832, align: 64, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !87, file: !45, line: 209, baseType: !24, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !87, file: !45, line: 209, baseType: !24, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !87, file: !45, line: 210, baseType: !24, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !87, file: !45, line: 211, baseType: !24, size: 32, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !87, file: !45, line: 212, baseType: !24, size: 32, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !87, file: !45, line: 213, baseType: !30, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !87, file: !45, line: 214, baseType: !96, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !87, file: !45, line: 217, baseType: !24, size: 32, align: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !87, file: !45, line: 217, baseType: !24, size: 32, align: 32, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !87, file: !45, line: 218, baseType: !24, size: 32, align: 32, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !87, file: !45, line: 219, baseType: !24, size: 32, align: 32, offset: 416)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !87, file: !45, line: 220, baseType: !24, size: 32, align: 32, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !87, file: !45, line: 221, baseType: !30, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !87, file: !45, line: 222, baseType: !96, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !87, file: !45, line: 223, baseType: !14, size: 32, align: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !87, file: !45, line: 223, baseType: !14, size: 32, align: 32, offset: 672)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !87, file: !45, line: 224, baseType: !14, size: 32, align: 32, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !87, file: !45, line: 224, baseType: !14, size: 32, align: 32, offset: 736)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !87, file: !45, line: 225, baseType: !14, size: 32, align: 32, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !87, file: !45, line: 225, baseType: !14, size: 32, align: 32, offset: 800)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !67, file: !45, line: 436, baseType: !111, size: 64, align: 64, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!14, !114, !137}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !45, line: 348, baseType: !116)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !45, line: 327, size: 384, align: 64, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !130}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !45, line: 329, baseType: !14, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !116, file: !45, line: 330, baseType: !14, size: 32, align: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !116, file: !45, line: 331, baseType: !14, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !116, file: !45, line: 332, baseType: !14, size: 32, align: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !116, file: !45, line: 333, baseType: !14, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !116, file: !45, line: 334, baseType: !24, size: 32, align: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !116, file: !45, line: 335, baseType: !14, size: 32, align: 32, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !116, file: !45, line: 336, baseType: !14, size: 32, align: 32, offset: 224)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !116, file: !45, line: 344, baseType: !127, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !14, !14, !96, !96}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !116, file: !45, line: 346, baseType: !131, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !135}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !45, line: 228, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !56, file: !45, line: 452, baseType: !139, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !45, line: 268, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 258, size: 12032, align: 64, elements: !142)
!142 = !{!143, !156, !161, !165, !169, !173, !174}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !141, file: !45, line: 260, baseType: !144, size: 4224, align: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 4224, align: 64, elements: !153)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !45, line: 238, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 231, size: 128, align: 64, elements: !147)
!147 = !{!148, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !146, file: !45, line: 233, baseType: !149, size: 16, align: 16)
!149 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !146, file: !45, line: 234, baseType: !33, size: 8, align: 8, offset: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !146, file: !45, line: 236, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!153 = !{!154, !155}
!154 = !DISubrange(count: 3)
!155 = !DISubrange(count: 11)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !141, file: !45, line: 261, baseType: !157, size: 2304, align: 64, offset: 4224)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 2304, align: 64, elements: !158)
!158 = !{!159, !160}
!159 = !DISubrange(count: 2)
!160 = !DISubrange(count: 9)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !141, file: !45, line: 262, baseType: !162, size: 2560, align: 64, offset: 6528)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 2560, align: 64, elements: !163)
!163 = !{!159, !164}
!164 = !DISubrange(count: 10)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !141, file: !45, line: 263, baseType: !166, size: 1536, align: 64, offset: 9088)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1536, align: 64, elements: !167)
!167 = !{!159, !168}
!168 = !DISubrange(count: 6)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !141, file: !45, line: 264, baseType: !170, size: 512, align: 64, offset: 10624)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 512, align: 64, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 4)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !141, file: !45, line: 265, baseType: !170, size: 512, align: 64, offset: 11136)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !141, file: !45, line: 266, baseType: !175, size: 384, align: 64, offset: 11648)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 384, align: 64, elements: !176)
!176 = !{!154}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !56, file: !45, line: 453, baseType: !178, size: 64, align: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !45, line: 293, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 281, size: 97024, align: 64, elements: !181)
!181 = !{!182, !185, !186, !189, !192, !196, !197, !201, !202, !203}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !180, file: !45, line: 283, baseType: !183, size: 256, align: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 256, align: 64, elements: !184)
!184 = !{!159}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !180, file: !45, line: 284, baseType: !170, size: 512, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !180, file: !45, line: 285, baseType: !187, size: 1536, align: 64, offset: 768)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1536, align: 64, elements: !188)
!188 = !{!154, !172}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !180, file: !45, line: 286, baseType: !190, size: 5120, align: 64, offset: 2304)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 5120, align: 64, elements: !191)
!191 = !{!164, !172}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !180, file: !45, line: 287, baseType: !193, size: 19200, align: 64, offset: 7424)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 19200, align: 64, elements: !194)
!194 = !{!164, !195}
!195 = !DISubrange(count: 15)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !180, file: !45, line: 288, baseType: !193, size: 19200, align: 64, offset: 26624)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !180, file: !45, line: 289, baseType: !198, size: 6400, align: 64, offset: 45824)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 6400, align: 64, elements: !199)
!199 = !{!164, !200}
!200 = !DISubrange(count: 5)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !180, file: !45, line: 290, baseType: !198, size: 6400, align: 64, offset: 52224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !180, file: !45, line: 291, baseType: !193, size: 19200, align: 64, offset: 58624)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !180, file: !45, line: 292, baseType: !193, size: 19200, align: 64, offset: 77824)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !56, file: !45, line: 456, baseType: !205, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !45, line: 313, baseType: !207)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !45, line: 308, size: 128, align: 64, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !207, file: !45, line: 310, baseType: !14, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !207, file: !45, line: 311, baseType: !14, size: 32, align: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !207, file: !45, line: 312, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !56, file: !45, line: 458, baseType: !14, size: 32, align: 32, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !56, file: !45, line: 459, baseType: !96, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !56, file: !45, line: 460, baseType: !96, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !56, file: !45, line: 461, baseType: !96, size: 64, align: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !56, file: !45, line: 462, baseType: !14, size: 32, align: 32, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !56, file: !45, line: 463, baseType: !96, size: 64, align: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !56, file: !45, line: 464, baseType: !96, size: 64, align: 64, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !56, file: !45, line: 465, baseType: !96, size: 64, align: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !56, file: !45, line: 467, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !14}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !56, file: !45, line: 469, baseType: !227, size: 192, align: 32, offset: 1024)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 192, align: 32, elements: !228)
!228 = !{!154, !159}
!229 = !{!230}
!230 = !DISubrange(count: 100)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !48, file: !45, line: 480, baseType: !14, size: 32, align: 32, offset: 6464)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !48, file: !45, line: 481, baseType: !233, size: 32, align: 32, offset: 6496)
!233 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !48, file: !45, line: 482, baseType: !233, size: 32, align: 32, offset: 6528)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !48, file: !45, line: 483, baseType: !233, size: 32, align: 32, offset: 6560)
!236 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !45, line: 559, type: !46, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!237 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !45, line: 560, type: !46, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!238 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !45, line: 561, type: !46, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!239 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !45, line: 562, type: !46, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!240 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !45, line: 565, type: !241, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!243 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !45, line: 566, type: !244, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!245 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !45, line: 567, type: !246, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!247 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !45, line: 569, type: !24, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!248 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !45, line: 570, type: !24, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!249 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !45, line: 572, type: !14, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!250 = !DIGlobalVariable(name: "me_time", scope: !0, file: !45, line: 572, type: !14, isLocal: false, isDefinition: true, variable: i32* @me_time)
!251 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !45, line: 573, type: !252, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !266, !267, !268, !269, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !254, file: !4, line: 105, baseType: !225, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !254, file: !4, line: 106, baseType: !24, size: 32, align: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !254, file: !4, line: 107, baseType: !24, size: 32, align: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !254, file: !4, line: 108, baseType: !225, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !254, file: !4, line: 110, baseType: !225, size: 32, align: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !254, file: !4, line: 111, baseType: !225, size: 32, align: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !254, file: !4, line: 112, baseType: !263, size: 256, align: 32, offset: 192)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 32, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !254, file: !4, line: 115, baseType: !225, size: 32, align: 32, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !254, file: !4, line: 116, baseType: !24, size: 32, align: 32, offset: 480)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !254, file: !4, line: 117, baseType: !24, size: 32, align: 32, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !254, file: !4, line: 119, baseType: !270, size: 256, align: 32, offset: 544)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 32, elements: !264)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !254, file: !4, line: 121, baseType: !270, size: 256, align: 32, offset: 800)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !254, file: !4, line: 122, baseType: !270, size: 256, align: 32, offset: 1056)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !254, file: !4, line: 124, baseType: !225, size: 32, align: 32, offset: 1312)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !254, file: !4, line: 125, baseType: !24, size: 32, align: 32, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !254, file: !4, line: 127, baseType: !24, size: 32, align: 32, offset: 1376)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !254, file: !4, line: 128, baseType: !30, size: 64, align: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !254, file: !4, line: 130, baseType: !14, size: 32, align: 32, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !254, file: !4, line: 131, baseType: !14, size: 32, align: 32, offset: 1504)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !254, file: !4, line: 132, baseType: !225, size: 32, align: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !254, file: !4, line: 133, baseType: !24, size: 32, align: 32, offset: 1568)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !254, file: !4, line: 134, baseType: !14, size: 32, align: 32, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !254, file: !4, line: 135, baseType: !14, size: 32, align: 32, offset: 1632)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !254, file: !4, line: 136, baseType: !14, size: 32, align: 32, offset: 1664)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !254, file: !4, line: 138, baseType: !14, size: 32, align: 32, offset: 1696)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !254, file: !4, line: 139, baseType: !14, size: 32, align: 32, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !254, file: !4, line: 141, baseType: !225, size: 32, align: 32, offset: 1760)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !254, file: !4, line: 142, baseType: !225, size: 32, align: 32, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !254, file: !4, line: 143, baseType: !225, size: 32, align: 32, offset: 1824)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !254, file: !4, line: 144, baseType: !225, size: 32, align: 32, offset: 1856)
!290 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !45, line: 574, type: !291, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !293, file: !4, line: 151, baseType: !225, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !293, file: !4, line: 153, baseType: !24, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !293, file: !4, line: 154, baseType: !225, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !293, file: !4, line: 155, baseType: !225, size: 32, align: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !293, file: !4, line: 156, baseType: !225, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !293, file: !4, line: 157, baseType: !225, size: 32, align: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !293, file: !4, line: 158, baseType: !24, size: 32, align: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !293, file: !4, line: 159, baseType: !24, size: 32, align: 32, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !293, file: !4, line: 160, baseType: !24, size: 32, align: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !293, file: !4, line: 162, baseType: !225, size: 32, align: 32, offset: 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !293, file: !4, line: 163, baseType: !263, size: 256, align: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !293, file: !4, line: 165, baseType: !24, size: 32, align: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !293, file: !4, line: 166, baseType: !24, size: 32, align: 32, offset: 608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !293, file: !4, line: 167, baseType: !24, size: 32, align: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !293, file: !4, line: 168, baseType: !24, size: 32, align: 32, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !293, file: !4, line: 170, baseType: !24, size: 32, align: 32, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !293, file: !4, line: 172, baseType: !225, size: 32, align: 32, offset: 736)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !293, file: !4, line: 173, baseType: !14, size: 32, align: 32, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !293, file: !4, line: 174, baseType: !14, size: 32, align: 32, offset: 800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !293, file: !4, line: 175, baseType: !24, size: 32, align: 32, offset: 832)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !293, file: !4, line: 177, baseType: !316, size: 8192, align: 32, offset: 864)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, align: 32, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !293, file: !4, line: 178, baseType: !24, size: 32, align: 32, offset: 9056)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !293, file: !4, line: 179, baseType: !225, size: 32, align: 32, offset: 9088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !293, file: !4, line: 180, baseType: !24, size: 32, align: 32, offset: 9120)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !293, file: !4, line: 181, baseType: !24, size: 32, align: 32, offset: 9152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !293, file: !4, line: 182, baseType: !225, size: 32, align: 32, offset: 9184)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !293, file: !4, line: 184, baseType: !225, size: 32, align: 32, offset: 9216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !293, file: !4, line: 185, baseType: !225, size: 32, align: 32, offset: 9248)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !293, file: !4, line: 186, baseType: !225, size: 32, align: 32, offset: 9280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !293, file: !4, line: 187, baseType: !24, size: 32, align: 32, offset: 9312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !293, file: !4, line: 188, baseType: !24, size: 32, align: 32, offset: 9344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !293, file: !4, line: 189, baseType: !24, size: 32, align: 32, offset: 9376)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !293, file: !4, line: 190, baseType: !24, size: 32, align: 32, offset: 9408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !293, file: !4, line: 191, baseType: !225, size: 32, align: 32, offset: 9440)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !293, file: !4, line: 192, baseType: !333, size: 7584, align: 32, offset: 9472)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !334, file: !4, line: 65, baseType: !225, size: 32, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !334, file: !4, line: 66, baseType: !24, size: 32, align: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !334, file: !4, line: 67, baseType: !24, size: 32, align: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !334, file: !4, line: 68, baseType: !24, size: 32, align: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !334, file: !4, line: 69, baseType: !225, size: 32, align: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !334, file: !4, line: 70, baseType: !225, size: 32, align: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !334, file: !4, line: 71, baseType: !225, size: 32, align: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !334, file: !4, line: 72, baseType: !24, size: 32, align: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !334, file: !4, line: 73, baseType: !225, size: 32, align: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !334, file: !4, line: 74, baseType: !225, size: 32, align: 32, offset: 288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !334, file: !4, line: 75, baseType: !24, size: 32, align: 32, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !334, file: !4, line: 76, baseType: !24, size: 32, align: 32, offset: 352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !334, file: !4, line: 77, baseType: !24, size: 32, align: 32, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !334, file: !4, line: 78, baseType: !225, size: 32, align: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !334, file: !4, line: 79, baseType: !24, size: 32, align: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !334, file: !4, line: 80, baseType: !24, size: 32, align: 32, offset: 480)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !334, file: !4, line: 81, baseType: !225, size: 32, align: 32, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !334, file: !4, line: 82, baseType: !24, size: 32, align: 32, offset: 544)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !334, file: !4, line: 83, baseType: !24, size: 32, align: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !334, file: !4, line: 84, baseType: !225, size: 32, align: 32, offset: 608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !334, file: !4, line: 85, baseType: !225, size: 32, align: 32, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !334, file: !4, line: 86, baseType: !358, size: 3296, align: 32, offset: 672)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !360)
!360 = !{!361, !362, !363, !364, !368, !369, !370, !371, !372, !373}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !359, file: !4, line: 50, baseType: !24, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !359, file: !4, line: 51, baseType: !24, size: 32, align: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !359, file: !4, line: 52, baseType: !24, size: 32, align: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !359, file: !4, line: 53, baseType: !365, size: 1024, align: 32, offset: 96)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1024, align: 32, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !359, file: !4, line: 54, baseType: !365, size: 1024, align: 32, offset: 1120)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !359, file: !4, line: 55, baseType: !365, size: 1024, align: 32, offset: 2144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !359, file: !4, line: 56, baseType: !24, size: 32, align: 32, offset: 3168)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !359, file: !4, line: 57, baseType: !24, size: 32, align: 32, offset: 3200)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !359, file: !4, line: 58, baseType: !24, size: 32, align: 32, offset: 3232)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !359, file: !4, line: 59, baseType: !24, size: 32, align: 32, offset: 3264)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !334, file: !4, line: 87, baseType: !225, size: 32, align: 32, offset: 3968)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !334, file: !4, line: 88, baseType: !358, size: 3296, align: 32, offset: 4000)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !334, file: !4, line: 90, baseType: !225, size: 32, align: 32, offset: 7296)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !334, file: !4, line: 91, baseType: !225, size: 32, align: 32, offset: 7328)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !334, file: !4, line: 92, baseType: !225, size: 32, align: 32, offset: 7360)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !334, file: !4, line: 93, baseType: !24, size: 32, align: 32, offset: 7392)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !334, file: !4, line: 94, baseType: !24, size: 32, align: 32, offset: 7424)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !334, file: !4, line: 95, baseType: !24, size: 32, align: 32, offset: 7456)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !334, file: !4, line: 96, baseType: !24, size: 32, align: 32, offset: 7488)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !334, file: !4, line: 97, baseType: !24, size: 32, align: 32, offset: 7520)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !334, file: !4, line: 98, baseType: !24, size: 32, align: 32, offset: 7552)
!385 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !45, line: 578, type: !14, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!386 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !45, line: 579, type: !14, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!387 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !45, line: 583, type: !388, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!389 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !45, line: 584, type: !388, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!390 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !45, line: 585, type: !391, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!392 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !45, line: 586, type: !14, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!393 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !45, line: 587, type: !14, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!394 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !45, line: 588, type: !14, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!395 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !45, line: 589, type: !14, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!396 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !45, line: 592, type: !241, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!397 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !45, line: 593, type: !241, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!398 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !45, line: 595, type: !244, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!399 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !45, line: 596, type: !244, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!400 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !45, line: 598, type: !241, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!401 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !45, line: 599, type: !244, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!402 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !45, line: 601, type: !241, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!403 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !45, line: 602, type: !244, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!404 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !45, line: 604, type: !405, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!409 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !45, line: 605, type: !406, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!410 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !45, line: 608, type: !411, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!412 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !45, line: 609, type: !411, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!413 = !DIGlobalVariable(name: "intras", scope: !0, file: !45, line: 610, type: !14, isLocal: false, isDefinition: true, variable: i32* @intras)
!414 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !45, line: 612, type: !14, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!415 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !45, line: 612, type: !14, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!416 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !45, line: 612, type: !14, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!417 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !45, line: 613, type: !14, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!418 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !45, line: 613, type: !14, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!419 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !45, line: 613, type: !14, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!420 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !45, line: 614, type: !14, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!421 = !DIGlobalVariable(name: "errortext", scope: !0, file: !45, line: 617, type: !422, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2400, align: 8, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 300)
!425 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !45, line: 620, type: !426, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, align: 32, elements: !427)
!427 = !{!428, !428}
!428 = !DISubrange(count: 16)
!429 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !45, line: 620, type: !426, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!430 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !45, line: 620, type: !426, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!431 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !45, line: 621, type: !426, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!432 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !45, line: 621, type: !426, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!433 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !45, line: 621, type: !426, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!434 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !45, line: 622, type: !435, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 24576, align: 32, elements: !436)
!436 = !{!154, !428, !428}
!437 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !45, line: 623, type: !438, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, align: 32, elements: !439)
!439 = !{!159, !172, !172}
!440 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !45, line: 623, type: !438, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!441 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !45, line: 624, type: !438, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!442 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !45, line: 624, type: !438, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!443 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !45, line: 625, type: !444, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 32, elements: !445)
!445 = !{!172, !172}
!446 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !45, line: 625, type: !447, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 32, elements: !448)
!448 = !{!428}
!449 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !45, line: 1201, type: !450, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !45, line: 1190, baseType: !452)
!452 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 1182, size: 192, align: 32, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !452, file: !45, line: 1184, baseType: !14, size: 32, align: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !452, file: !45, line: 1185, baseType: !14, size: 32, align: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !452, file: !45, line: 1186, baseType: !14, size: 32, align: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !452, file: !45, line: 1187, baseType: !14, size: 32, align: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !452, file: !45, line: 1188, baseType: !14, size: 32, align: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !452, file: !45, line: 1189, baseType: !14, size: 32, align: 32, offset: 160)
!460 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !45, line: 1202, type: !461, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !45, line: 1177, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 1145, size: 26880, align: 64, elements: !464)
!464 = !{!465, !467, !468, !469, !470, !471, !472, !473, !474, !476, !477, !478, !479, !480, !485, !486, !490, !491, !492, !493, !495, !496, !497, !498, !499, !500, !501}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !463, file: !45, line: 1147, baseType: !466, size: 64, align: 64)
!466 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !463, file: !45, line: 1149, baseType: !426, size: 8192, align: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !463, file: !45, line: 1150, baseType: !426, size: 8192, align: 32, offset: 8256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !463, file: !45, line: 1150, baseType: !426, size: 8192, align: 32, offset: 16448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !463, file: !45, line: 1151, baseType: !391, size: 64, align: 64, offset: 24640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !463, file: !45, line: 1152, baseType: !388, size: 64, align: 64, offset: 24704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !463, file: !45, line: 1153, baseType: !14, size: 32, align: 32, offset: 24768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !463, file: !45, line: 1155, baseType: !14, size: 32, align: 32, offset: 24800)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !463, file: !45, line: 1157, baseType: !475, size: 128, align: 32, offset: 24832)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, align: 32, elements: !171)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !463, file: !45, line: 1157, baseType: !475, size: 128, align: 32, offset: 24960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !463, file: !45, line: 1158, baseType: !246, size: 64, align: 64, offset: 25088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !463, file: !45, line: 1159, baseType: !447, size: 512, align: 32, offset: 25152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !463, file: !45, line: 1160, baseType: !14, size: 32, align: 32, offset: 25664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !463, file: !45, line: 1161, baseType: !481, size: 64, align: 64, offset: 25728)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !45, line: 62, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !483, line: 30, baseType: !484)
!483 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!484 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !463, file: !45, line: 1162, baseType: !14, size: 32, align: 32, offset: 25792)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !463, file: !45, line: 1163, baseType: !487, size: 64, align: 64, offset: 25856)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !463, file: !45, line: 1164, baseType: !487, size: 64, align: 64, offset: 25920)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !463, file: !45, line: 1165, baseType: !487, size: 64, align: 64, offset: 25984)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !463, file: !45, line: 1166, baseType: !487, size: 64, align: 64, offset: 26048)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !463, file: !45, line: 1167, baseType: !494, size: 512, align: 16, offset: 26112)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 512, align: 16, elements: !439)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !463, file: !45, line: 1168, baseType: !14, size: 32, align: 32, offset: 26624)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !463, file: !45, line: 1169, baseType: !14, size: 32, align: 32, offset: 26656)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !463, file: !45, line: 1171, baseType: !14, size: 32, align: 32, offset: 26688)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !463, file: !45, line: 1172, baseType: !14, size: 32, align: 32, offset: 26720)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !463, file: !45, line: 1174, baseType: !14, size: 32, align: 32, offset: 26752)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !463, file: !45, line: 1175, baseType: !14, size: 32, align: 32, offset: 26784)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !463, file: !45, line: 1176, baseType: !14, size: 32, align: 32, offset: 26816)
!502 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !45, line: 1203, type: !462, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!503 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !45, line: 1203, type: !462, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!504 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !45, line: 1204, type: !462, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!505 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !45, line: 1204, type: !462, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!506 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !45, line: 1230, type: !507, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !509, line: 153, baseType: !510)
!509 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !509, line: 122, size: 1216, align: 64, elements: !511)
!511 = !{!512, !514, !515, !516, !517, !518, !523, !524, !525, !529, !533, !542, !548, !549, !552, !553, !555, !559, !560, !561}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !510, file: !509, line: 123, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !510, file: !509, line: 124, baseType: !14, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !510, file: !509, line: 125, baseType: !14, size: 32, align: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !510, file: !509, line: 126, baseType: !408, size: 16, align: 16, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !510, file: !509, line: 127, baseType: !408, size: 16, align: 16, offset: 144)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !510, file: !509, line: 128, baseType: !519, size: 128, align: 64, offset: 192)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !509, line: 88, size: 128, align: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !519, file: !509, line: 89, baseType: !513, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !519, file: !509, line: 90, baseType: !14, size: 32, align: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !510, file: !509, line: 129, baseType: !14, size: 32, align: 32, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !510, file: !509, line: 132, baseType: !9, size: 64, align: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !510, file: !509, line: 133, baseType: !526, size: 64, align: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!14, !9}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !510, file: !509, line: 134, baseType: !530, size: 64, align: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!14, !9, !15, !14}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !510, file: !509, line: 135, baseType: !534, size: 64, align: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !9, !537, !14}
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !509, line: 77, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !539, line: 71, baseType: !540)
!539 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !541, line: 46, baseType: !484)
!541 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !510, file: !509, line: 136, baseType: !543, size: 64, align: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!14, !9, !546, !14}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !510, file: !509, line: 139, baseType: !519, size: 128, align: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !510, file: !509, line: 140, baseType: !550, size: 64, align: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !509, line: 94, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !510, file: !509, line: 141, baseType: !14, size: 32, align: 32, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !510, file: !509, line: 144, baseType: !554, size: 24, align: 8, offset: 928)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 24, align: 8, elements: !176)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !510, file: !509, line: 145, baseType: !556, size: 8, align: 8, offset: 952)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 1)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !510, file: !509, line: 148, baseType: !519, size: 128, align: 64, offset: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !510, file: !509, line: 151, baseType: !14, size: 32, align: 32, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !510, file: !509, line: 152, baseType: !537, size: 64, align: 64, offset: 1152)
!562 = !DIGlobalVariable(name: "p_log", scope: !0, file: !45, line: 1231, type: !507, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!563 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !45, line: 1232, type: !507, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!564 = !DIGlobalVariable(name: "p_in", scope: !0, file: !45, line: 1233, type: !14, isLocal: false, isDefinition: true, variable: i32* @p_in)
!565 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !45, line: 1234, type: !14, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!566 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !45, line: 1237, type: !567, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 640, align: 32, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 20)
!570 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !45, line: 1238, type: !567, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!571 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !45, line: 1239, type: !567, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!572 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !45, line: 1240, type: !567, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!573 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !45, line: 1241, type: !567, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!574 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !45, line: 1242, type: !567, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!575 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !45, line: 1456, type: !14, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!576 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !45, line: 1465, type: !14, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!577 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !45, line: 1466, type: !14, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!578 = !DIGlobalVariable(name: "WriteNALU", scope: !0, file: !579, line: 28, type: !580, isLocal: false, isDefinition: true, variable: i32 (%struct.NALU_t*)** @WriteNALU)
!579 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!14, !17}
!583 = !{}
!584 = !{i32 2, !"Dwarf Version", i32 2}
!585 = !{i32 2, !"Debug Info Version", i32 700000003}
!586 = !{i32 1, !"PIC Level", i32 2}
!587 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!588 = !DIExpression()
!589 = !DILocation(line: 52, column: 23, scope: !11)
!590 = !DILocation(line: 52, column: 37, scope: !11)
!591 = !DILocation(line: 52, column: 47, scope: !11)
!592 = !DILocation(line: 52, column: 62, scope: !11)
!593 = !DILocation(line: 52, column: 81, scope: !11)
!594 = !DILocation(line: 53, column: 21, scope: !11)
!595 = !DILocation(line: 53, column: 40, scope: !11)
!596 = !DILocation(line: 57, column: 3, scope: !11)
!597 = !{!"branch_weights", i32 4, i32 64}
!598 = !DILocation(line: 58, column: 3, scope: !11)
!599 = !DILocation(line: 59, column: 3, scope: !11)
!600 = !DILocation(line: 60, column: 3, scope: !11)
!601 = !DILocation(line: 62, column: 9, scope: !11)
