; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/output.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 42, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "FALSE", value: 0)
!13 = !DIEnumerator(name: "TRUE", value: 1)
!14 = !{!15, !18, !19, !20, !21}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !17, line: 30, baseType: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!20 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !{!23, !31, !57, !137, !156, !160, !161, !167, !191, !196, !200}
!23 = !DISubprogram(name: "testEndian", scope: !1, file: !1, line: 44, type: !24, isLocal: false, isDefinition: true, scopeLine: 45, isOptimized: true, function: i32 ()* @testEndian, variables: !27)
!24 = !DISubroutineType(types: !25)
!25 = !{!26}
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !{!28, !30}
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !23, file: !1, line: 46, type: !29)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !23, file: !1, line: 47, type: !15)
!31 = !DISubprogram(name: "img2buf", scope: !1, file: !1, line: 79, type: !32, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: void (i16**, i8*, i32, i32, i32, i32, i32, i32, i32)* @img2buf, variables: !37)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !36, !26, !26, !26, !26, !26, !26, !26}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imgX", arg: 1, scope: !31, file: !1, line: 79, type: !34)
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !31, file: !1, line: 79, type: !36)
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_x", arg: 3, scope: !31, file: !1, line: 79, type: !26)
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size_y", arg: 4, scope: !31, file: !1, line: 79, type: !26)
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol_size_in_bytes", arg: 5, scope: !31, file: !1, line: 79, type: !26)
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "crop_left", arg: 6, scope: !31, file: !1, line: 79, type: !26)
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "crop_right", arg: 7, scope: !31, file: !1, line: 79, type: !26)
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "crop_top", arg: 8, scope: !31, file: !1, line: 79, type: !26)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "crop_bottom", arg: 9, scope: !31, file: !1, line: 79, type: !26)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !31, file: !1, line: 81, type: !26)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !31, file: !1, line: 81, type: !26)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "twidth", scope: !31, file: !1, line: 83, type: !26)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "theight", scope: !31, file: !1, line: 84, type: !26)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !31, file: !1, line: 86, type: !26)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ui8", scope: !31, file: !1, line: 88, type: !18)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp16", scope: !31, file: !1, line: 89, type: !19)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ui16", scope: !31, file: !1, line: 89, type: !19)
!55 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp32", scope: !31, file: !1, line: 90, type: !20)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ui32", scope: !31, file: !1, line: 90, type: !20)
!57 = !DISubprogram(name: "write_picture", scope: !1, file: !1, line: 184, type: !58, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*, i32, i32)* @write_picture, variables: !133)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !26, !26}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !62, line: 82, baseType: !63)
!62 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !62, line: 21, size: 52672, align: 64, elements: !64)
!64 = !{!65, !67, !68, !69, !70, !71, !72, !81, !82, !83, !84, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !107, !108, !112, !116, !117, !119, !121, !122, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !63, file: !62, line: 23, baseType: !66, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !4, line: 190, baseType: !3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !63, file: !62, line: 25, baseType: !26, size: 32, align: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !63, file: !62, line: 26, baseType: !26, size: 32, align: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !63, file: !62, line: 27, baseType: !26, size: 32, align: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !63, file: !62, line: 28, baseType: !26, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !63, file: !62, line: 29, baseType: !26, size: 32, align: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !63, file: !62, line: 30, baseType: !73, size: 12672, align: 64, offset: 192)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 12672, align: 64, elements: !78)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !76, line: 30, baseType: !77)
!76 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!78 = !{!79, !80}
!79 = !DISubrange(count: 6)
!80 = !DISubrange(count: 33)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !63, file: !62, line: 31, baseType: !73, size: 12672, align: 64, offset: 12864)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !63, file: !62, line: 32, baseType: !73, size: 12672, align: 64, offset: 25536)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !63, file: !62, line: 33, baseType: !73, size: 12672, align: 64, offset: 38208)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !63, file: !62, line: 34, baseType: !85, size: 32, align: 32, offset: 50880)
!85 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !63, file: !62, line: 35, baseType: !26, size: 32, align: 32, offset: 50912)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !63, file: !62, line: 36, baseType: !26, size: 32, align: 32, offset: 50944)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !63, file: !62, line: 37, baseType: !26, size: 32, align: 32, offset: 50976)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !63, file: !62, line: 39, baseType: !26, size: 32, align: 32, offset: 51008)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !63, file: !62, line: 40, baseType: !26, size: 32, align: 32, offset: 51040)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !63, file: !62, line: 41, baseType: !26, size: 32, align: 32, offset: 51072)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !63, file: !62, line: 42, baseType: !26, size: 32, align: 32, offset: 51104)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !63, file: !62, line: 44, baseType: !26, size: 32, align: 32, offset: 51136)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !63, file: !62, line: 44, baseType: !26, size: 32, align: 32, offset: 51168)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !63, file: !62, line: 44, baseType: !26, size: 32, align: 32, offset: 51200)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !63, file: !62, line: 44, baseType: !26, size: 32, align: 32, offset: 51232)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !63, file: !62, line: 45, baseType: !26, size: 32, align: 32, offset: 51264)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !63, file: !62, line: 46, baseType: !26, size: 32, align: 32, offset: 51296)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !63, file: !62, line: 47, baseType: !26, size: 32, align: 32, offset: 51328)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !63, file: !62, line: 49, baseType: !34, size: 64, align: 64, offset: 51392)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !63, file: !62, line: 50, baseType: !35, size: 64, align: 64, offset: 51456)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !63, file: !62, line: 51, baseType: !35, size: 64, align: 64, offset: 51520)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !63, file: !62, line: 52, baseType: !34, size: 64, align: 64, offset: 51584)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !63, file: !62, line: 53, baseType: !34, size: 64, align: 64, offset: 51648)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !63, file: !62, line: 54, baseType: !106, size: 64, align: 64, offset: 51712)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !63, file: !62, line: 56, baseType: !15, size: 64, align: 64, offset: 51776)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !63, file: !62, line: 58, baseType: !109, size: 64, align: 64, offset: 51840)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !63, file: !62, line: 60, baseType: !113, size: 64, align: 64, offset: 51904)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !63, file: !62, line: 63, baseType: !113, size: 64, align: 64, offset: 51968)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !63, file: !62, line: 66, baseType: !118, size: 64, align: 64, offset: 52032)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !63, file: !62, line: 68, baseType: !120, size: 64, align: 64, offset: 52096)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !63, file: !62, line: 69, baseType: !120, size: 64, align: 64, offset: 52160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !63, file: !62, line: 71, baseType: !123, size: 64, align: 64, offset: 52224)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !63, file: !62, line: 72, baseType: !123, size: 64, align: 64, offset: 52288)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !63, file: !62, line: 73, baseType: !123, size: 64, align: 64, offset: 52352)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !63, file: !62, line: 75, baseType: !26, size: 32, align: 32, offset: 52416)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !63, file: !62, line: 76, baseType: !26, size: 32, align: 32, offset: 52448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !63, file: !62, line: 77, baseType: !26, size: 32, align: 32, offset: 52480)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !63, file: !62, line: 78, baseType: !26, size: 32, align: 32, offset: 52512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !63, file: !62, line: 79, baseType: !26, size: 32, align: 32, offset: 52544)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !63, file: !62, line: 80, baseType: !26, size: 32, align: 32, offset: 52576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !63, file: !62, line: 81, baseType: !26, size: 32, align: 32, offset: 52608)
!133 = !{!134, !135, !136}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !57, file: !1, line: 184, type: !60)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_out", arg: 2, scope: !57, file: !1, line: 184, type: !26)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "real_structure", arg: 3, scope: !57, file: !1, line: 184, type: !26)
!137 = !DISubprogram(name: "write_out_picture", scope: !1, file: !1, line: 199, type: !138, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*, i32)* @write_out_picture, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !60, !26}
!140 = !{!141, !142, !143, !147, !148, !149, !150, !151, !152, !153, !155}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !137, file: !1, line: 199, type: !60)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_out", arg: 2, scope: !137, file: !1, line: 199, type: !26)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SubWidthC", scope: !137, file: !1, line: 201, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SubHeightC", scope: !137, file: !1, line: 202, type: !144)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crop_left", scope: !137, file: !1, line: 204, type: !26)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crop_right", scope: !137, file: !1, line: 204, type: !26)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crop_top", scope: !137, file: !1, line: 204, type: !26)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crop_bottom", scope: !137, file: !1, line: 204, type: !26)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol_size_in_bytes", scope: !137, file: !1, line: 205, type: !26)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rgb_output", scope: !137, file: !1, line: 206, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !10, line: 45, baseType: !9)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !137, file: !1, line: 207, type: !36)
!156 = !DISubprogram(name: "init_out_buffer", scope: !1, file: !1, line: 283, type: !157, isLocal: false, isDefinition: true, scopeLine: 284, isOptimized: true, function: void ()* @init_out_buffer, variables: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !{}
!160 = !DISubprogram(name: "uninit_out_buffer", scope: !1, file: !1, line: 294, type: !157, isLocal: false, isDefinition: true, scopeLine: 295, isOptimized: true, function: void ()* @uninit_out_buffer, variables: !159)
!161 = !DISubprogram(name: "clear_picture", scope: !1, file: !1, line: 306, type: !162, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*)* @clear_picture, variables: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !60}
!164 = !{!165, !166}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !161, file: !1, line: 306, type: !60)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !161, file: !1, line: 308, type: !26)
!167 = !DISubprogram(name: "write_unpaired_field", scope: !1, file: !1, line: 329, type: !168, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.frame_store*, i32)* @write_unpaired_field, variables: !187)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !26}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !62, line: 137, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !62, line: 118, size: 512, align: 64, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !172, file: !62, line: 120, baseType: !26, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !172, file: !62, line: 121, baseType: !26, size: 32, align: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !172, file: !62, line: 122, baseType: !26, size: 32, align: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !172, file: !62, line: 123, baseType: !26, size: 32, align: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !172, file: !62, line: 125, baseType: !26, size: 32, align: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !172, file: !62, line: 127, baseType: !85, size: 32, align: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !172, file: !62, line: 128, baseType: !26, size: 32, align: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !172, file: !62, line: 129, baseType: !26, size: 32, align: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !172, file: !62, line: 130, baseType: !26, size: 32, align: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !172, file: !62, line: 131, baseType: !26, size: 32, align: 32, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !172, file: !62, line: 133, baseType: !60, size: 64, align: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !172, file: !62, line: 134, baseType: !60, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !172, file: !62, line: 135, baseType: !60, size: 64, align: 64, offset: 448)
!187 = !{!188, !189, !190}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fs", arg: 1, scope: !167, file: !1, line: 329, type: !170)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_out", arg: 2, scope: !167, file: !1, line: 329, type: !26)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !167, file: !1, line: 331, type: !60)
!191 = !DISubprogram(name: "flush_direct_output", scope: !1, file: !1, line: 366, type: !192, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @flush_direct_output, variables: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !26}
!194 = !{!195}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_out", arg: 1, scope: !191, file: !1, line: 366, type: !26)
!196 = !DISubprogram(name: "write_stored_frame", scope: !1, file: !1, line: 390, type: !168, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.frame_store*, i32)* @write_stored_frame, variables: !197)
!197 = !{!198, !199}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fs", arg: 1, scope: !196, file: !1, line: 390, type: !170)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_out", arg: 2, scope: !196, file: !1, line: 390, type: !26)
!200 = !DISubprogram(name: "direct_output", scope: !1, file: !1, line: 418, type: !138, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture*, i32)* @direct_output, variables: !201)
!201 = !{!202, !203}
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !200, file: !1, line: 418, type: !60)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_out", arg: 2, scope: !200, file: !1, line: 418, type: !26)
!204 = !{!205, !390, !391, !392, !393, !394, !395, !396, !398, !399, !400, !401, !402, !441, !536, !537, !538, !540, !541, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !572, !576, !577, !578, !579, !580, !581, !584, !587, !588, !589, !590, !593, !596, !607, !643, !644, !645, !646, !647, !703, !704, !705, !706, !707, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!205 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !206, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !209)
!209 = !{!210, !211, !212, !385, !386, !388, !389}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !208, file: !4, line: 477, baseType: !26, size: 32, align: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !208, file: !4, line: 478, baseType: !26, size: 32, align: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !208, file: !4, line: 479, baseType: !213, size: 6400, align: 64, offset: 64)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 6400, align: 64, elements: !383)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !298, !332, !359, !368, !369, !370, !371, !372, !373, !374, !375, !376, !380}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !216, file: !4, line: 445, baseType: !26, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !216, file: !4, line: 446, baseType: !26, size: 32, align: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !216, file: !4, line: 447, baseType: !26, size: 32, align: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !216, file: !4, line: 448, baseType: !26, size: 32, align: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !216, file: !4, line: 449, baseType: !26, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !216, file: !4, line: 450, baseType: !26, size: 32, align: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !216, file: !4, line: 451, baseType: !225, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !228)
!228 = !{!229, !245, !270}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !227, file: !4, line: 433, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !232, file: !4, line: 413, baseType: !26, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !232, file: !4, line: 414, baseType: !26, size: 32, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !232, file: !4, line: 415, baseType: !16, size: 8, align: 8, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !232, file: !4, line: 416, baseType: !26, size: 32, align: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !232, file: !4, line: 417, baseType: !26, size: 32, align: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !232, file: !4, line: 418, baseType: !16, size: 8, align: 8, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !232, file: !4, line: 420, baseType: !16, size: 8, align: 8, offset: 168)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !232, file: !4, line: 421, baseType: !26, size: 32, align: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !232, file: !4, line: 422, baseType: !26, size: 32, align: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !232, file: !4, line: 424, baseType: !15, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !232, file: !4, line: 425, baseType: !26, size: 32, align: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !227, file: !4, line: 434, baseType: !246, size: 832, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !247, file: !4, line: 209, baseType: !85, size: 32, align: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !247, file: !4, line: 209, baseType: !85, size: 32, align: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !247, file: !4, line: 210, baseType: !85, size: 32, align: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !247, file: !4, line: 211, baseType: !85, size: 32, align: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !247, file: !4, line: 212, baseType: !85, size: 32, align: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !247, file: !4, line: 213, baseType: !15, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !247, file: !4, line: 214, baseType: !256, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !247, file: !4, line: 217, baseType: !85, size: 32, align: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !247, file: !4, line: 217, baseType: !85, size: 32, align: 32, offset: 352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !247, file: !4, line: 218, baseType: !85, size: 32, align: 32, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !247, file: !4, line: 219, baseType: !85, size: 32, align: 32, offset: 416)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !247, file: !4, line: 220, baseType: !85, size: 32, align: 32, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !247, file: !4, line: 221, baseType: !15, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !247, file: !4, line: 222, baseType: !256, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !247, file: !4, line: 223, baseType: !26, size: 32, align: 32, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !247, file: !4, line: 223, baseType: !26, size: 32, align: 32, offset: 672)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !247, file: !4, line: 224, baseType: !26, size: 32, align: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !247, file: !4, line: 224, baseType: !26, size: 32, align: 32, offset: 736)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !247, file: !4, line: 225, baseType: !26, size: 32, align: 32, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !247, file: !4, line: 225, baseType: !26, size: 32, align: 32, offset: 800)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !227, file: !4, line: 436, baseType: !271, size: 64, align: 64, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!26, !274, !297}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !4, line: 329, baseType: !26, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !276, file: !4, line: 330, baseType: !26, size: 32, align: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !276, file: !4, line: 331, baseType: !26, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !276, file: !4, line: 332, baseType: !26, size: 32, align: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !276, file: !4, line: 333, baseType: !26, size: 32, align: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !276, file: !4, line: 334, baseType: !85, size: 32, align: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !276, file: !4, line: 335, baseType: !26, size: 32, align: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !276, file: !4, line: 336, baseType: !26, size: 32, align: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !276, file: !4, line: 344, baseType: !287, size: 64, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !26, !26, !256, !256}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !276, file: !4, line: 346, baseType: !291, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294, !295}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !216, file: !4, line: 452, baseType: !299, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !301)
!301 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !302)
!302 = !{!303, !314, !319, !323, !326, !328, !329}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !301, file: !4, line: 260, baseType: !304, size: 4224, align: 64)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 4224, align: 64, elements: !311)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !306)
!306 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !306, file: !4, line: 233, baseType: !19, size: 16, align: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !306, file: !4, line: 234, baseType: !18, size: 8, align: 8, offset: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !306, file: !4, line: 236, baseType: !20, size: 64, align: 64, offset: 64)
!311 = !{!312, !313}
!312 = !DISubrange(count: 3)
!313 = !DISubrange(count: 11)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !301, file: !4, line: 261, baseType: !315, size: 2304, align: 64, offset: 4224)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 2304, align: 64, elements: !316)
!316 = !{!317, !318}
!317 = !DISubrange(count: 2)
!318 = !DISubrange(count: 9)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !301, file: !4, line: 262, baseType: !320, size: 2560, align: 64, offset: 6528)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 2560, align: 64, elements: !321)
!321 = !{!317, !322}
!322 = !DISubrange(count: 10)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !301, file: !4, line: 263, baseType: !324, size: 1536, align: 64, offset: 9088)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1536, align: 64, elements: !325)
!325 = !{!317, !79}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !301, file: !4, line: 264, baseType: !327, size: 512, align: 64, offset: 10624)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 512, align: 64, elements: !145)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !301, file: !4, line: 265, baseType: !327, size: 512, align: 64, offset: 11136)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !301, file: !4, line: 266, baseType: !330, size: 384, align: 64, offset: 11648)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 384, align: 64, elements: !331)
!331 = !{!312}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !216, file: !4, line: 453, baseType: !333, size: 64, align: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !336)
!336 = !{!337, !340, !341, !344, !347, !351, !352, !356, !357, !358}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !335, file: !4, line: 283, baseType: !338, size: 256, align: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 256, align: 64, elements: !339)
!339 = !{!317}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !335, file: !4, line: 284, baseType: !327, size: 512, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !335, file: !4, line: 285, baseType: !342, size: 1536, align: 64, offset: 768)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1536, align: 64, elements: !343)
!343 = !{!312, !146}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !335, file: !4, line: 286, baseType: !345, size: 5120, align: 64, offset: 2304)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 5120, align: 64, elements: !346)
!346 = !{!322, !146}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !335, file: !4, line: 287, baseType: !348, size: 19200, align: 64, offset: 7424)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 19200, align: 64, elements: !349)
!349 = !{!322, !350}
!350 = !DISubrange(count: 15)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !335, file: !4, line: 288, baseType: !348, size: 19200, align: 64, offset: 26624)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !335, file: !4, line: 289, baseType: !353, size: 6400, align: 64, offset: 45824)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 6400, align: 64, elements: !354)
!354 = !{!322, !355}
!355 = !DISubrange(count: 5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !335, file: !4, line: 290, baseType: !353, size: 6400, align: 64, offset: 52224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !335, file: !4, line: 291, baseType: !348, size: 19200, align: 64, offset: 58624)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !335, file: !4, line: 292, baseType: !348, size: 19200, align: 64, offset: 77824)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !216, file: !4, line: 456, baseType: !360, size: 64, align: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !362, file: !4, line: 310, baseType: !26, size: 32, align: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !362, file: !4, line: 311, baseType: !26, size: 32, align: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !362, file: !4, line: 312, baseType: !367, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !216, file: !4, line: 458, baseType: !26, size: 32, align: 32, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !216, file: !4, line: 459, baseType: !256, size: 64, align: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !216, file: !4, line: 460, baseType: !256, size: 64, align: 64, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !216, file: !4, line: 461, baseType: !256, size: 64, align: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !216, file: !4, line: 462, baseType: !26, size: 32, align: 32, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !216, file: !4, line: 463, baseType: !256, size: 64, align: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !216, file: !4, line: 464, baseType: !256, size: 64, align: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !216, file: !4, line: 465, baseType: !256, size: 64, align: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !216, file: !4, line: 467, baseType: !377, size: 64, align: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!154, !26}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !216, file: !4, line: 469, baseType: !381, size: 192, align: 32, offset: 1024)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, align: 32, elements: !382)
!382 = !{!312, !317}
!383 = !{!384}
!384 = !DISubrange(count: 100)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !208, file: !4, line: 480, baseType: !26, size: 32, align: 32, offset: 6464)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !208, file: !4, line: 481, baseType: !387, size: 32, align: 32, offset: 6496)
!387 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !208, file: !4, line: 482, baseType: !387, size: 32, align: 32, offset: 6528)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !208, file: !4, line: 483, baseType: !387, size: 32, align: 32, offset: 6560)
!390 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !206, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!391 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !206, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!392 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !206, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!393 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !206, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!394 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !34, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!395 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !106, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!396 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !397, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!398 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !85, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!399 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !85, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!400 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !26, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!401 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !26, isLocal: false, isDefinition: true, variable: i32* @me_time)
!402 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !403, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !10, line: 145, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 103, size: 1920, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !417, !418, !419, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !405, file: !10, line: 105, baseType: !154, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !405, file: !10, line: 106, baseType: !85, size: 32, align: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !405, file: !10, line: 107, baseType: !85, size: 32, align: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !405, file: !10, line: 108, baseType: !154, size: 32, align: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !405, file: !10, line: 110, baseType: !154, size: 32, align: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !405, file: !10, line: 111, baseType: !154, size: 32, align: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !405, file: !10, line: 112, baseType: !414, size: 256, align: 32, offset: 192)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, align: 32, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !405, file: !10, line: 115, baseType: !154, size: 32, align: 32, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !405, file: !10, line: 116, baseType: !85, size: 32, align: 32, offset: 480)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !405, file: !10, line: 117, baseType: !85, size: 32, align: 32, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !405, file: !10, line: 119, baseType: !421, size: 256, align: 32, offset: 544)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 256, align: 32, elements: !415)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !405, file: !10, line: 121, baseType: !421, size: 256, align: 32, offset: 800)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !405, file: !10, line: 122, baseType: !421, size: 256, align: 32, offset: 1056)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !405, file: !10, line: 124, baseType: !154, size: 32, align: 32, offset: 1312)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !405, file: !10, line: 125, baseType: !85, size: 32, align: 32, offset: 1344)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !405, file: !10, line: 127, baseType: !85, size: 32, align: 32, offset: 1376)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !405, file: !10, line: 128, baseType: !15, size: 64, align: 64, offset: 1408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !405, file: !10, line: 130, baseType: !26, size: 32, align: 32, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !405, file: !10, line: 131, baseType: !26, size: 32, align: 32, offset: 1504)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !405, file: !10, line: 132, baseType: !154, size: 32, align: 32, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !405, file: !10, line: 133, baseType: !85, size: 32, align: 32, offset: 1568)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !405, file: !10, line: 134, baseType: !26, size: 32, align: 32, offset: 1600)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !405, file: !10, line: 135, baseType: !26, size: 32, align: 32, offset: 1632)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !405, file: !10, line: 136, baseType: !26, size: 32, align: 32, offset: 1664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !405, file: !10, line: 138, baseType: !26, size: 32, align: 32, offset: 1696)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !405, file: !10, line: 139, baseType: !26, size: 32, align: 32, offset: 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !405, file: !10, line: 141, baseType: !154, size: 32, align: 32, offset: 1760)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !405, file: !10, line: 142, baseType: !154, size: 32, align: 32, offset: 1792)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !405, file: !10, line: 143, baseType: !154, size: 32, align: 32, offset: 1824)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !405, file: !10, line: 144, baseType: !154, size: 32, align: 32, offset: 1856)
!441 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !442, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !10, line: 193, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 149, size: 17056, align: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !444, file: !10, line: 151, baseType: !154, size: 32, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !444, file: !10, line: 153, baseType: !85, size: 32, align: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !444, file: !10, line: 154, baseType: !154, size: 32, align: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !444, file: !10, line: 155, baseType: !154, size: 32, align: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !444, file: !10, line: 156, baseType: !154, size: 32, align: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !444, file: !10, line: 157, baseType: !154, size: 32, align: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !444, file: !10, line: 158, baseType: !85, size: 32, align: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !444, file: !10, line: 159, baseType: !85, size: 32, align: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !444, file: !10, line: 160, baseType: !85, size: 32, align: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !444, file: !10, line: 162, baseType: !154, size: 32, align: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !444, file: !10, line: 163, baseType: !414, size: 256, align: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !444, file: !10, line: 165, baseType: !85, size: 32, align: 32, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !444, file: !10, line: 166, baseType: !85, size: 32, align: 32, offset: 608)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !444, file: !10, line: 167, baseType: !85, size: 32, align: 32, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !444, file: !10, line: 168, baseType: !85, size: 32, align: 32, offset: 672)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !444, file: !10, line: 170, baseType: !85, size: 32, align: 32, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !444, file: !10, line: 172, baseType: !154, size: 32, align: 32, offset: 736)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !444, file: !10, line: 173, baseType: !26, size: 32, align: 32, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !444, file: !10, line: 174, baseType: !26, size: 32, align: 32, offset: 800)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !444, file: !10, line: 175, baseType: !85, size: 32, align: 32, offset: 832)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !444, file: !10, line: 177, baseType: !467, size: 8192, align: 32, offset: 864)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, align: 32, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !444, file: !10, line: 178, baseType: !85, size: 32, align: 32, offset: 9056)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !444, file: !10, line: 179, baseType: !154, size: 32, align: 32, offset: 9088)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !444, file: !10, line: 180, baseType: !85, size: 32, align: 32, offset: 9120)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !444, file: !10, line: 181, baseType: !85, size: 32, align: 32, offset: 9152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !444, file: !10, line: 182, baseType: !154, size: 32, align: 32, offset: 9184)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !444, file: !10, line: 184, baseType: !154, size: 32, align: 32, offset: 9216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !444, file: !10, line: 185, baseType: !154, size: 32, align: 32, offset: 9248)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !444, file: !10, line: 186, baseType: !154, size: 32, align: 32, offset: 9280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !444, file: !10, line: 187, baseType: !85, size: 32, align: 32, offset: 9312)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !444, file: !10, line: 188, baseType: !85, size: 32, align: 32, offset: 9344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !444, file: !10, line: 189, baseType: !85, size: 32, align: 32, offset: 9376)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !444, file: !10, line: 190, baseType: !85, size: 32, align: 32, offset: 9408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !444, file: !10, line: 191, baseType: !154, size: 32, align: 32, offset: 9440)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !444, file: !10, line: 192, baseType: !484, size: 7584, align: 32, offset: 9472)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !10, line: 99, baseType: !485)
!485 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 63, size: 7584, align: 32, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !485, file: !10, line: 65, baseType: !154, size: 32, align: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !485, file: !10, line: 66, baseType: !85, size: 32, align: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !485, file: !10, line: 67, baseType: !85, size: 32, align: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !485, file: !10, line: 68, baseType: !85, size: 32, align: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !485, file: !10, line: 69, baseType: !154, size: 32, align: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !485, file: !10, line: 70, baseType: !154, size: 32, align: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !485, file: !10, line: 71, baseType: !154, size: 32, align: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !485, file: !10, line: 72, baseType: !85, size: 32, align: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !485, file: !10, line: 73, baseType: !154, size: 32, align: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !485, file: !10, line: 74, baseType: !154, size: 32, align: 32, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !485, file: !10, line: 75, baseType: !85, size: 32, align: 32, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !485, file: !10, line: 76, baseType: !85, size: 32, align: 32, offset: 352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !485, file: !10, line: 77, baseType: !85, size: 32, align: 32, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !485, file: !10, line: 78, baseType: !154, size: 32, align: 32, offset: 416)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !485, file: !10, line: 79, baseType: !85, size: 32, align: 32, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !485, file: !10, line: 80, baseType: !85, size: 32, align: 32, offset: 480)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !485, file: !10, line: 81, baseType: !154, size: 32, align: 32, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !485, file: !10, line: 82, baseType: !85, size: 32, align: 32, offset: 544)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !485, file: !10, line: 83, baseType: !85, size: 32, align: 32, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !485, file: !10, line: 84, baseType: !154, size: 32, align: 32, offset: 608)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !485, file: !10, line: 85, baseType: !154, size: 32, align: 32, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !485, file: !10, line: 86, baseType: !509, size: 3296, align: 32, offset: 672)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !10, line: 60, baseType: !510)
!510 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 48, size: 3296, align: 32, elements: !511)
!511 = !{!512, !513, !514, !515, !519, !520, !521, !522, !523, !524}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !510, file: !10, line: 50, baseType: !85, size: 32, align: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !510, file: !10, line: 51, baseType: !85, size: 32, align: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !510, file: !10, line: 52, baseType: !85, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !510, file: !10, line: 53, baseType: !516, size: 1024, align: 32, offset: 96)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1024, align: 32, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !510, file: !10, line: 54, baseType: !516, size: 1024, align: 32, offset: 1120)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !510, file: !10, line: 55, baseType: !516, size: 1024, align: 32, offset: 2144)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !510, file: !10, line: 56, baseType: !85, size: 32, align: 32, offset: 3168)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !510, file: !10, line: 57, baseType: !85, size: 32, align: 32, offset: 3200)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !510, file: !10, line: 58, baseType: !85, size: 32, align: 32, offset: 3232)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !510, file: !10, line: 59, baseType: !85, size: 32, align: 32, offset: 3264)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !485, file: !10, line: 87, baseType: !154, size: 32, align: 32, offset: 3968)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !485, file: !10, line: 88, baseType: !509, size: 3296, align: 32, offset: 4000)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !485, file: !10, line: 90, baseType: !154, size: 32, align: 32, offset: 7296)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !485, file: !10, line: 91, baseType: !154, size: 32, align: 32, offset: 7328)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !485, file: !10, line: 92, baseType: !154, size: 32, align: 32, offset: 7360)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !485, file: !10, line: 93, baseType: !85, size: 32, align: 32, offset: 7392)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !485, file: !10, line: 94, baseType: !85, size: 32, align: 32, offset: 7424)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !485, file: !10, line: 95, baseType: !85, size: 32, align: 32, offset: 7456)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !485, file: !10, line: 96, baseType: !85, size: 32, align: 32, offset: 7488)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !485, file: !10, line: 97, baseType: !85, size: 32, align: 32, offset: 7520)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !485, file: !10, line: 98, baseType: !85, size: 32, align: 32, offset: 7552)
!536 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !26, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!537 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !26, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!538 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !539, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!540 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !539, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!541 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !542, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!543 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !26, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!544 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !26, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!545 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !26, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!546 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !26, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!547 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !34, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!548 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !34, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!549 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !106, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!550 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !106, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!551 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !34, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!552 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !106, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!553 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !34, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!554 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !106, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!555 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !109, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!556 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !110, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!557 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !120, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!558 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !120, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!559 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !26, isLocal: false, isDefinition: true, variable: i32* @intras)
!560 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !26, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!561 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !26, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!562 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !26, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!563 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !26, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!564 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !26, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!565 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !26, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!566 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !26, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!567 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !568, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 2400, align: 8, elements: !570)
!569 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!570 = !{!571}
!571 = !DISubrange(count: 300)
!572 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !573, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, align: 32, elements: !574)
!574 = !{!575, !575}
!575 = !DISubrange(count: 16)
!576 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !573, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!577 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !573, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!578 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !573, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!579 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !573, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!580 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !573, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!581 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !582, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24576, align: 32, elements: !583)
!583 = !{!312, !575, !575}
!584 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !585, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1024, align: 32, elements: !586)
!586 = !{!317, !146, !146}
!587 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !585, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!588 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !585, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!589 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !585, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!590 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !591, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 32, elements: !592)
!592 = !{!146, !146}
!593 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !594, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, align: 32, elements: !595)
!595 = !{!575}
!596 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !597, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !599)
!599 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !599, file: !4, line: 1184, baseType: !26, size: 32, align: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !599, file: !4, line: 1185, baseType: !26, size: 32, align: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !599, file: !4, line: 1186, baseType: !26, size: 32, align: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !599, file: !4, line: 1187, baseType: !26, size: 32, align: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !599, file: !4, line: 1188, baseType: !26, size: 32, align: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !599, file: !4, line: 1189, baseType: !26, size: 32, align: 32, offset: 160)
!607 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !608, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !611)
!611 = !{!612, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !631, !632, !633, !634, !636, !637, !638, !639, !640, !641, !642}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !610, file: !4, line: 1147, baseType: !613, size: 64, align: 64)
!613 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !610, file: !4, line: 1149, baseType: !573, size: 8192, align: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !610, file: !4, line: 1150, baseType: !573, size: 8192, align: 32, offset: 8256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !610, file: !4, line: 1150, baseType: !573, size: 8192, align: 32, offset: 16448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !610, file: !4, line: 1151, baseType: !542, size: 64, align: 64, offset: 24640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !610, file: !4, line: 1152, baseType: !539, size: 64, align: 64, offset: 24704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !610, file: !4, line: 1153, baseType: !26, size: 32, align: 32, offset: 24768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !610, file: !4, line: 1155, baseType: !26, size: 32, align: 32, offset: 24800)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !610, file: !4, line: 1157, baseType: !144, size: 128, align: 32, offset: 24832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !610, file: !4, line: 1157, baseType: !144, size: 128, align: 32, offset: 24960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !610, file: !4, line: 1158, baseType: !397, size: 64, align: 64, offset: 25088)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !610, file: !4, line: 1159, baseType: !594, size: 512, align: 32, offset: 25152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !610, file: !4, line: 1160, baseType: !26, size: 32, align: 32, offset: 25664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !610, file: !4, line: 1161, baseType: !74, size: 64, align: 64, offset: 25728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !610, file: !4, line: 1162, baseType: !26, size: 32, align: 32, offset: 25792)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !610, file: !4, line: 1163, baseType: !629, size: 64, align: 64, offset: 25856)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !610, file: !4, line: 1164, baseType: !629, size: 64, align: 64, offset: 25920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !610, file: !4, line: 1165, baseType: !629, size: 64, align: 64, offset: 25984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !610, file: !4, line: 1166, baseType: !629, size: 64, align: 64, offset: 26048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !610, file: !4, line: 1167, baseType: !635, size: 512, align: 16, offset: 26112)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 16, elements: !586)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !610, file: !4, line: 1168, baseType: !26, size: 32, align: 32, offset: 26624)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !610, file: !4, line: 1169, baseType: !26, size: 32, align: 32, offset: 26656)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !610, file: !4, line: 1171, baseType: !26, size: 32, align: 32, offset: 26688)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !610, file: !4, line: 1172, baseType: !26, size: 32, align: 32, offset: 26720)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !610, file: !4, line: 1174, baseType: !26, size: 32, align: 32, offset: 26752)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !610, file: !4, line: 1175, baseType: !26, size: 32, align: 32, offset: 26784)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !610, file: !4, line: 1176, baseType: !26, size: 32, align: 32, offset: 26816)
!643 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !609, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!644 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !609, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!645 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !609, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!646 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !609, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!647 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !648, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !650, line: 153, baseType: !651)
!650 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !650, line: 122, size: 1216, align: 64, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !663, !664, !665, !669, !674, !683, !689, !690, !693, !694, !696, !700, !701, !702}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !651, file: !650, line: 123, baseType: !36, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !651, file: !650, line: 124, baseType: !26, size: 32, align: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !651, file: !650, line: 125, baseType: !26, size: 32, align: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !651, file: !650, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !651, file: !650, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !651, file: !650, line: 128, baseType: !659, size: 128, align: 64, offset: 192)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !650, line: 88, size: 128, align: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !659, file: !650, line: 89, baseType: !36, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !659, file: !650, line: 90, baseType: !26, size: 32, align: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !651, file: !650, line: 129, baseType: !26, size: 32, align: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !651, file: !650, line: 132, baseType: !21, size: 64, align: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !651, file: !650, line: 133, baseType: !666, size: 64, align: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!26, !21}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !651, file: !650, line: 134, baseType: !670, size: 64, align: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!26, !21, !673, !26}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !651, file: !650, line: 135, baseType: !675, size: 64, align: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!678, !21, !678, !26}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !650, line: 77, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !680, line: 71, baseType: !681)
!680 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !682, line: 46, baseType: !77)
!682 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !651, file: !650, line: 136, baseType: !684, size: 64, align: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!26, !21, !687, !26}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !651, file: !650, line: 139, baseType: !659, size: 128, align: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !651, file: !650, line: 140, baseType: !691, size: 64, align: 64, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !650, line: 94, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !651, file: !650, line: 141, baseType: !26, size: 32, align: 32, offset: 896)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !651, file: !650, line: 144, baseType: !695, size: 24, align: 8, offset: 928)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !331)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !651, file: !650, line: 145, baseType: !697, size: 8, align: 8, offset: 952)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 1)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !651, file: !650, line: 148, baseType: !659, size: 128, align: 64, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !651, file: !650, line: 151, baseType: !26, size: 32, align: 32, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !651, file: !650, line: 152, baseType: !678, size: 64, align: 64, offset: 1152)
!703 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !648, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!704 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !648, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!705 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !26, isLocal: false, isDefinition: true, variable: i32* @p_in)
!706 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !26, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!707 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !708, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 640, align: 32, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 20)
!711 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !708, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!712 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !708, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!713 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !708, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!714 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !708, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!715 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !708, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!716 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !26, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!717 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !26, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!718 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !26, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!719 = !DIGlobalVariable(name: "out_buffer", scope: !0, file: !1, line: 32, type: !170, isLocal: false, isDefinition: true, variable: %struct.frame_store** @out_buffer)
!720 = !{i32 2, !"Dwarf Version", i32 2}
!721 = !{i32 2, !"Debug Info Version", i32 700000003}
!722 = !{i32 1, !"PIC Level", i32 2}
!723 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!724 = !DIExpression()
!725 = !DILocation(line: 46, column: 9, scope: !23)
!726 = !DILocation(line: 47, column: 9, scope: !23)
!727 = !DIExpression(DW_OP_bit_piece, 0, 8)
!728 = !DIExpression(DW_OP_bit_piece, 8, 8)
!729 = !DILocation(line: 53, column: 3, scope: !23)
!730 = !DILocation(line: 79, column: 24, scope: !31)
!731 = !DILocation(line: 79, column: 45, scope: !31)
!732 = !DILocation(line: 79, column: 54, scope: !31)
!733 = !DILocation(line: 79, column: 66, scope: !31)
!734 = !DILocation(line: 79, column: 78, scope: !31)
!735 = !DILocation(line: 79, column: 104, scope: !31)
!736 = !DILocation(line: 79, column: 119, scope: !31)
!737 = !DILocation(line: 79, column: 135, scope: !31)
!738 = !DILocation(line: 79, column: 149, scope: !31)
!739 = !DILocation(line: 83, column: 24, scope: !31)
!740 = !DILocation(line: 83, column: 36, scope: !31)
!741 = !DILocation(line: 83, column: 7, scope: !31)
!742 = !DILocation(line: 84, column: 7, scope: !31)
!743 = !DILocation(line: 86, column: 7, scope: !31)
!744 = !DILocation(line: 150, column: 27, scope: !745)
