; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parset.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }
%struct.pic_parameter_set_rbsp_t = type { i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, [8 x i32], [8 x i32], [8 x i32], i32, i32, i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !21, globals: !356, imports: !167)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parset.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8, !14}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 111, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!12 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!13 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 178, size: 32, align: 32, elements: !15)
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "UVLC", value: 0)
!17 = !DIEnumerator(name: "CABAC", value: 1)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !166, !168, !191, !200, !219, !232, !322, !334, !346, !349, !350}
!22 = !DISubprogram(name: "GenerateParameterSets", scope: !1, file: !1, line: 60, type: !23, isLocal: false, isDefinition: true, scopeLine: 61, isOptimized: true, function: void ()* @GenerateParameterSets, variables: !25)
!23 = !DISubroutineType(types: !24)
!24 = !{null}
!25 = !{!26, !126}
!26 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sps", scope: !22, file: !1, line: 62, type: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !30)
!30 = !{!31, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !29, file: !4, line: 151, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !29, file: !4, line: 153, baseType: !20, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !29, file: !4, line: 154, baseType: !32, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !29, file: !4, line: 155, baseType: !32, size: 32, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !29, file: !4, line: 156, baseType: !32, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !29, file: !4, line: 157, baseType: !32, size: 32, align: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !29, file: !4, line: 158, baseType: !20, size: 32, align: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !29, file: !4, line: 159, baseType: !20, size: 32, align: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !29, file: !4, line: 160, baseType: !20, size: 32, align: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !29, file: !4, line: 162, baseType: !32, size: 32, align: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !29, file: !4, line: 163, baseType: !43, size: 256, align: 32, offset: 320)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 256, align: 32, elements: !45)
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !{!46}
!46 = !DISubrange(count: 8)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !29, file: !4, line: 165, baseType: !20, size: 32, align: 32, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !29, file: !4, line: 166, baseType: !20, size: 32, align: 32, offset: 608)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !29, file: !4, line: 167, baseType: !20, size: 32, align: 32, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !29, file: !4, line: 168, baseType: !20, size: 32, align: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !29, file: !4, line: 170, baseType: !20, size: 32, align: 32, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !29, file: !4, line: 172, baseType: !32, size: 32, align: 32, offset: 736)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !29, file: !4, line: 173, baseType: !44, size: 32, align: 32, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !29, file: !4, line: 174, baseType: !44, size: 32, align: 32, offset: 800)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !29, file: !4, line: 175, baseType: !20, size: 32, align: 32, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !29, file: !4, line: 177, baseType: !57, size: 8192, align: 32, offset: 864)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8192, align: 32, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !29, file: !4, line: 178, baseType: !20, size: 32, align: 32, offset: 9056)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !29, file: !4, line: 179, baseType: !32, size: 32, align: 32, offset: 9088)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !29, file: !4, line: 180, baseType: !20, size: 32, align: 32, offset: 9120)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !29, file: !4, line: 181, baseType: !20, size: 32, align: 32, offset: 9152)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !29, file: !4, line: 182, baseType: !32, size: 32, align: 32, offset: 9184)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !29, file: !4, line: 184, baseType: !32, size: 32, align: 32, offset: 9216)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !29, file: !4, line: 185, baseType: !32, size: 32, align: 32, offset: 9248)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !29, file: !4, line: 186, baseType: !32, size: 32, align: 32, offset: 9280)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !29, file: !4, line: 187, baseType: !20, size: 32, align: 32, offset: 9312)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !29, file: !4, line: 188, baseType: !20, size: 32, align: 32, offset: 9344)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !29, file: !4, line: 189, baseType: !20, size: 32, align: 32, offset: 9376)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !29, file: !4, line: 190, baseType: !20, size: 32, align: 32, offset: 9408)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !29, file: !4, line: 191, baseType: !32, size: 32, align: 32, offset: 9440)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !29, file: !4, line: 192, baseType: !74, size: 7584, align: 32, offset: 9472)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !75, file: !4, line: 65, baseType: !32, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !75, file: !4, line: 66, baseType: !20, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !75, file: !4, line: 67, baseType: !20, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !75, file: !4, line: 68, baseType: !20, size: 32, align: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !75, file: !4, line: 69, baseType: !32, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !75, file: !4, line: 70, baseType: !32, size: 32, align: 32, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !75, file: !4, line: 71, baseType: !32, size: 32, align: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !75, file: !4, line: 72, baseType: !20, size: 32, align: 32, offset: 224)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !75, file: !4, line: 73, baseType: !32, size: 32, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !75, file: !4, line: 74, baseType: !32, size: 32, align: 32, offset: 288)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !75, file: !4, line: 75, baseType: !20, size: 32, align: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !75, file: !4, line: 76, baseType: !20, size: 32, align: 32, offset: 352)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !75, file: !4, line: 77, baseType: !20, size: 32, align: 32, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !75, file: !4, line: 78, baseType: !32, size: 32, align: 32, offset: 416)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !75, file: !4, line: 79, baseType: !20, size: 32, align: 32, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !75, file: !4, line: 80, baseType: !20, size: 32, align: 32, offset: 480)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !75, file: !4, line: 81, baseType: !32, size: 32, align: 32, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !75, file: !4, line: 82, baseType: !20, size: 32, align: 32, offset: 544)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !75, file: !4, line: 83, baseType: !20, size: 32, align: 32, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !75, file: !4, line: 84, baseType: !32, size: 32, align: 32, offset: 608)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !75, file: !4, line: 85, baseType: !32, size: 32, align: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !75, file: !4, line: 86, baseType: !99, size: 3296, align: 32, offset: 672)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !101)
!101 = !{!102, !103, !104, !105, !109, !110, !111, !112, !113, !114}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !100, file: !4, line: 50, baseType: !20, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !100, file: !4, line: 51, baseType: !20, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !100, file: !4, line: 52, baseType: !20, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !100, file: !4, line: 53, baseType: !106, size: 1024, align: 32, offset: 96)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, align: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !100, file: !4, line: 54, baseType: !106, size: 1024, align: 32, offset: 1120)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !100, file: !4, line: 55, baseType: !106, size: 1024, align: 32, offset: 2144)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !100, file: !4, line: 56, baseType: !20, size: 32, align: 32, offset: 3168)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !100, file: !4, line: 57, baseType: !20, size: 32, align: 32, offset: 3200)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !100, file: !4, line: 58, baseType: !20, size: 32, align: 32, offset: 3232)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !100, file: !4, line: 59, baseType: !20, size: 32, align: 32, offset: 3264)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !75, file: !4, line: 87, baseType: !32, size: 32, align: 32, offset: 3968)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !75, file: !4, line: 88, baseType: !99, size: 3296, align: 32, offset: 4000)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !75, file: !4, line: 90, baseType: !32, size: 32, align: 32, offset: 7296)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !75, file: !4, line: 91, baseType: !32, size: 32, align: 32, offset: 7328)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !75, file: !4, line: 92, baseType: !32, size: 32, align: 32, offset: 7360)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !75, file: !4, line: 93, baseType: !20, size: 32, align: 32, offset: 7392)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !75, file: !4, line: 94, baseType: !20, size: 32, align: 32, offset: 7424)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !75, file: !4, line: 95, baseType: !20, size: 32, align: 32, offset: 7456)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !75, file: !4, line: 96, baseType: !20, size: 32, align: 32, offset: 7488)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !75, file: !4, line: 97, baseType: !20, size: 32, align: 32, offset: 7520)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !75, file: !4, line: 98, baseType: !20, size: 32, align: 32, offset: 7552)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pps", scope: !22, file: !1, line: 63, type: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !143, !144, !145, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !129, file: !4, line: 105, baseType: !32, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !129, file: !4, line: 106, baseType: !20, size: 32, align: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !129, file: !4, line: 107, baseType: !20, size: 32, align: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !129, file: !4, line: 108, baseType: !32, size: 32, align: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !129, file: !4, line: 110, baseType: !32, size: 32, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !129, file: !4, line: 111, baseType: !32, size: 32, align: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !129, file: !4, line: 112, baseType: !43, size: 256, align: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !129, file: !4, line: 115, baseType: !32, size: 32, align: 32, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !129, file: !4, line: 116, baseType: !20, size: 32, align: 32, offset: 480)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !129, file: !4, line: 117, baseType: !20, size: 32, align: 32, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !129, file: !4, line: 119, baseType: !142, size: 256, align: 32, offset: 544)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, align: 32, elements: !45)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !129, file: !4, line: 121, baseType: !142, size: 256, align: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !129, file: !4, line: 122, baseType: !142, size: 256, align: 32, offset: 1056)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !129, file: !4, line: 124, baseType: !32, size: 32, align: 32, offset: 1312)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !129, file: !4, line: 125, baseType: !20, size: 32, align: 32, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !129, file: !4, line: 127, baseType: !20, size: 32, align: 32, offset: 1376)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !129, file: !4, line: 128, baseType: !149, size: 64, align: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !151, line: 30, baseType: !152)
!151 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!152 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !129, file: !4, line: 130, baseType: !44, size: 32, align: 32, offset: 1472)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !129, file: !4, line: 131, baseType: !44, size: 32, align: 32, offset: 1504)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !129, file: !4, line: 132, baseType: !32, size: 32, align: 32, offset: 1536)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !129, file: !4, line: 133, baseType: !20, size: 32, align: 32, offset: 1568)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !129, file: !4, line: 134, baseType: !44, size: 32, align: 32, offset: 1600)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !129, file: !4, line: 135, baseType: !44, size: 32, align: 32, offset: 1632)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !129, file: !4, line: 136, baseType: !44, size: 32, align: 32, offset: 1664)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !129, file: !4, line: 138, baseType: !44, size: 32, align: 32, offset: 1696)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !129, file: !4, line: 139, baseType: !44, size: 32, align: 32, offset: 1728)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !129, file: !4, line: 141, baseType: !32, size: 32, align: 32, offset: 1760)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !129, file: !4, line: 142, baseType: !32, size: 32, align: 32, offset: 1792)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !129, file: !4, line: 143, baseType: !32, size: 32, align: 32, offset: 1824)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !129, file: !4, line: 144, baseType: !32, size: 32, align: 32, offset: 1856)
!166 = !DISubprogram(name: "FreeParameterSets", scope: !1, file: !1, line: 119, type: !23, isLocal: false, isDefinition: true, scopeLine: 120, isOptimized: true, function: void ()* @FreeParameterSets, variables: !167)
!167 = !{}
!168 = !DISubprogram(name: "GenerateSeq_parameter_set_NALU", scope: !1, file: !1, line: 141, type: !169, isLocal: false, isDefinition: true, scopeLine: 142, isOptimized: true, function: %struct.NALU_t* ()* @GenerateSeq_parameter_set_NALU, variables: !183)
!169 = !DISubroutineType(types: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALU_t", file: !173, line: 49, baseType: !174)
!173 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalucommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!174 = !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 40, size: 256, align: 64, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "startcodeprefix_len", scope: !174, file: !173, line: 42, baseType: !44, size: 32, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !174, file: !173, line: 43, baseType: !20, size: 32, align: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !174, file: !173, line: 44, baseType: !20, size: 32, align: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !174, file: !173, line: 45, baseType: !44, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !174, file: !173, line: 46, baseType: !44, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_bit", scope: !174, file: !173, line: 47, baseType: !44, size: 32, align: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !174, file: !173, line: 48, baseType: !149, size: 64, align: 64, offset: 192)
!183 = !{!184, !185, !186, !187}
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !168, file: !1, line: 143, type: !171)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RBSPlen", scope: !168, file: !1, line: 144, type: !44)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NALUlen", scope: !168, file: !1, line: 145, type: !44)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbsp", scope: !168, file: !1, line: 146, type: !188)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512000, align: 8, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 64000)
!191 = !DISubprogram(name: "GeneratePic_parameter_set_NALU", scope: !1, file: !1, line: 171, type: !192, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: %struct.NALU_t* (i32)* @GeneratePic_parameter_set_NALU, variables: !194)
!192 = !DISubroutineType(types: !193)
!193 = !{!171, !44}
!194 = !{!195, !196, !197, !198, !199}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "PPS_id", arg: 1, scope: !191, file: !1, line: 171, type: !44)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !191, file: !1, line: 173, type: !171)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RBSPlen", scope: !191, file: !1, line: 174, type: !44)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NALUlen", scope: !191, file: !1, line: 175, type: !44)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rbsp", scope: !191, file: !1, line: 176, type: !188)
!200 = !DISubprogram(name: "GenerateSequenceParameterSet", scope: !1, file: !1, line: 203, type: !201, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.seq_parameter_set_rbsp_t*, i32)* @GenerateSequenceParameterSet, variables: !203)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !27, !44}
!203 = !{!204, !205, !206, !207, !211, !212, !213, !215, !216, !217, !218}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sps", arg: 1, scope: !200, file: !1, line: 203, type: !27)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SPS_id", arg: 2, scope: !200, file: !1, line: 203, type: !44)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !200, file: !1, line: 205, type: !20)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SubWidthC", scope: !200, file: !1, line: 206, type: !208)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, align: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SubHeightC", scope: !200, file: !1, line: 207, type: !208)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frext_profile", scope: !200, file: !1, line: 209, type: !44)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PicWidthInMbs", scope: !214, file: !1, line: 281, type: !44)
!214 = distinct !DILexicalBlock(scope: !200, file: !1, line: 280, column: 3)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PicHeightInMapUnits", scope: !214, file: !1, line: 281, type: !44)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "FrameHeightInMbs", scope: !214, file: !1, line: 281, type: !44)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "width", scope: !214, file: !1, line: 282, type: !44)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "height", scope: !214, file: !1, line: 282, type: !44)
!219 = !DISubprogram(name: "GeneratePictureParameterSet", scope: !1, file: !1, line: 361, type: !220, isLocal: false, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pic_parameter_set_rbsp_t*, %struct.seq_parameter_set_rbsp_t*, i32, i32, i32, i32, i32)* @GeneratePictureParameterSet, variables: !222)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !127, !27, !44, !44, !44, !44, !44}
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231}
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 1, scope: !219, file: !1, line: 361, type: !127)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sps", arg: 2, scope: !219, file: !1, line: 361, type: !27)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "PPS_id", arg: 3, scope: !219, file: !1, line: 361, type: !44)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "WeightedPrediction", arg: 4, scope: !219, file: !1, line: 362, type: !44)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "WeightedBiprediction", arg: 5, scope: !219, file: !1, line: 362, type: !44)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cb_qp_index_offset", arg: 6, scope: !219, file: !1, line: 363, type: !44)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr_qp_index_offset", arg: 7, scope: !219, file: !1, line: 363, type: !44)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !219, file: !1, line: 365, type: !20)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frext_profile", scope: !219, file: !1, line: 367, type: !44)
!232 = !DISubprogram(name: "Scaling_List", scope: !1, file: !1, line: 509, type: !233, isLocal: false, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16*, i16*, i32, i16*, %struct.datapartition*)* @Scaling_List, variables: !310)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !235, !235, !44, !235, !237}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !240)
!240 = !{!241, !257, !282}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !239, file: !9, line: 433, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !244, file: !9, line: 413, baseType: !44, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !244, file: !9, line: 414, baseType: !44, size: 32, align: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !244, file: !9, line: 415, baseType: !150, size: 8, align: 8, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !244, file: !9, line: 416, baseType: !44, size: 32, align: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !244, file: !9, line: 417, baseType: !44, size: 32, align: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !244, file: !9, line: 418, baseType: !150, size: 8, align: 8, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !244, file: !9, line: 420, baseType: !150, size: 8, align: 8, offset: 168)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !244, file: !9, line: 421, baseType: !44, size: 32, align: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !244, file: !9, line: 422, baseType: !44, size: 32, align: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !244, file: !9, line: 424, baseType: !149, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !244, file: !9, line: 425, baseType: !44, size: 32, align: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !239, file: !9, line: 434, baseType: !258, size: 832, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !259)
!259 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !259, file: !9, line: 209, baseType: !20, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !259, file: !9, line: 209, baseType: !20, size: 32, align: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !259, file: !9, line: 210, baseType: !20, size: 32, align: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !259, file: !9, line: 211, baseType: !20, size: 32, align: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !259, file: !9, line: 212, baseType: !20, size: 32, align: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !259, file: !9, line: 213, baseType: !149, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !259, file: !9, line: 214, baseType: !268, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !259, file: !9, line: 217, baseType: !20, size: 32, align: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !259, file: !9, line: 217, baseType: !20, size: 32, align: 32, offset: 352)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !259, file: !9, line: 218, baseType: !20, size: 32, align: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !259, file: !9, line: 219, baseType: !20, size: 32, align: 32, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !259, file: !9, line: 220, baseType: !20, size: 32, align: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !259, file: !9, line: 221, baseType: !149, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !259, file: !9, line: 222, baseType: !268, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !259, file: !9, line: 223, baseType: !44, size: 32, align: 32, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !259, file: !9, line: 223, baseType: !44, size: 32, align: 32, offset: 672)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !259, file: !9, line: 224, baseType: !44, size: 32, align: 32, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !259, file: !9, line: 224, baseType: !44, size: 32, align: 32, offset: 736)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !259, file: !9, line: 225, baseType: !44, size: 32, align: 32, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !259, file: !9, line: 225, baseType: !44, size: 32, align: 32, offset: 800)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !239, file: !9, line: 436, baseType: !283, size: 64, align: 64, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!44, !286, !309}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !302}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !9, line: 329, baseType: !44, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !288, file: !9, line: 330, baseType: !44, size: 32, align: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !288, file: !9, line: 331, baseType: !44, size: 32, align: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !288, file: !9, line: 332, baseType: !44, size: 32, align: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !288, file: !9, line: 333, baseType: !44, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !288, file: !9, line: 334, baseType: !20, size: 32, align: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !288, file: !9, line: 335, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !288, file: !9, line: 336, baseType: !44, size: 32, align: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !288, file: !9, line: 344, baseType: !299, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !44, !44, !268, !268}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !288, file: !9, line: 346, baseType: !303, size: 64, align: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !307}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scalingListinput", arg: 1, scope: !232, file: !1, line: 509, type: !235)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scalingList", arg: 2, scope: !232, file: !1, line: 509, type: !235)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sizeOfScalingList", arg: 3, scope: !232, file: !1, line: 509, type: !44)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "UseDefaultScalingMatrix", arg: 4, scope: !232, file: !1, line: 509, type: !235)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "partition", arg: 5, scope: !232, file: !1, line: 509, type: !237)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !232, file: !1, line: 511, type: !44)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scanj", scope: !232, file: !1, line: 511, type: !44)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !232, file: !1, line: 512, type: !44)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta_scale", scope: !232, file: !1, line: 513, type: !44)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastScale", scope: !232, file: !1, line: 513, type: !44)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nextScale", scope: !232, file: !1, line: 513, type: !44)
!322 = !DISubprogram(name: "GenerateSeq_parameter_set_rbsp", scope: !1, file: !1, line: 561, type: !323, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.seq_parameter_set_rbsp_t*, i8*)* @GenerateSeq_parameter_set_rbsp, variables: !327)
!323 = !DISubroutineType(types: !324)
!324 = !{!44, !27, !325}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!327 = !{!328, !329, !330, !331, !332, !333}
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sps", arg: 1, scope: !322, file: !1, line: 561, type: !27)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rbsp", arg: 2, scope: !322, file: !1, line: 561, type: !325)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !322, file: !1, line: 563, type: !237)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !322, file: !1, line: 564, type: !44)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LenInBytes", scope: !322, file: !1, line: 564, type: !44)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !322, file: !1, line: 565, type: !20)
!334 = !DISubprogram(name: "GeneratePic_parameter_set_rbsp", scope: !1, file: !1, line: 689, type: !335, isLocal: false, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pic_parameter_set_rbsp_t*, i8*)* @GeneratePic_parameter_set_rbsp, variables: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!44, !127, !325}
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345}
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pps", arg: 1, scope: !334, file: !1, line: 689, type: !127)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rbsp", arg: 2, scope: !334, file: !1, line: 689, type: !325)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partition", scope: !334, file: !1, line: 691, type: !237)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !334, file: !1, line: 692, type: !44)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LenInBytes", scope: !334, file: !1, line: 692, type: !44)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !334, file: !1, line: 693, type: !20)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NumberBitsPerSliceGroupId", scope: !334, file: !1, line: 694, type: !20)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "profile_idc", scope: !334, file: !1, line: 695, type: !44)
!346 = !DISubprogram(name: "IdentifyProfile", scope: !1, file: !1, line: 834, type: !347, isLocal: true, isDefinition: true, scopeLine: 835, isOptimized: true, variables: !167)
!347 = !DISubroutineType(types: !348)
!348 = !{!44}
!349 = !DISubprogram(name: "IdentifyLevel", scope: !1, file: !1, line: 852, type: !347, isLocal: true, isDefinition: true, scopeLine: 853, isOptimized: true, variables: !167)
!350 = !DISubprogram(name: "GenerateVUISequenceParameters", scope: !1, file: !1, line: 867, type: !351, isLocal: true, isDefinition: true, scopeLine: 868, flags: DIFlagPrototyped, isOptimized: true, variables: !353)
!351 = !DISubroutineType(types: !352)
!352 = !{!44, !237}
!353 = !{!354, !355}
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "partition", arg: 1, scope: !350, file: !1, line: 867, type: !237)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !350, file: !1, line: 869, type: !44)
!356 = !{!357, !472, !473, !474, !475, !476, !479, !481, !483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !511, !512, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !531, !532, !533, !534, !535, !536, !539, !542, !543, !544, !545, !548, !551, !562, !603, !604, !605, !606, !607, !663, !664, !665, !666, !667, !671, !672, !673, !674, !675, !676, !677, !678, !679, !684, !686, !688, !691}
!357 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !358, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !361)
!361 = !{!362, !363, !364, !467, !468, !470, !471}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !360, file: !9, line: 477, baseType: !44, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !360, file: !9, line: 478, baseType: !44, size: 32, align: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !360, file: !9, line: 479, baseType: !365, size: 6400, align: 64, offset: 64)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 6400, align: 64, elements: !465)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !414, !441, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !368, file: !9, line: 445, baseType: !44, size: 32, align: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !368, file: !9, line: 446, baseType: !44, size: 32, align: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !368, file: !9, line: 447, baseType: !44, size: 32, align: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !368, file: !9, line: 448, baseType: !44, size: 32, align: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !368, file: !9, line: 449, baseType: !44, size: 32, align: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !368, file: !9, line: 450, baseType: !44, size: 32, align: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !368, file: !9, line: 451, baseType: !237, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !368, file: !9, line: 452, baseType: !378, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !381)
!381 = !{!382, !395, !400, !404, !408, !410, !411}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !380, file: !9, line: 260, baseType: !383, size: 4224, align: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 4224, align: 64, elements: !392)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !385)
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !386)
!386 = !{!387, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !9, line: 233, baseType: !388, size: 16, align: 16)
!388 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !385, file: !9, line: 234, baseType: !152, size: 8, align: 8, offset: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !385, file: !9, line: 236, baseType: !391, size: 64, align: 64, offset: 64)
!391 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!392 = !{!393, !394}
!393 = !DISubrange(count: 3)
!394 = !DISubrange(count: 11)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !380, file: !9, line: 261, baseType: !396, size: 2304, align: 64, offset: 4224)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 2304, align: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DISubrange(count: 2)
!399 = !DISubrange(count: 9)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !380, file: !9, line: 262, baseType: !401, size: 2560, align: 64, offset: 6528)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 2560, align: 64, elements: !402)
!402 = !{!398, !403}
!403 = !DISubrange(count: 10)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !380, file: !9, line: 263, baseType: !405, size: 1536, align: 64, offset: 9088)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 1536, align: 64, elements: !406)
!406 = !{!398, !407}
!407 = !DISubrange(count: 6)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !380, file: !9, line: 264, baseType: !409, size: 512, align: 64, offset: 10624)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 512, align: 64, elements: !209)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !380, file: !9, line: 265, baseType: !409, size: 512, align: 64, offset: 11136)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !380, file: !9, line: 266, baseType: !412, size: 384, align: 64, offset: 11648)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 384, align: 64, elements: !413)
!413 = !{!393}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !368, file: !9, line: 453, baseType: !415, size: 64, align: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !418)
!418 = !{!419, !422, !423, !426, !429, !433, !434, !438, !439, !440}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !417, file: !9, line: 283, baseType: !420, size: 256, align: 64)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 256, align: 64, elements: !421)
!421 = !{!398}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !417, file: !9, line: 284, baseType: !409, size: 512, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !417, file: !9, line: 285, baseType: !424, size: 1536, align: 64, offset: 768)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 1536, align: 64, elements: !425)
!425 = !{!393, !210}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !417, file: !9, line: 286, baseType: !427, size: 5120, align: 64, offset: 2304)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 5120, align: 64, elements: !428)
!428 = !{!403, !210}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !417, file: !9, line: 287, baseType: !430, size: 19200, align: 64, offset: 7424)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 19200, align: 64, elements: !431)
!431 = !{!403, !432}
!432 = !DISubrange(count: 15)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !417, file: !9, line: 288, baseType: !430, size: 19200, align: 64, offset: 26624)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !417, file: !9, line: 289, baseType: !435, size: 6400, align: 64, offset: 45824)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 6400, align: 64, elements: !436)
!436 = !{!403, !437}
!437 = !DISubrange(count: 5)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !417, file: !9, line: 290, baseType: !435, size: 6400, align: 64, offset: 52224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !417, file: !9, line: 291, baseType: !430, size: 19200, align: 64, offset: 58624)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !417, file: !9, line: 292, baseType: !430, size: 19200, align: 64, offset: 77824)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !368, file: !9, line: 456, baseType: !442, size: 64, align: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !444, file: !9, line: 310, baseType: !44, size: 32, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !444, file: !9, line: 311, baseType: !44, size: 32, align: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !444, file: !9, line: 312, baseType: !449, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !368, file: !9, line: 458, baseType: !44, size: 32, align: 32, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !368, file: !9, line: 459, baseType: !268, size: 64, align: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !368, file: !9, line: 460, baseType: !268, size: 64, align: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !368, file: !9, line: 461, baseType: !268, size: 64, align: 64, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !368, file: !9, line: 462, baseType: !44, size: 32, align: 32, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !368, file: !9, line: 463, baseType: !268, size: 64, align: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !368, file: !9, line: 464, baseType: !268, size: 64, align: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !368, file: !9, line: 465, baseType: !268, size: 64, align: 64, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !368, file: !9, line: 467, baseType: !459, size: 64, align: 64, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!32, !44}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !368, file: !9, line: 469, baseType: !463, size: 192, align: 32, offset: 1024)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 192, align: 32, elements: !464)
!464 = !{!393, !398}
!465 = !{!466}
!466 = !DISubrange(count: 100)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !360, file: !9, line: 480, baseType: !44, size: 32, align: 32, offset: 6464)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !360, file: !9, line: 481, baseType: !469, size: 32, align: 32, offset: 6496)
!469 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !360, file: !9, line: 482, baseType: !469, size: 32, align: 32, offset: 6528)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !360, file: !9, line: 483, baseType: !469, size: 32, align: 32, offset: 6560)
!472 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !358, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!473 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !358, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!474 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !358, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!475 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !358, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!476 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !477, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!479 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !480, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!481 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !482, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!483 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !20, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!484 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !20, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!485 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !44, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!486 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !44, isLocal: false, isDefinition: true, variable: i32* @me_time)
!487 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !127, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!488 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !27, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!489 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !44, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!490 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !44, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!491 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !492, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!493 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !492, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!494 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !495, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!496 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !44, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!497 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !44, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!498 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !44, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!499 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !44, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!500 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !477, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!501 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !477, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!502 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !480, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!503 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !480, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!504 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !477, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!505 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !480, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!506 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !477, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!507 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !480, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!508 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !509, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!511 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !510, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!512 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !513, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!514 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !513, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!515 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !44, isLocal: false, isDefinition: true, variable: i32* @intras)
!516 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !44, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!517 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !44, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!518 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !44, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!519 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !44, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!520 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !44, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!521 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !44, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!522 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !44, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!523 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !524, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 2400, align: 8, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 300)
!527 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !528, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8192, align: 32, elements: !529)
!529 = !{!530, !530}
!530 = !DISubrange(count: 16)
!531 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !528, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!532 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !528, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!533 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !528, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!534 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !528, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!535 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !528, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!536 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !537, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 24576, align: 32, elements: !538)
!538 = !{!393, !530, !530}
!539 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !540, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, align: 32, elements: !541)
!541 = !{!398, !210, !210}
!542 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !540, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!543 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !540, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!544 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !540, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!545 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !546, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 512, align: 32, elements: !547)
!547 = !{!210, !210}
!548 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !549, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 512, align: 32, elements: !550)
!550 = !{!530}
!551 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !552, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !554, file: !9, line: 1184, baseType: !44, size: 32, align: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !554, file: !9, line: 1185, baseType: !44, size: 32, align: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !554, file: !9, line: 1186, baseType: !44, size: 32, align: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !554, file: !9, line: 1187, baseType: !44, size: 32, align: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !554, file: !9, line: 1188, baseType: !44, size: 32, align: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !554, file: !9, line: 1189, baseType: !44, size: 32, align: 32, offset: 160)
!562 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !563, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !566)
!566 = !{!567, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !586, !587, !591, !592, !593, !594, !596, !597, !598, !599, !600, !601, !602}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !565, file: !9, line: 1147, baseType: !568, size: 64, align: 64)
!568 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !565, file: !9, line: 1149, baseType: !528, size: 8192, align: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !565, file: !9, line: 1150, baseType: !528, size: 8192, align: 32, offset: 8256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !565, file: !9, line: 1150, baseType: !528, size: 8192, align: 32, offset: 16448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !565, file: !9, line: 1151, baseType: !495, size: 64, align: 64, offset: 24640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !565, file: !9, line: 1152, baseType: !492, size: 64, align: 64, offset: 24704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !565, file: !9, line: 1153, baseType: !44, size: 32, align: 32, offset: 24768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !565, file: !9, line: 1155, baseType: !44, size: 32, align: 32, offset: 24800)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !565, file: !9, line: 1157, baseType: !208, size: 128, align: 32, offset: 24832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !565, file: !9, line: 1157, baseType: !208, size: 128, align: 32, offset: 24960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !565, file: !9, line: 1158, baseType: !482, size: 64, align: 64, offset: 25088)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !565, file: !9, line: 1159, baseType: !549, size: 512, align: 32, offset: 25152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !565, file: !9, line: 1160, baseType: !44, size: 32, align: 32, offset: 25664)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !565, file: !9, line: 1161, baseType: !582, size: 64, align: 64, offset: 25728)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !584, line: 30, baseType: !585)
!584 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!585 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !565, file: !9, line: 1162, baseType: !44, size: 32, align: 32, offset: 25792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !565, file: !9, line: 1163, baseType: !588, size: 64, align: 64, offset: 25856)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !565, file: !9, line: 1164, baseType: !588, size: 64, align: 64, offset: 25920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !565, file: !9, line: 1165, baseType: !588, size: 64, align: 64, offset: 25984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !565, file: !9, line: 1166, baseType: !588, size: 64, align: 64, offset: 26048)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !565, file: !9, line: 1167, baseType: !595, size: 512, align: 16, offset: 26112)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 512, align: 16, elements: !541)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !565, file: !9, line: 1168, baseType: !44, size: 32, align: 32, offset: 26624)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !565, file: !9, line: 1169, baseType: !44, size: 32, align: 32, offset: 26656)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !565, file: !9, line: 1171, baseType: !44, size: 32, align: 32, offset: 26688)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !565, file: !9, line: 1172, baseType: !44, size: 32, align: 32, offset: 26720)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !565, file: !9, line: 1174, baseType: !44, size: 32, align: 32, offset: 26752)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !565, file: !9, line: 1175, baseType: !44, size: 32, align: 32, offset: 26784)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !565, file: !9, line: 1176, baseType: !44, size: 32, align: 32, offset: 26816)
!603 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !564, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!604 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !564, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!605 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !564, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!606 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !564, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!607 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !608, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !610, line: 153, baseType: !611)
!610 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !610, line: 122, size: 1216, align: 64, elements: !612)
!612 = !{!613, !615, !616, !617, !618, !619, !624, !625, !626, !630, !634, !643, !649, !650, !653, !654, !656, !660, !661, !662}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !611, file: !610, line: 123, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !611, file: !610, line: 124, baseType: !44, size: 32, align: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !611, file: !610, line: 125, baseType: !44, size: 32, align: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !611, file: !610, line: 126, baseType: !236, size: 16, align: 16, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !611, file: !610, line: 127, baseType: !236, size: 16, align: 16, offset: 144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !611, file: !610, line: 128, baseType: !620, size: 128, align: 64, offset: 192)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !610, line: 88, size: 128, align: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !620, file: !610, line: 89, baseType: !614, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !620, file: !610, line: 90, baseType: !44, size: 32, align: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !611, file: !610, line: 129, baseType: !44, size: 32, align: 32, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !611, file: !610, line: 132, baseType: !19, size: 64, align: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !611, file: !610, line: 133, baseType: !627, size: 64, align: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!44, !19}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !611, file: !610, line: 134, baseType: !631, size: 64, align: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!44, !19, !325, !44}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !611, file: !610, line: 135, baseType: !635, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!638, !19, !638, !44}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !610, line: 77, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !640, line: 71, baseType: !641)
!640 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !642, line: 46, baseType: !585)
!642 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !611, file: !610, line: 136, baseType: !644, size: 64, align: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!44, !19, !647, !44}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !611, file: !610, line: 139, baseType: !620, size: 128, align: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !611, file: !610, line: 140, baseType: !651, size: 64, align: 64, offset: 832)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !610, line: 94, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !611, file: !610, line: 141, baseType: !44, size: 32, align: 32, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !611, file: !610, line: 144, baseType: !655, size: 24, align: 8, offset: 928)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 24, align: 8, elements: !413)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !611, file: !610, line: 145, baseType: !657, size: 8, align: 8, offset: 952)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8, align: 8, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 1)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !611, file: !610, line: 148, baseType: !620, size: 128, align: 64, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !611, file: !610, line: 151, baseType: !44, size: 32, align: 32, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !611, file: !610, line: 152, baseType: !638, size: 64, align: 64, offset: 1152)
!663 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !608, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!664 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !608, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!665 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !44, isLocal: false, isDefinition: true, variable: i32* @p_in)
!666 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !44, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!667 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !668, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 640, align: 32, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 20)
!671 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !668, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!672 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !668, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!673 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !668, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!674 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !668, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!675 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !668, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!676 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !44, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!677 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !44, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!678 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !44, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!679 = !DIGlobalVariable(name: "WriteNALU", scope: !0, file: !680, line: 28, type: !681, isLocal: false, isDefinition: true, variable: i32 (%struct.NALU_t*)** @WriteNALU)
!680 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!44, !171}
!684 = !DIGlobalVariable(name: "SeqParSet", scope: !0, file: !1, line: 34, type: !685, isLocal: false, isDefinition: true, variable: [32 x %struct.seq_parameter_set_rbsp_t]* @SeqParSet)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 545792, align: 32, elements: !107)
!686 = !DIGlobalVariable(name: "PicParSet", scope: !0, file: !1, line: 35, type: !687, isLocal: false, isDefinition: true, variable: [256 x %struct.pic_parameter_set_rbsp_t]* @PicParSet)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 491520, align: 64, elements: !58)
!688 = !DIGlobalVariable(name: "ZZ_SCAN", scope: !0, file: !1, line: 37, type: !689, isLocal: true, isDefinition: true, variable: [16 x i8]* @ZZ_SCAN)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 128, align: 8, elements: !550)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
