; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/q_matrix.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }
%struct.seq_parameter_set_rbsp_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.vui_seq_parameters_t }

!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !23, file: !1, line: 168, type: !16)
!38 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufend", scope: !23, file: !1, line: 169, type: !16)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "IntContent", scope: !23, file: !1, line: 170, type: !15)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !23, file: !1, line: 171, type: !15)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !23, file: !1, line: 171, type: !15)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range", scope: !23, file: !1, line: 171, type: !15)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !23, file: !1, line: 171, type: !15)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnt", scope: !23, file: !1, line: 171, type: !15)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ScalingList", scope: !23, file: !1, line: 172, type: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!47 = !DISubprogram(name: "PatchMatrix", scope: !1, file: !1, line: 284, type: !48, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PatchMatrix, variables: !50)
!48 = !DISubroutineType(types: !49)
!49 = !{null}
!50 = !{!51, !52, !53, !54}
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ScalingList", scope: !47, file: !1, line: 286, type: !46)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !47, file: !1, line: 287, type: !15)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnt", scope: !47, file: !1, line: 287, type: !15)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fail", scope: !47, file: !1, line: 287, type: !15)
!55 = !DISubprogram(name: "Init_QMatrix", scope: !1, file: !1, line: 369, type: !48, isLocal: false, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @Init_QMatrix, variables: !56)
!56 = !{!57}
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "content", scope: !55, file: !1, line: 371, type: !16)
!58 = !DISubprogram(name: "CalculateQuantParam", scope: !1, file: !1, line: 404, type: !48, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @CalculateQuantParam, variables: !59)
!59 = !{!60, !61, !62, !63, !64, !68}
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !58, file: !1, line: 406, type: !15)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !58, file: !1, line: 406, type: !15)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !58, file: !1, line: 406, type: !15)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !58, file: !1, line: 406, type: !15)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "present", scope: !58, file: !1, line: 407, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 6)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_q_matrix", scope: !58, file: !1, line: 408, type: !15)
!69 = !DISubprogram(name: "CalculateQuant8Param", scope: !1, file: !1, line: 538, type: !48, isLocal: false, isDefinition: true, scopeLine: 539, isOptimized: true, function: void ()* @CalculateQuant8Param, variables: !70)
!70 = !{!71, !72, !73, !74, !75, !79}
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !69, file: !1, line: 540, type: !15)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !69, file: !1, line: 540, type: !15)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !69, file: !1, line: 540, type: !15)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !69, file: !1, line: 540, type: !15)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "present", scope: !69, file: !1, line: 541, type: !76)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 32, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 2)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_q_matrix", scope: !69, file: !1, line: 542, type: !15)
!80 = !{!81, !82, !83, !276, !277, !278, !279, !280, !283, !285, !287, !288, !289, !290, !291, !330, !425, !426, !427, !429, !430, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !447, !448, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !463, !467, !468, !469, !470, !471, !472, !475, !478, !479, !480, !481, !484, !487, !498, !540, !541, !542, !543, !544, !600, !601, !602, !603, !604, !608, !609, !610, !611, !612, !613, !614, !615, !616, !619, !622, !623, !624, !627, !628, !629, !630, !631, !632, !633, !634, !637, !641, !642, !643, !645, !647, !650, !653, !656, !657, !660}
!81 = !DIGlobalVariable(name: "matrix4x4_check", scope: !0, file: !1, line: 27, type: !65, isLocal: false, isDefinition: true, variable: [6 x i32]* @matrix4x4_check)
!82 = !DIGlobalVariable(name: "matrix8x8_check", scope: !0, file: !1, line: 28, type: !76, isLocal: false, isDefinition: true, variable: [2 x i32]* @matrix8x8_check)
!83 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !84, line: 558, type: !85, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !84, line: 484, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 475, size: 6592, align: 64, elements: !88)
!88 = !{!89, !90, !91, !271, !272, !274, !275}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !87, file: !84, line: 477, baseType: !15, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !87, file: !84, line: 478, baseType: !15, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !87, file: !84, line: 479, baseType: !92, size: 6400, align: 64, offset: 64)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 6400, align: 64, elements: !269)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !84, line: 471, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 443, size: 1216, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !181, !218, !244, !253, !254, !255, !256, !257, !258, !259, !260, !261, !266}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !95, file: !84, line: 445, baseType: !15, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !95, file: !84, line: 446, baseType: !15, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !95, file: !84, line: 447, baseType: !15, size: 32, align: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !95, file: !84, line: 448, baseType: !15, size: 32, align: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !95, file: !84, line: 449, baseType: !15, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !95, file: !84, line: 450, baseType: !15, size: 32, align: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !95, file: !84, line: 451, baseType: !104, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !84, line: 440, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !84, line: 430, size: 960, align: 64, elements: !107)
!107 = !{!108, !128, !153}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !106, file: !84, line: 433, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !84, line: 427, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 411, size: 384, align: 64, elements: !112)
!112 = !{!113, !114, !115, !119, !120, !121, !122, !123, !124, !125, !127}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !111, file: !84, line: 413, baseType: !15, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !111, file: !84, line: 414, baseType: !15, size: 32, align: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !111, file: !84, line: 415, baseType: !116, size: 8, align: 8, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !117, line: 30, baseType: !118)
!117 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !111, file: !84, line: 416, baseType: !15, size: 32, align: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !111, file: !84, line: 417, baseType: !15, size: 32, align: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !111, file: !84, line: 418, baseType: !116, size: 8, align: 8, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !111, file: !84, line: 420, baseType: !116, size: 8, align: 8, offset: 168)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !111, file: !84, line: 421, baseType: !15, size: 32, align: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !111, file: !84, line: 422, baseType: !15, size: 32, align: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !111, file: !84, line: 424, baseType: !126, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !111, file: !84, line: 425, baseType: !15, size: 32, align: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !106, file: !84, line: 434, baseType: !129, size: 832, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !84, line: 226, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 207, size: 832, align: 64, elements: !131)
!131 = !{!132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !130, file: !84, line: 209, baseType: !133, size: 32, align: 32)
!133 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !130, file: !84, line: 209, baseType: !133, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !130, file: !84, line: 210, baseType: !133, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !130, file: !84, line: 211, baseType: !133, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !130, file: !84, line: 212, baseType: !133, size: 32, align: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !130, file: !84, line: 213, baseType: !126, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !130, file: !84, line: 214, baseType: !18, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !130, file: !84, line: 217, baseType: !133, size: 32, align: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !130, file: !84, line: 217, baseType: !133, size: 32, align: 32, offset: 352)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !130, file: !84, line: 218, baseType: !133, size: 32, align: 32, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !130, file: !84, line: 219, baseType: !133, size: 32, align: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !130, file: !84, line: 220, baseType: !133, size: 32, align: 32, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !130, file: !84, line: 221, baseType: !126, size: 64, align: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !130, file: !84, line: 222, baseType: !18, size: 64, align: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !130, file: !84, line: 223, baseType: !15, size: 32, align: 32, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !130, file: !84, line: 223, baseType: !15, size: 32, align: 32, offset: 672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !130, file: !84, line: 224, baseType: !15, size: 32, align: 32, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !130, file: !84, line: 224, baseType: !15, size: 32, align: 32, offset: 736)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !130, file: !84, line: 225, baseType: !15, size: 32, align: 32, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !130, file: !84, line: 225, baseType: !15, size: 32, align: 32, offset: 800)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !106, file: !84, line: 436, baseType: !154, size: 64, align: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!15, !157, !180}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !84, line: 348, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !84, line: 327, size: 384, align: 64, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !173}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !84, line: 329, baseType: !15, size: 32, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !159, file: !84, line: 330, baseType: !15, size: 32, align: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !159, file: !84, line: 331, baseType: !15, size: 32, align: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !159, file: !84, line: 332, baseType: !15, size: 32, align: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !159, file: !84, line: 333, baseType: !15, size: 32, align: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !159, file: !84, line: 334, baseType: !133, size: 32, align: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !159, file: !84, line: 335, baseType: !15, size: 32, align: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !159, file: !84, line: 336, baseType: !15, size: 32, align: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !159, file: !84, line: 344, baseType: !170, size: 64, align: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !15, !15, !18, !18}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !159, file: !84, line: 346, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !178}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !84, line: 228, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !95, file: !84, line: 452, baseType: !182, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !84, line: 268, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 258, size: 12032, align: 64, elements: !185)
!185 = !{!186, !199, !203, !207, !210, !214, !215}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !184, file: !84, line: 260, baseType: !187, size: 4224, align: 64)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 4224, align: 64, elements: !196)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !84, line: 238, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 231, size: 128, align: 64, elements: !190)
!190 = !{!191, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !189, file: !84, line: 233, baseType: !192, size: 16, align: 16)
!192 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !189, file: !84, line: 234, baseType: !118, size: 8, align: 8, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !189, file: !84, line: 236, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!196 = !{!197, !198}
!197 = !DISubrange(count: 3)
!198 = !DISubrange(count: 11)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !184, file: !84, line: 261, baseType: !200, size: 2304, align: 64, offset: 4224)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 2304, align: 64, elements: !201)
!201 = !{!78, !202}
!202 = !DISubrange(count: 9)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !184, file: !84, line: 262, baseType: !204, size: 2560, align: 64, offset: 6528)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 2560, align: 64, elements: !205)
!205 = !{!78, !206}
!206 = !DISubrange(count: 10)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !184, file: !84, line: 263, baseType: !208, size: 1536, align: 64, offset: 9088)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1536, align: 64, elements: !209)
!209 = !{!78, !67}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !184, file: !84, line: 264, baseType: !211, size: 512, align: 64, offset: 10624)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 512, align: 64, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 4)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !184, file: !84, line: 265, baseType: !211, size: 512, align: 64, offset: 11136)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !184, file: !84, line: 266, baseType: !216, size: 384, align: 64, offset: 11648)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 384, align: 64, elements: !217)
!217 = !{!197}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !95, file: !84, line: 453, baseType: !219, size: 64, align: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !84, line: 293, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 281, size: 97024, align: 64, elements: !222)
!222 = !{!223, !225, !226, !229, !232, !236, !237, !241, !242, !243}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !221, file: !84, line: 283, baseType: !224, size: 256, align: 64)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 256, align: 64, elements: !77)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !221, file: !84, line: 284, baseType: !211, size: 512, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !221, file: !84, line: 285, baseType: !227, size: 1536, align: 64, offset: 768)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1536, align: 64, elements: !228)
!228 = !{!197, !213}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !221, file: !84, line: 286, baseType: !230, size: 5120, align: 64, offset: 2304)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 5120, align: 64, elements: !231)
!231 = !{!206, !213}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !221, file: !84, line: 287, baseType: !233, size: 19200, align: 64, offset: 7424)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 19200, align: 64, elements: !234)
!234 = !{!206, !235}
!235 = !DISubrange(count: 15)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !221, file: !84, line: 288, baseType: !233, size: 19200, align: 64, offset: 26624)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !221, file: !84, line: 289, baseType: !238, size: 6400, align: 64, offset: 45824)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 6400, align: 64, elements: !239)
!239 = !{!206, !240}
!240 = !DISubrange(count: 5)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !221, file: !84, line: 290, baseType: !238, size: 6400, align: 64, offset: 52224)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !221, file: !84, line: 291, baseType: !233, size: 19200, align: 64, offset: 58624)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !221, file: !84, line: 292, baseType: !233, size: 19200, align: 64, offset: 77824)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !95, file: !84, line: 456, baseType: !245, size: 64, align: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !84, line: 313, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !84, line: 308, size: 128, align: 64, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !247, file: !84, line: 310, baseType: !15, size: 32, align: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !247, file: !84, line: 311, baseType: !15, size: 32, align: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !247, file: !84, line: 312, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !95, file: !84, line: 458, baseType: !15, size: 32, align: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !95, file: !84, line: 459, baseType: !18, size: 64, align: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !95, file: !84, line: 460, baseType: !18, size: 64, align: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !95, file: !84, line: 461, baseType: !18, size: 64, align: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !95, file: !84, line: 462, baseType: !15, size: 32, align: 32, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !95, file: !84, line: 463, baseType: !18, size: 64, align: 64, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !95, file: !84, line: 464, baseType: !18, size: 64, align: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !95, file: !84, line: 465, baseType: !18, size: 64, align: 64, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !95, file: !84, line: 467, baseType: !262, size: 64, align: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !15}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !95, file: !84, line: 469, baseType: !267, size: 192, align: 32, offset: 1024)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, align: 32, elements: !268)
!268 = !{!197, !78}
!269 = !{!270}
!270 = !DISubrange(count: 100)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !87, file: !84, line: 480, baseType: !15, size: 32, align: 32, offset: 6464)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !87, file: !84, line: 481, baseType: !273, size: 32, align: 32, offset: 6496)
!273 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !87, file: !84, line: 482, baseType: !273, size: 32, align: 32, offset: 6528)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !87, file: !84, line: 483, baseType: !273, size: 32, align: 32, offset: 6560)
!276 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !84, line: 559, type: !85, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!277 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !84, line: 560, type: !85, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!278 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !84, line: 561, type: !85, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!279 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !84, line: 562, type: !85, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!280 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !84, line: 565, type: !281, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!283 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !84, line: 566, type: !284, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!285 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !84, line: 567, type: !286, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!287 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !84, line: 569, type: !133, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!288 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !84, line: 570, type: !133, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!289 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !84, line: 572, type: !15, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!290 = !DIGlobalVariable(name: "me_time", scope: !0, file: !84, line: 572, type: !15, isLocal: false, isDefinition: true, variable: i32* @me_time)
!291 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !84, line: 573, type: !292, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !306, !307, !308, !309, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !294, file: !4, line: 105, baseType: !265, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !294, file: !4, line: 106, baseType: !133, size: 32, align: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !294, file: !4, line: 107, baseType: !133, size: 32, align: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !294, file: !4, line: 108, baseType: !265, size: 32, align: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !294, file: !4, line: 110, baseType: !265, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !294, file: !4, line: 111, baseType: !265, size: 32, align: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !294, file: !4, line: 112, baseType: !303, size: 256, align: 32, offset: 192)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, align: 32, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !294, file: !4, line: 115, baseType: !265, size: 32, align: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !294, file: !4, line: 116, baseType: !133, size: 32, align: 32, offset: 480)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !294, file: !4, line: 117, baseType: !133, size: 32, align: 32, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !294, file: !4, line: 119, baseType: !310, size: 256, align: 32, offset: 544)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, align: 32, elements: !304)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !294, file: !4, line: 121, baseType: !310, size: 256, align: 32, offset: 800)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !294, file: !4, line: 122, baseType: !310, size: 256, align: 32, offset: 1056)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !294, file: !4, line: 124, baseType: !265, size: 32, align: 32, offset: 1312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !294, file: !4, line: 125, baseType: !133, size: 32, align: 32, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !294, file: !4, line: 127, baseType: !133, size: 32, align: 32, offset: 1376)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !294, file: !4, line: 128, baseType: !126, size: 64, align: 64, offset: 1408)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !294, file: !4, line: 130, baseType: !15, size: 32, align: 32, offset: 1472)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !294, file: !4, line: 131, baseType: !15, size: 32, align: 32, offset: 1504)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !294, file: !4, line: 132, baseType: !265, size: 32, align: 32, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !294, file: !4, line: 133, baseType: !133, size: 32, align: 32, offset: 1568)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !294, file: !4, line: 134, baseType: !15, size: 32, align: 32, offset: 1600)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !294, file: !4, line: 135, baseType: !15, size: 32, align: 32, offset: 1632)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !294, file: !4, line: 136, baseType: !15, size: 32, align: 32, offset: 1664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !294, file: !4, line: 138, baseType: !15, size: 32, align: 32, offset: 1696)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !294, file: !4, line: 139, baseType: !15, size: 32, align: 32, offset: 1728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !294, file: !4, line: 141, baseType: !265, size: 32, align: 32, offset: 1760)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !294, file: !4, line: 142, baseType: !265, size: 32, align: 32, offset: 1792)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !294, file: !4, line: 143, baseType: !265, size: 32, align: 32, offset: 1824)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !294, file: !4, line: 144, baseType: !265, size: 32, align: 32, offset: 1856)
!330 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !84, line: 574, type: !331, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !333, file: !4, line: 151, baseType: !265, size: 32, align: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !333, file: !4, line: 153, baseType: !133, size: 32, align: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !333, file: !4, line: 154, baseType: !265, size: 32, align: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !333, file: !4, line: 155, baseType: !265, size: 32, align: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !333, file: !4, line: 156, baseType: !265, size: 32, align: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !333, file: !4, line: 157, baseType: !265, size: 32, align: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !333, file: !4, line: 158, baseType: !133, size: 32, align: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !333, file: !4, line: 159, baseType: !133, size: 32, align: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !333, file: !4, line: 160, baseType: !133, size: 32, align: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !333, file: !4, line: 162, baseType: !265, size: 32, align: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !333, file: !4, line: 163, baseType: !303, size: 256, align: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !333, file: !4, line: 165, baseType: !133, size: 32, align: 32, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !333, file: !4, line: 166, baseType: !133, size: 32, align: 32, offset: 608)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !333, file: !4, line: 167, baseType: !133, size: 32, align: 32, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !333, file: !4, line: 168, baseType: !133, size: 32, align: 32, offset: 672)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !333, file: !4, line: 170, baseType: !133, size: 32, align: 32, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !333, file: !4, line: 172, baseType: !265, size: 32, align: 32, offset: 736)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !333, file: !4, line: 173, baseType: !15, size: 32, align: 32, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !333, file: !4, line: 174, baseType: !15, size: 32, align: 32, offset: 800)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !333, file: !4, line: 175, baseType: !133, size: 32, align: 32, offset: 832)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !333, file: !4, line: 177, baseType: !356, size: 8192, align: 32, offset: 864)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, align: 32, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !333, file: !4, line: 178, baseType: !133, size: 32, align: 32, offset: 9056)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !333, file: !4, line: 179, baseType: !265, size: 32, align: 32, offset: 9088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !333, file: !4, line: 180, baseType: !133, size: 32, align: 32, offset: 9120)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !333, file: !4, line: 181, baseType: !133, size: 32, align: 32, offset: 9152)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !333, file: !4, line: 182, baseType: !265, size: 32, align: 32, offset: 9184)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !333, file: !4, line: 184, baseType: !265, size: 32, align: 32, offset: 9216)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !333, file: !4, line: 185, baseType: !265, size: 32, align: 32, offset: 9248)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !333, file: !4, line: 186, baseType: !265, size: 32, align: 32, offset: 9280)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !333, file: !4, line: 187, baseType: !133, size: 32, align: 32, offset: 9312)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !333, file: !4, line: 188, baseType: !133, size: 32, align: 32, offset: 9344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !333, file: !4, line: 189, baseType: !133, size: 32, align: 32, offset: 9376)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !333, file: !4, line: 190, baseType: !133, size: 32, align: 32, offset: 9408)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !333, file: !4, line: 191, baseType: !265, size: 32, align: 32, offset: 9440)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !333, file: !4, line: 192, baseType: !373, size: 7584, align: 32, offset: 9472)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !374, file: !4, line: 65, baseType: !265, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !374, file: !4, line: 66, baseType: !133, size: 32, align: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !374, file: !4, line: 67, baseType: !133, size: 32, align: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !374, file: !4, line: 68, baseType: !133, size: 32, align: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !374, file: !4, line: 69, baseType: !265, size: 32, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !374, file: !4, line: 70, baseType: !265, size: 32, align: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !374, file: !4, line: 71, baseType: !265, size: 32, align: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !374, file: !4, line: 72, baseType: !133, size: 32, align: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !374, file: !4, line: 73, baseType: !265, size: 32, align: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !374, file: !4, line: 74, baseType: !265, size: 32, align: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !374, file: !4, line: 75, baseType: !133, size: 32, align: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !374, file: !4, line: 76, baseType: !133, size: 32, align: 32, offset: 352)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !374, file: !4, line: 77, baseType: !133, size: 32, align: 32, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !374, file: !4, line: 78, baseType: !265, size: 32, align: 32, offset: 416)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !374, file: !4, line: 79, baseType: !133, size: 32, align: 32, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !374, file: !4, line: 80, baseType: !133, size: 32, align: 32, offset: 480)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !374, file: !4, line: 81, baseType: !265, size: 32, align: 32, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !374, file: !4, line: 82, baseType: !133, size: 32, align: 32, offset: 544)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !374, file: !4, line: 83, baseType: !133, size: 32, align: 32, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !374, file: !4, line: 84, baseType: !265, size: 32, align: 32, offset: 608)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !374, file: !4, line: 85, baseType: !265, size: 32, align: 32, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !374, file: !4, line: 86, baseType: !398, size: 3296, align: 32, offset: 672)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !400)
!400 = !{!401, !402, !403, !404, !408, !409, !410, !411, !412, !413}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !399, file: !4, line: 50, baseType: !133, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !399, file: !4, line: 51, baseType: !133, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !399, file: !4, line: 52, baseType: !133, size: 32, align: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !399, file: !4, line: 53, baseType: !405, size: 1024, align: 32, offset: 96)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1024, align: 32, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !399, file: !4, line: 54, baseType: !405, size: 1024, align: 32, offset: 1120)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !399, file: !4, line: 55, baseType: !405, size: 1024, align: 32, offset: 2144)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !399, file: !4, line: 56, baseType: !133, size: 32, align: 32, offset: 3168)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !399, file: !4, line: 57, baseType: !133, size: 32, align: 32, offset: 3200)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !399, file: !4, line: 58, baseType: !133, size: 32, align: 32, offset: 3232)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !399, file: !4, line: 59, baseType: !133, size: 32, align: 32, offset: 3264)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !374, file: !4, line: 87, baseType: !265, size: 32, align: 32, offset: 3968)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !374, file: !4, line: 88, baseType: !398, size: 3296, align: 32, offset: 4000)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !374, file: !4, line: 90, baseType: !265, size: 32, align: 32, offset: 7296)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !374, file: !4, line: 91, baseType: !265, size: 32, align: 32, offset: 7328)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !374, file: !4, line: 92, baseType: !265, size: 32, align: 32, offset: 7360)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !374, file: !4, line: 93, baseType: !133, size: 32, align: 32, offset: 7392)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !374, file: !4, line: 94, baseType: !133, size: 32, align: 32, offset: 7424)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !374, file: !4, line: 95, baseType: !133, size: 32, align: 32, offset: 7456)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !374, file: !4, line: 96, baseType: !133, size: 32, align: 32, offset: 7488)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !374, file: !4, line: 97, baseType: !133, size: 32, align: 32, offset: 7520)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !374, file: !4, line: 98, baseType: !133, size: 32, align: 32, offset: 7552)
!425 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !84, line: 578, type: !15, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!426 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !84, line: 579, type: !15, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!427 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !84, line: 583, type: !428, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!429 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !84, line: 584, type: !428, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!430 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !84, line: 585, type: !431, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!432 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !84, line: 586, type: !15, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!433 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !84, line: 587, type: !15, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!434 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !84, line: 588, type: !15, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!435 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !84, line: 589, type: !15, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!436 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !84, line: 592, type: !281, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!437 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !84, line: 593, type: !281, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!438 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !84, line: 595, type: !284, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!439 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !84, line: 596, type: !284, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!440 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !84, line: 598, type: !281, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!441 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !84, line: 599, type: !284, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!442 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !84, line: 601, type: !281, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!443 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !84, line: 602, type: !284, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!444 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !84, line: 604, type: !445, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!447 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !84, line: 605, type: !446, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!448 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !84, line: 608, type: !449, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!450 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !84, line: 609, type: !449, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!451 = !DIGlobalVariable(name: "intras", scope: !0, file: !84, line: 610, type: !15, isLocal: false, isDefinition: true, variable: i32* @intras)
!452 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !84, line: 612, type: !15, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!453 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !84, line: 612, type: !15, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!454 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !84, line: 612, type: !15, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!455 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !84, line: 613, type: !15, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!456 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !84, line: 613, type: !15, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!457 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !84, line: 613, type: !15, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!458 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !84, line: 614, type: !15, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!459 = !DIGlobalVariable(name: "errortext", scope: !0, file: !84, line: 617, type: !460, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2400, align: 8, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 300)
!463 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !84, line: 620, type: !464, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, align: 32, elements: !465)
!465 = !{!466, !466}
!466 = !DISubrange(count: 16)
!467 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !84, line: 620, type: !464, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!468 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !84, line: 620, type: !464, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!469 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !84, line: 621, type: !464, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!470 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !84, line: 621, type: !464, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!471 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !84, line: 621, type: !464, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!472 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !84, line: 622, type: !473, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 24576, align: 32, elements: !474)
!474 = !{!197, !466, !466}
!475 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !84, line: 623, type: !476, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, align: 32, elements: !477)
!477 = !{!78, !213, !213}
!478 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !84, line: 623, type: !476, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!479 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !84, line: 624, type: !476, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!480 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !84, line: 624, type: !476, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!481 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !84, line: 625, type: !482, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, align: 32, elements: !483)
!483 = !{!213, !213}
!484 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !84, line: 625, type: !485, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, align: 32, elements: !486)
!486 = !{!466}
!487 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !84, line: 1201, type: !488, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !84, line: 1190, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 1182, size: 192, align: 32, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !490, file: !84, line: 1184, baseType: !15, size: 32, align: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !490, file: !84, line: 1185, baseType: !15, size: 32, align: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !490, file: !84, line: 1186, baseType: !15, size: 32, align: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !490, file: !84, line: 1187, baseType: !15, size: 32, align: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !490, file: !84, line: 1188, baseType: !15, size: 32, align: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !490, file: !84, line: 1189, baseType: !15, size: 32, align: 32, offset: 160)
!498 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !84, line: 1202, type: !499, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !84, line: 1177, baseType: !501)
!501 = !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 1145, size: 26880, align: 64, elements: !502)
!502 = !{!503, !505, !506, !507, !508, !509, !510, !511, !512, !514, !515, !516, !517, !518, !523, !524, !528, !529, !530, !531, !533, !534, !535, !536, !537, !538, !539}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !501, file: !84, line: 1147, baseType: !504, size: 64, align: 64)
!504 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !501, file: !84, line: 1149, baseType: !464, size: 8192, align: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !501, file: !84, line: 1150, baseType: !464, size: 8192, align: 32, offset: 8256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !501, file: !84, line: 1150, baseType: !464, size: 8192, align: 32, offset: 16448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !501, file: !84, line: 1151, baseType: !431, size: 64, align: 64, offset: 24640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !501, file: !84, line: 1152, baseType: !428, size: 64, align: 64, offset: 24704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !501, file: !84, line: 1153, baseType: !15, size: 32, align: 32, offset: 24768)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !501, file: !84, line: 1155, baseType: !15, size: 32, align: 32, offset: 24800)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !501, file: !84, line: 1157, baseType: !513, size: 128, align: 32, offset: 24832)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 128, align: 32, elements: !212)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !501, file: !84, line: 1157, baseType: !513, size: 128, align: 32, offset: 24960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !501, file: !84, line: 1158, baseType: !286, size: 64, align: 64, offset: 25088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !501, file: !84, line: 1159, baseType: !485, size: 512, align: 32, offset: 25152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !501, file: !84, line: 1160, baseType: !15, size: 32, align: 32, offset: 25664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !501, file: !84, line: 1161, baseType: !519, size: 64, align: 64, offset: 25728)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !84, line: 62, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !521, line: 30, baseType: !522)
!521 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!522 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !501, file: !84, line: 1162, baseType: !15, size: 32, align: 32, offset: 25792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !501, file: !84, line: 1163, baseType: !525, size: 64, align: 64, offset: 25856)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !501, file: !84, line: 1164, baseType: !525, size: 64, align: 64, offset: 25920)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !501, file: !84, line: 1165, baseType: !525, size: 64, align: 64, offset: 25984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !501, file: !84, line: 1166, baseType: !525, size: 64, align: 64, offset: 26048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !501, file: !84, line: 1167, baseType: !532, size: 512, align: 16, offset: 26112)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 16, elements: !477)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !501, file: !84, line: 1168, baseType: !15, size: 32, align: 32, offset: 26624)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !501, file: !84, line: 1169, baseType: !15, size: 32, align: 32, offset: 26656)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !501, file: !84, line: 1171, baseType: !15, size: 32, align: 32, offset: 26688)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !501, file: !84, line: 1172, baseType: !15, size: 32, align: 32, offset: 26720)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !501, file: !84, line: 1174, baseType: !15, size: 32, align: 32, offset: 26752)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !501, file: !84, line: 1175, baseType: !15, size: 32, align: 32, offset: 26784)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !501, file: !84, line: 1176, baseType: !15, size: 32, align: 32, offset: 26816)
!540 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !84, line: 1203, type: !500, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!541 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !84, line: 1203, type: !500, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!542 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !84, line: 1204, type: !500, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!543 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !84, line: 1204, type: !500, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!544 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !84, line: 1230, type: !545, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !547, line: 153, baseType: !548)
!547 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !547, line: 122, size: 1216, align: 64, elements: !549)
!549 = !{!550, !552, !553, !554, !555, !556, !561, !562, !563, !567, !571, !580, !586, !587, !590, !591, !593, !597, !598, !599}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !548, file: !547, line: 123, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !548, file: !547, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !548, file: !547, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !548, file: !547, line: 126, baseType: !10, size: 16, align: 16, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !548, file: !547, line: 127, baseType: !10, size: 16, align: 16, offset: 144)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !548, file: !547, line: 128, baseType: !557, size: 128, align: 64, offset: 192)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !547, line: 88, size: 128, align: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !557, file: !547, line: 89, baseType: !551, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !557, file: !547, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !548, file: !547, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !548, file: !547, line: 132, baseType: !9, size: 64, align: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !548, file: !547, line: 133, baseType: !564, size: 64, align: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!15, !9}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !548, file: !547, line: 134, baseType: !568, size: 64, align: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!15, !9, !16, !15}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !548, file: !547, line: 135, baseType: !572, size: 64, align: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!575, !9, !575, !15}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !547, line: 77, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !577, line: 71, baseType: !578)
!577 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !579, line: 46, baseType: !522)
!579 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !548, file: !547, line: 136, baseType: !581, size: 64, align: 64, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!15, !9, !584, !15}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !548, file: !547, line: 139, baseType: !557, size: 128, align: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !548, file: !547, line: 140, baseType: !588, size: 64, align: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !547, line: 94, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !548, file: !547, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !548, file: !547, line: 144, baseType: !592, size: 24, align: 8, offset: 928)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 24, align: 8, elements: !217)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !548, file: !547, line: 145, baseType: !594, size: 8, align: 8, offset: 952)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8, align: 8, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 1)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !548, file: !547, line: 148, baseType: !557, size: 128, align: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !548, file: !547, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !548, file: !547, line: 152, baseType: !575, size: 64, align: 64, offset: 1152)
!600 = !DIGlobalVariable(name: "p_log", scope: !0, file: !84, line: 1231, type: !545, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!601 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !84, line: 1232, type: !545, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!602 = !DIGlobalVariable(name: "p_in", scope: !0, file: !84, line: 1233, type: !15, isLocal: false, isDefinition: true, variable: i32* @p_in)
!603 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !84, line: 1234, type: !15, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!604 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !84, line: 1237, type: !605, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 640, align: 32, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 20)
!608 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !84, line: 1238, type: !605, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!609 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !84, line: 1239, type: !605, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!610 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !84, line: 1240, type: !605, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!611 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !84, line: 1241, type: !605, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!612 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !84, line: 1242, type: !605, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!613 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !84, line: 1456, type: !15, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!614 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !84, line: 1465, type: !15, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!615 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !84, line: 1466, type: !15, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!616 = !DIGlobalVariable(name: "LevelScale4x4Luma_Intra", scope: !0, file: !1, line: 46, type: !617, isLocal: false, isDefinition: true, variable: [6 x [4 x [4 x i32]]]* @LevelScale4x4Luma_Intra)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 3072, align: 32, elements: !618)
!618 = !{!67, !213, !213}
!619 = !DIGlobalVariable(name: "LevelScale4x4Chroma_Intra", scope: !0, file: !1, line: 47, type: !620, isLocal: false, isDefinition: true, variable: [2 x [6 x [4 x [4 x i32]]]]* @LevelScale4x4Chroma_Intra)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 6144, align: 32, elements: !621)
!621 = !{!78, !67, !213, !213}
!622 = !DIGlobalVariable(name: "LevelScale4x4Luma_Inter", scope: !0, file: !1, line: 49, type: !617, isLocal: false, isDefinition: true, variable: [6 x [4 x [4 x i32]]]* @LevelScale4x4Luma_Inter)
!623 = !DIGlobalVariable(name: "LevelScale4x4Chroma_Inter", scope: !0, file: !1, line: 50, type: !620, isLocal: false, isDefinition: true, variable: [2 x [6 x [4 x [4 x i32]]]]* @LevelScale4x4Chroma_Inter)
!624 = !DIGlobalVariable(name: "LevelScale8x8Luma_Intra", scope: !0, file: !1, line: 52, type: !625, isLocal: false, isDefinition: true, variable: [6 x [8 x [8 x i32]]]* @LevelScale8x8Luma_Intra)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 12288, align: 32, elements: !626)
!626 = !{!67, !305, !305}
