; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/q_offsets.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }

!31 = !DISubprogram(name: "ParseQOffsetMatrix", scope: !1, file: !1, line: 172, type: !32, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @ParseQOffsetMatrix, variables: !34)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !24, !19}
!34 = !{!35, !36, !37, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !31, file: !1, line: 172, type: !24)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsize", arg: 2, scope: !31, file: !1, line: 172, type: !19)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !31, file: !1, line: 174, type: !38)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64000, align: 64, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1000)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MapIdx", scope: !31, file: !1, line: 175, type: !19)
!42 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !31, file: !1, line: 176, type: !19)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "InString", scope: !31, file: !1, line: 177, type: !19)
!44 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "InItem", scope: !31, file: !1, line: 177, type: !19)
!45 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !31, file: !1, line: 178, type: !24)
!46 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufend", scope: !31, file: !1, line: 179, type: !24)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "IntContent", scope: !31, file: !1, line: 180, type: !19)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !31, file: !1, line: 181, type: !19)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !31, file: !1, line: 181, type: !19)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "range", scope: !31, file: !1, line: 181, type: !19)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !31, file: !1, line: 181, type: !19)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnt", scope: !31, file: !1, line: 181, type: !19)
!53 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "OffsetList", scope: !31, file: !1, line: 182, type: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!55 = !DISubprogram(name: "Init_QOffsetMatrix", scope: !1, file: !1, line: 294, type: !56, isLocal: false, isDefinition: true, scopeLine: 295, isOptimized: true, function: void ()* @Init_QOffsetMatrix, variables: !58)
!56 = !DISubroutineType(types: !57)
!57 = !{null}
!58 = !{!59}
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "content", scope: !55, file: !1, line: 296, type: !24)
!60 = !DISubprogram(name: "CalculateOffsetParam", scope: !1, file: !1, line: 330, type: !56, isLocal: false, isDefinition: true, scopeLine: 331, isOptimized: true, function: void ()* @CalculateOffsetParam, variables: !61)
!61 = !{!62, !63, !64, !65, !66}
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !60, file: !1, line: 332, type: !19)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !60, file: !1, line: 332, type: !19)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !60, file: !1, line: 332, type: !19)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !60, file: !1, line: 332, type: !19)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !60, file: !1, line: 333, type: !19)
!67 = !DISubprogram(name: "CalculateOffset8Param", scope: !1, file: !1, line: 403, type: !56, isLocal: false, isDefinition: true, scopeLine: 404, isOptimized: true, function: void ()* @CalculateOffset8Param, variables: !68)
!68 = !{!69, !70, !71, !72, !73}
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !67, file: !1, line: 406, type: !19)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !67, file: !1, line: 406, type: !19)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !67, file: !1, line: 406, type: !19)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !67, file: !1, line: 406, type: !19)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !67, file: !1, line: 407, type: !19)
!74 = !{!75, !79, !83, !275, !276, !277, !278, !279, !282, !284, !286, !287, !288, !289, !290, !329, !424, !425, !426, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !446, !447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462, !466, !467, !468, !469, !470, !471, !474, !477, !478, !479, !480, !483, !486, !497, !539, !540, !541, !542, !543, !599, !600, !601, !602, !603, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !622, !623, !624, !627, !628, !631, !635, !636, !637, !641, !644, !647, !648, !649, !652, !653}
!75 = !DIGlobalVariable(name: "offset4x4_check", scope: !0, file: !1, line: 20, type: !76, isLocal: false, isDefinition: true, variable: [6 x i32]* @offset4x4_check)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, align: 32, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 6)
!79 = !DIGlobalVariable(name: "offset8x8_check", scope: !0, file: !1, line: 21, type: !80, isLocal: false, isDefinition: true, variable: [2 x i32]* @offset8x8_check)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 32, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 2)
!83 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !84, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !87)
!87 = !{!88, !89, !90, !270, !271, !273, !274}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !86, file: !4, line: 477, baseType: !19, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !86, file: !4, line: 478, baseType: !19, size: 32, align: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !86, file: !4, line: 479, baseType: !91, size: 6400, align: 64, offset: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 6400, align: 64, elements: !268)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !180, !217, !243, !252, !253, !254, !255, !256, !257, !258, !259, !260, !265}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !94, file: !4, line: 445, baseType: !19, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !94, file: !4, line: 446, baseType: !19, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !94, file: !4, line: 447, baseType: !19, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !94, file: !4, line: 448, baseType: !19, size: 32, align: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !94, file: !4, line: 449, baseType: !19, size: 32, align: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !94, file: !4, line: 450, baseType: !19, size: 32, align: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !94, file: !4, line: 451, baseType: !103, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !106)
!106 = !{!107, !127, !152}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !105, file: !4, line: 433, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !111)
!111 = !{!112, !113, !114, !118, !119, !120, !121, !122, !123, !124, !126}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !110, file: !4, line: 413, baseType: !19, size: 32, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !110, file: !4, line: 414, baseType: !19, size: 32, align: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !110, file: !4, line: 415, baseType: !115, size: 8, align: 8, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !116, line: 30, baseType: !117)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !110, file: !4, line: 416, baseType: !19, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !110, file: !4, line: 417, baseType: !19, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !110, file: !4, line: 418, baseType: !115, size: 8, align: 8, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !110, file: !4, line: 420, baseType: !115, size: 8, align: 8, offset: 168)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !110, file: !4, line: 421, baseType: !19, size: 32, align: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !110, file: !4, line: 422, baseType: !19, size: 32, align: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !110, file: !4, line: 424, baseType: !125, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !110, file: !4, line: 425, baseType: !19, size: 32, align: 32, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !105, file: !4, line: 434, baseType: !128, size: 832, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !130)
!130 = !{!131, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !129, file: !4, line: 209, baseType: !132, size: 32, align: 32)
!132 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !129, file: !4, line: 209, baseType: !132, size: 32, align: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !129, file: !4, line: 210, baseType: !132, size: 32, align: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !129, file: !4, line: 211, baseType: !132, size: 32, align: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !129, file: !4, line: 212, baseType: !132, size: 32, align: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !129, file: !4, line: 213, baseType: !125, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !129, file: !4, line: 214, baseType: !26, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !129, file: !4, line: 217, baseType: !132, size: 32, align: 32, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !129, file: !4, line: 217, baseType: !132, size: 32, align: 32, offset: 352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !129, file: !4, line: 218, baseType: !132, size: 32, align: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !129, file: !4, line: 219, baseType: !132, size: 32, align: 32, offset: 416)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !129, file: !4, line: 220, baseType: !132, size: 32, align: 32, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !129, file: !4, line: 221, baseType: !125, size: 64, align: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !129, file: !4, line: 222, baseType: !26, size: 64, align: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !129, file: !4, line: 223, baseType: !19, size: 32, align: 32, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !129, file: !4, line: 223, baseType: !19, size: 32, align: 32, offset: 672)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !129, file: !4, line: 224, baseType: !19, size: 32, align: 32, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !129, file: !4, line: 224, baseType: !19, size: 32, align: 32, offset: 736)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !129, file: !4, line: 225, baseType: !19, size: 32, align: 32, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !129, file: !4, line: 225, baseType: !19, size: 32, align: 32, offset: 800)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !105, file: !4, line: 436, baseType: !153, size: 64, align: 64, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!19, !156, !179}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !158)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !172}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !4, line: 329, baseType: !19, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !158, file: !4, line: 330, baseType: !19, size: 32, align: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !158, file: !4, line: 331, baseType: !19, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !158, file: !4, line: 332, baseType: !19, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !158, file: !4, line: 333, baseType: !19, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !158, file: !4, line: 334, baseType: !132, size: 32, align: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !158, file: !4, line: 335, baseType: !19, size: 32, align: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !158, file: !4, line: 336, baseType: !19, size: 32, align: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !158, file: !4, line: 344, baseType: !169, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !19, !19, !26, !26}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !158, file: !4, line: 346, baseType: !173, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !176, !177}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !94, file: !4, line: 452, baseType: !181, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !184)
!184 = !{!185, !198, !202, !206, !209, !213, !214}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !183, file: !4, line: 260, baseType: !186, size: 4224, align: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 4224, align: 64, elements: !195)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !189)
!189 = !{!190, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !4, line: 233, baseType: !191, size: 16, align: 16)
!191 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !188, file: !4, line: 234, baseType: !117, size: 8, align: 8, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !188, file: !4, line: 236, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!195 = !{!196, !197}
!196 = !DISubrange(count: 3)
!197 = !DISubrange(count: 11)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !183, file: !4, line: 261, baseType: !199, size: 2304, align: 64, offset: 4224)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 2304, align: 64, elements: !200)
!200 = !{!82, !201}
!201 = !DISubrange(count: 9)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !183, file: !4, line: 262, baseType: !203, size: 2560, align: 64, offset: 6528)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 2560, align: 64, elements: !204)
!204 = !{!82, !205}
!205 = !DISubrange(count: 10)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !183, file: !4, line: 263, baseType: !207, size: 1536, align: 64, offset: 9088)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 1536, align: 64, elements: !208)
!208 = !{!82, !78}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !183, file: !4, line: 264, baseType: !210, size: 512, align: 64, offset: 10624)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 512, align: 64, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 4)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !183, file: !4, line: 265, baseType: !210, size: 512, align: 64, offset: 11136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !183, file: !4, line: 266, baseType: !215, size: 384, align: 64, offset: 11648)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 384, align: 64, elements: !216)
!216 = !{!196}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !94, file: !4, line: 453, baseType: !218, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !221)
!221 = !{!222, !224, !225, !228, !231, !235, !236, !240, !241, !242}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !220, file: !4, line: 283, baseType: !223, size: 256, align: 64)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 256, align: 64, elements: !81)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !220, file: !4, line: 284, baseType: !210, size: 512, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !220, file: !4, line: 285, baseType: !226, size: 1536, align: 64, offset: 768)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 1536, align: 64, elements: !227)
!227 = !{!196, !212}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !220, file: !4, line: 286, baseType: !229, size: 5120, align: 64, offset: 2304)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 5120, align: 64, elements: !230)
!230 = !{!205, !212}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !220, file: !4, line: 287, baseType: !232, size: 19200, align: 64, offset: 7424)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 19200, align: 64, elements: !233)
!233 = !{!205, !234}
!234 = !DISubrange(count: 15)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !220, file: !4, line: 288, baseType: !232, size: 19200, align: 64, offset: 26624)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !220, file: !4, line: 289, baseType: !237, size: 6400, align: 64, offset: 45824)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 6400, align: 64, elements: !238)
!238 = !{!205, !239}
!239 = !DISubrange(count: 5)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !220, file: !4, line: 290, baseType: !237, size: 6400, align: 64, offset: 52224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !220, file: !4, line: 291, baseType: !232, size: 19200, align: 64, offset: 58624)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !220, file: !4, line: 292, baseType: !232, size: 19200, align: 64, offset: 77824)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !94, file: !4, line: 456, baseType: !244, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !247)
!247 = !{!248, !249, !250}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !246, file: !4, line: 310, baseType: !19, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !246, file: !4, line: 311, baseType: !19, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !246, file: !4, line: 312, baseType: !251, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !94, file: !4, line: 458, baseType: !19, size: 32, align: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !94, file: !4, line: 459, baseType: !26, size: 64, align: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !94, file: !4, line: 460, baseType: !26, size: 64, align: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !94, file: !4, line: 461, baseType: !26, size: 64, align: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !94, file: !4, line: 462, baseType: !19, size: 32, align: 32, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !94, file: !4, line: 463, baseType: !26, size: 64, align: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !94, file: !4, line: 464, baseType: !26, size: 64, align: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !94, file: !4, line: 465, baseType: !26, size: 64, align: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !94, file: !4, line: 467, baseType: !261, size: 64, align: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !19}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !12, line: 45, baseType: !11)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !94, file: !4, line: 469, baseType: !266, size: 192, align: 32, offset: 1024)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, align: 32, elements: !267)
!267 = !{!196, !82}
!268 = !{!269}
!269 = !DISubrange(count: 100)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !86, file: !4, line: 480, baseType: !19, size: 32, align: 32, offset: 6464)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !86, file: !4, line: 481, baseType: !272, size: 32, align: 32, offset: 6496)
!272 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !86, file: !4, line: 482, baseType: !272, size: 32, align: 32, offset: 6528)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !86, file: !4, line: 483, baseType: !272, size: 32, align: 32, offset: 6560)
!275 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !84, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!276 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !84, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!277 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !84, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!278 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !84, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!279 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !280, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!282 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !283, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!284 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !285, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!286 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !132, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!287 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !132, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!288 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !19, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!289 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !19, isLocal: false, isDefinition: true, variable: i32* @me_time)
!290 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !291, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !12, line: 145, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 103, size: 1920, align: 64, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !305, !306, !307, !308, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !293, file: !12, line: 105, baseType: !264, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !293, file: !12, line: 106, baseType: !132, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !293, file: !12, line: 107, baseType: !132, size: 32, align: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !293, file: !12, line: 108, baseType: !264, size: 32, align: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !293, file: !12, line: 110, baseType: !264, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !293, file: !12, line: 111, baseType: !264, size: 32, align: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !293, file: !12, line: 112, baseType: !302, size: 256, align: 32, offset: 192)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, align: 32, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 8)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !293, file: !12, line: 115, baseType: !264, size: 32, align: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !293, file: !12, line: 116, baseType: !132, size: 32, align: 32, offset: 480)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !293, file: !12, line: 117, baseType: !132, size: 32, align: 32, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !293, file: !12, line: 119, baseType: !309, size: 256, align: 32, offset: 544)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 256, align: 32, elements: !303)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !293, file: !12, line: 121, baseType: !309, size: 256, align: 32, offset: 800)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !293, file: !12, line: 122, baseType: !309, size: 256, align: 32, offset: 1056)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !293, file: !12, line: 124, baseType: !264, size: 32, align: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !293, file: !12, line: 125, baseType: !132, size: 32, align: 32, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !293, file: !12, line: 127, baseType: !132, size: 32, align: 32, offset: 1376)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !293, file: !12, line: 128, baseType: !125, size: 64, align: 64, offset: 1408)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !293, file: !12, line: 130, baseType: !19, size: 32, align: 32, offset: 1472)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !293, file: !12, line: 131, baseType: !19, size: 32, align: 32, offset: 1504)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !293, file: !12, line: 132, baseType: !264, size: 32, align: 32, offset: 1536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !293, file: !12, line: 133, baseType: !132, size: 32, align: 32, offset: 1568)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !293, file: !12, line: 134, baseType: !19, size: 32, align: 32, offset: 1600)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !293, file: !12, line: 135, baseType: !19, size: 32, align: 32, offset: 1632)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !293, file: !12, line: 136, baseType: !19, size: 32, align: 32, offset: 1664)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !293, file: !12, line: 138, baseType: !19, size: 32, align: 32, offset: 1696)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !293, file: !12, line: 139, baseType: !19, size: 32, align: 32, offset: 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !293, file: !12, line: 141, baseType: !264, size: 32, align: 32, offset: 1760)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !293, file: !12, line: 142, baseType: !264, size: 32, align: 32, offset: 1792)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !293, file: !12, line: 143, baseType: !264, size: 32, align: 32, offset: 1824)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !293, file: !12, line: 144, baseType: !264, size: 32, align: 32, offset: 1856)
!329 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !330, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !12, line: 193, baseType: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 149, size: 17056, align: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !332, file: !12, line: 151, baseType: !264, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !332, file: !12, line: 153, baseType: !132, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !332, file: !12, line: 154, baseType: !264, size: 32, align: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !332, file: !12, line: 155, baseType: !264, size: 32, align: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !332, file: !12, line: 156, baseType: !264, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !332, file: !12, line: 157, baseType: !264, size: 32, align: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !332, file: !12, line: 158, baseType: !132, size: 32, align: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !332, file: !12, line: 159, baseType: !132, size: 32, align: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !332, file: !12, line: 160, baseType: !132, size: 32, align: 32, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !332, file: !12, line: 162, baseType: !264, size: 32, align: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !332, file: !12, line: 163, baseType: !302, size: 256, align: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !332, file: !12, line: 165, baseType: !132, size: 32, align: 32, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !332, file: !12, line: 166, baseType: !132, size: 32, align: 32, offset: 608)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !332, file: !12, line: 167, baseType: !132, size: 32, align: 32, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !332, file: !12, line: 168, baseType: !132, size: 32, align: 32, offset: 672)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !332, file: !12, line: 170, baseType: !132, size: 32, align: 32, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !332, file: !12, line: 172, baseType: !264, size: 32, align: 32, offset: 736)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !332, file: !12, line: 173, baseType: !19, size: 32, align: 32, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !332, file: !12, line: 174, baseType: !19, size: 32, align: 32, offset: 800)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !332, file: !12, line: 175, baseType: !132, size: 32, align: 32, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !332, file: !12, line: 177, baseType: !355, size: 8192, align: 32, offset: 864)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, align: 32, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !332, file: !12, line: 178, baseType: !132, size: 32, align: 32, offset: 9056)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !332, file: !12, line: 179, baseType: !264, size: 32, align: 32, offset: 9088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !332, file: !12, line: 180, baseType: !132, size: 32, align: 32, offset: 9120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !332, file: !12, line: 181, baseType: !132, size: 32, align: 32, offset: 9152)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !332, file: !12, line: 182, baseType: !264, size: 32, align: 32, offset: 9184)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !332, file: !12, line: 184, baseType: !264, size: 32, align: 32, offset: 9216)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !332, file: !12, line: 185, baseType: !264, size: 32, align: 32, offset: 9248)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !332, file: !12, line: 186, baseType: !264, size: 32, align: 32, offset: 9280)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !332, file: !12, line: 187, baseType: !132, size: 32, align: 32, offset: 9312)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !332, file: !12, line: 188, baseType: !132, size: 32, align: 32, offset: 9344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !332, file: !12, line: 189, baseType: !132, size: 32, align: 32, offset: 9376)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !332, file: !12, line: 190, baseType: !132, size: 32, align: 32, offset: 9408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !332, file: !12, line: 191, baseType: !264, size: 32, align: 32, offset: 9440)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !332, file: !12, line: 192, baseType: !372, size: 7584, align: 32, offset: 9472)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !12, line: 99, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 63, size: 7584, align: 32, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !373, file: !12, line: 65, baseType: !264, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !373, file: !12, line: 66, baseType: !132, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !373, file: !12, line: 67, baseType: !132, size: 32, align: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !373, file: !12, line: 68, baseType: !132, size: 32, align: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !373, file: !12, line: 69, baseType: !264, size: 32, align: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !373, file: !12, line: 70, baseType: !264, size: 32, align: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !373, file: !12, line: 71, baseType: !264, size: 32, align: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !373, file: !12, line: 72, baseType: !132, size: 32, align: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !373, file: !12, line: 73, baseType: !264, size: 32, align: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !373, file: !12, line: 74, baseType: !264, size: 32, align: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !373, file: !12, line: 75, baseType: !132, size: 32, align: 32, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !373, file: !12, line: 76, baseType: !132, size: 32, align: 32, offset: 352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !373, file: !12, line: 77, baseType: !132, size: 32, align: 32, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !373, file: !12, line: 78, baseType: !264, size: 32, align: 32, offset: 416)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !373, file: !12, line: 79, baseType: !132, size: 32, align: 32, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !373, file: !12, line: 80, baseType: !132, size: 32, align: 32, offset: 480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !373, file: !12, line: 81, baseType: !264, size: 32, align: 32, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !373, file: !12, line: 82, baseType: !132, size: 32, align: 32, offset: 544)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !373, file: !12, line: 83, baseType: !132, size: 32, align: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !373, file: !12, line: 84, baseType: !264, size: 32, align: 32, offset: 608)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !373, file: !12, line: 85, baseType: !264, size: 32, align: 32, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !373, file: !12, line: 86, baseType: !397, size: 3296, align: 32, offset: 672)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !12, line: 60, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 48, size: 3296, align: 32, elements: !399)
!399 = !{!400, !401, !402, !403, !407, !408, !409, !410, !411, !412}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !398, file: !12, line: 50, baseType: !132, size: 32, align: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !398, file: !12, line: 51, baseType: !132, size: 32, align: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !398, file: !12, line: 52, baseType: !132, size: 32, align: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !398, file: !12, line: 53, baseType: !404, size: 1024, align: 32, offset: 96)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 1024, align: 32, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !398, file: !12, line: 54, baseType: !404, size: 1024, align: 32, offset: 1120)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !398, file: !12, line: 55, baseType: !404, size: 1024, align: 32, offset: 2144)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !398, file: !12, line: 56, baseType: !132, size: 32, align: 32, offset: 3168)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !398, file: !12, line: 57, baseType: !132, size: 32, align: 32, offset: 3200)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !398, file: !12, line: 58, baseType: !132, size: 32, align: 32, offset: 3232)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !398, file: !12, line: 59, baseType: !132, size: 32, align: 32, offset: 3264)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !373, file: !12, line: 87, baseType: !264, size: 32, align: 32, offset: 3968)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !373, file: !12, line: 88, baseType: !397, size: 3296, align: 32, offset: 4000)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !373, file: !12, line: 90, baseType: !264, size: 32, align: 32, offset: 7296)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !373, file: !12, line: 91, baseType: !264, size: 32, align: 32, offset: 7328)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !373, file: !12, line: 92, baseType: !264, size: 32, align: 32, offset: 7360)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !373, file: !12, line: 93, baseType: !132, size: 32, align: 32, offset: 7392)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !373, file: !12, line: 94, baseType: !132, size: 32, align: 32, offset: 7424)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !373, file: !12, line: 95, baseType: !132, size: 32, align: 32, offset: 7456)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !373, file: !12, line: 96, baseType: !132, size: 32, align: 32, offset: 7488)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !373, file: !12, line: 97, baseType: !132, size: 32, align: 32, offset: 7520)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !373, file: !12, line: 98, baseType: !132, size: 32, align: 32, offset: 7552)
!424 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !19, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!425 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !19, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!426 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !427, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!428 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !427, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!429 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !430, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!431 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !19, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!432 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !19, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!433 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !19, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!434 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !19, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!435 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !280, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!436 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !280, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!437 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !283, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!438 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !283, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!439 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !280, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!440 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !283, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!441 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !280, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!442 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !283, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!443 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !444, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!446 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !445, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!447 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !448, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!449 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !448, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!450 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !19, isLocal: false, isDefinition: true, variable: i32* @intras)
!451 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !19, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!452 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !19, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!453 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !19, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!454 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !19, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!455 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !19, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!456 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !19, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!457 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !19, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!458 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !459, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2400, align: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 300)
!462 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !463, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, align: 32, elements: !464)
!464 = !{!465, !465}
!465 = !DISubrange(count: 16)
!466 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !463, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!467 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !463, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!468 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !463, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!469 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !463, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!470 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !463, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!471 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !472, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24576, align: 32, elements: !473)
!473 = !{!196, !465, !465}
!474 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !475, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1024, align: 32, elements: !476)
!476 = !{!82, !212, !212}
!477 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !475, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!478 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !475, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!479 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !475, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!480 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !481, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, align: 32, elements: !482)
!482 = !{!212, !212}
!483 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !484, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, align: 32, elements: !485)
!485 = !{!465}
!486 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !487, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !489, file: !4, line: 1184, baseType: !19, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !489, file: !4, line: 1185, baseType: !19, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !489, file: !4, line: 1186, baseType: !19, size: 32, align: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !489, file: !4, line: 1187, baseType: !19, size: 32, align: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !489, file: !4, line: 1188, baseType: !19, size: 32, align: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !489, file: !4, line: 1189, baseType: !19, size: 32, align: 32, offset: 160)
!497 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !498, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !501)
!501 = !{!502, !504, !505, !506, !507, !508, !509, !510, !511, !513, !514, !515, !516, !517, !522, !523, !527, !528, !529, !530, !532, !533, !534, !535, !536, !537, !538}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !500, file: !4, line: 1147, baseType: !503, size: 64, align: 64)
!503 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !500, file: !4, line: 1149, baseType: !463, size: 8192, align: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !500, file: !4, line: 1150, baseType: !463, size: 8192, align: 32, offset: 8256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !500, file: !4, line: 1150, baseType: !463, size: 8192, align: 32, offset: 16448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !500, file: !4, line: 1151, baseType: !430, size: 64, align: 64, offset: 24640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !500, file: !4, line: 1152, baseType: !427, size: 64, align: 64, offset: 24704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !500, file: !4, line: 1153, baseType: !19, size: 32, align: 32, offset: 24768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !500, file: !4, line: 1155, baseType: !19, size: 32, align: 32, offset: 24800)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !500, file: !4, line: 1157, baseType: !512, size: 128, align: 32, offset: 24832)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, align: 32, elements: !211)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !500, file: !4, line: 1157, baseType: !512, size: 128, align: 32, offset: 24960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !500, file: !4, line: 1158, baseType: !285, size: 64, align: 64, offset: 25088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !500, file: !4, line: 1159, baseType: !484, size: 512, align: 32, offset: 25152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !500, file: !4, line: 1160, baseType: !19, size: 32, align: 32, offset: 25664)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !500, file: !4, line: 1161, baseType: !518, size: 64, align: 64, offset: 25728)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !520, line: 30, baseType: !521)
!520 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!521 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !500, file: !4, line: 1162, baseType: !19, size: 32, align: 32, offset: 25792)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !500, file: !4, line: 1163, baseType: !524, size: 64, align: 64, offset: 25856)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !500, file: !4, line: 1164, baseType: !524, size: 64, align: 64, offset: 25920)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !500, file: !4, line: 1165, baseType: !524, size: 64, align: 64, offset: 25984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !500, file: !4, line: 1166, baseType: !524, size: 64, align: 64, offset: 26048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !500, file: !4, line: 1167, baseType: !531, size: 512, align: 16, offset: 26112)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, align: 16, elements: !476)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !500, file: !4, line: 1168, baseType: !19, size: 32, align: 32, offset: 26624)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !500, file: !4, line: 1169, baseType: !19, size: 32, align: 32, offset: 26656)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !500, file: !4, line: 1171, baseType: !19, size: 32, align: 32, offset: 26688)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !500, file: !4, line: 1172, baseType: !19, size: 32, align: 32, offset: 26720)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !500, file: !4, line: 1174, baseType: !19, size: 32, align: 32, offset: 26752)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !500, file: !4, line: 1175, baseType: !19, size: 32, align: 32, offset: 26784)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !500, file: !4, line: 1176, baseType: !19, size: 32, align: 32, offset: 26816)
!539 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !499, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!540 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !499, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!541 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !499, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!542 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !499, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!543 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !544, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !546, line: 153, baseType: !547)
!546 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !546, line: 122, size: 1216, align: 64, elements: !548)
!548 = !{!549, !551, !552, !553, !554, !555, !560, !561, !562, !566, !570, !579, !585, !586, !589, !590, !592, !596, !597, !598}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !547, file: !546, line: 123, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !547, file: !546, line: 124, baseType: !19, size: 32, align: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !547, file: !546, line: 125, baseType: !19, size: 32, align: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !547, file: !546, line: 126, baseType: !18, size: 16, align: 16, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !547, file: !546, line: 127, baseType: !18, size: 16, align: 16, offset: 144)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !547, file: !546, line: 128, baseType: !556, size: 128, align: 64, offset: 192)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !546, line: 88, size: 128, align: 64, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !556, file: !546, line: 89, baseType: !550, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !556, file: !546, line: 90, baseType: !19, size: 32, align: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !547, file: !546, line: 129, baseType: !19, size: 32, align: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !547, file: !546, line: 132, baseType: !17, size: 64, align: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !547, file: !546, line: 133, baseType: !563, size: 64, align: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!19, !17}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !547, file: !546, line: 134, baseType: !567, size: 64, align: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!19, !17, !24, !19}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !547, file: !546, line: 135, baseType: !571, size: 64, align: 64, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!574, !17, !574, !19}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !546, line: 77, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !576, line: 71, baseType: !577)
!576 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !578, line: 46, baseType: !521)
!578 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !547, file: !546, line: 136, baseType: !580, size: 64, align: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!19, !17, !583, !19}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !547, file: !546, line: 139, baseType: !556, size: 128, align: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !547, file: !546, line: 140, baseType: !587, size: 64, align: 64, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !546, line: 94, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !547, file: !546, line: 141, baseType: !19, size: 32, align: 32, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !547, file: !546, line: 144, baseType: !591, size: 24, align: 8, offset: 928)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 24, align: 8, elements: !216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !547, file: !546, line: 145, baseType: !593, size: 8, align: 8, offset: 952)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 8, align: 8, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 1)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !547, file: !546, line: 148, baseType: !556, size: 128, align: 64, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !547, file: !546, line: 151, baseType: !19, size: 32, align: 32, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !547, file: !546, line: 152, baseType: !574, size: 64, align: 64, offset: 1152)
!599 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !544, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!600 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !544, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!601 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !19, isLocal: false, isDefinition: true, variable: i32* @p_in)
!602 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !19, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!603 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !604, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 640, align: 32, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 20)
!607 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !604, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!608 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !604, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!609 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !604, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!610 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !604, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!611 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !4, line: 1242, type: !604, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!612 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !4, line: 1456, type: !19, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!613 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !4, line: 1465, type: !19, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!614 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !4, line: 1466, type: !19, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!615 = !DIGlobalVariable(name: "LevelOffset4x4Luma_Intra", scope: !0, file: !1, line: 44, type: !616, isLocal: false, isDefinition: true, variable: [13 x [4 x [4 x i32]]]* @LevelOffset4x4Luma_Intra)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 6656, align: 32, elements: !617)
!617 = !{!618, !212, !212}
!618 = !DISubrange(count: 13)
!619 = !DIGlobalVariable(name: "LevelOffset4x4Chroma_Intra", scope: !0, file: !1, line: 45, type: !620, isLocal: false, isDefinition: true, variable: [2 x [13 x [4 x [4 x i32]]]]* @LevelOffset4x4Chroma_Intra)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 13312, align: 32, elements: !621)
!621 = !{!82, !618, !212, !212}
!622 = !DIGlobalVariable(name: "LevelOffset4x4Luma_Inter", scope: !0, file: !1, line: 47, type: !616, isLocal: false, isDefinition: true, variable: [13 x [4 x [4 x i32]]]* @LevelOffset4x4Luma_Inter)
!623 = !DIGlobalVariable(name: "LevelOffset4x4Chroma_Inter", scope: !0, file: !1, line: 48, type: !620, isLocal: false, isDefinition: true, variable: [2 x [13 x [4 x [4 x i32]]]]* @LevelOffset4x4Chroma_Inter)
!624 = !DIGlobalVariable(name: "LevelOffset8x8Luma_Intra", scope: !0, file: !1, line: 50, type: !625, isLocal: false, isDefinition: true, variable: [13 x [8 x [8 x i32]]]* @LevelOffset8x8Luma_Intra)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 26624, align: 32, elements: !626)
