; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/ratectl.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m_Nc", scope: !125, file: !1, line: 1667, type: !27)
!133 = !DISubprogram(name: "MADModelEstimator", scope: !1, file: !1, line: 1753, type: !71, isLocal: false, isDefinition: true, scopeLine: 1754, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @MADModelEstimator, variables: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_windowSize", arg: 1, scope: !133, file: !1, line: 1753, type: !27)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_realSize", scope: !133, file: !1, line: 1755, type: !27)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !133, file: !1, line: 1756, type: !27)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oneSampleQ", scope: !133, file: !1, line: 1757, type: !23)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a00", scope: !133, file: !1, line: 1758, type: !23)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a01", scope: !133, file: !1, line: 1758, type: !23)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a10", scope: !133, file: !1, line: 1758, type: !23)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a11", scope: !133, file: !1, line: 1758, type: !23)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b0", scope: !133, file: !1, line: 1758, type: !23)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b1", scope: !133, file: !1, line: 1758, type: !23)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MatrixValue", scope: !133, file: !1, line: 1759, type: !23)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "estimateX2", scope: !133, file: !1, line: 1760, type: !49)
!147 = !DISubprogram(name: "QP2Qstep", scope: !1, file: !1, line: 1830, type: !148, isLocal: false, isDefinition: true, scopeLine: 1831, flags: DIFlagPrototyped, isOptimized: true, function: double (i32)* @QP2Qstep, variables: !150)
!148 = !DISubroutineType(types: !149)
!149 = !{!23, !27}
!150 = !{!151, !152, !153}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "QP", arg: 1, scope: !147, file: !1, line: 1830, type: !27)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !147, file: !1, line: 1832, type: !27)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Qstep", scope: !147, file: !1, line: 1833, type: !23)
!154 = !DISubprogram(name: "Qstep2QP", scope: !1, file: !1, line: 1851, type: !155, isLocal: false, isDefinition: true, scopeLine: 1852, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @Qstep2QP, variables: !157)
!155 = !DISubroutineType(types: !156)
!156 = !{!27, !23}
!157 = !{!158, !159, !160}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Qstep", arg: 1, scope: !154, file: !1, line: 1851, type: !23)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_per", scope: !154, file: !1, line: 1853, type: !27)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_rem", scope: !154, file: !1, line: 1853, type: !27)
!161 = !{!162, !164, !166, !167, !168, !169, !173, !366, !367, !368, !369, !370, !373, !375, !377, !378, !379, !380, !381, !420, !515, !516, !517, !519, !520, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !539, !540, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !556, !560, !561, !562, !563, !564, !565, !568, !571, !572, !573, !574, !577, !580, !591, !632, !633, !634, !635, !636, !693, !694, !695, !696, !697, !699, !700, !701, !702, !703, !704, !705, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !732, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!162 = !DIGlobalVariable(name: "THETA", scope: !0, file: !1, line: 125, type: !163, isLocal: false, isDefinition: true, variable: double* @THETA)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!164 = !DIGlobalVariable(name: "Switch", scope: !0, file: !1, line: 126, type: !165, isLocal: false, isDefinition: true, variable: i32* @Switch)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!166 = !DIGlobalVariable(name: "Iprev_bits", scope: !0, file: !1, line: 128, type: !27, isLocal: false, isDefinition: true, variable: i32* @Iprev_bits)
!167 = !DIGlobalVariable(name: "Pprev_bits", scope: !0, file: !1, line: 129, type: !27, isLocal: false, isDefinition: true, variable: i32* @Pprev_bits)
!168 = !DIGlobalVariable(name: "OMEGA", scope: !0, file: !1, line: 140, type: !163, isLocal: false, isDefinition: true, variable: double* @OMEGA)
!169 = !DIGlobalVariable(name: "QP2QSTEP", scope: !147, file: !1, line: 1834, type: !170, isLocal: true, isDefinition: true, variable: [6 x double]* @QP2Qstep.QP2QSTEP)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 384, align: 64, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 6)
!173 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !174, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !177)
!177 = !{!178, !179, !180, !362, !363, !364, !365}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !176, file: !9, line: 477, baseType: !27, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !176, file: !9, line: 478, baseType: !27, size: 32, align: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !176, file: !9, line: 479, baseType: !181, size: 6400, align: 64, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 6400, align: 64, elements: !360)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !192, !271, !309, !336, !345, !346, !347, !348, !349, !350, !351, !352, !353, !357}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !184, file: !9, line: 445, baseType: !27, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !184, file: !9, line: 446, baseType: !27, size: 32, align: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !184, file: !9, line: 447, baseType: !27, size: 32, align: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !184, file: !9, line: 448, baseType: !27, size: 32, align: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !184, file: !9, line: 449, baseType: !27, size: 32, align: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !184, file: !9, line: 450, baseType: !27, size: 32, align: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !184, file: !9, line: 451, baseType: !193, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !196)
!196 = !{!197, !217, !243}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !195, file: !9, line: 433, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !201)
!201 = !{!202, !203, !204, !208, !209, !210, !211, !212, !213, !214, !216}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !200, file: !9, line: 413, baseType: !27, size: 32, align: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !200, file: !9, line: 414, baseType: !27, size: 32, align: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !200, file: !9, line: 415, baseType: !205, size: 8, align: 8, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !206, line: 30, baseType: !207)
!206 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!207 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !200, file: !9, line: 416, baseType: !27, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !200, file: !9, line: 417, baseType: !27, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !200, file: !9, line: 418, baseType: !205, size: 8, align: 8, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !200, file: !9, line: 420, baseType: !205, size: 8, align: 8, offset: 168)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !200, file: !9, line: 421, baseType: !27, size: 32, align: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !200, file: !9, line: 422, baseType: !27, size: 32, align: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !200, file: !9, line: 424, baseType: !215, size: 64, align: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !200, file: !9, line: 425, baseType: !27, size: 32, align: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !195, file: !9, line: 434, baseType: !218, size: 832, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !220)
!220 = !{!221, !223, !224, !225, !226, !227, !228, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !219, file: !9, line: 209, baseType: !222, size: 32, align: 32)
!222 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !219, file: !9, line: 209, baseType: !222, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !219, file: !9, line: 210, baseType: !222, size: 32, align: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !219, file: !9, line: 211, baseType: !222, size: 32, align: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !219, file: !9, line: 212, baseType: !222, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !219, file: !9, line: 213, baseType: !215, size: 64, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !219, file: !9, line: 214, baseType: !229, size: 64, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !219, file: !9, line: 217, baseType: !222, size: 32, align: 32, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !219, file: !9, line: 217, baseType: !222, size: 32, align: 32, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !219, file: !9, line: 218, baseType: !222, size: 32, align: 32, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !219, file: !9, line: 219, baseType: !222, size: 32, align: 32, offset: 416)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !219, file: !9, line: 220, baseType: !222, size: 32, align: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !219, file: !9, line: 221, baseType: !215, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !219, file: !9, line: 222, baseType: !229, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !219, file: !9, line: 223, baseType: !27, size: 32, align: 32, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !219, file: !9, line: 223, baseType: !27, size: 32, align: 32, offset: 672)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !219, file: !9, line: 224, baseType: !27, size: 32, align: 32, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !219, file: !9, line: 224, baseType: !27, size: 32, align: 32, offset: 736)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !219, file: !9, line: 225, baseType: !27, size: 32, align: 32, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !219, file: !9, line: 225, baseType: !27, size: 32, align: 32, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !195, file: !9, line: 436, baseType: !244, size: 64, align: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!27, !247, !270}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !263}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !9, line: 329, baseType: !27, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !249, file: !9, line: 330, baseType: !27, size: 32, align: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !249, file: !9, line: 331, baseType: !27, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !9, line: 332, baseType: !27, size: 32, align: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !249, file: !9, line: 333, baseType: !27, size: 32, align: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !249, file: !9, line: 334, baseType: !222, size: 32, align: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !249, file: !9, line: 335, baseType: !27, size: 32, align: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !249, file: !9, line: 336, baseType: !27, size: 32, align: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !249, file: !9, line: 344, baseType: !260, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !27, !27, !229, !229}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !249, file: !9, line: 346, baseType: !264, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !267, !268}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !184, file: !9, line: 452, baseType: !272, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !275)
!275 = !{!276, !289, !294, !298, !301, !305, !306}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !274, file: !9, line: 260, baseType: !277, size: 4224, align: 64)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 4224, align: 64, elements: !286)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !280)
!280 = !{!281, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !279, file: !9, line: 233, baseType: !282, size: 16, align: 16)
!282 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !279, file: !9, line: 234, baseType: !207, size: 8, align: 8, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !279, file: !9, line: 236, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!286 = !{!287, !288}
!287 = !DISubrange(count: 3)
!288 = !DISubrange(count: 11)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !274, file: !9, line: 261, baseType: !290, size: 2304, align: 64, offset: 4224)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 2304, align: 64, elements: !291)
!291 = !{!292, !293}
!292 = !DISubrange(count: 2)
!293 = !DISubrange(count: 9)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !274, file: !9, line: 262, baseType: !295, size: 2560, align: 64, offset: 6528)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 2560, align: 64, elements: !296)
!296 = !{!292, !297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !274, file: !9, line: 263, baseType: !299, size: 1536, align: 64, offset: 9088)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 1536, align: 64, elements: !300)
!300 = !{!292, !172}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !274, file: !9, line: 264, baseType: !302, size: 512, align: 64, offset: 10624)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 512, align: 64, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !274, file: !9, line: 265, baseType: !302, size: 512, align: 64, offset: 11136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !274, file: !9, line: 266, baseType: !307, size: 384, align: 64, offset: 11648)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 384, align: 64, elements: !308)
!308 = !{!287}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !184, file: !9, line: 453, baseType: !310, size: 64, align: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !313)
!313 = !{!314, !317, !318, !321, !324, !328, !329, !333, !334, !335}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !312, file: !9, line: 283, baseType: !315, size: 256, align: 64)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, align: 64, elements: !316)
!316 = !{!292}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !312, file: !9, line: 284, baseType: !302, size: 512, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !312, file: !9, line: 285, baseType: !319, size: 1536, align: 64, offset: 768)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 1536, align: 64, elements: !320)
!320 = !{!287, !304}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !312, file: !9, line: 286, baseType: !322, size: 5120, align: 64, offset: 2304)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 5120, align: 64, elements: !323)
!323 = !{!297, !304}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !312, file: !9, line: 287, baseType: !325, size: 19200, align: 64, offset: 7424)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 19200, align: 64, elements: !326)
!326 = !{!297, !327}
!327 = !DISubrange(count: 15)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !312, file: !9, line: 288, baseType: !325, size: 19200, align: 64, offset: 26624)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !312, file: !9, line: 289, baseType: !330, size: 6400, align: 64, offset: 45824)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 6400, align: 64, elements: !331)
!331 = !{!297, !332}
!332 = !DISubrange(count: 5)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !312, file: !9, line: 290, baseType: !330, size: 6400, align: 64, offset: 52224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !312, file: !9, line: 291, baseType: !325, size: 19200, align: 64, offset: 58624)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !312, file: !9, line: 292, baseType: !325, size: 19200, align: 64, offset: 77824)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !184, file: !9, line: 456, baseType: !337, size: 64, align: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !340)
!340 = !{!341, !342, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !339, file: !9, line: 310, baseType: !27, size: 32, align: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !339, file: !9, line: 311, baseType: !27, size: 32, align: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !339, file: !9, line: 312, baseType: !344, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !184, file: !9, line: 458, baseType: !27, size: 32, align: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !184, file: !9, line: 459, baseType: !229, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !184, file: !9, line: 460, baseType: !229, size: 64, align: 64, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !184, file: !9, line: 461, baseType: !229, size: 64, align: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !184, file: !9, line: 462, baseType: !27, size: 32, align: 32, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !184, file: !9, line: 463, baseType: !229, size: 64, align: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !184, file: !9, line: 464, baseType: !229, size: 64, align: 64, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !184, file: !9, line: 465, baseType: !229, size: 64, align: 64, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !184, file: !9, line: 467, baseType: !354, size: 64, align: 64, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!49, !27}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !184, file: !9, line: 469, baseType: !358, size: 192, align: 32, offset: 1024)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, align: 32, elements: !359)
!359 = !{!287, !292}
!360 = !{!361}
!361 = !DISubrange(count: 100)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !176, file: !9, line: 480, baseType: !27, size: 32, align: 32, offset: 6464)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !176, file: !9, line: 481, baseType: !25, size: 32, align: 32, offset: 6496)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !176, file: !9, line: 482, baseType: !25, size: 32, align: 32, offset: 6528)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !176, file: !9, line: 483, baseType: !25, size: 32, align: 32, offset: 6560)
!366 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !174, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!367 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !174, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!368 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !174, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!369 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !174, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!370 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !371, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!373 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !374, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!375 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !376, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!377 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !222, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!378 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !222, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!379 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !27, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!380 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !27, isLocal: false, isDefinition: true, variable: i32* @me_time)
!381 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !382, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !396, !397, !398, !399, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !384, file: !4, line: 105, baseType: !49, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !384, file: !4, line: 106, baseType: !222, size: 32, align: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !384, file: !4, line: 107, baseType: !222, size: 32, align: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !384, file: !4, line: 108, baseType: !49, size: 32, align: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !384, file: !4, line: 110, baseType: !49, size: 32, align: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !384, file: !4, line: 111, baseType: !49, size: 32, align: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !384, file: !4, line: 112, baseType: !393, size: 256, align: 32, offset: 192)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, align: 32, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !384, file: !4, line: 115, baseType: !49, size: 32, align: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !384, file: !4, line: 116, baseType: !222, size: 32, align: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !384, file: !4, line: 117, baseType: !222, size: 32, align: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !384, file: !4, line: 119, baseType: !400, size: 256, align: 32, offset: 544)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, align: 32, elements: !394)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !384, file: !4, line: 121, baseType: !400, size: 256, align: 32, offset: 800)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !384, file: !4, line: 122, baseType: !400, size: 256, align: 32, offset: 1056)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !384, file: !4, line: 124, baseType: !49, size: 32, align: 32, offset: 1312)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !384, file: !4, line: 125, baseType: !222, size: 32, align: 32, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !384, file: !4, line: 127, baseType: !222, size: 32, align: 32, offset: 1376)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !384, file: !4, line: 128, baseType: !215, size: 64, align: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !384, file: !4, line: 130, baseType: !27, size: 32, align: 32, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !384, file: !4, line: 131, baseType: !27, size: 32, align: 32, offset: 1504)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !384, file: !4, line: 132, baseType: !49, size: 32, align: 32, offset: 1536)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !384, file: !4, line: 133, baseType: !222, size: 32, align: 32, offset: 1568)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !384, file: !4, line: 134, baseType: !27, size: 32, align: 32, offset: 1600)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !384, file: !4, line: 135, baseType: !27, size: 32, align: 32, offset: 1632)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !384, file: !4, line: 136, baseType: !27, size: 32, align: 32, offset: 1664)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !384, file: !4, line: 138, baseType: !27, size: 32, align: 32, offset: 1696)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !384, file: !4, line: 139, baseType: !27, size: 32, align: 32, offset: 1728)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !384, file: !4, line: 141, baseType: !49, size: 32, align: 32, offset: 1760)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !384, file: !4, line: 142, baseType: !49, size: 32, align: 32, offset: 1792)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !384, file: !4, line: 143, baseType: !49, size: 32, align: 32, offset: 1824)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !384, file: !4, line: 144, baseType: !49, size: 32, align: 32, offset: 1856)
!420 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !421, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !423, file: !4, line: 151, baseType: !49, size: 32, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !423, file: !4, line: 153, baseType: !222, size: 32, align: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !423, file: !4, line: 154, baseType: !49, size: 32, align: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !423, file: !4, line: 155, baseType: !49, size: 32, align: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !423, file: !4, line: 156, baseType: !49, size: 32, align: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !423, file: !4, line: 157, baseType: !49, size: 32, align: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !423, file: !4, line: 158, baseType: !222, size: 32, align: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !423, file: !4, line: 159, baseType: !222, size: 32, align: 32, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !423, file: !4, line: 160, baseType: !222, size: 32, align: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !423, file: !4, line: 162, baseType: !49, size: 32, align: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !423, file: !4, line: 163, baseType: !393, size: 256, align: 32, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !423, file: !4, line: 165, baseType: !222, size: 32, align: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !423, file: !4, line: 166, baseType: !222, size: 32, align: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !423, file: !4, line: 167, baseType: !222, size: 32, align: 32, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !423, file: !4, line: 168, baseType: !222, size: 32, align: 32, offset: 672)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !423, file: !4, line: 170, baseType: !222, size: 32, align: 32, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !423, file: !4, line: 172, baseType: !49, size: 32, align: 32, offset: 736)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !423, file: !4, line: 173, baseType: !27, size: 32, align: 32, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !423, file: !4, line: 174, baseType: !27, size: 32, align: 32, offset: 800)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !423, file: !4, line: 175, baseType: !222, size: 32, align: 32, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !423, file: !4, line: 177, baseType: !446, size: 8192, align: 32, offset: 864)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 32, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !423, file: !4, line: 178, baseType: !222, size: 32, align: 32, offset: 9056)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !423, file: !4, line: 179, baseType: !49, size: 32, align: 32, offset: 9088)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !423, file: !4, line: 180, baseType: !222, size: 32, align: 32, offset: 9120)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !423, file: !4, line: 181, baseType: !222, size: 32, align: 32, offset: 9152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !423, file: !4, line: 182, baseType: !49, size: 32, align: 32, offset: 9184)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !423, file: !4, line: 184, baseType: !49, size: 32, align: 32, offset: 9216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !423, file: !4, line: 185, baseType: !49, size: 32, align: 32, offset: 9248)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !423, file: !4, line: 186, baseType: !49, size: 32, align: 32, offset: 9280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !423, file: !4, line: 187, baseType: !222, size: 32, align: 32, offset: 9312)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !423, file: !4, line: 188, baseType: !222, size: 32, align: 32, offset: 9344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !423, file: !4, line: 189, baseType: !222, size: 32, align: 32, offset: 9376)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !423, file: !4, line: 190, baseType: !222, size: 32, align: 32, offset: 9408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !423, file: !4, line: 191, baseType: !49, size: 32, align: 32, offset: 9440)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !423, file: !4, line: 192, baseType: !463, size: 7584, align: 32, offset: 9472)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !464, file: !4, line: 65, baseType: !49, size: 32, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !464, file: !4, line: 66, baseType: !222, size: 32, align: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !464, file: !4, line: 67, baseType: !222, size: 32, align: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !464, file: !4, line: 68, baseType: !222, size: 32, align: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !464, file: !4, line: 69, baseType: !49, size: 32, align: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !464, file: !4, line: 70, baseType: !49, size: 32, align: 32, offset: 160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !464, file: !4, line: 71, baseType: !49, size: 32, align: 32, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !464, file: !4, line: 72, baseType: !222, size: 32, align: 32, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !464, file: !4, line: 73, baseType: !49, size: 32, align: 32, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !464, file: !4, line: 74, baseType: !49, size: 32, align: 32, offset: 288)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !464, file: !4, line: 75, baseType: !222, size: 32, align: 32, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !464, file: !4, line: 76, baseType: !222, size: 32, align: 32, offset: 352)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !464, file: !4, line: 77, baseType: !222, size: 32, align: 32, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !464, file: !4, line: 78, baseType: !49, size: 32, align: 32, offset: 416)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !464, file: !4, line: 79, baseType: !222, size: 32, align: 32, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !464, file: !4, line: 80, baseType: !222, size: 32, align: 32, offset: 480)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !464, file: !4, line: 81, baseType: !49, size: 32, align: 32, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !464, file: !4, line: 82, baseType: !222, size: 32, align: 32, offset: 544)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !464, file: !4, line: 83, baseType: !222, size: 32, align: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !464, file: !4, line: 84, baseType: !49, size: 32, align: 32, offset: 608)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !464, file: !4, line: 85, baseType: !49, size: 32, align: 32, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !464, file: !4, line: 86, baseType: !488, size: 3296, align: 32, offset: 672)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !490)
!490 = !{!491, !492, !493, !494, !498, !499, !500, !501, !502, !503}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !489, file: !4, line: 50, baseType: !222, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !489, file: !4, line: 51, baseType: !222, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !489, file: !4, line: 52, baseType: !222, size: 32, align: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !489, file: !4, line: 53, baseType: !495, size: 1024, align: 32, offset: 96)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1024, align: 32, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !489, file: !4, line: 54, baseType: !495, size: 1024, align: 32, offset: 1120)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !489, file: !4, line: 55, baseType: !495, size: 1024, align: 32, offset: 2144)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !489, file: !4, line: 56, baseType: !222, size: 32, align: 32, offset: 3168)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !489, file: !4, line: 57, baseType: !222, size: 32, align: 32, offset: 3200)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !489, file: !4, line: 58, baseType: !222, size: 32, align: 32, offset: 3232)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !489, file: !4, line: 59, baseType: !222, size: 32, align: 32, offset: 3264)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !464, file: !4, line: 87, baseType: !49, size: 32, align: 32, offset: 3968)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !464, file: !4, line: 88, baseType: !488, size: 3296, align: 32, offset: 4000)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !464, file: !4, line: 90, baseType: !49, size: 32, align: 32, offset: 7296)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !464, file: !4, line: 91, baseType: !49, size: 32, align: 32, offset: 7328)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !464, file: !4, line: 92, baseType: !49, size: 32, align: 32, offset: 7360)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !464, file: !4, line: 93, baseType: !222, size: 32, align: 32, offset: 7392)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !464, file: !4, line: 94, baseType: !222, size: 32, align: 32, offset: 7424)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !464, file: !4, line: 95, baseType: !222, size: 32, align: 32, offset: 7456)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !464, file: !4, line: 96, baseType: !222, size: 32, align: 32, offset: 7488)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !464, file: !4, line: 97, baseType: !222, size: 32, align: 32, offset: 7520)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !464, file: !4, line: 98, baseType: !222, size: 32, align: 32, offset: 7552)
!515 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !27, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!516 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !27, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!517 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !518, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!519 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !518, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!520 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !521, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!522 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !27, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!523 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !27, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!524 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !27, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!525 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !27, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!526 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !371, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!527 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !371, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!528 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !374, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!529 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !374, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!530 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !371, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!531 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !374, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!532 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !371, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!533 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !374, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!534 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !535, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!539 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !536, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!540 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !541, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!542 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !541, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!543 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !27, isLocal: false, isDefinition: true, variable: i32* @intras)
!544 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !27, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!545 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !27, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!546 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !27, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!547 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !27, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!548 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !27, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!549 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !27, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!550 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !27, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!551 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !552, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 2400, align: 8, elements: !554)
!553 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!554 = !{!555}
!555 = !DISubrange(count: 300)
!556 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !557, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 32, elements: !558)
!558 = !{!559, !559}
!559 = !DISubrange(count: 16)
!560 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !557, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!561 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !557, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!562 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !557, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!563 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !557, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!564 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !557, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!565 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !566, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24576, align: 32, elements: !567)
!567 = !{!287, !559, !559}
!568 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !569, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, align: 32, elements: !570)
!570 = !{!292, !304, !304}
!571 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !569, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!572 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !569, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!573 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !569, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!574 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !575, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, align: 32, elements: !576)
!576 = !{!304, !304}
!577 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !578, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, align: 32, elements: !579)
!579 = !{!559}
!580 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !581, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !583, file: !9, line: 1184, baseType: !27, size: 32, align: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !583, file: !9, line: 1185, baseType: !27, size: 32, align: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !583, file: !9, line: 1186, baseType: !27, size: 32, align: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !583, file: !9, line: 1187, baseType: !27, size: 32, align: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !583, file: !9, line: 1188, baseType: !27, size: 32, align: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !583, file: !9, line: 1189, baseType: !27, size: 32, align: 32, offset: 160)
!591 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !592, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !606, !607, !608, !609, !610, !615, !616, !620, !621, !622, !623, !625, !626, !627, !628, !629, !630, !631}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !594, file: !9, line: 1147, baseType: !23, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !594, file: !9, line: 1149, baseType: !557, size: 8192, align: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !594, file: !9, line: 1150, baseType: !557, size: 8192, align: 32, offset: 8256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !594, file: !9, line: 1150, baseType: !557, size: 8192, align: 32, offset: 16448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !594, file: !9, line: 1151, baseType: !521, size: 64, align: 64, offset: 24640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !594, file: !9, line: 1152, baseType: !518, size: 64, align: 64, offset: 24704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !594, file: !9, line: 1153, baseType: !27, size: 32, align: 32, offset: 24768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !594, file: !9, line: 1155, baseType: !27, size: 32, align: 32, offset: 24800)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !594, file: !9, line: 1157, baseType: !605, size: 128, align: 32, offset: 24832)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, align: 32, elements: !303)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !594, file: !9, line: 1157, baseType: !605, size: 128, align: 32, offset: 24960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !594, file: !9, line: 1158, baseType: !376, size: 64, align: 64, offset: 25088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !594, file: !9, line: 1159, baseType: !578, size: 512, align: 32, offset: 25152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !594, file: !9, line: 1160, baseType: !27, size: 32, align: 32, offset: 25664)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !594, file: !9, line: 1161, baseType: !611, size: 64, align: 64, offset: 25728)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !613, line: 30, baseType: !614)
!613 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!614 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !594, file: !9, line: 1162, baseType: !27, size: 32, align: 32, offset: 25792)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !594, file: !9, line: 1163, baseType: !617, size: 64, align: 64, offset: 25856)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !594, file: !9, line: 1164, baseType: !617, size: 64, align: 64, offset: 25920)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !594, file: !9, line: 1165, baseType: !617, size: 64, align: 64, offset: 25984)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !594, file: !9, line: 1166, baseType: !617, size: 64, align: 64, offset: 26048)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !594, file: !9, line: 1167, baseType: !624, size: 512, align: 16, offset: 26112)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 512, align: 16, elements: !570)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !594, file: !9, line: 1168, baseType: !27, size: 32, align: 32, offset: 26624)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !594, file: !9, line: 1169, baseType: !27, size: 32, align: 32, offset: 26656)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !594, file: !9, line: 1171, baseType: !27, size: 32, align: 32, offset: 26688)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !594, file: !9, line: 1172, baseType: !27, size: 32, align: 32, offset: 26720)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !594, file: !9, line: 1174, baseType: !27, size: 32, align: 32, offset: 26752)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !594, file: !9, line: 1175, baseType: !27, size: 32, align: 32, offset: 26784)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !594, file: !9, line: 1176, baseType: !27, size: 32, align: 32, offset: 26816)
!632 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !593, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!633 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !593, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!634 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !593, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!635 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !593, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!636 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !637, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !639, line: 153, baseType: !640)
!639 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !639, line: 122, size: 1216, align: 64, elements: !641)
!641 = !{!642, !644, !645, !646, !647, !648, !653, !654, !655, !659, !664, !673, !679, !680, !683, !684, !686, !690, !691, !692}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !640, file: !639, line: 123, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !640, file: !639, line: 124, baseType: !27, size: 32, align: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !640, file: !639, line: 125, baseType: !27, size: 32, align: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !640, file: !639, line: 126, baseType: !538, size: 16, align: 16, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !640, file: !639, line: 127, baseType: !538, size: 16, align: 16, offset: 144)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !640, file: !639, line: 128, baseType: !649, size: 128, align: 64, offset: 192)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !639, line: 88, size: 128, align: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !649, file: !639, line: 89, baseType: !643, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !649, file: !639, line: 90, baseType: !27, size: 32, align: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !640, file: !639, line: 129, baseType: !27, size: 32, align: 32, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !640, file: !639, line: 132, baseType: !24, size: 64, align: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !640, file: !639, line: 133, baseType: !656, size: 64, align: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!27, !24}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !640, file: !639, line: 134, baseType: !660, size: 64, align: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!27, !24, !663, !27}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !640, file: !639, line: 135, baseType: !665, size: 64, align: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !24, !668, !27}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !639, line: 77, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !670, line: 71, baseType: !671)
!670 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !672, line: 46, baseType: !614)
!672 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !640, file: !639, line: 136, baseType: !674, size: 64, align: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, align: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!27, !24, !677, !27}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !640, file: !639, line: 139, baseType: !649, size: 128, align: 64, offset: 704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !640, file: !639, line: 140, baseType: !681, size: 64, align: 64, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !639, line: 94, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !640, file: !639, line: 141, baseType: !27, size: 32, align: 32, offset: 896)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !640, file: !639, line: 144, baseType: !685, size: 24, align: 8, offset: 928)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 24, align: 8, elements: !308)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !640, file: !639, line: 145, baseType: !687, size: 8, align: 8, offset: 952)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 8, align: 8, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 1)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !640, file: !639, line: 148, baseType: !649, size: 128, align: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !640, file: !639, line: 151, baseType: !27, size: 32, align: 32, offset: 1088)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !640, file: !639, line: 152, baseType: !668, size: 64, align: 64, offset: 1152)
!693 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !637, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!694 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !637, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!695 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !27, isLocal: false, isDefinition: true, variable: i32* @p_in)
!696 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !27, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!697 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !698, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 640, align: 32, elements: !101)
!699 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !698, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!700 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !698, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!701 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !698, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!702 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !698, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!703 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !698, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!704 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !27, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!705 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !27, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!706 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !27, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!707 = !DIGlobalVariable(name: "bit_rate", scope: !0, file: !708, line: 124, type: !23, isLocal: false, isDefinition: true, variable: double* @bit_rate)
!708 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/ratectl.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!709 = !DIGlobalVariable(name: "frame_rate", scope: !0, file: !708, line: 125, type: !23, isLocal: false, isDefinition: true, variable: double* @frame_rate)
!710 = !DIGlobalVariable(name: "GAMMAP", scope: !0, file: !708, line: 126, type: !23, isLocal: false, isDefinition: true, variable: double* @GAMMAP)
!711 = !DIGlobalVariable(name: "BETAP", scope: !0, file: !708, line: 127, type: !23, isLocal: false, isDefinition: true, variable: double* @BETAP)
!712 = !DIGlobalVariable(name: "RC_MAX_QUANT", scope: !0, file: !708, line: 129, type: !27, isLocal: false, isDefinition: true, variable: i32* @RC_MAX_QUANT)
!713 = !DIGlobalVariable(name: "RC_MIN_QUANT", scope: !0, file: !708, line: 130, type: !27, isLocal: false, isDefinition: true, variable: i32* @RC_MIN_QUANT)
!714 = !DIGlobalVariable(name: "BufferSize", scope: !0, file: !708, line: 132, type: !23, isLocal: false, isDefinition: true, variable: double* @BufferSize)
!715 = !DIGlobalVariable(name: "GOPTargetBufferLevel", scope: !0, file: !708, line: 133, type: !23, isLocal: false, isDefinition: true, variable: double* @GOPTargetBufferLevel)
