; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/rdopt.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.CSobj = type { i32, %struct.EncodingEnvironment*, %struct.Bitstream*, i32, %struct.MotionInfoContexts*, %struct.TextureInfoContexts*, i32, [8 x i32], [2 x [4 x [4 x [2 x i32]]]], i64 }
%struct.EncodingEnvironment = type { i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i8*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.Bitstream = type { i32, i32, i8, i32, i32, i8, i8, i32, i32, i8*, i32 }
%struct.MotionInfoContexts = type { [3 x [11 x %struct.BiContextType]], [2 x [9 x %struct.BiContextType]], [2 x [10 x %struct.BiContextType]], [2 x [6 x %struct.BiContextType]], [4 x %struct.BiContextType], [4 x %struct.BiContextType], [3 x %struct.BiContextType] }
%struct.BiContextType = type { i16, i8, i64 }
%struct.TextureInfoContexts = type { [2 x %struct.BiContextType], [4 x %struct.BiContextType], [3 x [4 x %struct.BiContextType]], [10 x [4 x %struct.BiContextType]], [10 x [15 x %struct.BiContextType]], [10 x [15 x %struct.BiContextType]], [10 x [5 x %struct.BiContextType]], [10 x [5 x %struct.BiContextType]], [10 x [15 x %struct.BiContextType]], [10 x [15 x %struct.BiContextType]] }

!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 3, scope: !78, file: !1, line: 241, type: !62)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 4, scope: !78, file: !1, line: 241, type: !62)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !78, file: !1, line: 243, type: !62)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !78, file: !1, line: 243, type: !62)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !78, file: !1, line: 243, type: !62)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !78, file: !1, line: 243, type: !62)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !78, file: !1, line: 243, type: !62)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !78, file: !1, line: 243, type: !62)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y_pos", scope: !78, file: !1, line: 243, type: !62)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_pos", scope: !78, file: !1, line: 243, type: !62)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yy", scope: !78, file: !1, line: 243, type: !62)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xx", scope: !78, file: !1, line: 243, type: !62)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pres_x", scope: !78, file: !1, line: 243, type: !62)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pres_y", scope: !78, file: !1, line: 243, type: !62)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxold_x", scope: !78, file: !1, line: 244, type: !62)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxold_y", scope: !78, file: !1, line: 245, type: !62)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_frame", scope: !78, file: !1, line: 246, type: !62)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by0", scope: !78, file: !1, line: 248, type: !62)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by1", scope: !78, file: !1, line: 249, type: !62)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx0", scope: !78, file: !1, line: 250, type: !62)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx1", scope: !78, file: !1, line: 251, type: !62)
!105 = !DISubprogram(name: "RDCost_for_4x4IntraBlocks", scope: !1, file: !1, line: 376, type: !106, isLocal: false, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: true, function: double (i32*, i32, i32, i32, double, double, i32)* @RDCost_for_4x4IntraBlocks, variables: !109)
!106 = !DISubroutineType(types: !107)
!107 = !{!61, !108, !62, !62, !62, !61, !61, !62}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !132, !311, !375, !376, !379}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nonzero", arg: 1, scope: !105, file: !1, line: 376, type: !108)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 2, scope: !105, file: !1, line: 377, type: !62)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b4", arg: 3, scope: !105, file: !1, line: 378, type: !62)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ipmode", arg: 4, scope: !105, file: !1, line: 379, type: !62)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 5, scope: !105, file: !1, line: 380, type: !61)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_rdcost", arg: 6, scope: !105, file: !1, line: 381, type: !61)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mostProbableMode", arg: 7, scope: !105, file: !1, line: 382, type: !62)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdcost", scope: !105, file: !1, line: 384, type: !61)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !105, file: !1, line: 385, type: !62)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !105, file: !1, line: 385, type: !62)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !105, file: !1, line: 385, type: !62)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !105, file: !1, line: 385, type: !62)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distortion", scope: !105, file: !1, line: 386, type: !62)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !105, file: !1, line: 387, type: !62)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !105, file: !1, line: 388, type: !62)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !105, file: !1, line: 389, type: !62)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !105, file: !1, line: 390, type: !62)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_y", scope: !105, file: !1, line: 391, type: !62)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !105, file: !1, line: 392, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !105, file: !1, line: 394, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !221, !259, !286, !295, !296, !297, !298, !299, !300, !301, !302, !303, !308}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !135, file: !4, line: 445, baseType: !62, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !135, file: !4, line: 446, baseType: !62, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !135, file: !4, line: 447, baseType: !62, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !135, file: !4, line: 448, baseType: !62, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !135, file: !4, line: 449, baseType: !62, size: 32, align: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !135, file: !4, line: 450, baseType: !62, size: 32, align: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !135, file: !4, line: 451, baseType: !144, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !147)
!147 = !{!148, !168, !193}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !146, file: !4, line: 433, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !152)
!152 = !{!153, !154, !155, !159, !160, !161, !162, !163, !164, !165, !167}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !151, file: !4, line: 413, baseType: !62, size: 32, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !151, file: !4, line: 414, baseType: !62, size: 32, align: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !151, file: !4, line: 415, baseType: !156, size: 8, align: 8, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !157, line: 30, baseType: !158)
!157 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!158 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !151, file: !4, line: 416, baseType: !62, size: 32, align: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !151, file: !4, line: 417, baseType: !62, size: 32, align: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !151, file: !4, line: 418, baseType: !156, size: 8, align: 8, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !151, file: !4, line: 420, baseType: !156, size: 8, align: 8, offset: 168)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !151, file: !4, line: 421, baseType: !62, size: 32, align: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !151, file: !4, line: 422, baseType: !62, size: 32, align: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !151, file: !4, line: 424, baseType: !166, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !151, file: !4, line: 425, baseType: !62, size: 32, align: 32, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !146, file: !4, line: 434, baseType: !169, size: 832, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !171)
!171 = !{!172, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !170, file: !4, line: 209, baseType: !173, size: 32, align: 32)
!173 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !170, file: !4, line: 209, baseType: !173, size: 32, align: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !170, file: !4, line: 210, baseType: !173, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !170, file: !4, line: 211, baseType: !173, size: 32, align: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !170, file: !4, line: 212, baseType: !173, size: 32, align: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !170, file: !4, line: 213, baseType: !166, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !170, file: !4, line: 214, baseType: !108, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !170, file: !4, line: 217, baseType: !173, size: 32, align: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !170, file: !4, line: 217, baseType: !173, size: 32, align: 32, offset: 352)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !170, file: !4, line: 218, baseType: !173, size: 32, align: 32, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !170, file: !4, line: 219, baseType: !173, size: 32, align: 32, offset: 416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !170, file: !4, line: 220, baseType: !173, size: 32, align: 32, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !170, file: !4, line: 221, baseType: !166, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !170, file: !4, line: 222, baseType: !108, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !170, file: !4, line: 223, baseType: !62, size: 32, align: 32, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !170, file: !4, line: 223, baseType: !62, size: 32, align: 32, offset: 672)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !170, file: !4, line: 224, baseType: !62, size: 32, align: 32, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !170, file: !4, line: 224, baseType: !62, size: 32, align: 32, offset: 736)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !170, file: !4, line: 225, baseType: !62, size: 32, align: 32, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !170, file: !4, line: 225, baseType: !62, size: 32, align: 32, offset: 800)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !146, file: !4, line: 436, baseType: !194, size: 64, align: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!62, !197, !220}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !199)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !213}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !4, line: 329, baseType: !62, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !199, file: !4, line: 330, baseType: !62, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !199, file: !4, line: 331, baseType: !62, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !199, file: !4, line: 332, baseType: !62, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !199, file: !4, line: 333, baseType: !62, size: 32, align: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !199, file: !4, line: 334, baseType: !173, size: 32, align: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !199, file: !4, line: 335, baseType: !62, size: 32, align: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !199, file: !4, line: 336, baseType: !62, size: 32, align: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !199, file: !4, line: 344, baseType: !210, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !62, !62, !108, !108}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !199, file: !4, line: 346, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !217, !218}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !135, file: !4, line: 452, baseType: !222, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !225)
!225 = !{!226, !238, !243, !247, !251, !255, !256}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !224, file: !4, line: 260, baseType: !227, size: 4224, align: 64)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 4224, align: 64, elements: !235)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !229, file: !4, line: 233, baseType: !131, size: 16, align: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !229, file: !4, line: 234, baseType: !158, size: 8, align: 8, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !229, file: !4, line: 236, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!235 = !{!236, !237}
!236 = !DISubrange(count: 3)
!237 = !DISubrange(count: 11)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !224, file: !4, line: 261, baseType: !239, size: 2304, align: 64, offset: 4224)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 2304, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DISubrange(count: 2)
!242 = !DISubrange(count: 9)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !224, file: !4, line: 262, baseType: !244, size: 2560, align: 64, offset: 6528)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 2560, align: 64, elements: !245)
!245 = !{!241, !246}
!246 = !DISubrange(count: 10)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !224, file: !4, line: 263, baseType: !248, size: 1536, align: 64, offset: 9088)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 1536, align: 64, elements: !249)
!249 = !{!241, !250}
!250 = !DISubrange(count: 6)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !224, file: !4, line: 264, baseType: !252, size: 512, align: 64, offset: 10624)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 512, align: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 4)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !224, file: !4, line: 265, baseType: !252, size: 512, align: 64, offset: 11136)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !224, file: !4, line: 266, baseType: !257, size: 384, align: 64, offset: 11648)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 384, align: 64, elements: !258)
!258 = !{!236}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !135, file: !4, line: 453, baseType: !260, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !263)
!263 = !{!264, !267, !268, !271, !274, !278, !279, !283, !284, !285}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !262, file: !4, line: 283, baseType: !265, size: 256, align: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 256, align: 64, elements: !266)
!266 = !{!241}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !262, file: !4, line: 284, baseType: !252, size: 512, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !262, file: !4, line: 285, baseType: !269, size: 1536, align: 64, offset: 768)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 1536, align: 64, elements: !270)
!270 = !{!236, !254}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !262, file: !4, line: 286, baseType: !272, size: 5120, align: 64, offset: 2304)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 5120, align: 64, elements: !273)
!273 = !{!246, !254}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !262, file: !4, line: 287, baseType: !275, size: 19200, align: 64, offset: 7424)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 19200, align: 64, elements: !276)
!276 = !{!246, !277}
!277 = !DISubrange(count: 15)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !262, file: !4, line: 288, baseType: !275, size: 19200, align: 64, offset: 26624)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !262, file: !4, line: 289, baseType: !280, size: 6400, align: 64, offset: 45824)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 6400, align: 64, elements: !281)
!281 = !{!246, !282}
!282 = !DISubrange(count: 5)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !262, file: !4, line: 290, baseType: !280, size: 6400, align: 64, offset: 52224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !262, file: !4, line: 291, baseType: !275, size: 19200, align: 64, offset: 58624)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !262, file: !4, line: 292, baseType: !275, size: 19200, align: 64, offset: 77824)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !135, file: !4, line: 456, baseType: !287, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !289)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !289, file: !4, line: 310, baseType: !62, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !289, file: !4, line: 311, baseType: !62, size: 32, align: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !289, file: !4, line: 312, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !135, file: !4, line: 458, baseType: !62, size: 32, align: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !135, file: !4, line: 459, baseType: !108, size: 64, align: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !135, file: !4, line: 460, baseType: !108, size: 64, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !135, file: !4, line: 461, baseType: !108, size: 64, align: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !135, file: !4, line: 462, baseType: !62, size: 32, align: 32, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !135, file: !4, line: 463, baseType: !108, size: 64, align: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !135, file: !4, line: 464, baseType: !108, size: 64, align: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !135, file: !4, line: 465, baseType: !108, size: 64, align: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !135, file: !4, line: 467, baseType: !304, size: 64, align: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !62}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !12, line: 45, baseType: !11)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !135, file: !4, line: 469, baseType: !309, size: 192, align: 32, offset: 1024)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 192, align: 32, elements: !310)
!310 = !{!236, !241}
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !105, file: !1, line: 395, type: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !4, line: 406, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !4, line: 351, size: 5056, align: 64, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !325, !327, !328, !329, !332, !336, !337, !338, !343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !314, file: !4, line: 353, baseType: !62, size: 32, align: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !314, file: !4, line: 354, baseType: !62, size: 32, align: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !314, file: !4, line: 355, baseType: !62, size: 32, align: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !314, file: !4, line: 356, baseType: !62, size: 32, align: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !314, file: !4, line: 357, baseType: !62, size: 32, align: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !314, file: !4, line: 358, baseType: !322, size: 256, align: 32, offset: 160)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !314, file: !4, line: 360, baseType: !326, size: 64, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !314, file: !4, line: 361, baseType: !326, size: 64, align: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !314, file: !4, line: 363, baseType: !62, size: 32, align: 32, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !314, file: !4, line: 364, baseType: !330, size: 2048, align: 32, offset: 608)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, align: 32, elements: !331)
!331 = !{!241, !254, !254, !241}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !314, file: !4, line: 365, baseType: !333, size: 512, align: 32, offset: 2656)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 512, align: 32, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !314, file: !4, line: 366, baseType: !333, size: 512, align: 32, offset: 3168)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !314, file: !4, line: 367, baseType: !62, size: 32, align: 32, offset: 3680)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !314, file: !4, line: 368, baseType: !339, size: 64, align: 64, offset: 3712)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !341, line: 30, baseType: !342)
!341 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!342 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !314, file: !4, line: 369, baseType: !344, size: 128, align: 32, offset: 3776)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, align: 32, elements: !253)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !314, file: !4, line: 370, baseType: !344, size: 128, align: 32, offset: 3904)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !314, file: !4, line: 371, baseType: !234, size: 64, align: 64, offset: 4032)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !314, file: !4, line: 373, baseType: !62, size: 32, align: 32, offset: 4096)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !314, file: !4, line: 374, baseType: !62, size: 32, align: 32, offset: 4128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !314, file: !4, line: 375, baseType: !62, size: 32, align: 32, offset: 4160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !314, file: !4, line: 377, baseType: !62, size: 32, align: 32, offset: 4192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !314, file: !4, line: 378, baseType: !62, size: 32, align: 32, offset: 4224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !314, file: !4, line: 380, baseType: !62, size: 32, align: 32, offset: 4256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !314, file: !4, line: 382, baseType: !62, size: 32, align: 32, offset: 4288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !314, file: !4, line: 382, baseType: !62, size: 32, align: 32, offset: 4320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !314, file: !4, line: 382, baseType: !62, size: 32, align: 32, offset: 4352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !314, file: !4, line: 382, baseType: !62, size: 32, align: 32, offset: 4384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !314, file: !4, line: 383, baseType: !62, size: 32, align: 32, offset: 4416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !314, file: !4, line: 383, baseType: !62, size: 32, align: 32, offset: 4448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !314, file: !4, line: 383, baseType: !62, size: 32, align: 32, offset: 4480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !314, file: !4, line: 383, baseType: !62, size: 32, align: 32, offset: 4512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !314, file: !4, line: 385, baseType: !62, size: 32, align: 32, offset: 4544)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !314, file: !4, line: 386, baseType: !62, size: 32, align: 32, offset: 4576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !314, file: !4, line: 387, baseType: !62, size: 32, align: 32, offset: 4608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !314, file: !4, line: 390, baseType: !62, size: 32, align: 32, offset: 4640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !314, file: !4, line: 394, baseType: !61, size: 64, align: 64, offset: 4672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !314, file: !4, line: 395, baseType: !62, size: 32, align: 32, offset: 4736)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !314, file: !4, line: 396, baseType: !62, size: 32, align: 32, offset: 4768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !314, file: !4, line: 397, baseType: !62, size: 32, align: 32, offset: 4800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !314, file: !4, line: 398, baseType: !62, size: 32, align: 32, offset: 4832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !314, file: !4, line: 399, baseType: !62, size: 32, align: 32, offset: 4864)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !314, file: !4, line: 401, baseType: !62, size: 32, align: 32, offset: 4896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !314, file: !4, line: 402, baseType: !62, size: 32, align: 32, offset: 4928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !314, file: !4, line: 403, baseType: !62, size: 32, align: 32, offset: 4960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !314, file: !4, line: 405, baseType: !62, size: 32, align: 32, offset: 4992)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !105, file: !1, line: 396, type: !197)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !105, file: !1, line: 397, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !105, file: !1, line: 398, type: !144)
!380 = !DISubprogram(name: "RDCost_for_4x4Blocks_Chroma", scope: !1, file: !1, line: 459, type: !381, isLocal: false, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @RDCost_for_4x4Blocks_Chroma, variables: !383)
!381 = !DISubroutineType(types: !382)
!382 = !{!62, !62, !62, !62}
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !396, !397, !398, !399, !400, !401}
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !380, file: !1, line: 459, type: !62)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b4", arg: 2, scope: !380, file: !1, line: 460, type: !62)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chroma", arg: 3, scope: !380, file: !1, line: 461, type: !62)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !380, file: !1, line: 463, type: !62)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !380, file: !1, line: 465, type: !133)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !380, file: !1, line: 466, type: !312)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !380, file: !1, line: 467, type: !197)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !380, file: !1, line: 468, type: !377)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !380, file: !1, line: 469, type: !62)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !394, file: !1, line: 487, type: !108)
!394 = distinct !DILexicalBlock(scope: !395, file: !1, line: 486, column: 3)
!395 = distinct !DILexicalBlock(scope: !380, file: !1, line: 481, column: 7)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !394, file: !1, line: 487, type: !108)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !394, file: !1, line: 488, type: !62)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !394, file: !1, line: 488, type: !62)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !394, file: !1, line: 488, type: !62)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !394, file: !1, line: 489, type: !144)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitCount", scope: !394, file: !1, line: 490, type: !108)
!402 = !DISubprogram(name: "Mode_Decision_for_4x4IntraBlocks", scope: !1, file: !1, line: 536, type: !403, isLocal: false, isDefinition: true, scopeLine: 537, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, double, i32*)* @Mode_Decision_for_4x4IntraBlocks, variables: !405)
!403 = !DISubroutineType(types: !404)
!404 = !{!62, !62, !62, !61, !108}
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !451, !452, !453, !454, !455, !456, !457, !458, !459, !462}
!406 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !402, file: !1, line: 536, type: !62)
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b4", arg: 2, scope: !402, file: !1, line: 536, type: !62)
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 3, scope: !402, file: !1, line: 536, type: !61)
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_cost", arg: 4, scope: !402, file: !1, line: 536, type: !108)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipmode", scope: !402, file: !1, line: 538, type: !62)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_ipmode", scope: !402, file: !1, line: 538, type: !62)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !402, file: !1, line: 538, type: !62)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !402, file: !1, line: 538, type: !62)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !402, file: !1, line: 538, type: !62)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !402, file: !1, line: 538, type: !62)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !402, file: !1, line: 538, type: !62)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !402, file: !1, line: 538, type: !62)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !402, file: !1, line: 538, type: !62)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_nz", scope: !402, file: !1, line: 539, type: !62)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !402, file: !1, line: 539, type: !62)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rec4x4", scope: !402, file: !1, line: 539, type: !422)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 512, align: 32, elements: !423)
!423 = !{!254, !254}
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !402, file: !1, line: 539, type: !333)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdcost", scope: !402, file: !1, line: 540, type: !61)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !402, file: !1, line: 541, type: !62)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !402, file: !1, line: 542, type: !62)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !402, file: !1, line: 543, type: !62)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !402, file: !1, line: 544, type: !62)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_x", scope: !402, file: !1, line: 545, type: !62)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_y", scope: !402, file: !1, line: 546, type: !62)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_x", scope: !402, file: !1, line: 547, type: !62)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_y", scope: !402, file: !1, line: 548, type: !62)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_rdcost", scope: !402, file: !1, line: 549, type: !61)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_available", scope: !402, file: !1, line: 559, type: !62)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up_available", scope: !402, file: !1, line: 559, type: !62)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_available", scope: !402, file: !1, line: 559, type: !62)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upMode", scope: !402, file: !1, line: 561, type: !62)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftMode", scope: !402, file: !1, line: 562, type: !62)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mostProbableMode", scope: !402, file: !1, line: 563, type: !62)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_block", scope: !402, file: !1, line: 565, type: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !4, line: 305, baseType: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !4, line: 297, size: 192, align: 32, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !443, file: !4, line: 299, baseType: !62, size: 32, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !443, file: !4, line: 300, baseType: !62, size: 32, align: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !443, file: !4, line: 301, baseType: !62, size: 32, align: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !443, file: !4, line: 302, baseType: !62, size: 32, align: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !443, file: !4, line: 303, baseType: !62, size: 32, align: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !443, file: !4, line: 304, baseType: !62, size: 32, align: 32, offset: 160)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top_block", scope: !402, file: !1, line: 566, type: !442)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !402, file: !1, line: 573, type: !62)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !402, file: !1, line: 573, type: !62)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !402, file: !1, line: 573, type: !62)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !402, file: !1, line: 574, type: !62)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distortion", scope: !402, file: !1, line: 574, type: !62)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !402, file: !1, line: 574, type: !62)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_ipmode", scope: !402, file: !1, line: 575, type: !62)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rec4x4_c", scope: !402, file: !1, line: 576, type: !460)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 1024, align: 32, elements: !461)
!461 = !{!241, !254, !254}
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "available_mode", scope: !463, file: !1, line: 601, type: !62)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 600, column: 3)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 599, column: 3)
!465 = distinct !DILexicalBlock(scope: !402, file: !1, line: 599, column: 3)
!466 = !DISubprogram(name: "Mode_Decision_for_8x8IntraBlocks", scope: !1, file: !1, line: 912, type: !467, isLocal: false, isDefinition: true, scopeLine: 913, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, double, i32*)* @Mode_Decision_for_8x8IntraBlocks, variables: !469)
!467 = !DISubroutineType(types: !468)
!468 = !{!62, !62, !61, !108}
!469 = !{!470, !471, !472, !473, !474, !475}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !466, file: !1, line: 912, type: !62)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 2, scope: !466, file: !1, line: 912, type: !61)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cost", arg: 3, scope: !466, file: !1, line: 912, type: !108)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !466, file: !1, line: 914, type: !62)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !466, file: !1, line: 914, type: !62)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost4x4", scope: !466, file: !1, line: 915, type: !62)
!476 = !DISubprogram(name: "Mode_Decision_for_Intra4x4Macroblock", scope: !1, file: !1, line: 937, type: !477, isLocal: false, isDefinition: true, scopeLine: 939, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i32*)* @Mode_Decision_for_Intra4x4Macroblock, variables: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{!62, !61, !108}
!479 = !{!480, !481, !482, !483, !484}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 1, scope: !476, file: !1, line: 937, type: !61)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cost", arg: 2, scope: !476, file: !1, line: 937, type: !108)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp", scope: !476, file: !1, line: 940, type: !62)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !476, file: !1, line: 940, type: !62)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8", scope: !476, file: !1, line: 940, type: !62)
!485 = !DISubprogram(name: "RDCost_for_8x8blocks", scope: !1, file: !1, line: 961, type: !486, isLocal: false, isDefinition: true, scopeLine: 969, flags: DIFlagPrototyped, isOptimized: true, function: double (i32*, i64*, double, i32, i32, i16, i16, i16)* @RDCost_for_8x8blocks, variables: !489)
!486 = !DISubroutineType(types: !487)
!487 = !{!61, !108, !488, !61, !62, !62, !63, !63, !63}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cnt_nonz", arg: 1, scope: !485, file: !1, line: 961, type: !108)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp_blk", arg: 2, scope: !485, file: !1, line: 962, type: !488)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 3, scope: !485, file: !1, line: 963, type: !61)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 4, scope: !485, file: !1, line: 964, type: !62)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 5, scope: !485, file: !1, line: 965, type: !62)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdir", arg: 6, scope: !485, file: !1, line: 966, type: !63)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 7, scope: !485, file: !1, line: 967, type: !63)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bwd_ref", arg: 8, scope: !485, file: !1, line: 968, type: !63)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !485, file: !1, line: 970, type: !62)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !485, file: !1, line: 970, type: !62)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !485, file: !1, line: 970, type: !62)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !485, file: !1, line: 971, type: !62)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distortion", scope: !485, file: !1, line: 972, type: !339)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !485, file: !1, line: 973, type: !62)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mrate", scope: !485, file: !1, line: 973, type: !62)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_mode", scope: !485, file: !1, line: 974, type: !62)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_mode", scope: !485, file: !1, line: 974, type: !62)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp", scope: !485, file: !1, line: 975, type: !62)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pax", scope: !485, file: !1, line: 976, type: !62)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pay", scope: !485, file: !1, line: 977, type: !62)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !485, file: !1, line: 978, type: !62)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !485, file: !1, line: 979, type: !62)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !485, file: !1, line: 980, type: !62)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direct", scope: !485, file: !1, line: 981, type: !62)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8value", scope: !485, file: !1, line: 982, type: !62)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !485, file: !1, line: 984, type: !312)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !485, file: !1, line: 985, type: !197)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !485, file: !1, line: 986, type: !133)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !485, file: !1, line: 987, type: !144)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !485, file: !1, line: 988, type: !377)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep_dp", scope: !485, file: !1, line: 990, type: !218)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !485, file: !1, line: 993, type: !62)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !485, file: !1, line: 993, type: !62)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !485, file: !1, line: 993, type: !62)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !485, file: !1, line: 993, type: !62)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !485, file: !1, line: 993, type: !62)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4_x", scope: !485, file: !1, line: 994, type: !62)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4_y", scope: !485, file: !1, line: 994, type: !62)
!528 = !DISubprogram(name: "I16Offset", scope: !1, file: !1, line: 1173, type: !529, isLocal: false, isDefinition: true, scopeLine: 1174, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @I16Offset, variables: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{!62, !62, !62}
!531 = !{!532, !533}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp", arg: 1, scope: !528, file: !1, line: 1173, type: !62)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i16mode", arg: 2, scope: !528, file: !1, line: 1173, type: !62)
!534 = !DISubprogram(name: "SetModesAndRefframeForBlocks", scope: !1, file: !1, line: 1185, type: !535, isLocal: false, isDefinition: true, scopeLine: 1186, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @SetModesAndRefframeForBlocks, variables: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !62}
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !534, file: !1, line: 1185, type: !62)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !534, file: !1, line: 1187, type: !62)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !534, file: !1, line: 1187, type: !62)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !534, file: !1, line: 1187, type: !62)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !534, file: !1, line: 1187, type: !62)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !534, file: !1, line: 1188, type: !312)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !534, file: !1, line: 1189, type: !62)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !534, file: !1, line: 1191, type: !62)
!546 = !DISubprogram(name: "Intra16x16_Mode_Decision", scope: !1, file: !1, line: 1371, type: !547, isLocal: false, isDefinition: true, scopeLine: 1372, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.macroblock*, i32*)* @Intra16x16_Mode_Decision, variables: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !312, !108}
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !564}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !546, file: !1, line: 1371, type: !312)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i16mode", arg: 2, scope: !546, file: !1, line: 1371, type: !108)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !546, file: !1, line: 1374, type: !62)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !546, file: !1, line: 1374, type: !62)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !546, file: !1, line: 1374, type: !62)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_ipmode", scope: !546, file: !1, line: 1375, type: !62)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !546, file: !1, line: 1376, type: !62)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !546, file: !1, line: 1376, type: !62)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !546, file: !1, line: 1376, type: !62)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !546, file: !1, line: 1377, type: !62)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !546, file: !1, line: 1378, type: !62)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY_orig", scope: !546, file: !1, line: 1379, type: !129)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgUV_orig", scope: !546, file: !1, line: 1380, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_cbp", scope: !546, file: !1, line: 1381, type: !62)
!565 = !DISubprogram(name: "SetCoeffAndReconstruction8x8", scope: !1, file: !1, line: 1463, type: !566, isLocal: false, isDefinition: true, scopeLine: 1464, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.macroblock*)* @SetCoeffAndReconstruction8x8, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !312}
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !565, file: !1, line: 1463, type: !312)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !565, file: !1, line: 1465, type: !62)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !565, file: !1, line: 1465, type: !62)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !565, file: !1, line: 1465, type: !62)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !565, file: !1, line: 1465, type: !62)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !565, file: !1, line: 1470, type: !62)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !565, file: !1, line: 1471, type: !62)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !565, file: !1, line: 1472, type: !62)
!577 = !DISubprogram(name: "SetMotionVectorsMB", scope: !1, file: !1, line: 1641, type: !578, isLocal: false, isDefinition: true, scopeLine: 1642, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.macroblock*, i32)* @SetMotionVectorsMB, variables: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !312, !62}
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !601, !602}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currMB", arg: 1, scope: !577, file: !1, line: 1641, type: !312)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bframe", arg: 2, scope: !577, file: !1, line: 1641, type: !62)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !577, file: !1, line: 1643, type: !62)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !577, file: !1, line: 1643, type: !62)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !577, file: !1, line: 1643, type: !62)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !577, file: !1, line: 1643, type: !62)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !577, file: !1, line: 1643, type: !62)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode8", scope: !577, file: !1, line: 1643, type: !62)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdir8", scope: !577, file: !1, line: 1643, type: !62)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !577, file: !1, line: 1643, type: !62)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "by", scope: !577, file: !1, line: 1643, type: !62)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bx", scope: !577, file: !1, line: 1643, type: !62)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bxr", scope: !577, file: !1, line: 1643, type: !62)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !577, file: !1, line: 1644, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv", scope: !577, file: !1, line: 1645, type: !595)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_ref", scope: !577, file: !1, line: 1646, type: !62)
!603 = !DISubprogram(name: "RDCost_for_macroblocks", scope: !1, file: !1, line: 1762, type: !604, isLocal: false, isDefinition: true, scopeLine: 1766, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i32, double*, i32)* @RDCost_for_macroblocks, variables: !607)
!604 = !DISubroutineType(types: !605)
!605 = !{!62, !61, !62, !606, !62}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !630}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 1, scope: !603, file: !1, line: 1762, type: !61)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !603, file: !1, line: 1763, type: !62)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_rdcost", arg: 3, scope: !603, file: !1, line: 1764, type: !606)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i16mode", arg: 4, scope: !603, file: !1, line: 1765, type: !62)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !603, file: !1, line: 1767, type: !62)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !603, file: !1, line: 1767, type: !62)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !603, file: !1, line: 1767, type: !62)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !603, file: !1, line: 1768, type: !62)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distortion", scope: !603, file: !1, line: 1769, type: !339)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdcost", scope: !603, file: !1, line: 1770, type: !61)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !603, file: !1, line: 1771, type: !312)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevMB", scope: !603, file: !1, line: 1772, type: !312)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !603, file: !1, line: 1773, type: !62)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_cc", scope: !603, file: !1, line: 1774, type: !62)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_of_cc", scope: !603, file: !1, line: 1775, type: !62)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cc_rate", scope: !603, file: !1, line: 1776, type: !62)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !603, file: !1, line: 1776, type: !62)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_cbp", scope: !603, file: !1, line: 1777, type: !62)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !603, file: !1, line: 1777, type: !62)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !628, file: !1, line: 1789, type: !62)
!628 = distinct !DILexicalBlock(scope: !629, file: !1, line: 1788, column: 3)
!629 = distinct !DILexicalBlock(scope: !603, file: !1, line: 1787, column: 7)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !628, file: !1, line: 1790, type: !62)
!631 = !DISubprogram(name: "store_macroblock_parameters", scope: !1, file: !1, line: 1989, type: !535, isLocal: false, isDefinition: true, scopeLine: 1990, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @store_macroblock_parameters, variables: !632)
!632 = !{!633, !634, !635, !636, !637, !641, !642, !643}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !631, file: !1, line: 1989, type: !62)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !631, file: !1, line: 1991, type: !62)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !631, file: !1, line: 1991, type: !62)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !631, file: !1, line: 1991, type: !62)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i4p", scope: !631, file: !1, line: 1991, type: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i3p", scope: !631, file: !1, line: 1991, type: !639)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !631, file: !1, line: 1992, type: !312)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !631, file: !1, line: 1993, type: !62)
!644 = !DISubprogram(name: "set_stored_macroblock_parameters", scope: !1, file: !1, line: 2097, type: !66, isLocal: false, isDefinition: true, scopeLine: 2098, isOptimized: true, function: void ()* @set_stored_macroblock_parameters, variables: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !669}
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !644, file: !1, line: 2099, type: !62)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !644, file: !1, line: 2099, type: !62)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !644, file: !1, line: 2099, type: !62)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i4p", scope: !644, file: !1, line: 2099, type: !638)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i3p", scope: !644, file: !1, line: 2099, type: !639)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !644, file: !1, line: 2099, type: !62)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !644, file: !1, line: 2100, type: !312)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !644, file: !1, line: 2101, type: !62)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !644, file: !1, line: 2102, type: !62)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipredmodes", scope: !644, file: !1, line: 2103, type: !640)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !644, file: !1, line: 2105, type: !129)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgUV", scope: !644, file: !1, line: 2106, type: !563)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !644, file: !1, line: 2108, type: !62)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !660, file: !1, line: 2227, type: !595)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 2226, column: 7)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 2225, column: 11)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 2223, column: 5)
!663 = distinct !DILexicalBlock(scope: !664, file: !1, line: 2212, column: 9)
!664 = distinct !DILexicalBlock(scope: !665, file: !1, line: 2210, column: 3)
!665 = distinct !DILexicalBlock(scope: !666, file: !1, line: 2209, column: 3)
!666 = distinct !DILexicalBlock(scope: !667, file: !1, line: 2209, column: 3)
!667 = distinct !DILexicalBlock(scope: !668, file: !1, line: 2208, column: 3)
!668 = distinct !DILexicalBlock(scope: !644, file: !1, line: 2208, column: 3)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !670, file: !1, line: 2281, type: !595)
!670 = distinct !DILexicalBlock(scope: !671, file: !1, line: 2280, column: 11)
!671 = distinct !DILexicalBlock(scope: !672, file: !1, line: 2279, column: 15)
!672 = distinct !DILexicalBlock(scope: !673, file: !1, line: 2277, column: 9)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 2267, column: 13)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 2264, column: 7)
!675 = distinct !DILexicalBlock(scope: !676, file: !1, line: 2263, column: 7)
!676 = distinct !DILexicalBlock(scope: !677, file: !1, line: 2263, column: 7)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 2262, column: 5)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2262, column: 5)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 2261, column: 3)
!680 = distinct !DILexicalBlock(scope: !644, file: !1, line: 2260, column: 7)
!681 = !DISubprogram(name: "SetRefAndMotionVectors", scope: !1, file: !1, line: 2377, type: !682, isLocal: false, isDefinition: true, scopeLine: 2378, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32)* @SetRefAndMotionVectors, variables: !684)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !62, !62, !62, !62, !62}
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !712}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 1, scope: !681, file: !1, line: 2377, type: !62)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !681, file: !1, line: 2377, type: !62)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdir", arg: 3, scope: !681, file: !1, line: 2377, type: !62)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fwref", arg: 4, scope: !681, file: !1, line: 2377, type: !62)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bwref", arg: 5, scope: !681, file: !1, line: 2377, type: !62)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !681, file: !1, line: 2379, type: !62)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !681, file: !1, line: 2379, type: !62)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bslice", scope: !681, file: !1, line: 2380, type: !62)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pmode", scope: !681, file: !1, line: 2381, type: !62)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !681, file: !1, line: 2382, type: !62)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !681, file: !1, line: 2383, type: !62)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !681, file: !1, line: 2384, type: !62)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !681, file: !1, line: 2385, type: !62)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !681, file: !1, line: 2387, type: !62)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !681, file: !1, line: 2388, type: !312)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !701, file: !1, line: 2435, type: !595)
!701 = distinct !DILexicalBlock(scope: !702, file: !1, line: 2434, column: 11)
!702 = distinct !DILexicalBlock(scope: !703, file: !1, line: 2433, column: 15)
!703 = distinct !DILexicalBlock(scope: !704, file: !1, line: 2431, column: 9)
!704 = distinct !DILexicalBlock(scope: !705, file: !1, line: 2430, column: 13)
!705 = distinct !DILexicalBlock(scope: !706, file: !1, line: 2422, column: 7)
!706 = distinct !DILexicalBlock(scope: !707, file: !1, line: 2421, column: 7)
!707 = distinct !DILexicalBlock(scope: !708, file: !1, line: 2421, column: 7)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 2420, column: 5)
!709 = distinct !DILexicalBlock(scope: !710, file: !1, line: 2420, column: 5)
!710 = distinct !DILexicalBlock(scope: !711, file: !1, line: 2419, column: 3)
!711 = distinct !DILexicalBlock(scope: !681, file: !1, line: 2407, column: 7)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !713, file: !1, line: 2464, type: !595)
!713 = distinct !DILexicalBlock(scope: !714, file: !1, line: 2463, column: 11)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 2462, column: 15)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 2460, column: 9)
!716 = distinct !DILexicalBlock(scope: !705, file: !1, line: 2459, column: 13)
!717 = !DISubprogram(name: "field_flag_inference", scope: !1, file: !1, line: 2499, type: !718, isLocal: false, isDefinition: true, scopeLine: 2500, isOptimized: true, function: i32 ()* @field_flag_inference, variables: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{!62}
!720 = !{!721, !722}
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_field", scope: !717, file: !1, line: 2501, type: !62)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !717, file: !1, line: 2502, type: !312)
!723 = !DISubprogram(name: "StoreMVBlock8x8", scope: !1, file: !1, line: 2529, type: !724, isLocal: false, isDefinition: true, scopeLine: 2530, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32, i32)* @StoreMVBlock8x8, variables: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !62, !62, !62, !62, !62, !62, !62}
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !723, file: !1, line: 2529, type: !62)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 2, scope: !723, file: !1, line: 2529, type: !62)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !723, file: !1, line: 2529, type: !62)
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 4, scope: !723, file: !1, line: 2529, type: !62)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref", arg: 5, scope: !723, file: !1, line: 2529, type: !62)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdir8", arg: 6, scope: !723, file: !1, line: 2529, type: !62)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bframe", arg: 7, scope: !723, file: !1, line: 2529, type: !62)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !723, file: !1, line: 2531, type: !62)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !723, file: !1, line: 2531, type: !62)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !723, file: !1, line: 2531, type: !62)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !723, file: !1, line: 2531, type: !62)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !723, file: !1, line: 2531, type: !62)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !723, file: !1, line: 2531, type: !62)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !723, file: !1, line: 2532, type: !595)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv", scope: !723, file: !1, line: 2533, type: !595)
!742 = !DISubprogram(name: "StoreMV8x8", scope: !1, file: !1, line: 2610, type: !535, isLocal: false, isDefinition: true, scopeLine: 2611, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @StoreMV8x8, variables: !743)
!743 = !{!744, !745, !746}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !742, file: !1, line: 2610, type: !62)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8", scope: !742, file: !1, line: 2612, type: !62)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !742, file: !1, line: 2614, type: !62)
!747 = !DISubprogram(name: "RestoreMVBlock8x8", scope: !1, file: !1, line: 2627, type: !724, isLocal: false, isDefinition: true, scopeLine: 2628, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32, i32)* @RestoreMVBlock8x8, variables: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !747, file: !1, line: 2627, type: !62)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 2, scope: !747, file: !1, line: 2627, type: !62)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !747, file: !1, line: 2627, type: !62)
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 4, scope: !747, file: !1, line: 2627, type: !62)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref", arg: 5, scope: !747, file: !1, line: 2627, type: !62)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdir8", arg: 6, scope: !747, file: !1, line: 2627, type: !62)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bframe", arg: 7, scope: !747, file: !1, line: 2627, type: !62)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !747, file: !1, line: 2629, type: !62)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !747, file: !1, line: 2629, type: !62)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !747, file: !1, line: 2629, type: !62)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !747, file: !1, line: 2629, type: !62)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !747, file: !1, line: 2629, type: !62)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !747, file: !1, line: 2629, type: !62)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !747, file: !1, line: 2630, type: !595)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv", scope: !747, file: !1, line: 2631, type: !595)
!764 = !DISubprogram(name: "RestoreMV8x8", scope: !1, file: !1, line: 2707, type: !535, isLocal: false, isDefinition: true, scopeLine: 2708, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @RestoreMV8x8, variables: !765)
!765 = !{!766, !767, !768}
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !764, file: !1, line: 2707, type: !62)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8", scope: !764, file: !1, line: 2709, type: !62)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !764, file: !1, line: 2711, type: !62)
!769 = !DISubprogram(name: "StoreNewMotionVectorsBlock8x8", scope: !1, file: !1, line: 2726, type: !724, isLocal: false, isDefinition: true, scopeLine: 2727, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32, i32, i32, i32)* @StoreNewMotionVectorsBlock8x8, variables: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !769, file: !1, line: 2726, type: !62)
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block8x8", arg: 2, scope: !769, file: !1, line: 2726, type: !62)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !769, file: !1, line: 2726, type: !62)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fw_ref", arg: 4, scope: !769, file: !1, line: 2726, type: !62)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bw_ref", arg: 5, scope: !769, file: !1, line: 2726, type: !62)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pdir8", arg: 6, scope: !769, file: !1, line: 2726, type: !62)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bframe", arg: 7, scope: !769, file: !1, line: 2726, type: !62)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !769, file: !1, line: 2728, type: !62)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !769, file: !1, line: 2728, type: !62)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !769, file: !1, line: 2728, type: !62)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !769, file: !1, line: 2728, type: !62)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !769, file: !1, line: 2728, type: !62)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jj", scope: !769, file: !1, line: 2728, type: !62)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_mv", scope: !769, file: !1, line: 2729, type: !595)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pred_mv", scope: !769, file: !1, line: 2730, type: !595)
!786 = !DISubprogram(name: "GetBestTransformP8x8", scope: !1, file: !1, line: 2814, type: !718, isLocal: false, isDefinition: true, scopeLine: 2815, isOptimized: true, function: i32 ()* @GetBestTransformP8x8, variables: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !804, !805}
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !786, file: !1, line: 2816, type: !62)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !786, file: !1, line: 2816, type: !62)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !786, file: !1, line: 2816, type: !62)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !786, file: !1, line: 2816, type: !62)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !786, file: !1, line: 2816, type: !62)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !786, file: !1, line: 2816, type: !62)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !786, file: !1, line: 2816, type: !62)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_y", scope: !786, file: !1, line: 2817, type: !62)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_x", scope: !786, file: !1, line: 2817, type: !62)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block8x8", scope: !786, file: !1, line: 2817, type: !62)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8", scope: !786, file: !1, line: 2818, type: !62)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost4x4", scope: !786, file: !1, line: 2818, type: !62)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff4x4", scope: !786, file: !1, line: 2819, type: !801)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, align: 32, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 64)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff_ptr", scope: !786, file: !1, line: 2819, type: !108)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff8x8", scope: !786, file: !1, line: 2820, type: !801)
!806 = !DISubprogram(name: "encode_one_macroblock", scope: !1, file: !1, line: 2870, type: !66, isLocal: false, isDefinition: true, scopeLine: 2871, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @encode_one_macroblock, variables: !807)
!807 = !{!808, !809, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !886, !912, !925, !928, !930, !933, !934}
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_index", scope: !806, file: !1, line: 2876, type: !62)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valid", scope: !806, file: !1, line: 2878, type: !810)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 480, align: 32, elements: !811)
!811 = !{!277}
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rerun", scope: !806, file: !1, line: 2879, type: !62)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !806, file: !1, line: 2879, type: !62)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !806, file: !1, line: 2879, type: !62)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !806, file: !1, line: 2879, type: !62)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !806, file: !1, line: 2879, type: !62)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !806, file: !1, line: 2879, type: !62)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !806, file: !1, line: 2879, type: !62)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !806, file: !1, line: 2879, type: !62)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !806, file: !1, line: 2879, type: !62)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !806, file: !1, line: 2879, type: !62)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !806, file: !1, line: 2879, type: !62)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ctr16x16", scope: !806, file: !1, line: 2879, type: !62)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !806, file: !1, line: 2879, type: !62)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdir", scope: !806, file: !1, line: 2880, type: !63)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_pdir", scope: !806, file: !1, line: 2880, type: !63)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !806, file: !1, line: 2880, type: !63)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp", scope: !806, file: !1, line: 2881, type: !61)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_mode", scope: !806, file: !1, line: 2881, type: !61)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_motion", scope: !806, file: !1, line: 2881, type: !61)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_rdcost", scope: !806, file: !1, line: 2881, type: !61)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdcost", scope: !806, file: !1, line: 2881, type: !61)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_rdcost", scope: !806, file: !1, line: 2881, type: !61)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_motion_factor", scope: !806, file: !1, line: 2882, type: !62)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fw_mcost", scope: !806, file: !1, line: 2883, type: !62)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bw_mcost", scope: !806, file: !1, line: 2883, type: !62)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bid_mcost", scope: !806, file: !1, line: 2883, type: !62)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcost", scope: !806, file: !1, line: 2883, type: !62)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_mcost", scope: !806, file: !1, line: 2883, type: !62)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnt_nonz", scope: !806, file: !1, line: 2884, type: !62)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_cnt_nonz", scope: !806, file: !1, line: 2884, type: !62)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_fw_ref", scope: !806, file: !1, line: 2885, type: !63)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_cbp_blk", scope: !806, file: !1, line: 2886, type: !339)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !806, file: !1, line: 2887, type: !62)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_cost", scope: !806, file: !1, line: 2888, type: !62)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_cost8x8", scope: !806, file: !1, line: 2888, type: !62)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8", scope: !806, file: !1, line: 2888, type: !62)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost_direct", scope: !806, file: !1, line: 2888, type: !62)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "have_direct", scope: !806, file: !1, line: 2888, type: !62)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i16mode", scope: !806, file: !1, line: 2888, type: !62)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intra1", scope: !806, file: !1, line: 2889, type: !62)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp_cpb", scope: !806, file: !1, line: 2890, type: !62)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_transform_flag", scope: !806, file: !1, line: 2891, type: !62)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direct4x4_tmp", scope: !806, file: !1, line: 2892, type: !62)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direct8x8_tmp", scope: !806, file: !1, line: 2892, type: !62)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8_direct", scope: !806, file: !1, line: 2892, type: !62)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intra", scope: !806, file: !1, line: 2894, type: !62)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "spframe", scope: !806, file: !1, line: 2895, type: !62)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "siframe", scope: !806, file: !1, line: 2896, type: !62)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !806, file: !1, line: 2897, type: !62)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "runs", scope: !806, file: !1, line: 2898, type: !62)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "checkref", scope: !806, file: !1, line: 2900, type: !62)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !806, file: !1, line: 2901, type: !312)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevMB", scope: !806, file: !1, line: 2902, type: !312)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipredmodes", scope: !806, file: !1, line: 2904, type: !640)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_bw_ref", scope: !806, file: !1, line: 2905, type: !63)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allmvs", scope: !806, file: !1, line: 2906, type: !595)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i4p", scope: !806, file: !1, line: 2907, type: !638)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bpd_mcost_l0", scope: !806, file: !1, line: 2910, type: !62)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bpd_mcost_l1", scope: !806, file: !1, line: 2910, type: !62)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !806, file: !1, line: 2914, type: !62)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !806, file: !1, line: 2914, type: !62)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curr_mb_field", scope: !806, file: !1, line: 2920, type: !62)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_8x8_flag", scope: !806, file: !1, line: 2922, type: !62)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_no_mbpart", scope: !806, file: !1, line: 2922, type: !62)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !806, file: !1, line: 2925, type: !62)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !806, file: !1, line: 2925, type: !62)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !806, file: !1, line: 2925, type: !62)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !806, file: !1, line: 2925, type: !62)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_cbp", scope: !806, file: !1, line: 2926, type: !62)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_scale", scope: !882, file: !1, line: 3022, type: !61)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 3021, column: 6)
!883 = distinct !DILexicalBlock(scope: !884, file: !1, line: 3013, column: 10)
!884 = distinct !DILexicalBlock(scope: !885, file: !1, line: 3010, column: 4)
!885 = distinct !DILexicalBlock(scope: !806, file: !1, line: 3009, column: 8)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !887, file: !1, line: 3250, type: !595)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 3249, column: 22)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 3248, column: 26)
!889 = distinct !DILexicalBlock(scope: !890, file: !1, line: 3246, column: 20)
!890 = distinct !DILexicalBlock(scope: !891, file: !1, line: 3245, column: 20)
!891 = distinct !DILexicalBlock(scope: !892, file: !1, line: 3245, column: 20)
!892 = distinct !DILexicalBlock(scope: !893, file: !1, line: 3244, column: 18)
!893 = distinct !DILexicalBlock(scope: !894, file: !1, line: 3243, column: 18)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 3243, column: 18)
!895 = distinct !DILexicalBlock(scope: !896, file: !1, line: 3242, column: 16)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 3228, column: 20)
!897 = distinct !DILexicalBlock(scope: !898, file: !1, line: 3227, column: 14)
!898 = distinct !DILexicalBlock(scope: !899, file: !1, line: 3226, column: 18)
!899 = distinct !DILexicalBlock(scope: !900, file: !1, line: 3095, column: 12)
!900 = distinct !DILexicalBlock(scope: !901, file: !1, line: 3094, column: 12)
!901 = distinct !DILexicalBlock(scope: !902, file: !1, line: 3094, column: 12)
!902 = distinct !DILexicalBlock(scope: !903, file: !1, line: 3093, column: 10)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 3092, column: 14)
!904 = distinct !DILexicalBlock(scope: !905, file: !1, line: 3086, column: 8)
!905 = distinct !DILexicalBlock(scope: !906, file: !1, line: 3085, column: 8)
!906 = distinct !DILexicalBlock(scope: !907, file: !1, line: 3085, column: 8)
!907 = distinct !DILexicalBlock(scope: !908, file: !1, line: 3077, column: 6)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 3076, column: 10)
!909 = distinct !DILexicalBlock(scope: !910, file: !1, line: 3066, column: 4)
!910 = distinct !DILexicalBlock(scope: !911, file: !1, line: 3065, column: 4)
!911 = distinct !DILexicalBlock(scope: !806, file: !1, line: 3065, column: 4)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bipred_mv", scope: !913, file: !1, line: 3294, type: !595)
!913 = distinct !DILexicalBlock(scope: !914, file: !1, line: 3293, column: 24)
!914 = distinct !DILexicalBlock(scope: !915, file: !1, line: 3292, column: 28)
!915 = distinct !DILexicalBlock(scope: !916, file: !1, line: 3290, column: 22)
!916 = distinct !DILexicalBlock(scope: !917, file: !1, line: 3289, column: 22)
!917 = distinct !DILexicalBlock(scope: !918, file: !1, line: 3289, column: 22)
!918 = distinct !DILexicalBlock(scope: !919, file: !1, line: 3288, column: 20)
!919 = distinct !DILexicalBlock(scope: !920, file: !1, line: 3287, column: 20)
!920 = distinct !DILexicalBlock(scope: !921, file: !1, line: 3287, column: 20)
!921 = distinct !DILexicalBlock(scope: !922, file: !1, line: 3286, column: 18)
!922 = distinct !DILexicalBlock(scope: !923, file: !1, line: 3272, column: 22)
!923 = distinct !DILexicalBlock(scope: !924, file: !1, line: 3271, column: 16)
!924 = distinct !DILexicalBlock(scope: !897, file: !1, line: 3270, column: 20)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocky_plus_block2", scope: !926, file: !1, line: 3320, type: !62)
!926 = distinct !DILexicalBlock(scope: !927, file: !1, line: 3319, column: 14)
!927 = distinct !DILexicalBlock(scope: !898, file: !1, line: 3318, column: 23)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blockx_plus_block2", scope: !929, file: !1, line: 3370, type: !62)
!929 = distinct !DILexicalBlock(scope: !927, file: !1, line: 3369, column: 14)
!930 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_available_up", scope: !931, file: !1, line: 4166, type: !62)
!931 = distinct !DILexicalBlock(scope: !932, file: !1, line: 4165, column: 5)
!932 = distinct !DILexicalBlock(scope: !909, file: !1, line: 4164, column: 9)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_available_left", scope: !931, file: !1, line: 4167, type: !62)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_available_up_left", scope: !931, file: !1, line: 4168, type: !62)
!935 = !DISubprogram(name: "set_mbaff_parameters", scope: !1, file: !1, line: 4952, type: !66, isLocal: false, isDefinition: true, scopeLine: 4953, isOptimized: true, function: void ()* @set_mbaff_parameters, variables: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944}
!937 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !935, file: !1, line: 4954, type: !62)
!938 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !935, file: !1, line: 4954, type: !62)
!939 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !935, file: !1, line: 4954, type: !62)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !935, file: !1, line: 4954, type: !62)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !935, file: !1, line: 4955, type: !312)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !935, file: !1, line: 4956, type: !62)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !935, file: !1, line: 4957, type: !62)
!944 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipredmodes", scope: !935, file: !1, line: 4958, type: !640)
!945 = !DISubprogram(name: "store_coding_state_cs_cm", scope: !1, file: !1, line: 5045, type: !66, isLocal: false, isDefinition: true, scopeLine: 5046, isOptimized: true, function: void ()* @store_coding_state_cs_cm, variables: !68)
!946 = !DISubprogram(name: "reset_coding_state_cs_cm", scope: !1, file: !1, line: 5056, type: !66, isLocal: false, isDefinition: true, scopeLine: 5057, isOptimized: true, function: void ()* @reset_coding_state_cs_cm, variables: !68)
!947 = !{!948, !949, !950, !951, !952, !953, !970, !971, !972, !973, !974, !975, !976, !977, !980, !982, !985, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1048, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1178, !1181, !1182, !1183, !1184, !1185, !1186, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1206, !1239, !1240, !1241, !1242, !1243, !1301, !1302, !1303, !1304, !1305, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1319, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1329, !1330, !1331, !1332, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1365, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1443, !1444, !1446, !1447, !1448, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1467, !1468, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492}
!948 = !DIGlobalVariable(name: "cofAC", scope: !0, file: !1, line: 56, type: !638, isLocal: false, isDefinition: true, variable: i32***** @cofAC)
!949 = !DIGlobalVariable(name: "cofAC8x8", scope: !0, file: !1, line: 56, type: !638, isLocal: false, isDefinition: true, variable: i32***** @cofAC8x8)
!950 = !DIGlobalVariable(name: "cofDC", scope: !0, file: !1, line: 57, type: !639, isLocal: false, isDefinition: true, variable: i32**** @cofDC)
!951 = !DIGlobalVariable(name: "cofAC4x4", scope: !0, file: !1, line: 58, type: !640, isLocal: false, isDefinition: true, variable: i32*** @cofAC4x4)
!952 = !DIGlobalVariable(name: "cofAC4x4intern", scope: !0, file: !1, line: 58, type: !638, isLocal: false, isDefinition: true, variable: i32***** @cofAC4x4intern)
!953 = !DIGlobalVariable(name: "cs_mb", scope: !0, file: !1, line: 71, type: !954, isLocal: false, isDefinition: true, variable: %struct.CSobj** @cs_mb)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "CSptr", file: !955, line: 42, baseType: !956)
!955 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/rdopt_coding_state.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
