; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/rdpicdecision.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !18, globals: !240, imports: !586)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/rdpicdecision.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 192, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12, !13, !14, !15}
!11 = !DIEnumerator(name: "P_SLICE", value: 0)
!12 = !DIEnumerator(name: "B_SLICE", value: 1)
!13 = !DIEnumerator(name: "I_SLICE", value: 2)
!14 = !DIEnumerator(name: "SP_SLICE", value: 3)
!15 = !DIEnumerator(name: "SI_SLICE", value: 4)
!16 = !{!17}
!17 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!18 = !{!19, !31}
!19 = !DISubprogram(name: "rd_pic_decision", scope: !1, file: !1, line: 25, type: !20, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, double, i32, i32, double)* @rd_pic_decision, variables: !23)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !17, !17, !22, !22, !17}
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !{!24, !25, !26, !27, !28, !29, !30}
!24 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snrY_version1", arg: 1, scope: !19, file: !1, line: 25, type: !17)
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "snrY_version2", arg: 2, scope: !19, file: !1, line: 25, type: !17)
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bits_version1", arg: 3, scope: !19, file: !1, line: 25, type: !22)
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bits_version2", arg: 4, scope: !19, file: !1, line: 25, type: !22)
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda_picture", arg: 5, scope: !19, file: !1, line: 25, type: !17)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost_version1", scope: !19, file: !1, line: 27, type: !17)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost_version2", scope: !19, file: !1, line: 27, type: !17)
!31 = !DISubprogram(name: "picture_coding_decision", scope: !1, file: !1, line: 44, type: !32, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.Picture*, %struct.Picture*, i32)* @picture_coding_decision, variables: !229)
!32 = !DISubroutineType(types: !33)
!33 = !{!22, !34, !34, !22}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !37)
!37 = !{!38, !39, !40, !224, !225, !227, !228}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !36, file: !9, line: 477, baseType: !22, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !36, file: !9, line: 478, baseType: !22, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !36, file: !9, line: 479, baseType: !41, size: 6400, align: 64, offset: 64)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 6400, align: 64, elements: !222)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !131, !170, !197, !206, !207, !208, !209, !210, !211, !212, !213, !214, !219}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !44, file: !9, line: 445, baseType: !22, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !44, file: !9, line: 446, baseType: !22, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !44, file: !9, line: 447, baseType: !22, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !44, file: !9, line: 448, baseType: !22, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !44, file: !9, line: 449, baseType: !22, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !44, file: !9, line: 450, baseType: !22, size: 32, align: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !44, file: !9, line: 451, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !56)
!56 = !{!57, !77, !103}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !55, file: !9, line: 433, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !61)
!61 = !{!62, !63, !64, !68, !69, !70, !71, !72, !73, !74, !76}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !60, file: !9, line: 413, baseType: !22, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !60, file: !9, line: 414, baseType: !22, size: 32, align: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !60, file: !9, line: 415, baseType: !65, size: 8, align: 8, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !66, line: 30, baseType: !67)
!66 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !60, file: !9, line: 416, baseType: !22, size: 32, align: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !60, file: !9, line: 417, baseType: !22, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !60, file: !9, line: 418, baseType: !65, size: 8, align: 8, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !60, file: !9, line: 420, baseType: !65, size: 8, align: 8, offset: 168)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !60, file: !9, line: 421, baseType: !22, size: 32, align: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !60, file: !9, line: 422, baseType: !22, size: 32, align: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !60, file: !9, line: 424, baseType: !75, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !60, file: !9, line: 425, baseType: !22, size: 32, align: 32, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !55, file: !9, line: 434, baseType: !78, size: 832, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !80)
!80 = !{!81, !83, !84, !85, !86, !87, !88, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !79, file: !9, line: 209, baseType: !82, size: 32, align: 32)
!82 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !79, file: !9, line: 209, baseType: !82, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !79, file: !9, line: 210, baseType: !82, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !79, file: !9, line: 211, baseType: !82, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !79, file: !9, line: 212, baseType: !82, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !79, file: !9, line: 213, baseType: !75, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !79, file: !9, line: 214, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !79, file: !9, line: 217, baseType: !82, size: 32, align: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !79, file: !9, line: 217, baseType: !82, size: 32, align: 32, offset: 352)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !79, file: !9, line: 218, baseType: !82, size: 32, align: 32, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !79, file: !9, line: 219, baseType: !82, size: 32, align: 32, offset: 416)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !79, file: !9, line: 220, baseType: !82, size: 32, align: 32, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !79, file: !9, line: 221, baseType: !75, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !79, file: !9, line: 222, baseType: !89, size: 64, align: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !79, file: !9, line: 223, baseType: !22, size: 32, align: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !79, file: !9, line: 223, baseType: !22, size: 32, align: 32, offset: 672)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !79, file: !9, line: 224, baseType: !22, size: 32, align: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !79, file: !9, line: 224, baseType: !22, size: 32, align: 32, offset: 736)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !79, file: !9, line: 225, baseType: !22, size: 32, align: 32, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !79, file: !9, line: 225, baseType: !22, size: 32, align: 32, offset: 800)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !55, file: !9, line: 436, baseType: !104, size: 64, align: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!22, !107, !130}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !123}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !9, line: 329, baseType: !22, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !109, file: !9, line: 330, baseType: !22, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !109, file: !9, line: 331, baseType: !22, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !9, line: 332, baseType: !22, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !109, file: !9, line: 333, baseType: !22, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !109, file: !9, line: 334, baseType: !82, size: 32, align: 32, offset: 160)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !109, file: !9, line: 335, baseType: !22, size: 32, align: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !109, file: !9, line: 336, baseType: !22, size: 32, align: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !109, file: !9, line: 344, baseType: !120, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !22, !22, !89, !89}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !109, file: !9, line: 346, baseType: !124, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !127, !128}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !44, file: !9, line: 452, baseType: !132, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !135)
!135 = !{!136, !149, !154, !158, !162, !166, !167}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !134, file: !9, line: 260, baseType: !137, size: 4224, align: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 4224, align: 64, elements: !146)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !140)
!140 = !{!141, !143, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !9, line: 233, baseType: !142, size: 16, align: 16)
!142 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !139, file: !9, line: 234, baseType: !67, size: 8, align: 8, offset: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !139, file: !9, line: 236, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!146 = !{!147, !148}
!147 = !DISubrange(count: 3)
!148 = !DISubrange(count: 11)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !134, file: !9, line: 261, baseType: !150, size: 2304, align: 64, offset: 4224)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 2304, align: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DISubrange(count: 2)
!153 = !DISubrange(count: 9)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !134, file: !9, line: 262, baseType: !155, size: 2560, align: 64, offset: 6528)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 2560, align: 64, elements: !156)
!156 = !{!152, !157}
!157 = !DISubrange(count: 10)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !134, file: !9, line: 263, baseType: !159, size: 1536, align: 64, offset: 9088)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1536, align: 64, elements: !160)
!160 = !{!152, !161}
!161 = !DISubrange(count: 6)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !134, file: !9, line: 264, baseType: !163, size: 512, align: 64, offset: 10624)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 512, align: 64, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !134, file: !9, line: 265, baseType: !163, size: 512, align: 64, offset: 11136)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !134, file: !9, line: 266, baseType: !168, size: 384, align: 64, offset: 11648)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 384, align: 64, elements: !169)
!169 = !{!147}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !44, file: !9, line: 453, baseType: !171, size: 64, align: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !174)
!174 = !{!175, !178, !179, !182, !185, !189, !190, !194, !195, !196}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !173, file: !9, line: 283, baseType: !176, size: 256, align: 64)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 256, align: 64, elements: !177)
!177 = !{!152}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !173, file: !9, line: 284, baseType: !163, size: 512, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !173, file: !9, line: 285, baseType: !180, size: 1536, align: 64, offset: 768)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1536, align: 64, elements: !181)
!181 = !{!147, !165}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !173, file: !9, line: 286, baseType: !183, size: 5120, align: 64, offset: 2304)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 5120, align: 64, elements: !184)
!184 = !{!157, !165}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !173, file: !9, line: 287, baseType: !186, size: 19200, align: 64, offset: 7424)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 19200, align: 64, elements: !187)
!187 = !{!157, !188}
!188 = !DISubrange(count: 15)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !173, file: !9, line: 288, baseType: !186, size: 19200, align: 64, offset: 26624)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !173, file: !9, line: 289, baseType: !191, size: 6400, align: 64, offset: 45824)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 6400, align: 64, elements: !192)
!192 = !{!157, !193}
!193 = !DISubrange(count: 5)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !173, file: !9, line: 290, baseType: !191, size: 6400, align: 64, offset: 52224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !173, file: !9, line: 291, baseType: !186, size: 19200, align: 64, offset: 58624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !173, file: !9, line: 292, baseType: !186, size: 19200, align: 64, offset: 77824)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !44, file: !9, line: 456, baseType: !198, size: 64, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !200, file: !9, line: 310, baseType: !22, size: 32, align: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !200, file: !9, line: 311, baseType: !22, size: 32, align: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !200, file: !9, line: 312, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !44, file: !9, line: 458, baseType: !22, size: 32, align: 32, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !44, file: !9, line: 459, baseType: !89, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !44, file: !9, line: 460, baseType: !89, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !44, file: !9, line: 461, baseType: !89, size: 64, align: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !44, file: !9, line: 462, baseType: !22, size: 32, align: 32, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !44, file: !9, line: 463, baseType: !89, size: 64, align: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !44, file: !9, line: 464, baseType: !89, size: 64, align: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !44, file: !9, line: 465, baseType: !89, size: 64, align: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !44, file: !9, line: 467, baseType: !215, size: 64, align: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !22}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !44, file: !9, line: 469, baseType: !220, size: 192, align: 32, offset: 1024)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, align: 32, elements: !221)
!221 = !{!147, !152}
!222 = !{!223}
!223 = !DISubrange(count: 100)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !36, file: !9, line: 480, baseType: !22, size: 32, align: 32, offset: 6464)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !36, file: !9, line: 481, baseType: !226, size: 32, align: 32, offset: 6496)
!226 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !36, file: !9, line: 482, baseType: !226, size: 32, align: 32, offset: 6528)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !36, file: !9, line: 483, baseType: !226, size: 32, align: 32, offset: 6560)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "picture1", arg: 1, scope: !31, file: !1, line: 44, type: !34)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "picture2", arg: 2, scope: !31, file: !1, line: 44, type: !34)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qp", arg: 3, scope: !31, file: !1, line: 44, type: !22)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lambda_picture", scope: !31, file: !1, line: 46, type: !17)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "spframe", scope: !31, file: !1, line: 47, type: !22)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bframe", scope: !31, file: !1, line: 48, type: !22)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "snr_picture1", scope: !31, file: !1, line: 49, type: !17)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "snr_picture2", scope: !31, file: !1, line: 49, type: !17)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_picture1", scope: !31, file: !1, line: 50, type: !22)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit_picture2", scope: !31, file: !1, line: 50, type: !22)
!240 = !{!241, !242, !243, !244, !245, !246, !249, !251, !253, !254, !255, !256, !257, !296, !391, !392, !393, !395, !396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !432, !436, !437, !438, !439, !440, !441, !444, !447, !448, !449, !450, !453, !456, !467, !508, !509, !510, !511, !512, !570, !571, !572, !573, !574, !578, !579, !580, !581, !582, !583, !584, !585}
!241 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !34, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!242 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !34, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!243 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !34, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!244 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !34, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!245 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !34, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!246 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !247, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!249 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !250, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!251 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !252, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!253 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !82, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!254 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !82, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!255 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !22, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!256 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !22, isLocal: false, isDefinition: true, variable: i32* @me_time)
!257 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !258, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !272, !273, !274, !275, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !260, file: !4, line: 105, baseType: !218, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !260, file: !4, line: 106, baseType: !82, size: 32, align: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !260, file: !4, line: 107, baseType: !82, size: 32, align: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !260, file: !4, line: 108, baseType: !218, size: 32, align: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !260, file: !4, line: 110, baseType: !218, size: 32, align: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !260, file: !4, line: 111, baseType: !218, size: 32, align: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !260, file: !4, line: 112, baseType: !269, size: 256, align: 32, offset: 192)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, align: 32, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !260, file: !4, line: 115, baseType: !218, size: 32, align: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !260, file: !4, line: 116, baseType: !82, size: 32, align: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !260, file: !4, line: 117, baseType: !82, size: 32, align: 32, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !260, file: !4, line: 119, baseType: !276, size: 256, align: 32, offset: 544)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, align: 32, elements: !270)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !260, file: !4, line: 121, baseType: !276, size: 256, align: 32, offset: 800)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !260, file: !4, line: 122, baseType: !276, size: 256, align: 32, offset: 1056)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !260, file: !4, line: 124, baseType: !218, size: 32, align: 32, offset: 1312)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !260, file: !4, line: 125, baseType: !82, size: 32, align: 32, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !260, file: !4, line: 127, baseType: !82, size: 32, align: 32, offset: 1376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !260, file: !4, line: 128, baseType: !75, size: 64, align: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !260, file: !4, line: 130, baseType: !22, size: 32, align: 32, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !260, file: !4, line: 131, baseType: !22, size: 32, align: 32, offset: 1504)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !260, file: !4, line: 132, baseType: !218, size: 32, align: 32, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !260, file: !4, line: 133, baseType: !82, size: 32, align: 32, offset: 1568)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !260, file: !4, line: 134, baseType: !22, size: 32, align: 32, offset: 1600)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !260, file: !4, line: 135, baseType: !22, size: 32, align: 32, offset: 1632)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !260, file: !4, line: 136, baseType: !22, size: 32, align: 32, offset: 1664)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !260, file: !4, line: 138, baseType: !22, size: 32, align: 32, offset: 1696)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !260, file: !4, line: 139, baseType: !22, size: 32, align: 32, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !260, file: !4, line: 141, baseType: !218, size: 32, align: 32, offset: 1760)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !260, file: !4, line: 142, baseType: !218, size: 32, align: 32, offset: 1792)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !260, file: !4, line: 143, baseType: !218, size: 32, align: 32, offset: 1824)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !260, file: !4, line: 144, baseType: !218, size: 32, align: 32, offset: 1856)
!296 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !297, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !299, file: !4, line: 151, baseType: !218, size: 32, align: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !299, file: !4, line: 153, baseType: !82, size: 32, align: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !299, file: !4, line: 154, baseType: !218, size: 32, align: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !299, file: !4, line: 155, baseType: !218, size: 32, align: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !299, file: !4, line: 156, baseType: !218, size: 32, align: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !299, file: !4, line: 157, baseType: !218, size: 32, align: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !299, file: !4, line: 158, baseType: !82, size: 32, align: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !299, file: !4, line: 159, baseType: !82, size: 32, align: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !299, file: !4, line: 160, baseType: !82, size: 32, align: 32, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !299, file: !4, line: 162, baseType: !218, size: 32, align: 32, offset: 288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !299, file: !4, line: 163, baseType: !269, size: 256, align: 32, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !299, file: !4, line: 165, baseType: !82, size: 32, align: 32, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !299, file: !4, line: 166, baseType: !82, size: 32, align: 32, offset: 608)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !299, file: !4, line: 167, baseType: !82, size: 32, align: 32, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !299, file: !4, line: 168, baseType: !82, size: 32, align: 32, offset: 672)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !299, file: !4, line: 170, baseType: !82, size: 32, align: 32, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !299, file: !4, line: 172, baseType: !218, size: 32, align: 32, offset: 736)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !299, file: !4, line: 173, baseType: !22, size: 32, align: 32, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !299, file: !4, line: 174, baseType: !22, size: 32, align: 32, offset: 800)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !299, file: !4, line: 175, baseType: !82, size: 32, align: 32, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !299, file: !4, line: 177, baseType: !322, size: 8192, align: 32, offset: 864)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, align: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !299, file: !4, line: 178, baseType: !82, size: 32, align: 32, offset: 9056)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !299, file: !4, line: 179, baseType: !218, size: 32, align: 32, offset: 9088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !299, file: !4, line: 180, baseType: !82, size: 32, align: 32, offset: 9120)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !299, file: !4, line: 181, baseType: !82, size: 32, align: 32, offset: 9152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !299, file: !4, line: 182, baseType: !218, size: 32, align: 32, offset: 9184)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !299, file: !4, line: 184, baseType: !218, size: 32, align: 32, offset: 9216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !299, file: !4, line: 185, baseType: !218, size: 32, align: 32, offset: 9248)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !299, file: !4, line: 186, baseType: !218, size: 32, align: 32, offset: 9280)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !299, file: !4, line: 187, baseType: !82, size: 32, align: 32, offset: 9312)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !299, file: !4, line: 188, baseType: !82, size: 32, align: 32, offset: 9344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !299, file: !4, line: 189, baseType: !82, size: 32, align: 32, offset: 9376)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !299, file: !4, line: 190, baseType: !82, size: 32, align: 32, offset: 9408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !299, file: !4, line: 191, baseType: !218, size: 32, align: 32, offset: 9440)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !299, file: !4, line: 192, baseType: !339, size: 7584, align: 32, offset: 9472)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !340, file: !4, line: 65, baseType: !218, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !340, file: !4, line: 66, baseType: !82, size: 32, align: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !340, file: !4, line: 67, baseType: !82, size: 32, align: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !340, file: !4, line: 68, baseType: !82, size: 32, align: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !340, file: !4, line: 69, baseType: !218, size: 32, align: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !340, file: !4, line: 70, baseType: !218, size: 32, align: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !340, file: !4, line: 71, baseType: !218, size: 32, align: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !340, file: !4, line: 72, baseType: !82, size: 32, align: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !340, file: !4, line: 73, baseType: !218, size: 32, align: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !340, file: !4, line: 74, baseType: !218, size: 32, align: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !340, file: !4, line: 75, baseType: !82, size: 32, align: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !340, file: !4, line: 76, baseType: !82, size: 32, align: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !340, file: !4, line: 77, baseType: !82, size: 32, align: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !340, file: !4, line: 78, baseType: !218, size: 32, align: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !340, file: !4, line: 79, baseType: !82, size: 32, align: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !340, file: !4, line: 80, baseType: !82, size: 32, align: 32, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !340, file: !4, line: 81, baseType: !218, size: 32, align: 32, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !340, file: !4, line: 82, baseType: !82, size: 32, align: 32, offset: 544)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !340, file: !4, line: 83, baseType: !82, size: 32, align: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !340, file: !4, line: 84, baseType: !218, size: 32, align: 32, offset: 608)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !340, file: !4, line: 85, baseType: !218, size: 32, align: 32, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !340, file: !4, line: 86, baseType: !364, size: 3296, align: 32, offset: 672)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !366)
!366 = !{!367, !368, !369, !370, !374, !375, !376, !377, !378, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !365, file: !4, line: 50, baseType: !82, size: 32, align: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !365, file: !4, line: 51, baseType: !82, size: 32, align: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !365, file: !4, line: 52, baseType: !82, size: 32, align: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !365, file: !4, line: 53, baseType: !371, size: 1024, align: 32, offset: 96)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 1024, align: 32, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !365, file: !4, line: 54, baseType: !371, size: 1024, align: 32, offset: 1120)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !365, file: !4, line: 55, baseType: !371, size: 1024, align: 32, offset: 2144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !365, file: !4, line: 56, baseType: !82, size: 32, align: 32, offset: 3168)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !365, file: !4, line: 57, baseType: !82, size: 32, align: 32, offset: 3200)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !365, file: !4, line: 58, baseType: !82, size: 32, align: 32, offset: 3232)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !365, file: !4, line: 59, baseType: !82, size: 32, align: 32, offset: 3264)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !340, file: !4, line: 87, baseType: !218, size: 32, align: 32, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !340, file: !4, line: 88, baseType: !364, size: 3296, align: 32, offset: 4000)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !340, file: !4, line: 90, baseType: !218, size: 32, align: 32, offset: 7296)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !340, file: !4, line: 91, baseType: !218, size: 32, align: 32, offset: 7328)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !340, file: !4, line: 92, baseType: !218, size: 32, align: 32, offset: 7360)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !340, file: !4, line: 93, baseType: !82, size: 32, align: 32, offset: 7392)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !340, file: !4, line: 94, baseType: !82, size: 32, align: 32, offset: 7424)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !340, file: !4, line: 95, baseType: !82, size: 32, align: 32, offset: 7456)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !340, file: !4, line: 96, baseType: !82, size: 32, align: 32, offset: 7488)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !340, file: !4, line: 97, baseType: !82, size: 32, align: 32, offset: 7520)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !340, file: !4, line: 98, baseType: !82, size: 32, align: 32, offset: 7552)
!391 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !22, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!392 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !22, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!393 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !394, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!395 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !394, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!396 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !397, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!398 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !22, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!399 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !22, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!400 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !22, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!401 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !22, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!402 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !247, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!403 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !247, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!404 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !250, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!405 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !250, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!406 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !247, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!407 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !250, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!408 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !247, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!409 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !250, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!410 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !411, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!415 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !412, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!416 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !417, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!418 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !417, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!419 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !22, isLocal: false, isDefinition: true, variable: i32* @intras)
!420 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !22, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!421 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !22, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!422 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !22, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!423 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !22, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!424 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !22, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!425 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !22, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!426 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !22, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!427 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !428, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 2400, align: 8, elements: !430)
!429 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!430 = !{!431}
!431 = !DISubrange(count: 300)
!432 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !433, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, align: 32, elements: !434)
!434 = !{!435, !435}
!435 = !DISubrange(count: 16)
!436 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !433, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!437 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !433, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!438 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !433, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!439 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !433, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!440 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !433, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!441 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !442, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 24576, align: 32, elements: !443)
!443 = !{!147, !435, !435}
!444 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !445, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, align: 32, elements: !446)
!446 = !{!152, !165, !165}
!447 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !445, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!448 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !445, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!449 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !445, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!450 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !451, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 32, elements: !452)
!452 = !{!165, !165}
!453 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !454, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 32, elements: !455)
!455 = !{!435}
!456 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !457, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !459, file: !9, line: 1184, baseType: !22, size: 32, align: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !459, file: !9, line: 1185, baseType: !22, size: 32, align: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !459, file: !9, line: 1186, baseType: !22, size: 32, align: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !459, file: !9, line: 1187, baseType: !22, size: 32, align: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !459, file: !9, line: 1188, baseType: !22, size: 32, align: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !459, file: !9, line: 1189, baseType: !22, size: 32, align: 32, offset: 160)
!467 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !468, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !482, !483, !484, !485, !486, !491, !492, !496, !497, !498, !499, !501, !502, !503, !504, !505, !506, !507}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !470, file: !9, line: 1147, baseType: !17, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !470, file: !9, line: 1149, baseType: !433, size: 8192, align: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !470, file: !9, line: 1150, baseType: !433, size: 8192, align: 32, offset: 8256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !470, file: !9, line: 1150, baseType: !433, size: 8192, align: 32, offset: 16448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !470, file: !9, line: 1151, baseType: !397, size: 64, align: 64, offset: 24640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !470, file: !9, line: 1152, baseType: !394, size: 64, align: 64, offset: 24704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !470, file: !9, line: 1153, baseType: !22, size: 32, align: 32, offset: 24768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !470, file: !9, line: 1155, baseType: !22, size: 32, align: 32, offset: 24800)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !470, file: !9, line: 1157, baseType: !481, size: 128, align: 32, offset: 24832)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, align: 32, elements: !164)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !470, file: !9, line: 1157, baseType: !481, size: 128, align: 32, offset: 24960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !470, file: !9, line: 1158, baseType: !252, size: 64, align: 64, offset: 25088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !470, file: !9, line: 1159, baseType: !454, size: 512, align: 32, offset: 25152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !470, file: !9, line: 1160, baseType: !22, size: 32, align: 32, offset: 25664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !470, file: !9, line: 1161, baseType: !487, size: 64, align: 64, offset: 25728)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !489, line: 30, baseType: !490)
!489 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!490 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !470, file: !9, line: 1162, baseType: !22, size: 32, align: 32, offset: 25792)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !470, file: !9, line: 1163, baseType: !493, size: 64, align: 64, offset: 25856)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !470, file: !9, line: 1164, baseType: !493, size: 64, align: 64, offset: 25920)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !470, file: !9, line: 1165, baseType: !493, size: 64, align: 64, offset: 25984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !470, file: !9, line: 1166, baseType: !493, size: 64, align: 64, offset: 26048)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !470, file: !9, line: 1167, baseType: !500, size: 512, align: 16, offset: 26112)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 512, align: 16, elements: !446)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !470, file: !9, line: 1168, baseType: !22, size: 32, align: 32, offset: 26624)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !470, file: !9, line: 1169, baseType: !22, size: 32, align: 32, offset: 26656)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !470, file: !9, line: 1171, baseType: !22, size: 32, align: 32, offset: 26688)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !470, file: !9, line: 1172, baseType: !22, size: 32, align: 32, offset: 26720)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !470, file: !9, line: 1174, baseType: !22, size: 32, align: 32, offset: 26752)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !470, file: !9, line: 1175, baseType: !22, size: 32, align: 32, offset: 26784)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !470, file: !9, line: 1176, baseType: !22, size: 32, align: 32, offset: 26816)
!508 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !469, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!509 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !469, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!510 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !469, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!511 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !469, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!512 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !513, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !515, line: 153, baseType: !516)
!515 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !515, line: 122, size: 1216, align: 64, elements: !517)
!517 = !{!518, !520, !521, !522, !523, !524, !529, !530, !532, !536, !541, !550, !556, !557, !560, !561, !563, !567, !568, !569}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !516, file: !515, line: 123, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !516, file: !515, line: 124, baseType: !22, size: 32, align: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !516, file: !515, line: 125, baseType: !22, size: 32, align: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !516, file: !515, line: 126, baseType: !414, size: 16, align: 16, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !516, file: !515, line: 127, baseType: !414, size: 16, align: 16, offset: 144)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !516, file: !515, line: 128, baseType: !525, size: 128, align: 64, offset: 192)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !515, line: 88, size: 128, align: 64, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !525, file: !515, line: 89, baseType: !519, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !525, file: !515, line: 90, baseType: !22, size: 32, align: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !516, file: !515, line: 129, baseType: !22, size: 32, align: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !516, file: !515, line: 132, baseType: !531, size: 64, align: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !516, file: !515, line: 133, baseType: !533, size: 64, align: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!22, !531}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !516, file: !515, line: 134, baseType: !537, size: 64, align: 64, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!22, !531, !540, !22}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !516, file: !515, line: 135, baseType: !542, size: 64, align: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!545, !531, !545, !22}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !515, line: 77, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !547, line: 71, baseType: !548)
!547 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !549, line: 46, baseType: !490)
!549 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !516, file: !515, line: 136, baseType: !551, size: 64, align: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!22, !531, !554, !22}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !516, file: !515, line: 139, baseType: !525, size: 128, align: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !516, file: !515, line: 140, baseType: !558, size: 64, align: 64, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !515, line: 94, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !516, file: !515, line: 141, baseType: !22, size: 32, align: 32, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !516, file: !515, line: 144, baseType: !562, size: 24, align: 8, offset: 928)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 24, align: 8, elements: !169)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !516, file: !515, line: 145, baseType: !564, size: 8, align: 8, offset: 952)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, align: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 1)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !516, file: !515, line: 148, baseType: !525, size: 128, align: 64, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !516, file: !515, line: 151, baseType: !22, size: 32, align: 32, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !516, file: !515, line: 152, baseType: !545, size: 64, align: 64, offset: 1152)
!570 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !513, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!571 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !513, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!572 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !22, isLocal: false, isDefinition: true, variable: i32* @p_in)
!573 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !22, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!574 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !575, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 640, align: 32, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 20)
!578 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !575, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!579 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !575, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!580 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !575, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!581 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !575, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!582 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !575, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!583 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !22, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!584 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !22, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!585 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !22, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!586 = !{}
!587 = !{i32 2, !"Dwarf Version", i32 2}
!588 = !{i32 2, !"Debug Info Version", i32 700000003}
!589 = !{i32 1, !"PIC Level", i32 2}
!590 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!591 = !DIExpression()
!592 = !DILocation(line: 25, column: 28, scope: !19)
!593 = !DILocation(line: 25, column: 50, scope: !19)
!594 = !DILocation(line: 25, column: 69, scope: !19)
!595 = !DILocation(line: 25, column: 88, scope: !19)
!596 = !DILocation(line: 25, column: 110, scope: !19)
!597 = !DILocation(line: 29, column: 19, scope: !19)
!598 = !DILocation(line: 29, column: 42, scope: !19)
!599 = !DILocation(line: 29, column: 59, scope: !19)
!600 = !DILocation(line: 27, column: 10, scope: !19)
!601 = !DILocation(line: 30, column: 19, scope: !19)
!602 = !DILocation(line: 30, column: 42, scope: !19)
!603 = !DILocation(line: 30, column: 59, scope: !19)
!604 = !DILocation(line: 27, column: 25, scope: !19)
!605 = !DILocation(line: 32, column: 21, scope: !606)
!606 = distinct !DILexicalBlock(scope: !19, file: !1, line: 32, column: 7)
!607 = !DILocation(line: 32, column: 37, scope: !606)
!608 = !DILocation(line: 32, column: 55, scope: !606)
!609 = !DILocation(line: 32, column: 89, scope: !606)
!610 = !DILocation(line: 32, column: 72, scope: !606)
!611 = !DILocation(line: 36, column: 1, scope: !19)
!612 = !DILocation(line: 44, column: 39, scope: !31)
!613 = !DILocation(line: 44, column: 58, scope: !31)
