; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/sei.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.sei_struct = type { i32, i32, i8, i8* }
%struct.spare_picture_struct = type { i32, i32, i32, %struct.Bitstream* }
%struct.Bitstream = type { i32, i32, i8, i32, i32, i8, i8, i32, i32, i8*, i32 }
%struct.InputParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x [2 x i32]], [8 x [2 x i32]], i32, i32, i32, i32, [200 x i8], [200 x i8], [200 x i8], [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1024 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], [200 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [200 x i8], i32, i32, i32*, i32*, i8*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [8 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [6 x double], [200 x i8], i32 }

!44 = !DIEnumerator(name: "SE_CBP_INTRA", value: 6)
!45 = !DIEnumerator(name: "SE_LUM_DC_INTRA", value: 7)
!46 = !DIEnumerator(name: "SE_CHR_DC_INTRA", value: 8)
!47 = !DIEnumerator(name: "SE_LUM_AC_INTRA", value: 9)
!48 = !DIEnumerator(name: "SE_CHR_AC_INTRA", value: 10)
!49 = !DIEnumerator(name: "SE_CBP_INTER", value: 11)
!50 = !DIEnumerator(name: "SE_LUM_DC_INTER", value: 12)
!51 = !DIEnumerator(name: "SE_CHR_DC_INTER", value: 13)
!52 = !DIEnumerator(name: "SE_LUM_AC_INTER", value: 14)
!53 = !DIEnumerator(name: "SE_CHR_AC_INTER", value: 15)
!54 = !DIEnumerator(name: "SE_DELTA_QUANT_INTER", value: 16)
!55 = !DIEnumerator(name: "SE_DELTA_QUANT_INTRA", value: 17)
!56 = !DIEnumerator(name: "SE_BFRAME", value: 18)
!57 = !DIEnumerator(name: "SE_EOS", value: 19)
!58 = !DIEnumerator(name: "SE_TRANSFORM_SIZE_FLAG", value: 20)
!59 = !DIEnumerator(name: "SE_MAX_ELEMENTS", value: 21)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!64 = !{!65, !71, !74, !79, !94, !100, !103, !128, !129, !130, !131, !187, !213, !220, !223, !226, !231, !234, !237, !240, !241, !245, !246, !247, !248, !253, !254, !255, !256, !260, !268, !269, !270, !271, !275, !276, !277, !278, !283, !288, !289, !290, !291, !297, !302, !303, !304, !305, !306, !310}
!65 = !DISubprogram(name: "InitSEIMessages", scope: !1, file: !1, line: 65, type: !66, isLocal: false, isDefinition: true, scopeLine: 66, isOptimized: true, function: void ()* @InitSEIMessages, variables: !68)
!66 = !DISubroutineType(types: !67)
!67 = !{null}
!68 = !{!69}
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !65, file: !1, line: 67, type: !70)
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DISubprogram(name: "CloseSEIMessages", scope: !1, file: !1, line: 93, type: !66, isLocal: false, isDefinition: true, scopeLine: 94, isOptimized: true, function: void ()* @CloseSEIMessages, variables: !72)
!72 = !{!73}
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !71, file: !1, line: 95, type: !70)
!74 = !DISubprogram(name: "HaveAggregationSEI", scope: !1, file: !1, line: 116, type: !75, isLocal: false, isDefinition: true, scopeLine: 117, isOptimized: true, function: i32 ()* @HaveAggregationSEI, variables: !78)
!75 = !DISubroutineType(types: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!78 = !{}
!79 = !DISubprogram(name: "write_sei_message", scope: !1, file: !1, line: 159, type: !80, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, i32, i32)* @write_sei_message, variables: !86)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !70, !82, !70, !70}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !84, line: 30, baseType: !85)
!84 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87, !88, !89, !90, !91, !92, !93}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "id", arg: 1, scope: !79, file: !1, line: 159, type: !70)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 2, scope: !79, file: !1, line: 159, type: !82)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload_size", arg: 3, scope: !79, file: !1, line: 159, type: !70)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload_type", arg: 4, scope: !79, file: !1, line: 159, type: !70)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !79, file: !1, line: 161, type: !70)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !79, file: !1, line: 161, type: !70)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !79, file: !1, line: 161, type: !70)
!94 = !DISubprogram(name: "finalize_sei_message", scope: !1, file: !1, line: 199, type: !95, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @finalize_sei_message, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !70}
!97 = !{!98, !99}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "id", arg: 1, scope: !94, file: !1, line: 199, type: !70)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !94, file: !1, line: 201, type: !70)
!100 = !DISubprogram(name: "clear_sei_message", scope: !1, file: !1, line: 221, type: !95, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @clear_sei_message, variables: !101)
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "id", arg: 1, scope: !100, file: !1, line: 221, type: !70)
!103 = !DISubprogram(name: "AppendTmpbits2Buf", scope: !1, file: !1, line: 240, type: !104, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Bitstream*, %struct.Bitstream*)* @AppendTmpbits2Buf, variables: !121)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !108, file: !9, line: 413, baseType: !70, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !108, file: !9, line: 414, baseType: !70, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !108, file: !9, line: 415, baseType: !83, size: 8, align: 8, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !108, file: !9, line: 416, baseType: !70, size: 32, align: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !108, file: !9, line: 417, baseType: !70, size: 32, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !108, file: !9, line: 418, baseType: !83, size: 8, align: 8, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !108, file: !9, line: 420, baseType: !83, size: 8, align: 8, offset: 168)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !108, file: !9, line: 421, baseType: !70, size: 32, align: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !108, file: !9, line: 422, baseType: !70, size: 32, align: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !108, file: !9, line: 424, baseType: !82, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !108, file: !9, line: 425, baseType: !70, size: 32, align: 32, offset: 320)
!121 = !{!122, !123, !124, !125, !126, !127}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !103, file: !1, line: 240, type: !106)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !103, file: !1, line: 240, type: !106)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !103, file: !1, line: 242, type: !70)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !103, file: !1, line: 242, type: !70)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !103, file: !1, line: 243, type: !85)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits_in_last_byte", scope: !103, file: !1, line: 244, type: !70)
!128 = !DISubprogram(name: "InitSparePicture", scope: !1, file: !1, line: 313, type: !66, isLocal: false, isDefinition: true, scopeLine: 314, isOptimized: true, function: void ()* @InitSparePicture, variables: !78)
!129 = !DISubprogram(name: "CloseSparePicture", scope: !1, file: !1, line: 336, type: !66, isLocal: false, isDefinition: true, scopeLine: 337, isOptimized: true, function: void ()* @CloseSparePicture, variables: !78)
!130 = !DISubprogram(name: "CalculateSparePicture", scope: !1, file: !1, line: 359, type: !66, isLocal: false, isDefinition: true, scopeLine: 360, isOptimized: true, function: void ()* @CalculateSparePicture, variables: !78)
!131 = !DISubprogram(name: "ComposeSparePictureMessage", scope: !1, file: !1, line: 540, type: !132, isLocal: false, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.Bitstream*)* @ComposeSparePictureMessage, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !70, !70, !106}
!134 = !{!135, !136, !137, !138, !139}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delta_spare_frame_num", arg: 1, scope: !131, file: !1, line: 540, type: !70)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref_area_indicator", arg: 2, scope: !131, file: !1, line: 540, type: !70)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmpBitstream", arg: 3, scope: !131, file: !1, line: 540, type: !106)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitstream", scope: !131, file: !1, line: 542, type: !106)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !131, file: !1, line: 543, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !150, !151, !152, !157}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !9, line: 329, baseType: !70, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !141, file: !9, line: 330, baseType: !70, size: 32, align: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !141, file: !9, line: 331, baseType: !70, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !9, line: 332, baseType: !70, size: 32, align: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !141, file: !9, line: 333, baseType: !70, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !141, file: !9, line: 334, baseType: !149, size: 32, align: 32, offset: 160)
!149 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !141, file: !9, line: 335, baseType: !70, size: 32, align: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !141, file: !9, line: 336, baseType: !70, size: 32, align: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !141, file: !9, line: 344, baseType: !153, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !70, !70, !156, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !141, file: !9, line: 346, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161, !162}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !165, file: !9, line: 209, baseType: !149, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !165, file: !9, line: 209, baseType: !149, size: 32, align: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !165, file: !9, line: 210, baseType: !149, size: 32, align: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !165, file: !9, line: 211, baseType: !149, size: 32, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !165, file: !9, line: 212, baseType: !149, size: 32, align: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !165, file: !9, line: 213, baseType: !82, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !165, file: !9, line: 214, baseType: !156, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !165, file: !9, line: 217, baseType: !149, size: 32, align: 32, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !165, file: !9, line: 217, baseType: !149, size: 32, align: 32, offset: 352)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !165, file: !9, line: 218, baseType: !149, size: 32, align: 32, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !165, file: !9, line: 219, baseType: !149, size: 32, align: 32, offset: 416)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !165, file: !9, line: 220, baseType: !149, size: 32, align: 32, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !165, file: !9, line: 221, baseType: !82, size: 64, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !165, file: !9, line: 222, baseType: !156, size: 64, align: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !165, file: !9, line: 223, baseType: !70, size: 32, align: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !165, file: !9, line: 223, baseType: !70, size: 32, align: 32, offset: 672)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !165, file: !9, line: 224, baseType: !70, size: 32, align: 32, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !165, file: !9, line: 224, baseType: !70, size: 32, align: 32, offset: 736)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !165, file: !9, line: 225, baseType: !70, size: 32, align: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !165, file: !9, line: 225, baseType: !70, size: 32, align: 32, offset: 800)
!187 = !DISubprogram(name: "CompressSpareMBMap", scope: !1, file: !1, line: 570, type: !188, isLocal: false, isDefinition: true, scopeLine: 571, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8**, %struct.Bitstream*)* @CompressSpareMBMap, variables: !192)
!188 = !DISubroutineType(types: !189)
!189 = !{!77, !190, !106}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map_sp", arg: 1, scope: !187, file: !1, line: 570, type: !190)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bitstream", arg: 2, scope: !187, file: !1, line: 570, type: !106)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !187, file: !1, line: 572, type: !70)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !187, file: !1, line: 572, type: !70)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "noc", scope: !187, file: !1, line: 573, type: !70)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit0", scope: !187, file: !1, line: 573, type: !70)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bit1", scope: !187, file: !1, line: 573, type: !70)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bitc", scope: !187, file: !1, line: 573, type: !70)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !187, file: !1, line: 574, type: !140)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !187, file: !1, line: 575, type: !70)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !187, file: !1, line: 575, type: !70)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !187, file: !1, line: 575, type: !70)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !187, file: !1, line: 575, type: !70)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bottom", scope: !187, file: !1, line: 575, type: !70)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top", scope: !187, file: !1, line: 575, type: !70)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "directx", scope: !187, file: !1, line: 575, type: !70)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "directy", scope: !187, file: !1, line: 575, type: !70)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_uncompressed", scope: !187, file: !1, line: 578, type: !70)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_compressed", scope: !187, file: !1, line: 579, type: !70)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !187, file: !1, line: 580, type: !77)
!213 = !DISubprogram(name: "FinalizeSpareMBMap", scope: !1, file: !1, line: 730, type: !66, isLocal: false, isDefinition: true, scopeLine: 731, isOptimized: true, function: void ()* @FinalizeSpareMBMap, variables: !214)
!214 = !{!215, !216, !217, !218, !219}
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CurrFrameNum", scope: !213, file: !1, line: 732, type: !70)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta_frame_num", scope: !213, file: !1, line: 733, type: !70)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !213, file: !1, line: 734, type: !140)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !213, file: !1, line: 735, type: !106)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "source", scope: !213, file: !1, line: 735, type: !106)
!220 = !DISubprogram(name: "InitSubseqInfo", scope: !1, file: !1, line: 801, type: !95, isLocal: false, isDefinition: true, scopeLine: 802, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @InitSubseqInfo, variables: !221)
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currLayer", arg: 1, scope: !220, file: !1, line: 801, type: !70)
!223 = !DISubprogram(name: "UpdateSubseqInfo", scope: !1, file: !1, line: 828, type: !95, isLocal: false, isDefinition: true, scopeLine: 829, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @UpdateSubseqInfo, variables: !224)
!224 = !{!225}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currLayer", arg: 1, scope: !223, file: !1, line: 828, type: !70)
!226 = !DISubprogram(name: "FinalizeSubseqInfo", scope: !1, file: !1, line: 860, type: !95, isLocal: false, isDefinition: true, scopeLine: 861, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @FinalizeSubseqInfo, variables: !227)
!227 = !{!228, !229, !230}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currLayer", arg: 1, scope: !226, file: !1, line: 860, type: !70)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !226, file: !1, line: 862, type: !140)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !226, file: !1, line: 863, type: !106)
!231 = !DISubprogram(name: "ClearSubseqInfoPayload", scope: !1, file: !1, line: 900, type: !95, isLocal: false, isDefinition: true, scopeLine: 901, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @ClearSubseqInfoPayload, variables: !232)
!232 = !{!233}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currLayer", arg: 1, scope: !231, file: !1, line: 900, type: !70)
!234 = !DISubprogram(name: "CloseSubseqInfo", scope: !1, file: !1, line: 915, type: !95, isLocal: false, isDefinition: true, scopeLine: 916, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @CloseSubseqInfo, variables: !235)
!235 = !{!236}
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currLayer", arg: 1, scope: !234, file: !1, line: 915, type: !70)
!237 = !DISubprogram(name: "InitSubseqLayerInfo", scope: !1, file: !1, line: 943, type: !66, isLocal: false, isDefinition: true, scopeLine: 944, isOptimized: true, function: void ()* @InitSubseqLayerInfo, variables: !238)
!238 = !{!239}
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !237, file: !1, line: 945, type: !70)
!240 = !DISubprogram(name: "CloseSubseqLayerInfo", scope: !1, file: !1, line: 962, type: !66, isLocal: false, isDefinition: true, scopeLine: 963, isOptimized: true, function: void ()* @CloseSubseqLayerInfo, variables: !78)
!241 = !DISubprogram(name: "FinalizeSubseqLayerInfo", scope: !1, file: !1, line: 972, type: !66, isLocal: false, isDefinition: true, scopeLine: 973, isOptimized: true, function: void ()* @FinalizeSubseqLayerInfo, variables: !242)
!242 = !{!243, !244}
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !241, file: !1, line: 974, type: !70)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !241, file: !1, line: 974, type: !70)
!245 = !DISubprogram(name: "InitSubseqChar", scope: !1, file: !1, line: 1000, type: !66, isLocal: false, isDefinition: true, scopeLine: 1001, isOptimized: true, function: void ()* @InitSubseqChar, variables: !78)
!246 = !DISubprogram(name: "ClearSubseqCharPayload", scope: !1, file: !1, line: 1015, type: !66, isLocal: false, isDefinition: true, scopeLine: 1016, isOptimized: true, function: void ()* @ClearSubseqCharPayload, variables: !78)
!247 = !DISubprogram(name: "UpdateSubseqChar", scope: !1, file: !1, line: 1026, type: !66, isLocal: false, isDefinition: true, scopeLine: 1027, isOptimized: true, function: void ()* @UpdateSubseqChar, variables: !78)
!248 = !DISubprogram(name: "FinalizeSubseqChar", scope: !1, file: !1, line: 1043, type: !66, isLocal: false, isDefinition: true, scopeLine: 1044, isOptimized: true, function: void ()* @FinalizeSubseqChar, variables: !249)
!249 = !{!250, !251, !252}
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !248, file: !1, line: 1045, type: !70)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !248, file: !1, line: 1046, type: !140)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !248, file: !1, line: 1047, type: !106)
!253 = !DISubprogram(name: "CloseSubseqChar", scope: !1, file: !1, line: 1101, type: !66, isLocal: false, isDefinition: true, scopeLine: 1102, isOptimized: true, function: void ()* @CloseSubseqChar, variables: !78)
!254 = !DISubprogram(name: "InitSceneInformation", scope: !1, file: !1, line: 1125, type: !66, isLocal: false, isDefinition: true, scopeLine: 1126, isOptimized: true, function: void ()* @InitSceneInformation, variables: !78)
!255 = !DISubprogram(name: "CloseSceneInformation", scope: !1, file: !1, line: 1143, type: !66, isLocal: false, isDefinition: true, scopeLine: 1144, isOptimized: true, function: void ()* @CloseSceneInformation, variables: !78)
!256 = !DISubprogram(name: "FinalizeSceneInformation", scope: !1, file: !1, line: 1153, type: !66, isLocal: false, isDefinition: true, scopeLine: 1154, isOptimized: true, function: void ()* @FinalizeSceneInformation, variables: !257)
!257 = !{!258, !259}
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !256, file: !1, line: 1155, type: !140)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !256, file: !1, line: 1156, type: !106)
!260 = !DISubprogram(name: "UpdateSceneInformation", scope: !1, file: !1, line: 1192, type: !261, isLocal: false, isDefinition: true, scopeLine: 1193, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i32)* @UpdateSceneInformation, variables: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !77, !70, !70, !70}
!263 = !{!264, !265, !266, !267}
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "HasSceneInformation", arg: 1, scope: !260, file: !1, line: 1192, type: !77)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sceneID", arg: 2, scope: !260, file: !1, line: 1192, type: !70)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sceneTransType", arg: 3, scope: !260, file: !1, line: 1192, type: !70)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "secondSceneID", arg: 4, scope: !260, file: !1, line: 1192, type: !70)
!268 = !DISubprogram(name: "InitPanScanRectInfo", scope: !1, file: !1, line: 1224, type: !66, isLocal: false, isDefinition: true, scopeLine: 1225, isOptimized: true, function: void ()* @InitPanScanRectInfo, variables: !78)
!269 = !DISubprogram(name: "ClearPanScanRectInfoPayload", scope: !1, file: !1, line: 1241, type: !66, isLocal: false, isDefinition: true, scopeLine: 1242, isOptimized: true, function: void ()* @ClearPanScanRectInfoPayload, variables: !78)
!270 = !DISubprogram(name: "UpdatePanScanRectInfo", scope: !1, file: !1, line: 1252, type: !66, isLocal: false, isDefinition: true, scopeLine: 1253, isOptimized: true, function: void ()* @UpdatePanScanRectInfo, variables: !78)
!271 = !DISubprogram(name: "FinalizePanScanRectInfo", scope: !1, file: !1, line: 1262, type: !66, isLocal: false, isDefinition: true, scopeLine: 1263, isOptimized: true, function: void ()* @FinalizePanScanRectInfo, variables: !272)
!272 = !{!273, !274}
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !271, file: !1, line: 1264, type: !140)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !271, file: !1, line: 1265, type: !106)
!275 = !DISubprogram(name: "ClosePanScanRectInfo", scope: !1, file: !1, line: 1305, type: !66, isLocal: false, isDefinition: true, scopeLine: 1306, isOptimized: true, function: void ()* @ClosePanScanRectInfo, variables: !78)
!276 = !DISubprogram(name: "InitUser_data_unregistered", scope: !1, file: !1, line: 1326, type: !66, isLocal: false, isDefinition: true, scopeLine: 1327, isOptimized: true, function: void ()* @InitUser_data_unregistered, variables: !78)
!277 = !DISubprogram(name: "ClearUser_data_unregistered", scope: !1, file: !1, line: 1340, type: !66, isLocal: false, isDefinition: true, scopeLine: 1341, isOptimized: true, function: void ()* @ClearUser_data_unregistered, variables: !78)
!278 = !DISubprogram(name: "UpdateUser_data_unregistered", scope: !1, file: !1, line: 1354, type: !66, isLocal: false, isDefinition: true, scopeLine: 1355, isOptimized: true, function: void ()* @UpdateUser_data_unregistered, variables: !279)
!279 = !{!280, !281, !282}
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !278, file: !1, line: 1356, type: !70)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp_data", scope: !278, file: !1, line: 1356, type: !70)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total_byte", scope: !278, file: !1, line: 1357, type: !70)
!283 = !DISubprogram(name: "FinalizeUser_data_unregistered", scope: !1, file: !1, line: 1369, type: !66, isLocal: false, isDefinition: true, scopeLine: 1370, isOptimized: true, function: void ()* @FinalizeUser_data_unregistered, variables: !284)
!284 = !{!285, !286, !287}
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !283, file: !1, line: 1371, type: !70)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !283, file: !1, line: 1372, type: !140)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !283, file: !1, line: 1373, type: !106)
!288 = !DISubprogram(name: "CloseUser_data_unregistered", scope: !1, file: !1, line: 1405, type: !66, isLocal: false, isDefinition: true, scopeLine: 1406, isOptimized: true, function: void ()* @CloseUser_data_unregistered, variables: !78)
!289 = !DISubprogram(name: "InitUser_data_registered_itu_t_t35", scope: !1, file: !1, line: 1431, type: !66, isLocal: false, isDefinition: true, scopeLine: 1432, isOptimized: true, function: void ()* @InitUser_data_registered_itu_t_t35, variables: !78)
!290 = !DISubprogram(name: "ClearUser_data_registered_itu_t_t35", scope: !1, file: !1, line: 1445, type: !66, isLocal: false, isDefinition: true, scopeLine: 1446, isOptimized: true, function: void ()* @ClearUser_data_registered_itu_t_t35, variables: !78)
!291 = !DISubprogram(name: "UpdateUser_data_registered_itu_t_t35", scope: !1, file: !1, line: 1461, type: !66, isLocal: false, isDefinition: true, scopeLine: 1462, isOptimized: true, function: void ()* @UpdateUser_data_registered_itu_t_t35, variables: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !291, file: !1, line: 1463, type: !70)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp_data", scope: !291, file: !1, line: 1463, type: !70)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total_byte", scope: !291, file: !1, line: 1464, type: !70)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "country_code", scope: !291, file: !1, line: 1465, type: !70)
!297 = !DISubprogram(name: "FinalizeUser_data_registered_itu_t_t35", scope: !1, file: !1, line: 1488, type: !66, isLocal: false, isDefinition: true, scopeLine: 1489, isOptimized: true, function: void ()* @FinalizeUser_data_registered_itu_t_t35, variables: !298)
!298 = !{!299, !300, !301}
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !297, file: !1, line: 1490, type: !70)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !297, file: !1, line: 1491, type: !140)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !297, file: !1, line: 1492, type: !106)
!302 = !DISubprogram(name: "CloseUser_data_registered_itu_t_t35", scope: !1, file: !1, line: 1542, type: !66, isLocal: false, isDefinition: true, scopeLine: 1543, isOptimized: true, function: void ()* @CloseUser_data_registered_itu_t_t35, variables: !78)
!303 = !DISubprogram(name: "InitRandomAccess", scope: !1, file: !1, line: 1567, type: !66, isLocal: false, isDefinition: true, scopeLine: 1568, isOptimized: true, function: void ()* @InitRandomAccess, variables: !78)
!304 = !DISubprogram(name: "ClearRandomAccess", scope: !1, file: !1, line: 1579, type: !66, isLocal: false, isDefinition: true, scopeLine: 1580, isOptimized: true, function: void ()* @ClearRandomAccess, variables: !78)
!305 = !DISubprogram(name: "UpdateRandomAccess", scope: !1, file: !1, line: 1594, type: !66, isLocal: false, isDefinition: true, scopeLine: 1595, isOptimized: true, function: void ()* @UpdateRandomAccess, variables: !78)
!306 = !DISubprogram(name: "FinalizeRandomAccess", scope: !1, file: !1, line: 1610, type: !66, isLocal: false, isDefinition: true, scopeLine: 1611, isOptimized: true, function: void ()* @FinalizeRandomAccess, variables: !307)
!307 = !{!308, !309}
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !306, file: !1, line: 1612, type: !140)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !306, file: !1, line: 1613, type: !106)
!310 = !DISubprogram(name: "CloseRandomAccess", scope: !1, file: !1, line: 1651, type: !66, isLocal: false, isDefinition: true, scopeLine: 1652, isOptimized: true, function: void ()* @CloseRandomAccess, variables: !78)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !461, !462, !463, !464, !465, !467, !469, !471, !472, !473, !474, !475, !514, !609, !610, !611, !613, !614, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !633, !634, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !650, !654, !655, !656, !657, !658, !659, !662, !665, !666, !667, !668, !671, !674, !685, !727, !728, !729, !730, !731, !787, !788, !789, !790, !791, !795, !796, !797, !798, !799, !800, !801, !802, !803, !820, !821, !829, !830, !840, !841, !850, !859, !867, !878, !889, !907, !916}
!312 = !DIGlobalVariable(name: "seiHasTemporal_reference", scope: !0, file: !1, line: 35, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasTemporal_reference)
!313 = !DIGlobalVariable(name: "seiHasClock_timestamp", scope: !0, file: !1, line: 36, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasClock_timestamp)
!314 = !DIGlobalVariable(name: "seiHasPanscan_rect", scope: !0, file: !1, line: 37, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasPanscan_rect)
!315 = !DIGlobalVariable(name: "seiHasBuffering_period", scope: !0, file: !1, line: 38, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasBuffering_period)
!316 = !DIGlobalVariable(name: "seiHasHrd_picture", scope: !0, file: !1, line: 39, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasHrd_picture)
!317 = !DIGlobalVariable(name: "seiHasFiller_payload", scope: !0, file: !1, line: 40, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasFiller_payload)
!318 = !DIGlobalVariable(name: "seiHasUser_data_registered_itu_t_t35", scope: !0, file: !1, line: 41, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasUser_data_registered_itu_t_t35)
!319 = !DIGlobalVariable(name: "seiHasUser_data_unregistered", scope: !0, file: !1, line: 42, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasUser_data_unregistered)
!320 = !DIGlobalVariable(name: "seiHasRandom_access_point", scope: !0, file: !1, line: 43, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasRandom_access_point)
!321 = !DIGlobalVariable(name: "seiHasRef_pic_buffer_management_repetition", scope: !0, file: !1, line: 44, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasRef_pic_buffer_management_repetition)
!322 = !DIGlobalVariable(name: "seiHasSpare_picture", scope: !0, file: !1, line: 45, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSpare_picture)
!323 = !DIGlobalVariable(name: "seiHasSceneInformation", scope: !0, file: !1, line: 47, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSceneInformation)
!324 = !DIGlobalVariable(name: "seiHasSubseq_information", scope: !0, file: !1, line: 49, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSubseq_information)
!325 = !DIGlobalVariable(name: "seiHasSubseq_layer_characteristics", scope: !0, file: !1, line: 50, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSubseq_layer_characteristics)
!326 = !DIGlobalVariable(name: "seiHasSubseq_characteristics", scope: !0, file: !1, line: 51, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSubseq_characteristics)
!327 = !DIGlobalVariable(name: "seiHasSparePicture", scope: !0, file: !1, line: 304, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSparePicture)
!328 = !DIGlobalVariable(name: "seiHasSubseqInfo", scope: !0, file: !1, line: 792, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSubseqInfo)
!329 = !DIGlobalVariable(name: "id", scope: !220, file: !1, line: 803, type: !63, isLocal: true, isDefinition: true, variable: i16* @InitSubseqInfo.id)
!330 = !DIGlobalVariable(name: "seiHasSubseqLayerInfo", scope: !0, file: !1, line: 934, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSubseqLayerInfo)
!331 = !DIGlobalVariable(name: "seiHasSubseqChar", scope: !0, file: !1, line: 997, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasSubseqChar)
!332 = !DIGlobalVariable(name: "seiHasPanScanRectInfo", scope: !0, file: !1, line: 1221, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasPanScanRectInfo)
!333 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !334, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !337)
!337 = !{!338, !339, !340, !456, !457, !459, !460}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !336, file: !9, line: 477, baseType: !70, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !336, file: !9, line: 478, baseType: !70, size: 32, align: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !336, file: !9, line: 479, baseType: !341, size: 6400, align: 64, offset: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 6400, align: 64, elements: !454)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !344)
!344 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !365, !403, !430, !439, !440, !441, !442, !443, !444, !445, !446, !447, !451}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !344, file: !9, line: 445, baseType: !70, size: 32, align: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !344, file: !9, line: 446, baseType: !70, size: 32, align: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !344, file: !9, line: 447, baseType: !70, size: 32, align: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !344, file: !9, line: 448, baseType: !70, size: 32, align: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !344, file: !9, line: 449, baseType: !70, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !344, file: !9, line: 450, baseType: !70, size: 32, align: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !344, file: !9, line: 451, baseType: !353, size: 64, align: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !355, file: !9, line: 433, baseType: !106, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !355, file: !9, line: 434, baseType: !164, size: 832, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !355, file: !9, line: 436, baseType: !360, size: 64, align: 64, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!70, !363, !364}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !344, file: !9, line: 452, baseType: !366, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !369)
!369 = !{!370, !382, !387, !391, !395, !399, !400}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !368, file: !9, line: 260, baseType: !371, size: 4224, align: 64)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 4224, align: 64, elements: !379)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !373, file: !9, line: 233, baseType: !63, size: 16, align: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !373, file: !9, line: 234, baseType: !85, size: 8, align: 8, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !373, file: !9, line: 236, baseType: !378, size: 64, align: 64, offset: 64)
!378 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!379 = !{!380, !381}
!380 = !DISubrange(count: 3)
!381 = !DISubrange(count: 11)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !368, file: !9, line: 261, baseType: !383, size: 2304, align: 64, offset: 4224)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 2304, align: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DISubrange(count: 2)
!386 = !DISubrange(count: 9)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !368, file: !9, line: 262, baseType: !388, size: 2560, align: 64, offset: 6528)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 2560, align: 64, elements: !389)
!389 = !{!385, !390}
!390 = !DISubrange(count: 10)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !368, file: !9, line: 263, baseType: !392, size: 1536, align: 64, offset: 9088)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1536, align: 64, elements: !393)
!393 = !{!385, !394}
!394 = !DISubrange(count: 6)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !368, file: !9, line: 264, baseType: !396, size: 512, align: 64, offset: 10624)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 512, align: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !368, file: !9, line: 265, baseType: !396, size: 512, align: 64, offset: 11136)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !368, file: !9, line: 266, baseType: !401, size: 384, align: 64, offset: 11648)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 384, align: 64, elements: !402)
!402 = !{!380}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !344, file: !9, line: 453, baseType: !404, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !407)
!407 = !{!408, !411, !412, !415, !418, !422, !423, !427, !428, !429}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !406, file: !9, line: 283, baseType: !409, size: 256, align: 64)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 256, align: 64, elements: !410)
!410 = !{!385}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !406, file: !9, line: 284, baseType: !396, size: 512, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !406, file: !9, line: 285, baseType: !413, size: 1536, align: 64, offset: 768)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1536, align: 64, elements: !414)
!414 = !{!380, !398}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !406, file: !9, line: 286, baseType: !416, size: 5120, align: 64, offset: 2304)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 5120, align: 64, elements: !417)
!417 = !{!390, !398}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !406, file: !9, line: 287, baseType: !419, size: 19200, align: 64, offset: 7424)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 19200, align: 64, elements: !420)
!420 = !{!390, !421}
!421 = !DISubrange(count: 15)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !406, file: !9, line: 288, baseType: !419, size: 19200, align: 64, offset: 26624)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !406, file: !9, line: 289, baseType: !424, size: 6400, align: 64, offset: 45824)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 6400, align: 64, elements: !425)
!425 = !{!390, !426}
!426 = !DISubrange(count: 5)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !406, file: !9, line: 290, baseType: !424, size: 6400, align: 64, offset: 52224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !406, file: !9, line: 291, baseType: !419, size: 19200, align: 64, offset: 58624)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !406, file: !9, line: 292, baseType: !419, size: 19200, align: 64, offset: 77824)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !344, file: !9, line: 456, baseType: !431, size: 64, align: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !433, file: !9, line: 310, baseType: !70, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !433, file: !9, line: 311, baseType: !70, size: 32, align: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !433, file: !9, line: 312, baseType: !438, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !344, file: !9, line: 458, baseType: !70, size: 32, align: 32, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !344, file: !9, line: 459, baseType: !156, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !344, file: !9, line: 460, baseType: !156, size: 64, align: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !344, file: !9, line: 461, baseType: !156, size: 64, align: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !344, file: !9, line: 462, baseType: !70, size: 32, align: 32, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !344, file: !9, line: 463, baseType: !156, size: 64, align: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !344, file: !9, line: 464, baseType: !156, size: 64, align: 64, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !344, file: !9, line: 465, baseType: !156, size: 64, align: 64, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !344, file: !9, line: 467, baseType: !448, size: 64, align: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!77, !70}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !344, file: !9, line: 469, baseType: !452, size: 192, align: 32, offset: 1024)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 192, align: 32, elements: !453)
!453 = !{!380, !385}
!454 = !{!455}
!455 = !DISubrange(count: 100)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !336, file: !9, line: 480, baseType: !70, size: 32, align: 32, offset: 6464)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !336, file: !9, line: 481, baseType: !458, size: 32, align: 32, offset: 6496)
!458 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !336, file: !9, line: 482, baseType: !458, size: 32, align: 32, offset: 6528)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !336, file: !9, line: 483, baseType: !458, size: 32, align: 32, offset: 6560)
!461 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !334, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!462 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !334, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!463 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !334, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!464 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !334, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!465 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !466, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!467 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !468, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!469 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !470, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!471 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !149, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!472 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !149, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!473 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !70, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!474 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !70, isLocal: false, isDefinition: true, variable: i32* @me_time)
!475 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !476, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !490, !491, !492, !493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !478, file: !4, line: 105, baseType: !77, size: 32, align: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !478, file: !4, line: 106, baseType: !149, size: 32, align: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !478, file: !4, line: 107, baseType: !149, size: 32, align: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !478, file: !4, line: 108, baseType: !77, size: 32, align: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !478, file: !4, line: 110, baseType: !77, size: 32, align: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !478, file: !4, line: 111, baseType: !77, size: 32, align: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !478, file: !4, line: 112, baseType: !487, size: 256, align: 32, offset: 192)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, align: 32, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !478, file: !4, line: 115, baseType: !77, size: 32, align: 32, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !478, file: !4, line: 116, baseType: !149, size: 32, align: 32, offset: 480)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !478, file: !4, line: 117, baseType: !149, size: 32, align: 32, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !478, file: !4, line: 119, baseType: !494, size: 256, align: 32, offset: 544)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 256, align: 32, elements: !488)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !478, file: !4, line: 121, baseType: !494, size: 256, align: 32, offset: 800)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !478, file: !4, line: 122, baseType: !494, size: 256, align: 32, offset: 1056)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !478, file: !4, line: 124, baseType: !77, size: 32, align: 32, offset: 1312)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !478, file: !4, line: 125, baseType: !149, size: 32, align: 32, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !478, file: !4, line: 127, baseType: !149, size: 32, align: 32, offset: 1376)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !478, file: !4, line: 128, baseType: !82, size: 64, align: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !478, file: !4, line: 130, baseType: !70, size: 32, align: 32, offset: 1472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !478, file: !4, line: 131, baseType: !70, size: 32, align: 32, offset: 1504)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !478, file: !4, line: 132, baseType: !77, size: 32, align: 32, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !478, file: !4, line: 133, baseType: !149, size: 32, align: 32, offset: 1568)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !478, file: !4, line: 134, baseType: !70, size: 32, align: 32, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !478, file: !4, line: 135, baseType: !70, size: 32, align: 32, offset: 1632)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !478, file: !4, line: 136, baseType: !70, size: 32, align: 32, offset: 1664)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !478, file: !4, line: 138, baseType: !70, size: 32, align: 32, offset: 1696)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !478, file: !4, line: 139, baseType: !70, size: 32, align: 32, offset: 1728)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !478, file: !4, line: 141, baseType: !77, size: 32, align: 32, offset: 1760)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !478, file: !4, line: 142, baseType: !77, size: 32, align: 32, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !478, file: !4, line: 143, baseType: !77, size: 32, align: 32, offset: 1824)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !478, file: !4, line: 144, baseType: !77, size: 32, align: 32, offset: 1856)
!514 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !515, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !517)
!517 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !517, file: !4, line: 151, baseType: !77, size: 32, align: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !517, file: !4, line: 153, baseType: !149, size: 32, align: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !517, file: !4, line: 154, baseType: !77, size: 32, align: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !517, file: !4, line: 155, baseType: !77, size: 32, align: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !517, file: !4, line: 156, baseType: !77, size: 32, align: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !517, file: !4, line: 157, baseType: !77, size: 32, align: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !517, file: !4, line: 158, baseType: !149, size: 32, align: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !517, file: !4, line: 159, baseType: !149, size: 32, align: 32, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !517, file: !4, line: 160, baseType: !149, size: 32, align: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !517, file: !4, line: 162, baseType: !77, size: 32, align: 32, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !517, file: !4, line: 163, baseType: !487, size: 256, align: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !517, file: !4, line: 165, baseType: !149, size: 32, align: 32, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !517, file: !4, line: 166, baseType: !149, size: 32, align: 32, offset: 608)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !517, file: !4, line: 167, baseType: !149, size: 32, align: 32, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !517, file: !4, line: 168, baseType: !149, size: 32, align: 32, offset: 672)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !517, file: !4, line: 170, baseType: !149, size: 32, align: 32, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !517, file: !4, line: 172, baseType: !77, size: 32, align: 32, offset: 736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !517, file: !4, line: 173, baseType: !70, size: 32, align: 32, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !517, file: !4, line: 174, baseType: !70, size: 32, align: 32, offset: 800)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !517, file: !4, line: 175, baseType: !149, size: 32, align: 32, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !517, file: !4, line: 177, baseType: !540, size: 8192, align: 32, offset: 864)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8192, align: 32, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !517, file: !4, line: 178, baseType: !149, size: 32, align: 32, offset: 9056)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !517, file: !4, line: 179, baseType: !77, size: 32, align: 32, offset: 9088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !517, file: !4, line: 180, baseType: !149, size: 32, align: 32, offset: 9120)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !517, file: !4, line: 181, baseType: !149, size: 32, align: 32, offset: 9152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !517, file: !4, line: 182, baseType: !77, size: 32, align: 32, offset: 9184)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !517, file: !4, line: 184, baseType: !77, size: 32, align: 32, offset: 9216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !517, file: !4, line: 185, baseType: !77, size: 32, align: 32, offset: 9248)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !517, file: !4, line: 186, baseType: !77, size: 32, align: 32, offset: 9280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !517, file: !4, line: 187, baseType: !149, size: 32, align: 32, offset: 9312)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !517, file: !4, line: 188, baseType: !149, size: 32, align: 32, offset: 9344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !517, file: !4, line: 189, baseType: !149, size: 32, align: 32, offset: 9376)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !517, file: !4, line: 190, baseType: !149, size: 32, align: 32, offset: 9408)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !517, file: !4, line: 191, baseType: !77, size: 32, align: 32, offset: 9440)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !517, file: !4, line: 192, baseType: !557, size: 7584, align: 32, offset: 9472)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !558)
!558 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !558, file: !4, line: 65, baseType: !77, size: 32, align: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !558, file: !4, line: 66, baseType: !149, size: 32, align: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !558, file: !4, line: 67, baseType: !149, size: 32, align: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !558, file: !4, line: 68, baseType: !149, size: 32, align: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !558, file: !4, line: 69, baseType: !77, size: 32, align: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !558, file: !4, line: 70, baseType: !77, size: 32, align: 32, offset: 160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !558, file: !4, line: 71, baseType: !77, size: 32, align: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !558, file: !4, line: 72, baseType: !149, size: 32, align: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !558, file: !4, line: 73, baseType: !77, size: 32, align: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !558, file: !4, line: 74, baseType: !77, size: 32, align: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !558, file: !4, line: 75, baseType: !149, size: 32, align: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !558, file: !4, line: 76, baseType: !149, size: 32, align: 32, offset: 352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !558, file: !4, line: 77, baseType: !149, size: 32, align: 32, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !558, file: !4, line: 78, baseType: !77, size: 32, align: 32, offset: 416)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !558, file: !4, line: 79, baseType: !149, size: 32, align: 32, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !558, file: !4, line: 80, baseType: !149, size: 32, align: 32, offset: 480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !558, file: !4, line: 81, baseType: !77, size: 32, align: 32, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !558, file: !4, line: 82, baseType: !149, size: 32, align: 32, offset: 544)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !558, file: !4, line: 83, baseType: !149, size: 32, align: 32, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !558, file: !4, line: 84, baseType: !77, size: 32, align: 32, offset: 608)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !558, file: !4, line: 85, baseType: !77, size: 32, align: 32, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !558, file: !4, line: 86, baseType: !582, size: 3296, align: 32, offset: 672)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !584)
!584 = !{!585, !586, !587, !588, !592, !593, !594, !595, !596, !597}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !583, file: !4, line: 50, baseType: !149, size: 32, align: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !583, file: !4, line: 51, baseType: !149, size: 32, align: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !583, file: !4, line: 52, baseType: !149, size: 32, align: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !583, file: !4, line: 53, baseType: !589, size: 1024, align: 32, offset: 96)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1024, align: 32, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !583, file: !4, line: 54, baseType: !589, size: 1024, align: 32, offset: 1120)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !583, file: !4, line: 55, baseType: !589, size: 1024, align: 32, offset: 2144)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !583, file: !4, line: 56, baseType: !149, size: 32, align: 32, offset: 3168)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !583, file: !4, line: 57, baseType: !149, size: 32, align: 32, offset: 3200)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !583, file: !4, line: 58, baseType: !149, size: 32, align: 32, offset: 3232)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !583, file: !4, line: 59, baseType: !149, size: 32, align: 32, offset: 3264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !558, file: !4, line: 87, baseType: !77, size: 32, align: 32, offset: 3968)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !558, file: !4, line: 88, baseType: !582, size: 3296, align: 32, offset: 4000)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !558, file: !4, line: 90, baseType: !77, size: 32, align: 32, offset: 7296)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !558, file: !4, line: 91, baseType: !77, size: 32, align: 32, offset: 7328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !558, file: !4, line: 92, baseType: !77, size: 32, align: 32, offset: 7360)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !558, file: !4, line: 93, baseType: !149, size: 32, align: 32, offset: 7392)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !558, file: !4, line: 94, baseType: !149, size: 32, align: 32, offset: 7424)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !558, file: !4, line: 95, baseType: !149, size: 32, align: 32, offset: 7456)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !558, file: !4, line: 96, baseType: !149, size: 32, align: 32, offset: 7488)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !558, file: !4, line: 97, baseType: !149, size: 32, align: 32, offset: 7520)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !558, file: !4, line: 98, baseType: !149, size: 32, align: 32, offset: 7552)
!609 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !70, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!610 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !70, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!611 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !612, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!613 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !612, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!614 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !615, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!616 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !70, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!617 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !70, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!618 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !70, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!619 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !70, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!620 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !466, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!621 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !466, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!622 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !468, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!623 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !468, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!624 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !466, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!625 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !468, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!626 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !466, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!627 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !468, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!628 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !629, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!633 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !630, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!634 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !635, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!636 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !635, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!637 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !70, isLocal: false, isDefinition: true, variable: i32* @intras)
!638 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !70, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!639 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !70, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!640 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !70, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!641 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !70, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!642 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !70, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!643 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !70, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!644 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !70, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!645 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !646, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 2400, align: 8, elements: !648)
!647 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!648 = !{!649}
!649 = !DISubrange(count: 300)
!650 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !651, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8192, align: 32, elements: !652)
!652 = !{!653, !653}
!653 = !DISubrange(count: 16)
!654 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !651, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!655 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !651, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!656 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !651, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!657 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !651, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!658 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !651, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!659 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !660, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 24576, align: 32, elements: !661)
!661 = !{!380, !653, !653}
!662 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !663, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, align: 32, elements: !664)
!664 = !{!385, !398, !398}
!665 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !663, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!666 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !663, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!667 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !663, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!668 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !669, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, align: 32, elements: !670)
!670 = !{!398, !398}
!671 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !672, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, align: 32, elements: !673)
!673 = !{!653}
!674 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !675, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !677)
!677 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !677, file: !9, line: 1184, baseType: !70, size: 32, align: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !677, file: !9, line: 1185, baseType: !70, size: 32, align: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !677, file: !9, line: 1186, baseType: !70, size: 32, align: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !677, file: !9, line: 1187, baseType: !70, size: 32, align: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !677, file: !9, line: 1188, baseType: !70, size: 32, align: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !677, file: !9, line: 1189, baseType: !70, size: 32, align: 32, offset: 160)
!685 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !686, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !689)
!689 = !{!690, !692, !693, !694, !695, !696, !697, !698, !699, !701, !702, !703, !704, !705, !710, !711, !715, !716, !717, !718, !720, !721, !722, !723, !724, !725, !726}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !688, file: !9, line: 1147, baseType: !691, size: 64, align: 64)
!691 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !688, file: !9, line: 1149, baseType: !651, size: 8192, align: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !688, file: !9, line: 1150, baseType: !651, size: 8192, align: 32, offset: 8256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !688, file: !9, line: 1150, baseType: !651, size: 8192, align: 32, offset: 16448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !688, file: !9, line: 1151, baseType: !615, size: 64, align: 64, offset: 24640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !688, file: !9, line: 1152, baseType: !612, size: 64, align: 64, offset: 24704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !688, file: !9, line: 1153, baseType: !70, size: 32, align: 32, offset: 24768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !688, file: !9, line: 1155, baseType: !70, size: 32, align: 32, offset: 24800)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !688, file: !9, line: 1157, baseType: !700, size: 128, align: 32, offset: 24832)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, align: 32, elements: !397)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !688, file: !9, line: 1157, baseType: !700, size: 128, align: 32, offset: 24960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !688, file: !9, line: 1158, baseType: !470, size: 64, align: 64, offset: 25088)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !688, file: !9, line: 1159, baseType: !672, size: 512, align: 32, offset: 25152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !688, file: !9, line: 1160, baseType: !70, size: 32, align: 32, offset: 25664)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !688, file: !9, line: 1161, baseType: !706, size: 64, align: 64, offset: 25728)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !708, line: 30, baseType: !709)
!708 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!709 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !688, file: !9, line: 1162, baseType: !70, size: 32, align: 32, offset: 25792)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !688, file: !9, line: 1163, baseType: !712, size: 64, align: 64, offset: 25856)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !688, file: !9, line: 1164, baseType: !712, size: 64, align: 64, offset: 25920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !688, file: !9, line: 1165, baseType: !712, size: 64, align: 64, offset: 25984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !688, file: !9, line: 1166, baseType: !712, size: 64, align: 64, offset: 26048)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !688, file: !9, line: 1167, baseType: !719, size: 512, align: 16, offset: 26112)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 512, align: 16, elements: !664)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !688, file: !9, line: 1168, baseType: !70, size: 32, align: 32, offset: 26624)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !688, file: !9, line: 1169, baseType: !70, size: 32, align: 32, offset: 26656)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !688, file: !9, line: 1171, baseType: !70, size: 32, align: 32, offset: 26688)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !688, file: !9, line: 1172, baseType: !70, size: 32, align: 32, offset: 26720)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !688, file: !9, line: 1174, baseType: !70, size: 32, align: 32, offset: 26752)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !688, file: !9, line: 1175, baseType: !70, size: 32, align: 32, offset: 26784)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !688, file: !9, line: 1176, baseType: !70, size: 32, align: 32, offset: 26816)
!727 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !687, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!728 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !687, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!729 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !687, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!730 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !687, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!731 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !732, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !734, line: 153, baseType: !735)
!734 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !734, line: 122, size: 1216, align: 64, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !747, !748, !749, !753, !758, !767, !773, !774, !777, !778, !780, !784, !785, !786}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !735, file: !734, line: 123, baseType: !191, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !735, file: !734, line: 124, baseType: !70, size: 32, align: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !735, file: !734, line: 125, baseType: !70, size: 32, align: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !735, file: !734, line: 126, baseType: !632, size: 16, align: 16, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !735, file: !734, line: 127, baseType: !632, size: 16, align: 16, offset: 144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !735, file: !734, line: 128, baseType: !743, size: 128, align: 64, offset: 192)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !734, line: 88, size: 128, align: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !743, file: !734, line: 89, baseType: !191, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !743, file: !734, line: 90, baseType: !70, size: 32, align: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !735, file: !734, line: 129, baseType: !70, size: 32, align: 32, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !735, file: !734, line: 132, baseType: !61, size: 64, align: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !735, file: !734, line: 133, baseType: !750, size: 64, align: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!70, !61}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !735, file: !734, line: 134, baseType: !754, size: 64, align: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!70, !61, !757, !70}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !735, file: !734, line: 135, baseType: !759, size: 64, align: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!762, !61, !762, !70}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !734, line: 77, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !764, line: 71, baseType: !765)
!764 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !766, line: 46, baseType: !709)
!766 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !735, file: !734, line: 136, baseType: !768, size: 64, align: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!70, !61, !771, !70}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !735, file: !734, line: 139, baseType: !743, size: 128, align: 64, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !735, file: !734, line: 140, baseType: !775, size: 64, align: 64, offset: 832)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !734, line: 94, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !735, file: !734, line: 141, baseType: !70, size: 32, align: 32, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !735, file: !734, line: 144, baseType: !779, size: 24, align: 8, offset: 928)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 24, align: 8, elements: !402)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !735, file: !734, line: 145, baseType: !781, size: 8, align: 8, offset: 952)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8, align: 8, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 1)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !735, file: !734, line: 148, baseType: !743, size: 128, align: 64, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !735, file: !734, line: 151, baseType: !70, size: 32, align: 32, offset: 1088)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !735, file: !734, line: 152, baseType: !762, size: 64, align: 64, offset: 1152)
!787 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !732, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!788 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !732, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!789 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !70, isLocal: false, isDefinition: true, variable: i32* @p_in)
!790 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !70, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!791 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !792, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 640, align: 32, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 20)
!795 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !792, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!796 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !792, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!797 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !792, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!798 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !792, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!799 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !792, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!800 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !70, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!801 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !70, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!802 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !70, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!803 = !DIGlobalVariable(name: "WriteNALU", scope: !0, file: !804, line: 28, type: !805, isLocal: false, isDefinition: true, variable: i32 (%struct.NALU_t*)** @WriteNALU)
!804 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!70, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALU_t", file: !810, line: 49, baseType: !811)
!810 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalucommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!811 = !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 40, size: 256, align: 64, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "startcodeprefix_len", scope: !811, file: !810, line: 42, baseType: !70, size: 32, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !811, file: !810, line: 43, baseType: !149, size: 32, align: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !811, file: !810, line: 44, baseType: !149, size: 32, align: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !811, file: !810, line: 45, baseType: !70, size: 32, align: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !811, file: !810, line: 46, baseType: !70, size: 32, align: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_bit", scope: !811, file: !810, line: 47, baseType: !70, size: 32, align: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !811, file: !810, line: 48, baseType: !82, size: 64, align: 64, offset: 192)
!820 = !DIGlobalVariable(name: "seiHasUser_data_unregistered_info", scope: !0, file: !1, line: 1324, type: !77, isLocal: false, isDefinition: true, variable: i32* @seiHasUser_data_unregistered_info)
!821 = !DIGlobalVariable(name: "seiUser_data_unregistered", scope: !0, file: !1, line: 1325, type: !822, isLocal: false, isDefinition: true, variable: %struct.user_data_unregistered_information_struct* @seiUser_data_unregistered)
