; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/slice.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !34, subprograms: !217, globals: !423, imports: !769)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/slice.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !8, !13, !17, !22, !27}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FALSE", value: 0)
!7 = !DIEnumerator(name: "TRUE", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 96, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "PAR_DP_1", value: 0)
!12 = !DIEnumerator(name: "PAR_DP_3", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 178, size: 32, align: 32, elements: !14)
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "UVLC", value: 0)
!16 = !DIEnumerator(name: "CABAC", value: 1)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 111, size: 32, align: 32, elements: !18)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!20 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!21 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 185, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "FRAME", value: 0)
!25 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!26 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 192, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "P_SLICE", value: 0)
!30 = !DIEnumerator(name: "B_SLICE", value: 1)
!31 = !DIEnumerator(name: "I_SLICE", value: 2)
!32 = !DIEnumerator(name: "SP_SLICE", value: 3)
!33 = !DIEnumerator(name: "SI_SLICE", value: 4)
!34 = !{!35, !36, !48, !53, !70}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !39)
!39 = !{!40, !42, !43, !44, !45, !46, !47, !126, !165, !192, !201, !202, !203, !204, !205, !206, !207, !208, !209, !214}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !38, file: !9, line: 445, baseType: !41, size: 32, align: 32)
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !38, file: !9, line: 446, baseType: !41, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !38, file: !9, line: 447, baseType: !41, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !38, file: !9, line: 448, baseType: !41, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !38, file: !9, line: 449, baseType: !41, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !38, file: !9, line: 450, baseType: !41, size: 32, align: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !38, file: !9, line: 451, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !51)
!51 = !{!52, !72, !98}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !50, file: !9, line: 433, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !56)
!56 = !{!57, !58, !59, !63, !64, !65, !66, !67, !68, !69, !71}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !55, file: !9, line: 413, baseType: !41, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !55, file: !9, line: 414, baseType: !41, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !55, file: !9, line: 415, baseType: !60, size: 8, align: 8, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !61, line: 30, baseType: !62)
!61 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !55, file: !9, line: 416, baseType: !41, size: 32, align: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !55, file: !9, line: 417, baseType: !41, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !55, file: !9, line: 418, baseType: !60, size: 8, align: 8, offset: 160)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !55, file: !9, line: 420, baseType: !60, size: 8, align: 8, offset: 168)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !55, file: !9, line: 421, baseType: !41, size: 32, align: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !55, file: !9, line: 422, baseType: !41, size: 32, align: 32, offset: 224)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !55, file: !9, line: 424, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !55, file: !9, line: 425, baseType: !41, size: 32, align: 32, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !50, file: !9, line: 434, baseType: !73, size: 832, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !75)
!75 = !{!76, !78, !79, !80, !81, !82, !83, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !74, file: !9, line: 209, baseType: !77, size: 32, align: 32)
!77 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !74, file: !9, line: 209, baseType: !77, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !74, file: !9, line: 210, baseType: !77, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !74, file: !9, line: 211, baseType: !77, size: 32, align: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !74, file: !9, line: 212, baseType: !77, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !74, file: !9, line: 213, baseType: !70, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !74, file: !9, line: 214, baseType: !84, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !74, file: !9, line: 217, baseType: !77, size: 32, align: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !74, file: !9, line: 217, baseType: !77, size: 32, align: 32, offset: 352)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !74, file: !9, line: 218, baseType: !77, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !74, file: !9, line: 219, baseType: !77, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !74, file: !9, line: 220, baseType: !77, size: 32, align: 32, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !74, file: !9, line: 221, baseType: !70, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !74, file: !9, line: 222, baseType: !84, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !74, file: !9, line: 223, baseType: !41, size: 32, align: 32, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !74, file: !9, line: 223, baseType: !41, size: 32, align: 32, offset: 672)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !74, file: !9, line: 224, baseType: !41, size: 32, align: 32, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !74, file: !9, line: 224, baseType: !41, size: 32, align: 32, offset: 736)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !74, file: !9, line: 225, baseType: !41, size: 32, align: 32, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !74, file: !9, line: 225, baseType: !41, size: 32, align: 32, offset: 800)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !50, file: !9, line: 436, baseType: !99, size: 64, align: 64, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!41, !102, !125}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !118}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !9, line: 329, baseType: !41, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !104, file: !9, line: 330, baseType: !41, size: 32, align: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !104, file: !9, line: 331, baseType: !41, size: 32, align: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !9, line: 332, baseType: !41, size: 32, align: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !104, file: !9, line: 333, baseType: !41, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !104, file: !9, line: 334, baseType: !77, size: 32, align: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !104, file: !9, line: 335, baseType: !41, size: 32, align: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !104, file: !9, line: 336, baseType: !41, size: 32, align: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !104, file: !9, line: 344, baseType: !115, size: 64, align: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !41, !41, !84, !84}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !104, file: !9, line: 346, baseType: !119, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122, !123}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !38, file: !9, line: 452, baseType: !127, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !130)
!130 = !{!131, !144, !149, !153, !157, !161, !162}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !129, file: !9, line: 260, baseType: !132, size: 4224, align: 64)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 4224, align: 64, elements: !141)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !135)
!135 = !{!136, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !134, file: !9, line: 233, baseType: !137, size: 16, align: 16)
!137 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !134, file: !9, line: 234, baseType: !62, size: 8, align: 8, offset: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !134, file: !9, line: 236, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!141 = !{!142, !143}
!142 = !DISubrange(count: 3)
!143 = !DISubrange(count: 11)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !129, file: !9, line: 261, baseType: !145, size: 2304, align: 64, offset: 4224)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 2304, align: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DISubrange(count: 2)
!148 = !DISubrange(count: 9)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !129, file: !9, line: 262, baseType: !150, size: 2560, align: 64, offset: 6528)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 2560, align: 64, elements: !151)
!151 = !{!147, !152}
!152 = !DISubrange(count: 10)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !129, file: !9, line: 263, baseType: !154, size: 1536, align: 64, offset: 9088)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1536, align: 64, elements: !155)
!155 = !{!147, !156}
!156 = !DISubrange(count: 6)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !129, file: !9, line: 264, baseType: !158, size: 512, align: 64, offset: 10624)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 512, align: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 4)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !129, file: !9, line: 265, baseType: !158, size: 512, align: 64, offset: 11136)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !129, file: !9, line: 266, baseType: !163, size: 384, align: 64, offset: 11648)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 384, align: 64, elements: !164)
!164 = !{!142}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !38, file: !9, line: 453, baseType: !166, size: 64, align: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !169)
!169 = !{!170, !173, !174, !177, !180, !184, !185, !189, !190, !191}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !168, file: !9, line: 283, baseType: !171, size: 256, align: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, align: 64, elements: !172)
!172 = !{!147}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !168, file: !9, line: 284, baseType: !158, size: 512, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !168, file: !9, line: 285, baseType: !175, size: 1536, align: 64, offset: 768)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1536, align: 64, elements: !176)
!176 = !{!142, !160}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !168, file: !9, line: 286, baseType: !178, size: 5120, align: 64, offset: 2304)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 5120, align: 64, elements: !179)
!179 = !{!152, !160}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !168, file: !9, line: 287, baseType: !181, size: 19200, align: 64, offset: 7424)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 19200, align: 64, elements: !182)
!182 = !{!152, !183}
!183 = !DISubrange(count: 15)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !168, file: !9, line: 288, baseType: !181, size: 19200, align: 64, offset: 26624)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !168, file: !9, line: 289, baseType: !186, size: 6400, align: 64, offset: 45824)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 6400, align: 64, elements: !187)
!187 = !{!152, !188}
!188 = !DISubrange(count: 5)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !168, file: !9, line: 290, baseType: !186, size: 6400, align: 64, offset: 52224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !168, file: !9, line: 291, baseType: !181, size: 19200, align: 64, offset: 58624)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !168, file: !9, line: 292, baseType: !181, size: 19200, align: 64, offset: 77824)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !38, file: !9, line: 456, baseType: !193, size: 64, align: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !195, file: !9, line: 310, baseType: !41, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !195, file: !9, line: 311, baseType: !41, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !195, file: !9, line: 312, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !38, file: !9, line: 458, baseType: !41, size: 32, align: 32, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !38, file: !9, line: 459, baseType: !84, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !38, file: !9, line: 460, baseType: !84, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !38, file: !9, line: 461, baseType: !84, size: 64, align: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !38, file: !9, line: 462, baseType: !41, size: 32, align: 32, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !38, file: !9, line: 463, baseType: !84, size: 64, align: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !38, file: !9, line: 464, baseType: !84, size: 64, align: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !38, file: !9, line: 465, baseType: !84, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !38, file: !9, line: 467, baseType: !210, size: 64, align: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !41}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !38, file: !9, line: 469, baseType: !215, size: 192, align: 32, offset: 1024)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, align: 32, elements: !216)
!216 = !{!142, !147}
!217 = !{!218, !223, !233, !241, !270, !276, !283, !389, !403, !412, !416}
!218 = !DISubprogram(name: "init_ref_pic_list_reordering", scope: !1, file: !1, line: 50, type: !219, isLocal: false, isDefinition: true, scopeLine: 51, isOptimized: true, function: void ()* @init_ref_pic_list_reordering, variables: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{null}
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !218, file: !1, line: 52, type: !36)
!223 = !DISubprogram(name: "start_slice", scope: !1, file: !1, line: 72, type: !224, isLocal: false, isDefinition: true, scopeLine: 73, isOptimized: true, function: i32 ()* @start_slice, variables: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!41}
!226 = !{!227, !228, !229, !230, !231, !232}
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep", scope: !223, file: !1, line: 74, type: !123)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !223, file: !1, line: 75, type: !36)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !223, file: !1, line: 76, type: !53)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header_len", scope: !223, file: !1, line: 77, type: !41)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !223, file: !1, line: 78, type: !41)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NumberOfPartitions", scope: !223, file: !1, line: 79, type: !41)
!233 = !DISubprogram(name: "terminate_slice", scope: !1, file: !1, line: 134, type: !224, isLocal: false, isDefinition: true, scopeLine: 135, isOptimized: true, function: i32 ()* @terminate_slice, variables: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_written", scope: !233, file: !1, line: 136, type: !41)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !233, file: !1, line: 137, type: !53)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !233, file: !1, line: 138, type: !36)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eep", scope: !233, file: !1, line: 139, type: !123)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !233, file: !1, line: 140, type: !41)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byte_pos_before_startcode_emu_prevention", scope: !233, file: !1, line: 141, type: !41)
!241 = !DISubprogram(name: "encode_one_slice", scope: !1, file: !1, line: 185, type: !242, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.Picture*)* @encode_one_slice, variables: !259)
!242 = !DISubroutineType(types: !243)
!243 = !{!41, !41, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !247)
!247 = !{!248, !249, !250, !254, !255, !257, !258}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !246, file: !9, line: 477, baseType: !41, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !246, file: !9, line: 478, baseType: !41, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !246, file: !9, line: 479, baseType: !251, size: 6400, align: 64, offset: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 6400, align: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 100)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !246, file: !9, line: 480, baseType: !41, size: 32, align: 32, offset: 6464)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !246, file: !9, line: 481, baseType: !256, size: 32, align: 32, offset: 6496)
!256 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !246, file: !9, line: 482, baseType: !256, size: 32, align: 32, offset: 6528)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !246, file: !9, line: 483, baseType: !256, size: 32, align: 32, offset: 6560)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !269}
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SliceGroupId", arg: 1, scope: !241, file: !1, line: 185, type: !41)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pic", arg: 2, scope: !241, file: !1, line: 185, type: !244)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_of_slice", scope: !241, file: !1, line: 187, type: !213)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "recode_macroblock", scope: !241, file: !1, line: 188, type: !213)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !241, file: !1, line: 189, type: !41)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NumberOfCodedMBs", scope: !241, file: !1, line: 190, type: !41)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "CurrentMbAddr", scope: !241, file: !1, line: 191, type: !41)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "FrameRDCost", scope: !241, file: !1, line: 192, type: !268)
!268 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "FieldRDCost", scope: !241, file: !1, line: 192, type: !268)
!270 = !DISubprogram(name: "free_slice_list", scope: !1, file: !1, line: 731, type: !271, isLocal: false, isDefinition: true, scopeLine: 732, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Picture*)* @free_slice_list, variables: !273)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !244}
!273 = !{!274, !275}
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currPic", arg: 1, scope: !270, file: !1, line: 731, type: !244)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !270, file: !1, line: 733, type: !41)
!276 = !DISubprogram(name: "modify_redundant_pic_cnt", scope: !1, file: !1, line: 789, type: !277, isLocal: false, isDefinition: true, scopeLine: 790, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @modify_redundant_pic_cnt, variables: !280)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!280 = !{!281, !282}
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 1, scope: !276, file: !1, line: 789, type: !279)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !276, file: !1, line: 791, type: !62)
!283 = !DISubprogram(name: "poc_ref_pic_reorder", scope: !1, file: !1, line: 838, type: !284, isLocal: false, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.storable_picture**, i32, i32*, i32*, i32*, i32, i32)* @poc_ref_pic_reorder, variables: !361)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !286, !77, !84, !84, !84, !41, !41}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !289, line: 82, baseType: !290)
!289 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/mbuffer.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !289, line: 21, size: 52672, align: 64, elements: !291)
!291 = !{!292, !294, !295, !296, !297, !298, !299, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !328, !329, !330, !331, !332, !334, !335, !340, !344, !345, !347, !349, !350, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !290, file: !289, line: 23, baseType: !293, size: 32, align: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !9, line: 190, baseType: !22)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !290, file: !289, line: 25, baseType: !41, size: 32, align: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !290, file: !289, line: 26, baseType: !41, size: 32, align: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !290, file: !289, line: 27, baseType: !41, size: 32, align: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !290, file: !289, line: 28, baseType: !41, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "order_num", scope: !290, file: !289, line: 29, baseType: !41, size: 32, align: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_num", scope: !290, file: !289, line: 30, baseType: !300, size: 12672, align: 64, offset: 192)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 12672, align: 64, elements: !305)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !303, line: 30, baseType: !304)
!303 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!304 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!305 = !{!156, !306}
!306 = !DISubrange(count: 33)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "frm_ref_pic_num", scope: !290, file: !289, line: 31, baseType: !300, size: 12672, align: 64, offset: 12864)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "top_ref_pic_num", scope: !290, file: !289, line: 32, baseType: !300, size: 12672, align: 64, offset: 25536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_ref_pic_num", scope: !290, file: !289, line: 33, baseType: !300, size: 12672, align: 64, offset: 38208)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !290, file: !289, line: 34, baseType: !77, size: 32, align: 32, offset: 50880)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !290, file: !289, line: 35, baseType: !41, size: 32, align: 32, offset: 50912)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !290, file: !289, line: 36, baseType: !41, size: 32, align: 32, offset: 50944)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !290, file: !289, line: 37, baseType: !41, size: 32, align: 32, offset: 50976)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !290, file: !289, line: 39, baseType: !41, size: 32, align: 32, offset: 51008)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !290, file: !289, line: 40, baseType: !41, size: 32, align: 32, offset: 51040)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !290, file: !289, line: 41, baseType: !41, size: 32, align: 32, offset: 51072)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !290, file: !289, line: 42, baseType: !41, size: 32, align: 32, offset: 51104)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !290, file: !289, line: 44, baseType: !41, size: 32, align: 32, offset: 51136)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !290, file: !289, line: 44, baseType: !41, size: 32, align: 32, offset: 51168)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !290, file: !289, line: 44, baseType: !41, size: 32, align: 32, offset: 51200)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !290, file: !289, line: 44, baseType: !41, size: 32, align: 32, offset: 51232)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_vector_adjustment", scope: !290, file: !289, line: 45, baseType: !41, size: 32, align: 32, offset: 51264)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !290, file: !289, line: 46, baseType: !41, size: 32, align: 32, offset: 51296)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "MbaffFrameFlag", scope: !290, file: !289, line: 47, baseType: !41, size: 32, align: 32, offset: 51328)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !290, file: !289, line: 49, baseType: !326, size: 64, align: 64, offset: 51392)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11", scope: !290, file: !289, line: 50, baseType: !327, size: 64, align: 64, offset: 51456)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_11_w", scope: !290, file: !289, line: 51, baseType: !327, size: 64, align: 64, offset: 51520)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups", scope: !290, file: !289, line: 52, baseType: !326, size: 64, align: 64, offset: 51584)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ups_w", scope: !290, file: !289, line: 53, baseType: !326, size: 64, align: 64, offset: 51648)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !290, file: !289, line: 54, baseType: !333, size: 64, align: 64, offset: 51712)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !290, file: !289, line: 56, baseType: !70, size: 64, align: 64, offset: 51776)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !290, file: !289, line: 58, baseType: !336, size: 64, align: 64, offset: 51840)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_id", scope: !290, file: !289, line: 60, baseType: !341, size: 64, align: 64, offset: 51904)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ref_id", scope: !290, file: !289, line: 63, baseType: !341, size: 64, align: 64, offset: 51968)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !290, file: !289, line: 66, baseType: !346, size: 64, align: 64, offset: 52032)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "moving_block", scope: !290, file: !289, line: 68, baseType: !348, size: 64, align: 64, offset: 52096)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "field_frame", scope: !290, file: !289, line: 69, baseType: !348, size: 64, align: 64, offset: 52160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !290, file: !289, line: 71, baseType: !351, size: 64, align: 64, offset: 52224)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !290, file: !289, line: 72, baseType: !351, size: 64, align: 64, offset: 52288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !290, file: !289, line: 73, baseType: !351, size: 64, align: 64, offset: 52352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !290, file: !289, line: 75, baseType: !41, size: 32, align: 32, offset: 52416)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !290, file: !289, line: 76, baseType: !41, size: 32, align: 32, offset: 52448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !290, file: !289, line: 77, baseType: !41, size: 32, align: 32, offset: 52480)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !290, file: !289, line: 78, baseType: !41, size: 32, align: 32, offset: 52512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !290, file: !289, line: 79, baseType: !41, size: 32, align: 32, offset: 52544)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !290, file: !289, line: 80, baseType: !41, size: 32, align: 32, offset: 52576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !290, file: !289, line: 81, baseType: !41, size: 32, align: 32, offset: 52608)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !283, file: !1, line: 838, type: !286)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_ref_idx_lX_active", arg: 2, scope: !283, file: !1, line: 838, type: !77)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "remapping_of_pic_nums_idc", arg: 3, scope: !283, file: !1, line: 838, type: !84)
!365 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "abs_diff_pic_num_minus1", arg: 4, scope: !283, file: !1, line: 838, type: !84)
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "long_term_pic_idx", arg: 5, scope: !283, file: !1, line: 838, type: !84)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "weighted_prediction", arg: 6, scope: !283, file: !1, line: 838, type: !41)
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list_no", arg: 7, scope: !283, file: !1, line: 838, type: !41)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !283, file: !1, line: 840, type: !77)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !283, file: !1, line: 840, type: !77)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !283, file: !1, line: 840, type: !77)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currPicNum", scope: !283, file: !1, line: 842, type: !41)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "picNumLXPred", scope: !283, file: !1, line: 842, type: !41)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_order", scope: !283, file: !1, line: 844, type: !375)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1024, align: 32, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 32)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "re_order", scope: !283, file: !1, line: 845, type: !375)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_reorder", scope: !283, file: !1, line: 846, type: !375)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_sign", scope: !283, file: !1, line: 847, type: !375)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reorder_stop", scope: !283, file: !1, line: 848, type: !41)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "no_reorder", scope: !283, file: !1, line: 848, type: !41)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "poc_diff", scope: !283, file: !1, line: 849, type: !375)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_value", scope: !283, file: !1, line: 850, type: !41)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !283, file: !1, line: 850, type: !41)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_poc_dist", scope: !283, file: !1, line: 852, type: !41)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxPicNum", scope: !283, file: !1, line: 853, type: !41)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "MaxFrameNum", scope: !283, file: !1, line: 853, type: !41)
!389 = !DISubprogram(name: "init_slice", scope: !1, file: !1, line: 485, type: !390, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, variables: !392)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !41}
!392 = !{!393, !394, !395, !396, !397, !398, !399, !402}
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start_mb_addr", arg: 1, scope: !389, file: !1, line: 485, type: !41)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !389, file: !1, line: 487, type: !41)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currPic", scope: !389, file: !1, line: 488, type: !244)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !389, file: !1, line: 489, type: !48)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currStream", scope: !389, file: !1, line: 490, type: !53)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !389, file: !1, line: 491, type: !36)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !400, file: !1, line: 574, type: !41)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 572, column: 3)
!401 = distinct !DILexicalBlock(scope: !389, file: !1, line: 571, column: 7)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_ref", scope: !400, file: !1, line: 574, type: !41)
!403 = !DISubprogram(name: "malloc_slice", scope: !1, file: !1, line: 674, type: !404, isLocal: true, isDefinition: true, scopeLine: 675, isOptimized: true, variables: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!36}
!406 = !{!407, !408, !409, !410}
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !403, file: !1, line: 676, type: !41)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !403, file: !1, line: 677, type: !48)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slice", scope: !403, file: !1, line: 678, type: !36)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer_size", scope: !403, file: !1, line: 679, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!412 = !DISubprogram(name: "set_ref_pic_num", scope: !1, file: !1, line: 795, type: !219, isLocal: true, isDefinition: true, scopeLine: 796, isOptimized: true, variables: !413)
!413 = !{!414, !415}
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !412, file: !1, line: 797, type: !41)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !412, file: !1, line: 797, type: !41)
!416 = !DISubprogram(name: "free_slice", scope: !1, file: !1, line: 752, type: !417, isLocal: true, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: true, variables: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !36}
!419 = !{!420, !421, !422}
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slice", arg: 1, scope: !416, file: !1, line: 752, type: !36)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !416, file: !1, line: 754, type: !41)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !416, file: !1, line: 755, type: !48)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !433, !434, !435, !436, !437, !476, !569, !570, !571, !573, !574, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !605, !609, !610, !611, !612, !613, !614, !617, !620, !621, !622, !623, !626, !629, !640, !676, !677, !678, !679, !680, !736, !737, !738, !739, !740, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!424 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !244, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!425 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !244, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!426 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !244, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!427 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !244, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!428 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !244, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!429 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !326, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!430 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !333, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!431 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !432, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!433 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !77, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!434 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !77, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!435 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !41, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!436 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !41, isLocal: false, isDefinition: true, variable: i32* @me_time)
!437 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !438, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448, !452, !453, !454, !455, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !440, file: !4, line: 105, baseType: !213, size: 32, align: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !440, file: !4, line: 106, baseType: !77, size: 32, align: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !440, file: !4, line: 107, baseType: !77, size: 32, align: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !440, file: !4, line: 108, baseType: !213, size: 32, align: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !440, file: !4, line: 110, baseType: !213, size: 32, align: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !440, file: !4, line: 111, baseType: !213, size: 32, align: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !440, file: !4, line: 112, baseType: !449, size: 256, align: 32, offset: 192)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, align: 32, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !440, file: !4, line: 115, baseType: !213, size: 32, align: 32, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !440, file: !4, line: 116, baseType: !77, size: 32, align: 32, offset: 480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !440, file: !4, line: 117, baseType: !77, size: 32, align: 32, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !440, file: !4, line: 119, baseType: !456, size: 256, align: 32, offset: 544)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, align: 32, elements: !450)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !440, file: !4, line: 121, baseType: !456, size: 256, align: 32, offset: 800)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !440, file: !4, line: 122, baseType: !456, size: 256, align: 32, offset: 1056)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !440, file: !4, line: 124, baseType: !213, size: 32, align: 32, offset: 1312)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !440, file: !4, line: 125, baseType: !77, size: 32, align: 32, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !440, file: !4, line: 127, baseType: !77, size: 32, align: 32, offset: 1376)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !440, file: !4, line: 128, baseType: !70, size: 64, align: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !440, file: !4, line: 130, baseType: !41, size: 32, align: 32, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !440, file: !4, line: 131, baseType: !41, size: 32, align: 32, offset: 1504)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !440, file: !4, line: 132, baseType: !213, size: 32, align: 32, offset: 1536)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !440, file: !4, line: 133, baseType: !77, size: 32, align: 32, offset: 1568)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !440, file: !4, line: 134, baseType: !41, size: 32, align: 32, offset: 1600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !440, file: !4, line: 135, baseType: !41, size: 32, align: 32, offset: 1632)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !440, file: !4, line: 136, baseType: !41, size: 32, align: 32, offset: 1664)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !440, file: !4, line: 138, baseType: !41, size: 32, align: 32, offset: 1696)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !440, file: !4, line: 139, baseType: !41, size: 32, align: 32, offset: 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !440, file: !4, line: 141, baseType: !213, size: 32, align: 32, offset: 1760)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !440, file: !4, line: 142, baseType: !213, size: 32, align: 32, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !440, file: !4, line: 143, baseType: !213, size: 32, align: 32, offset: 1824)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !440, file: !4, line: 144, baseType: !213, size: 32, align: 32, offset: 1856)
!476 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !477, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !479, file: !4, line: 151, baseType: !213, size: 32, align: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !479, file: !4, line: 153, baseType: !77, size: 32, align: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !479, file: !4, line: 154, baseType: !213, size: 32, align: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !479, file: !4, line: 155, baseType: !213, size: 32, align: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !479, file: !4, line: 156, baseType: !213, size: 32, align: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !479, file: !4, line: 157, baseType: !213, size: 32, align: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !479, file: !4, line: 158, baseType: !77, size: 32, align: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !479, file: !4, line: 159, baseType: !77, size: 32, align: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !479, file: !4, line: 160, baseType: !77, size: 32, align: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !479, file: !4, line: 162, baseType: !213, size: 32, align: 32, offset: 288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !479, file: !4, line: 163, baseType: !449, size: 256, align: 32, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !479, file: !4, line: 165, baseType: !77, size: 32, align: 32, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !479, file: !4, line: 166, baseType: !77, size: 32, align: 32, offset: 608)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !479, file: !4, line: 167, baseType: !77, size: 32, align: 32, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !479, file: !4, line: 168, baseType: !77, size: 32, align: 32, offset: 672)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !479, file: !4, line: 170, baseType: !77, size: 32, align: 32, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !479, file: !4, line: 172, baseType: !213, size: 32, align: 32, offset: 736)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !479, file: !4, line: 173, baseType: !41, size: 32, align: 32, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !479, file: !4, line: 174, baseType: !41, size: 32, align: 32, offset: 800)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !479, file: !4, line: 175, baseType: !77, size: 32, align: 32, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !479, file: !4, line: 177, baseType: !502, size: 8192, align: 32, offset: 864)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, align: 32, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !479, file: !4, line: 178, baseType: !77, size: 32, align: 32, offset: 9056)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !479, file: !4, line: 179, baseType: !213, size: 32, align: 32, offset: 9088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !479, file: !4, line: 180, baseType: !77, size: 32, align: 32, offset: 9120)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !479, file: !4, line: 181, baseType: !77, size: 32, align: 32, offset: 9152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !479, file: !4, line: 182, baseType: !213, size: 32, align: 32, offset: 9184)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !479, file: !4, line: 184, baseType: !213, size: 32, align: 32, offset: 9216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !479, file: !4, line: 185, baseType: !213, size: 32, align: 32, offset: 9248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !479, file: !4, line: 186, baseType: !213, size: 32, align: 32, offset: 9280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !479, file: !4, line: 187, baseType: !77, size: 32, align: 32, offset: 9312)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !479, file: !4, line: 188, baseType: !77, size: 32, align: 32, offset: 9344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !479, file: !4, line: 189, baseType: !77, size: 32, align: 32, offset: 9376)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !479, file: !4, line: 190, baseType: !77, size: 32, align: 32, offset: 9408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !479, file: !4, line: 191, baseType: !213, size: 32, align: 32, offset: 9440)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !479, file: !4, line: 192, baseType: !519, size: 7584, align: 32, offset: 9472)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !520)
!520 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !520, file: !4, line: 65, baseType: !213, size: 32, align: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !520, file: !4, line: 66, baseType: !77, size: 32, align: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !520, file: !4, line: 67, baseType: !77, size: 32, align: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !520, file: !4, line: 68, baseType: !77, size: 32, align: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !520, file: !4, line: 69, baseType: !213, size: 32, align: 32, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !520, file: !4, line: 70, baseType: !213, size: 32, align: 32, offset: 160)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !520, file: !4, line: 71, baseType: !213, size: 32, align: 32, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !520, file: !4, line: 72, baseType: !77, size: 32, align: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !520, file: !4, line: 73, baseType: !213, size: 32, align: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !520, file: !4, line: 74, baseType: !213, size: 32, align: 32, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !520, file: !4, line: 75, baseType: !77, size: 32, align: 32, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !520, file: !4, line: 76, baseType: !77, size: 32, align: 32, offset: 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !520, file: !4, line: 77, baseType: !77, size: 32, align: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !520, file: !4, line: 78, baseType: !213, size: 32, align: 32, offset: 416)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !520, file: !4, line: 79, baseType: !77, size: 32, align: 32, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !520, file: !4, line: 80, baseType: !77, size: 32, align: 32, offset: 480)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !520, file: !4, line: 81, baseType: !213, size: 32, align: 32, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !520, file: !4, line: 82, baseType: !77, size: 32, align: 32, offset: 544)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !520, file: !4, line: 83, baseType: !77, size: 32, align: 32, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !520, file: !4, line: 84, baseType: !213, size: 32, align: 32, offset: 608)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !520, file: !4, line: 85, baseType: !213, size: 32, align: 32, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !520, file: !4, line: 86, baseType: !544, size: 3296, align: 32, offset: 672)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !546)
!546 = !{!547, !548, !549, !550, !552, !553, !554, !555, !556, !557}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !545, file: !4, line: 50, baseType: !77, size: 32, align: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !545, file: !4, line: 51, baseType: !77, size: 32, align: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !545, file: !4, line: 52, baseType: !77, size: 32, align: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !545, file: !4, line: 53, baseType: !551, size: 1024, align: 32, offset: 96)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1024, align: 32, elements: !376)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !545, file: !4, line: 54, baseType: !551, size: 1024, align: 32, offset: 1120)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !545, file: !4, line: 55, baseType: !551, size: 1024, align: 32, offset: 2144)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !545, file: !4, line: 56, baseType: !77, size: 32, align: 32, offset: 3168)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !545, file: !4, line: 57, baseType: !77, size: 32, align: 32, offset: 3200)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !545, file: !4, line: 58, baseType: !77, size: 32, align: 32, offset: 3232)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !545, file: !4, line: 59, baseType: !77, size: 32, align: 32, offset: 3264)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !520, file: !4, line: 87, baseType: !213, size: 32, align: 32, offset: 3968)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !520, file: !4, line: 88, baseType: !544, size: 3296, align: 32, offset: 4000)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !520, file: !4, line: 90, baseType: !213, size: 32, align: 32, offset: 7296)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !520, file: !4, line: 91, baseType: !213, size: 32, align: 32, offset: 7328)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !520, file: !4, line: 92, baseType: !213, size: 32, align: 32, offset: 7360)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !520, file: !4, line: 93, baseType: !77, size: 32, align: 32, offset: 7392)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !520, file: !4, line: 94, baseType: !77, size: 32, align: 32, offset: 7424)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !520, file: !4, line: 95, baseType: !77, size: 32, align: 32, offset: 7456)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !520, file: !4, line: 96, baseType: !77, size: 32, align: 32, offset: 7488)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !520, file: !4, line: 97, baseType: !77, size: 32, align: 32, offset: 7520)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !520, file: !4, line: 98, baseType: !77, size: 32, align: 32, offset: 7552)
!569 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !41, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!570 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !41, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!571 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !572, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!573 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !572, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!574 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !575, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!576 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !41, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!577 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !41, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!578 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !41, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!579 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !41, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!580 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !326, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!581 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !326, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!582 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !333, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!583 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !333, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!584 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !326, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!585 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !333, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!586 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !326, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!587 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !333, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!588 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !336, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!589 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !337, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!590 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !348, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!591 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !348, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!592 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !41, isLocal: false, isDefinition: true, variable: i32* @intras)
!593 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !41, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!594 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !41, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!595 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !41, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!596 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !41, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!597 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !41, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!598 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !41, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!599 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !41, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!600 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !601, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 2400, align: 8, elements: !603)
!602 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!603 = !{!604}
!604 = !DISubrange(count: 300)
!605 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !606, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, align: 32, elements: !607)
!607 = !{!608, !608}
!608 = !DISubrange(count: 16)
!609 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !606, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!610 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !606, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!611 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !606, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!612 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !606, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!613 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !606, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!614 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !615, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 24576, align: 32, elements: !616)
!616 = !{!142, !608, !608}
!617 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !618, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1024, align: 32, elements: !619)
!619 = !{!147, !160, !160}
!620 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !618, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!621 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !618, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!622 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !618, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!623 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !624, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, align: 32, elements: !625)
!625 = !{!160, !160}
!626 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !627, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, align: 32, elements: !628)
!628 = !{!608}
!629 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !630, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !632, file: !9, line: 1184, baseType: !41, size: 32, align: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !632, file: !9, line: 1185, baseType: !41, size: 32, align: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !632, file: !9, line: 1186, baseType: !41, size: 32, align: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !632, file: !9, line: 1187, baseType: !41, size: 32, align: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !632, file: !9, line: 1188, baseType: !41, size: 32, align: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !632, file: !9, line: 1189, baseType: !41, size: 32, align: 32, offset: 160)
!640 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !641, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !643)
!643 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !655, !656, !657, !658, !659, !660, !661, !664, !665, !666, !667, !669, !670, !671, !672, !673, !674, !675}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !643, file: !9, line: 1147, baseType: !268, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !643, file: !9, line: 1149, baseType: !606, size: 8192, align: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !643, file: !9, line: 1150, baseType: !606, size: 8192, align: 32, offset: 8256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !643, file: !9, line: 1150, baseType: !606, size: 8192, align: 32, offset: 16448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !643, file: !9, line: 1151, baseType: !575, size: 64, align: 64, offset: 24640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !643, file: !9, line: 1152, baseType: !572, size: 64, align: 64, offset: 24704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !643, file: !9, line: 1153, baseType: !41, size: 32, align: 32, offset: 24768)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !643, file: !9, line: 1155, baseType: !41, size: 32, align: 32, offset: 24800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !643, file: !9, line: 1157, baseType: !654, size: 128, align: 32, offset: 24832)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, align: 32, elements: !159)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !643, file: !9, line: 1157, baseType: !654, size: 128, align: 32, offset: 24960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !643, file: !9, line: 1158, baseType: !432, size: 64, align: 64, offset: 25088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !643, file: !9, line: 1159, baseType: !627, size: 512, align: 32, offset: 25152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !643, file: !9, line: 1160, baseType: !41, size: 32, align: 32, offset: 25664)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !643, file: !9, line: 1161, baseType: !301, size: 64, align: 64, offset: 25728)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !643, file: !9, line: 1162, baseType: !41, size: 32, align: 32, offset: 25792)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !643, file: !9, line: 1163, baseType: !662, size: 64, align: 64, offset: 25856)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !643, file: !9, line: 1164, baseType: !662, size: 64, align: 64, offset: 25920)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !643, file: !9, line: 1165, baseType: !662, size: 64, align: 64, offset: 25984)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !643, file: !9, line: 1166, baseType: !662, size: 64, align: 64, offset: 26048)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !643, file: !9, line: 1167, baseType: !668, size: 512, align: 16, offset: 26112)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 512, align: 16, elements: !619)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !643, file: !9, line: 1168, baseType: !41, size: 32, align: 32, offset: 26624)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !643, file: !9, line: 1169, baseType: !41, size: 32, align: 32, offset: 26656)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !643, file: !9, line: 1171, baseType: !41, size: 32, align: 32, offset: 26688)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !643, file: !9, line: 1172, baseType: !41, size: 32, align: 32, offset: 26720)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !643, file: !9, line: 1174, baseType: !41, size: 32, align: 32, offset: 26752)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !643, file: !9, line: 1175, baseType: !41, size: 32, align: 32, offset: 26784)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !643, file: !9, line: 1176, baseType: !41, size: 32, align: 32, offset: 26816)
!676 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !642, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!677 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !642, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!678 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !642, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!679 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !642, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!680 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !681, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !683, line: 153, baseType: !684)
!683 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !683, line: 122, size: 1216, align: 64, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !696, !697, !698, !702, !707, !716, !722, !723, !726, !727, !729, !733, !734, !735}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !684, file: !683, line: 123, baseType: !279, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !684, file: !683, line: 124, baseType: !41, size: 32, align: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !684, file: !683, line: 125, baseType: !41, size: 32, align: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !684, file: !683, line: 126, baseType: !339, size: 16, align: 16, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !684, file: !683, line: 127, baseType: !339, size: 16, align: 16, offset: 144)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !684, file: !683, line: 128, baseType: !692, size: 128, align: 64, offset: 192)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !683, line: 88, size: 128, align: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !692, file: !683, line: 89, baseType: !279, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !692, file: !683, line: 90, baseType: !41, size: 32, align: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !684, file: !683, line: 129, baseType: !41, size: 32, align: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !684, file: !683, line: 132, baseType: !35, size: 64, align: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !684, file: !683, line: 133, baseType: !699, size: 64, align: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!41, !35}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !684, file: !683, line: 134, baseType: !703, size: 64, align: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!41, !35, !706, !41}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !684, file: !683, line: 135, baseType: !708, size: 64, align: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !35, !711, !41}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !683, line: 77, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !713, line: 71, baseType: !714)
!713 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !715, line: 46, baseType: !304)
!715 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !684, file: !683, line: 136, baseType: !717, size: 64, align: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!41, !35, !720, !41}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !684, file: !683, line: 139, baseType: !692, size: 128, align: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !684, file: !683, line: 140, baseType: !724, size: 64, align: 64, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !683, line: 94, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !684, file: !683, line: 141, baseType: !41, size: 32, align: 32, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !684, file: !683, line: 144, baseType: !728, size: 24, align: 8, offset: 928)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, align: 8, elements: !164)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !684, file: !683, line: 145, baseType: !730, size: 8, align: 8, offset: 952)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, align: 8, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 1)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !684, file: !683, line: 148, baseType: !692, size: 128, align: 64, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !684, file: !683, line: 151, baseType: !41, size: 32, align: 32, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !684, file: !683, line: 152, baseType: !711, size: 64, align: 64, offset: 1152)
!736 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !681, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!737 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !681, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!738 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !41, isLocal: false, isDefinition: true, variable: i32* @p_in)
!739 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !41, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!740 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !741, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 640, align: 32, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 20)
!744 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !741, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!745 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !741, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!746 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !741, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!747 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !741, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!748 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !741, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!749 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !41, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!750 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !41, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!751 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !41, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!752 = !DIGlobalVariable(name: "WriteNALU", scope: !0, file: !753, line: 28, type: !754, isLocal: false, isDefinition: true, variable: i32 (%struct.NALU_t*)** @WriteNALU)
!753 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalu.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!41, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALU_t", file: !759, line: 49, baseType: !760)
!759 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/nalucommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!760 = !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 40, size: 256, align: 64, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "startcodeprefix_len", scope: !760, file: !759, line: 42, baseType: !41, size: 32, align: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !760, file: !759, line: 43, baseType: !77, size: 32, align: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !760, file: !759, line: 44, baseType: !77, size: 32, align: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !760, file: !759, line: 45, baseType: !41, size: 32, align: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !760, file: !759, line: 46, baseType: !41, size: 32, align: 32, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_bit", scope: !760, file: !759, line: 47, baseType: !41, size: 32, align: 32, offset: 160)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !760, file: !759, line: 48, baseType: !70, size: 64, align: 64, offset: 192)
!769 = !{}
!770 = !{i32 2, !"Dwarf Version", i32 2}
!771 = !{i32 2, !"Debug Info Version", i32 700000003}
!772 = !{i32 1, !"PIC Level", i32 2}
!773 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!774 = !DILocation(line: 52, column: 22, scope: !218)
!775 = !{!776, !776, i64 0}
!776 = !{!"any pointer", !777, i64 0}
!777 = !{!"omnipotent char", !778, i64 0}
!778 = !{!"Simple C/C++ TBAA"}
!779 = !DILocation(line: 52, column: 27, scope: !218)
!780 = !{!781, !776, i64 14160}
!781 = !{!"", !782, i64 0, !782, i64 4, !782, i64 8, !782, i64 12, !782, i64 16, !782, i64 20, !782, i64 24, !782, i64 28, !782, i64 32, !782, i64 36, !782, i64 40, !782, i64 44, !783, i64 48, !782, i64 52, !782, i64 56, !782, i64 60, !782, i64 64, !782, i64 68, !782, i64 72, !782, i64 76, !782, i64 80, !782, i64 84, !782, i64 88, !782, i64 92, !782, i64 96, !776, i64 104, !776, i64 112, !782, i64 120, !776, i64 128, !782, i64 136, !782, i64 140, !782, i64 144, !782, i64 148, !782, i64 152, !782, i64 156, !782, i64 160, !782, i64 164, !782, i64 168, !782, i64 172, !782, i64 176, !782, i64 180, !777, i64 184, !777, i64 4792, !777, i64 7352, !777, i64 8504, !777, i64 12600, !777, i64 13112, !776, i64 14136, !776, i64 14144, !776, i64 14152, !776, i64 14160, !776, i64 14168, !777, i64 14176, !776, i64 71776, !776, i64 71784, !782, i64 71792, !782, i64 71796, !782, i64 71800, !782, i64 71804, !777, i64 71808, !782, i64 71872, !782, i64 71876, !782, i64 71880, !782, i64 71884, !782, i64 71888, !784, i64 71896, !782, i64 71904, !782, i64 71908, !782, i64 71912, !782, i64 71916, !776, i64 71920, !776, i64 71928, !776, i64 71936, !776, i64 71944, !777, i64 71952, !782, i64 71984, !782, i64 71988, !782, i64 71992, !782, i64 71996, !782, i64 72000, !782, i64 72004, !782, i64 72008, !782, i64 72012, !777, i64 72016, !782, i64 72376, !782, i64 72380, !782, i64 72384, !782, i64 72388, !782, i64 72392, !782, i64 72396, !782, i64 72400, !782, i64 72404, !782, i64 72408, !782, i64 72412, !782, i64 72416, !782, i64 72420, !777, i64 72424, !782, i64 72428, !782, i64 72432, !777, i64 72436, !782, i64 72444, !782, i64 72448, !782, i64 72452, !782, i64 72456, !782, i64 72460, !782, i64 72464, !782, i64 72468, !782, i64 72472, !782, i64 72476, !782, i64 72480, !782, i64 72484, !782, i64 72488, !782, i64 72492, !782, i64 72496, !782, i64 72500, !782, i64 72504, !782, i64 72508, !776, i64 72512, !782, i64 72520, !782, i64 72524, !782, i64 72528, !782, i64 72532, !782, i64 72536, !784, i64 72544, !782, i64 72552, !782, i64 72556, !782, i64 72560, !782, i64 72564, !782, i64 72568, !782, i64 72572, !782, i64 72576, !776, i64 72584, !782, i64 72592, !782, i64 72596, !782, i64 72600, !782, i64 72604, !782, i64 72608, !782, i64 72612, !782, i64 72616, !782, i64 72620, !782, i64 72624, !782, i64 72628, !782, i64 72632, !782, i64 72636, !782, i64 72640, !782, i64 72644, !782, i64 72648, !782, i64 72652, !782, i64 72656, !782, i64 72660, !782, i64 72664, !782, i64 72668, !782, i64 72672, !782, i64 72676, !782, i64 72680, !782, i64 72684, !782, i64 72688, !782, i64 72692, !782, i64 72696, !782, i64 72700, !782, i64 72704, !782, i64 72708, !782, i64 72712, !777, i64 72716, !782, i64 72724, !782, i64 72728, !782, i64 72732}
!782 = !{!"int", !777, i64 0}
!783 = !{!"float", !777, i64 0}
!784 = !{!"double", !777, i64 0}
!785 = !DIExpression()
!786 = !DILocation(line: 52, column: 10, scope: !218)
!787 = !DILocation(line: 54, column: 14, scope: !218)
!788 = !DILocation(line: 54, column: 46, scope: !218)
!789 = !{!790, !782, i64 56}
!790 = !{!"", !782, i64 0, !782, i64 4, !782, i64 8, !782, i64 12, !782, i64 16, !782, i64 20, !776, i64 24, !776, i64 32, !776, i64 40, !776, i64 48, !782, i64 56, !776, i64 64, !776, i64 72, !776, i64 80, !782, i64 88, !776, i64 96, !776, i64 104, !776, i64 112, !776, i64 120, !777, i64 128}
!791 = !DILocation(line: 55, column: 14, scope: !218)
