; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/transform8x8.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_cost", arg: 2, scope: !49, file: !1, line: 217, type: !52)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbp", scope: !49, file: !1, line: 219, type: !45)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b8", scope: !49, file: !1, line: 219, type: !45)
!58 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost8x8", scope: !49, file: !1, line: 219, type: !45)
!59 = !DISubprogram(name: "Mode_Decision_for_new_8x8IntraBlocks", scope: !1, file: !1, line: 242, type: !60, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, double, i32*)* @Mode_Decision_for_new_8x8IntraBlocks, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{!45, !45, !46, !52}
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !81, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !102, !103, !104, !105, !106, !107, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!63 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !59, file: !1, line: 242, type: !45)
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 2, scope: !59, file: !1, line: 242, type: !46)
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_cost", arg: 3, scope: !59, file: !1, line: 242, type: !52)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ipmode", scope: !59, file: !1, line: 244, type: !45)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "best_ipmode", scope: !59, file: !1, line: 244, type: !45)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !59, file: !1, line: 244, type: !45)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !59, file: !1, line: 244, type: !45)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !59, file: !1, line: 244, type: !45)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !59, file: !1, line: 244, type: !45)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !59, file: !1, line: 244, type: !45)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cost", scope: !59, file: !1, line: 244, type: !45)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !59, file: !1, line: 244, type: !45)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_nz", scope: !59, file: !1, line: 245, type: !45)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !59, file: !1, line: 245, type: !45)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !59, file: !1, line: 245, type: !78)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rec8x8", scope: !59, file: !1, line: 246, type: !82)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 1024, align: 16, elements: !84)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !{!85, !85}
!85 = !DISubrange(count: 8)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdcost", scope: !59, file: !1, line: 247, type: !46)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block4x4_x", scope: !59, file: !1, line: 248, type: !45)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block4x4_y", scope: !59, file: !1, line: 248, type: !45)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !59, file: !1, line: 249, type: !45)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !59, file: !1, line: 250, type: !45)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !59, file: !1, line: 251, type: !45)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !59, file: !1, line: 252, type: !45)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_x", scope: !59, file: !1, line: 253, type: !45)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_y", scope: !59, file: !1, line: 254, type: !45)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_x", scope: !59, file: !1, line: 255, type: !45)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_block_y", scope: !59, file: !1, line: 256, type: !45)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_rdcost", scope: !59, file: !1, line: 257, type: !46)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY_orig", scope: !59, file: !1, line: 258, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_available", scope: !59, file: !1, line: 261, type: !45)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up_available", scope: !59, file: !1, line: 261, type: !45)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_available", scope: !59, file: !1, line: 261, type: !45)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upMode", scope: !59, file: !1, line: 263, type: !45)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftMode", scope: !59, file: !1, line: 264, type: !45)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mostProbableMode", scope: !59, file: !1, line: 265, type: !45)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_block", scope: !59, file: !1, line: 267, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !9, line: 305, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !9, line: 297, size: 192, align: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !109, file: !9, line: 299, baseType: !45, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !109, file: !9, line: 300, baseType: !45, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !109, file: !9, line: 301, baseType: !45, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !109, file: !9, line: 302, baseType: !45, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !109, file: !9, line: 303, baseType: !45, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !109, file: !9, line: 304, baseType: !45, size: 32, align: 32, offset: 160)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top_block", scope: !59, file: !1, line: 268, type: !108)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_R", scope: !59, file: !1, line: 271, type: !45)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_G", scope: !59, file: !1, line: 271, type: !45)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "residue_B", scope: !59, file: !1, line: 271, type: !45)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !59, file: !1, line: 272, type: !45)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distortion", scope: !59, file: !1, line: 272, type: !45)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !59, file: !1, line: 272, type: !45)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !59, file: !1, line: 272, type: !45)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_ipmode", scope: !59, file: !1, line: 273, type: !45)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rec8x8_c", scope: !59, file: !1, line: 274, type: !127)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 4096, align: 32, elements: !128)
!128 = !{!129, !130, !130, !130}
!129 = !DISubrange(count: 2)
!130 = !DISubrange(count: 4)
!131 = !DISubprogram(name: "intrapred_luma8x8", scope: !1, file: !1, line: 693, type: !132, isLocal: false, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*, i32*)* @intrapred_luma8x8, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !45, !45, !52, !52, !52}
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !147, !148, !149, !150, !151, !154, !155, !156, !157, !158, !159, !160}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_x", arg: 1, scope: !131, file: !1, line: 693, type: !45)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "img_y", arg: 2, scope: !131, file: !1, line: 693, type: !45)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left_available", arg: 3, scope: !131, file: !1, line: 693, type: !52)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "up_available", arg: 4, scope: !131, file: !1, line: 693, type: !52)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "all_available", arg: 5, scope: !131, file: !1, line: 693, type: !52)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !131, file: !1, line: 695, type: !45)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !131, file: !1, line: 695, type: !45)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !131, file: !1, line: 696, type: !45)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PredPel", scope: !131, file: !1, line: 697, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 800, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 25)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !131, file: !1, line: 698, type: !99)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ioff", scope: !131, file: !1, line: 700, type: !45)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "joff", scope: !131, file: !1, line: 701, type: !45)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mb_nr", scope: !131, file: !1, line: 702, type: !45)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_a", scope: !131, file: !1, line: 704, type: !152)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1536, align: 32, elements: !153)
!153 = !{!85}
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_b", scope: !131, file: !1, line: 705, type: !108)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_c", scope: !131, file: !1, line: 705, type: !108)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pix_d", scope: !131, file: !1, line: 705, type: !108)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_up", scope: !131, file: !1, line: 707, type: !45)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_left", scope: !131, file: !1, line: 708, type: !45)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_up_left", scope: !131, file: !1, line: 709, type: !45)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_available_up_right", scope: !131, file: !1, line: 710, type: !45)
!161 = !DISubprogram(name: "LowPassForIntra8x8Pred", scope: !1, file: !1, line: 1300, type: !162, isLocal: false, isDefinition: true, scopeLine: 1301, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32, i32, i32)* @LowPassForIntra8x8Pred, variables: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !52, !45, !45, !45}
!164 = !{!165, !166, !167, !168, !169, !170}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "PredPel", arg: 1, scope: !161, file: !1, line: 1300, type: !52)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_up_left", arg: 2, scope: !161, file: !1, line: 1300, type: !45)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_up", arg: 3, scope: !161, file: !1, line: 1300, type: !45)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_left", arg: 4, scope: !161, file: !1, line: 1300, type: !45)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !161, file: !1, line: 1302, type: !45)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LoopArray", scope: !161, file: !1, line: 1303, type: !144)
!171 = !DISubprogram(name: "RDCost_for_8x8IntraBlocks", scope: !1, file: !1, line: 1373, type: !172, isLocal: false, isDefinition: true, scopeLine: 1374, flags: DIFlagPrototyped, isOptimized: true, function: double (i32*, i32, i32, double, double, i32)* @RDCost_for_8x8IntraBlocks, variables: !174)
!172 = !DISubroutineType(types: !173)
!173 = !{!46, !52, !45, !45, !46, !46, !45}
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !191, !192, !193, !194, !195, !196, !197, !198, !375, !433, !434, !437, !438}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nonzero", arg: 1, scope: !171, file: !1, line: 1373, type: !52)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 2, scope: !171, file: !1, line: 1373, type: !45)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ipmode", arg: 3, scope: !171, file: !1, line: 1373, type: !45)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 4, scope: !171, file: !1, line: 1373, type: !46)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_rdcost", arg: 5, scope: !171, file: !1, line: 1373, type: !46)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mostProbableMode", arg: 6, scope: !171, file: !1, line: 1373, type: !45)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdcost", scope: !171, file: !1, line: 1375, type: !46)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !171, file: !1, line: 1376, type: !45)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !171, file: !1, line: 1376, type: !45)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !171, file: !1, line: 1376, type: !45)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !171, file: !1, line: 1376, type: !45)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distortion", scope: !171, file: !1, line: 1377, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !9, line: 62, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !189, line: 30, baseType: !190)
!189 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!190 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !171, file: !1, line: 1378, type: !45)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !171, file: !1, line: 1379, type: !45)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_x", scope: !171, file: !1, line: 1380, type: !45)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_pix_y", scope: !171, file: !1, line: 1381, type: !45)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pic_opix_y", scope: !171, file: !1, line: 1382, type: !45)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY_orig", scope: !171, file: !1, line: 1383, type: !99)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imgY", scope: !171, file: !1, line: 1384, type: !99)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSlice", scope: !171, file: !1, line: 1386, type: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !9, line: 471, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 443, size: 1216, align: 64, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !287, !323, !350, !359, !360, !361, !362, !363, !364, !365, !366, !367, !372}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !201, file: !9, line: 445, baseType: !45, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !201, file: !9, line: 446, baseType: !45, size: 32, align: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !201, file: !9, line: 447, baseType: !45, size: 32, align: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !201, file: !9, line: 448, baseType: !45, size: 32, align: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !201, file: !9, line: 449, baseType: !45, size: 32, align: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !201, file: !9, line: 450, baseType: !45, size: 32, align: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !201, file: !9, line: 451, baseType: !210, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !9, line: 440, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !9, line: 430, size: 960, align: 64, elements: !213)
!213 = !{!214, !234, !259}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !212, file: !9, line: 433, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !9, line: 427, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 411, size: 384, align: 64, elements: !218)
!218 = !{!219, !220, !221, !225, !226, !227, !228, !229, !230, !231, !233}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !217, file: !9, line: 413, baseType: !45, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !217, file: !9, line: 414, baseType: !45, size: 32, align: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !217, file: !9, line: 415, baseType: !222, size: 8, align: 8, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !223, line: 30, baseType: !224)
!223 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!224 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !217, file: !9, line: 416, baseType: !45, size: 32, align: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !217, file: !9, line: 417, baseType: !45, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !217, file: !9, line: 418, baseType: !222, size: 8, align: 8, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !217, file: !9, line: 420, baseType: !222, size: 8, align: 8, offset: 168)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !217, file: !9, line: 421, baseType: !45, size: 32, align: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !217, file: !9, line: 422, baseType: !45, size: 32, align: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !217, file: !9, line: 424, baseType: !232, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !217, file: !9, line: 425, baseType: !45, size: 32, align: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !212, file: !9, line: 434, baseType: !235, size: 832, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !9, line: 226, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 207, size: 832, align: 64, elements: !237)
!237 = !{!238, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !236, file: !9, line: 209, baseType: !239, size: 32, align: 32)
!239 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !236, file: !9, line: 209, baseType: !239, size: 32, align: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !236, file: !9, line: 210, baseType: !239, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !236, file: !9, line: 211, baseType: !239, size: 32, align: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !236, file: !9, line: 212, baseType: !239, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !236, file: !9, line: 213, baseType: !232, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !236, file: !9, line: 214, baseType: !52, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !236, file: !9, line: 217, baseType: !239, size: 32, align: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !236, file: !9, line: 217, baseType: !239, size: 32, align: 32, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !236, file: !9, line: 218, baseType: !239, size: 32, align: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !236, file: !9, line: 219, baseType: !239, size: 32, align: 32, offset: 416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !236, file: !9, line: 220, baseType: !239, size: 32, align: 32, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !236, file: !9, line: 221, baseType: !232, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !236, file: !9, line: 222, baseType: !52, size: 64, align: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !236, file: !9, line: 223, baseType: !45, size: 32, align: 32, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !236, file: !9, line: 223, baseType: !45, size: 32, align: 32, offset: 672)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !236, file: !9, line: 224, baseType: !45, size: 32, align: 32, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !236, file: !9, line: 224, baseType: !45, size: 32, align: 32, offset: 736)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !236, file: !9, line: 225, baseType: !45, size: 32, align: 32, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !236, file: !9, line: 225, baseType: !45, size: 32, align: 32, offset: 800)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !212, file: !9, line: 436, baseType: !260, size: 64, align: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!45, !263, !286}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !9, line: 348, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !9, line: 327, size: 384, align: 64, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !279}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !9, line: 329, baseType: !45, size: 32, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !265, file: !9, line: 330, baseType: !45, size: 32, align: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !265, file: !9, line: 331, baseType: !45, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !9, line: 332, baseType: !45, size: 32, align: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !265, file: !9, line: 333, baseType: !45, size: 32, align: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !265, file: !9, line: 334, baseType: !239, size: 32, align: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !265, file: !9, line: 335, baseType: !45, size: 32, align: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !265, file: !9, line: 336, baseType: !45, size: 32, align: 32, offset: 224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !265, file: !9, line: 344, baseType: !276, size: 64, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !45, !45, !52, !52}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !265, file: !9, line: 346, baseType: !280, size: 64, align: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !283, !284}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !9, line: 228, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !201, file: !9, line: 452, baseType: !288, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !9, line: 268, baseType: !290)
!290 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 258, size: 12032, align: 64, elements: !291)
!291 = !{!292, !304, !308, !312, !316, !319, !320}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !290, file: !9, line: 260, baseType: !293, size: 4224, align: 64)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 4224, align: 64, elements: !301)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !9, line: 238, baseType: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 231, size: 128, align: 64, elements: !296)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !295, file: !9, line: 233, baseType: !83, size: 16, align: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !295, file: !9, line: 234, baseType: !224, size: 8, align: 8, offset: 16)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !295, file: !9, line: 236, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!301 = !{!302, !303}
!302 = !DISubrange(count: 3)
!303 = !DISubrange(count: 11)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !290, file: !9, line: 261, baseType: !305, size: 2304, align: 64, offset: 4224)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 2304, align: 64, elements: !306)
!306 = !{!129, !307}
!307 = !DISubrange(count: 9)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !290, file: !9, line: 262, baseType: !309, size: 2560, align: 64, offset: 6528)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 2560, align: 64, elements: !310)
!310 = !{!129, !311}
!311 = !DISubrange(count: 10)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !290, file: !9, line: 263, baseType: !313, size: 1536, align: 64, offset: 9088)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1536, align: 64, elements: !314)
!314 = !{!129, !315}
!315 = !DISubrange(count: 6)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !290, file: !9, line: 264, baseType: !317, size: 512, align: 64, offset: 10624)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 512, align: 64, elements: !318)
!318 = !{!130}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !290, file: !9, line: 265, baseType: !317, size: 512, align: 64, offset: 11136)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !290, file: !9, line: 266, baseType: !321, size: 384, align: 64, offset: 11648)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 384, align: 64, elements: !322)
!322 = !{!302}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !201, file: !9, line: 453, baseType: !324, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !9, line: 293, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 281, size: 97024, align: 64, elements: !327)
!327 = !{!328, !331, !332, !335, !338, !342, !343, !347, !348, !349}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !326, file: !9, line: 283, baseType: !329, size: 256, align: 64)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 256, align: 64, elements: !330)
!330 = !{!129}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !326, file: !9, line: 284, baseType: !317, size: 512, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !326, file: !9, line: 285, baseType: !333, size: 1536, align: 64, offset: 768)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1536, align: 64, elements: !334)
!334 = !{!302, !130}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !326, file: !9, line: 286, baseType: !336, size: 5120, align: 64, offset: 2304)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 5120, align: 64, elements: !337)
!337 = !{!311, !130}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !326, file: !9, line: 287, baseType: !339, size: 19200, align: 64, offset: 7424)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 19200, align: 64, elements: !340)
!340 = !{!311, !341}
!341 = !DISubrange(count: 15)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !326, file: !9, line: 288, baseType: !339, size: 19200, align: 64, offset: 26624)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !326, file: !9, line: 289, baseType: !344, size: 6400, align: 64, offset: 45824)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 6400, align: 64, elements: !345)
!345 = !{!311, !346}
!346 = !DISubrange(count: 5)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !326, file: !9, line: 290, baseType: !344, size: 6400, align: 64, offset: 52224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !326, file: !9, line: 291, baseType: !339, size: 19200, align: 64, offset: 58624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !326, file: !9, line: 292, baseType: !339, size: 19200, align: 64, offset: 77824)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !201, file: !9, line: 456, baseType: !351, size: 64, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !9, line: 313, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !9, line: 308, size: 128, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !353, file: !9, line: 310, baseType: !45, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !353, file: !9, line: 311, baseType: !45, size: 32, align: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !353, file: !9, line: 312, baseType: !358, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !201, file: !9, line: 458, baseType: !45, size: 32, align: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !201, file: !9, line: 459, baseType: !52, size: 64, align: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !201, file: !9, line: 460, baseType: !52, size: 64, align: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !201, file: !9, line: 461, baseType: !52, size: 64, align: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !201, file: !9, line: 462, baseType: !45, size: 32, align: 32, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !201, file: !9, line: 463, baseType: !52, size: 64, align: 64, offset: 768)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !201, file: !9, line: 464, baseType: !52, size: 64, align: 64, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !201, file: !9, line: 465, baseType: !52, size: 64, align: 64, offset: 896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !201, file: !9, line: 467, baseType: !368, size: 64, align: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!371, !45}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !201, file: !9, line: 469, baseType: !373, size: 192, align: 32, offset: 1024)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 192, align: 32, elements: !374)
!374 = !{!302, !129}
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !171, file: !1, line: 1387, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !9, line: 406, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !9, line: 351, size: 5056, align: 64, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !387, !389, !390, !391, !394, !398, !399, !400, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "currSEnr", scope: !378, file: !9, line: 353, baseType: !45, size: 32, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !378, file: !9, line: 354, baseType: !45, size: 32, align: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp", scope: !378, file: !9, line: 355, baseType: !45, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !378, file: !9, line: 356, baseType: !45, size: 32, align: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "qpsp", scope: !378, file: !9, line: 357, baseType: !45, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bitcounter", scope: !378, file: !9, line: 358, baseType: !386, size: 256, align: 32, offset: 160)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 256, align: 32, elements: !153)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_up", scope: !378, file: !9, line: 360, baseType: !388, size: 64, align: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mb_available_left", scope: !378, file: !9, line: 361, baseType: !388, size: 64, align: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !378, file: !9, line: 363, baseType: !45, size: 32, align: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !378, file: !9, line: 364, baseType: !392, size: 2048, align: 32, offset: 608)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, align: 32, elements: !393)
!393 = !{!129, !130, !130, !129}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !378, file: !9, line: 365, baseType: !395, size: 512, align: 32, offset: 2656)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 32, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes8x8", scope: !378, file: !9, line: 366, baseType: !395, size: 512, align: 32, offset: 3168)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !378, file: !9, line: 367, baseType: !45, size: 32, align: 32, offset: 3680)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !378, file: !9, line: 368, baseType: !187, size: 64, align: 64, offset: 3712)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !378, file: !9, line: 369, baseType: !402, size: 128, align: 32, offset: 3776)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, align: 32, elements: !318)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !378, file: !9, line: 370, baseType: !402, size: 128, align: 32, offset: 3904)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !378, file: !9, line: 371, baseType: !300, size: 64, align: 64, offset: 4032)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lf_disable", scope: !378, file: !9, line: 373, baseType: !45, size: 32, align: 32, offset: 4096)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lf_alpha_c0_offset", scope: !378, file: !9, line: 374, baseType: !45, size: 32, align: 32, offset: 4128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lf_beta_offset", scope: !378, file: !9, line: 375, baseType: !45, size: 32, align: 32, offset: 4160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !378, file: !9, line: 377, baseType: !45, size: 32, align: 32, offset: 4192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "IntraChromaPredModeFlag", scope: !378, file: !9, line: 378, baseType: !45, size: 32, align: 32, offset: 4224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !378, file: !9, line: 380, baseType: !45, size: 32, align: 32, offset: 4256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !378, file: !9, line: 382, baseType: !45, size: 32, align: 32, offset: 4288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !378, file: !9, line: 382, baseType: !45, size: 32, align: 32, offset: 4320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !378, file: !9, line: 382, baseType: !45, size: 32, align: 32, offset: 4352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !378, file: !9, line: 382, baseType: !45, size: 32, align: 32, offset: 4384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !378, file: !9, line: 383, baseType: !45, size: 32, align: 32, offset: 4416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !378, file: !9, line: 383, baseType: !45, size: 32, align: 32, offset: 4448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !378, file: !9, line: 383, baseType: !45, size: 32, align: 32, offset: 4480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !378, file: !9, line: 383, baseType: !45, size: 32, align: 32, offset: 4512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "all_blk_8x8", scope: !378, file: !9, line: 385, baseType: !45, size: 32, align: 32, offset: 4544)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !378, file: !9, line: 386, baseType: !45, size: 32, align: 32, offset: 4576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !378, file: !9, line: 387, baseType: !45, size: 32, align: 32, offset: 4608)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !378, file: !9, line: 390, baseType: !45, size: 32, align: 32, offset: 4640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "actj", scope: !378, file: !9, line: 394, baseType: !46, size: 64, align: 64, offset: 4672)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !378, file: !9, line: 395, baseType: !45, size: 32, align: 32, offset: 4736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !378, file: !9, line: 396, baseType: !45, size: 32, align: 32, offset: 4768)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cbp", scope: !378, file: !9, line: 397, baseType: !45, size: 32, align: 32, offset: 4800)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "predict_qp", scope: !378, file: !9, line: 398, baseType: !45, size: 32, align: 32, offset: 4832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "predict_error", scope: !378, file: !9, line: 399, baseType: !45, size: 32, align: 32, offset: 4864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "LFDisableIdc", scope: !378, file: !9, line: 401, baseType: !45, size: 32, align: 32, offset: 4896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "LFAlphaC0Offset", scope: !378, file: !9, line: 402, baseType: !45, size: 32, align: 32, offset: 4928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "LFBetaOffset", scope: !378, file: !9, line: 403, baseType: !45, size: 32, align: 32, offset: 4960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !378, file: !9, line: 405, baseType: !45, size: 32, align: 32, offset: 4992)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currSE", scope: !171, file: !1, line: 1388, type: !263)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partMap", scope: !171, file: !1, line: 1389, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dataPart", scope: !171, file: !1, line: 1390, type: !210)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b4", scope: !439, file: !1, line: 1433, type: !45)
!439 = distinct !DILexicalBlock(scope: !440, file: !1, line: 1432, column: 3)
!440 = distinct !DILexicalBlock(scope: !171, file: !1, line: 1431, column: 7)
!441 = !DISubprogram(name: "dct_luma8x8", scope: !1, file: !1, line: 1470, type: !442, isLocal: false, isDefinition: true, scopeLine: 1471, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32)* @dct_luma8x8, variables: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!45, !45, !52, !45}
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !469, !470, !471, !472, !473, !477, !478, !482, !483, !487, !488, !492}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b8", arg: 1, scope: !441, file: !1, line: 1470, type: !45)
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "coeff_cost", arg: 2, scope: !441, file: !1, line: 1470, type: !52)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intra", arg: 3, scope: !441, file: !1, line: 1470, type: !45)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !441, file: !1, line: 1474, type: !45)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !441, file: !1, line: 1474, type: !45)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilev", scope: !441, file: !1, line: 1474, type: !45)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_ctr", scope: !441, file: !1, line: 1474, type: !45)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_const", scope: !441, file: !1, line: 1475, type: !45)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !441, file: !1, line: 1475, type: !45)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_pos", scope: !441, file: !1, line: 1475, type: !45)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "run", scope: !441, file: !1, line: 1475, type: !45)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !441, file: !1, line: 1476, type: !45)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_per", scope: !441, file: !1, line: 1477, type: !45)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qp_rem", scope: !441, file: !1, line: 1477, type: !45)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_bits", scope: !441, file: !1, line: 1477, type: !45)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dq_lshift", scope: !441, file: !1, line: 1478, type: !45)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dq_rshift", scope: !441, file: !1, line: 1478, type: !45)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dq_round", scope: !441, file: !1, line: 1478, type: !45)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_x", scope: !441, file: !1, line: 1480, type: !45)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block_y", scope: !441, file: !1, line: 1481, type: !45)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACLevel", scope: !441, file: !1, line: 1482, type: !52)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ACRun", scope: !441, file: !1, line: 1483, type: !52)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m6", scope: !441, file: !1, line: 1484, type: !468)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, align: 32, elements: !84)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan_poss", scope: !441, file: !1, line: 1485, type: !402)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "runs", scope: !441, file: !1, line: 1485, type: !402)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currMB", scope: !441, file: !1, line: 1487, type: !376)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lossless_qpprime", scope: !441, file: !1, line: 1488, type: !371)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !474, file: !1, line: 1518, type: !386)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 1517, column: 3)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 1516, column: 3)
!476 = distinct !DILexicalBlock(scope: !441, file: !1, line: 1516, column: 3)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !474, file: !1, line: 1518, type: !386)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !479, file: !1, line: 1552, type: !386)
!479 = distinct !DILexicalBlock(scope: !480, file: !1, line: 1551, column: 3)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 1550, column: 3)
!481 = distinct !DILexicalBlock(scope: !441, file: !1, line: 1550, column: 3)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !479, file: !1, line: 1552, type: !386)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !484, file: !1, line: 1686, type: !386)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 1685, column: 3)
!485 = distinct !DILexicalBlock(scope: !486, file: !1, line: 1684, column: 3)
!486 = distinct !DILexicalBlock(scope: !441, file: !1, line: 1684, column: 3)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !484, file: !1, line: 1686, type: !386)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !489, file: !1, line: 1720, type: !386)
!489 = distinct !DILexicalBlock(scope: !490, file: !1, line: 1719, column: 3)
!490 = distinct !DILexicalBlock(scope: !491, file: !1, line: 1718, column: 3)
!491 = distinct !DILexicalBlock(scope: !441, file: !1, line: 1718, column: 3)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !489, file: !1, line: 1720, type: !386)
!493 = !{!494, !497, !498, !502, !503, !506, !522, !523, !524, !525, !526, !527, !529, !531, !532, !533, !534, !535, !571, !666, !667, !668, !670, !671, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !690, !691, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !707, !710, !711, !712, !713, !714, !715, !718, !721, !722, !723, !724, !727, !728, !739, !775, !776, !777, !778, !779, !837, !838, !839, !840, !841, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!494 = !DIGlobalVariable(name: "quant_coef8", scope: !0, file: !1, line: 40, type: !495, isLocal: false, isDefinition: true, variable: [6 x [8 x [8 x i32]]]* @quant_coef8)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 12288, align: 32, elements: !496)
!496 = !{!315, !85, !85}
!497 = !DIGlobalVariable(name: "dequant_coef8", scope: !0, file: !1, line: 105, type: !495, isLocal: false, isDefinition: true, variable: [6 x [8 x [8 x i32]]]* @dequant_coef8)
!498 = !DIGlobalVariable(name: "SNGL_SCAN8x8", scope: !0, file: !1, line: 172, type: !499, isLocal: false, isDefinition: true, variable: [64 x [2 x i8]]* @SNGL_SCAN8x8)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 1024, align: 8, elements: !501)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!501 = !{!80, !129}
!502 = !DIGlobalVariable(name: "FIELD_SCAN8x8", scope: !0, file: !1, line: 185, type: !499, isLocal: false, isDefinition: true, variable: [64 x [2 x i8]]* @FIELD_SCAN8x8)
!503 = !DIGlobalVariable(name: "COEFF_COST8x8", scope: !0, file: !1, line: 198, type: !504, isLocal: false, isDefinition: true, variable: [2 x [64 x i8]]* @COEFF_COST8x8)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 1024, align: 8, elements: !505)
!505 = !{!129, !80}
!506 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !9, line: 558, type: !507, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !9, line: 484, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 475, size: 6592, align: 64, elements: !510)
!510 = !{!511, !512, !513, !517, !518, !520, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !509, file: !9, line: 477, baseType: !45, size: 32, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !509, file: !9, line: 478, baseType: !45, size: 32, align: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !509, file: !9, line: 479, baseType: !514, size: 6400, align: 64, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 6400, align: 64, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 100)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !509, file: !9, line: 480, baseType: !45, size: 32, align: 32, offset: 6464)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !509, file: !9, line: 481, baseType: !519, size: 32, align: 32, offset: 6496)
!519 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !509, file: !9, line: 482, baseType: !519, size: 32, align: 32, offset: 6528)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !509, file: !9, line: 483, baseType: !519, size: 32, align: 32, offset: 6560)
!522 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !9, line: 559, type: !507, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!523 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !9, line: 560, type: !507, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!524 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !9, line: 561, type: !507, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!525 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !9, line: 562, type: !507, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!526 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !9, line: 565, type: !99, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!527 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !9, line: 566, type: !528, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!529 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !9, line: 567, type: !530, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!531 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !9, line: 569, type: !239, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!532 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !9, line: 570, type: !239, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!533 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !9, line: 572, type: !45, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!534 = !DIGlobalVariable(name: "me_time", scope: !0, file: !9, line: 572, type: !45, isLocal: false, isDefinition: true, variable: i32* @me_time)
!535 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !9, line: 573, type: !536, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !538)
!538 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !538, file: !4, line: 105, baseType: !371, size: 32, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !538, file: !4, line: 106, baseType: !239, size: 32, align: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !538, file: !4, line: 107, baseType: !239, size: 32, align: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !538, file: !4, line: 108, baseType: !371, size: 32, align: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !538, file: !4, line: 110, baseType: !371, size: 32, align: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !538, file: !4, line: 111, baseType: !371, size: 32, align: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !538, file: !4, line: 112, baseType: !386, size: 256, align: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !538, file: !4, line: 115, baseType: !371, size: 32, align: 32, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !538, file: !4, line: 116, baseType: !239, size: 32, align: 32, offset: 480)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !538, file: !4, line: 117, baseType: !239, size: 32, align: 32, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !538, file: !4, line: 119, baseType: !551, size: 256, align: 32, offset: 544)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 256, align: 32, elements: !153)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !538, file: !4, line: 121, baseType: !551, size: 256, align: 32, offset: 800)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !538, file: !4, line: 122, baseType: !551, size: 256, align: 32, offset: 1056)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !538, file: !4, line: 124, baseType: !371, size: 32, align: 32, offset: 1312)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !538, file: !4, line: 125, baseType: !239, size: 32, align: 32, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !538, file: !4, line: 127, baseType: !239, size: 32, align: 32, offset: 1376)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !538, file: !4, line: 128, baseType: !232, size: 64, align: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !538, file: !4, line: 130, baseType: !45, size: 32, align: 32, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !538, file: !4, line: 131, baseType: !45, size: 32, align: 32, offset: 1504)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !538, file: !4, line: 132, baseType: !371, size: 32, align: 32, offset: 1536)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !538, file: !4, line: 133, baseType: !239, size: 32, align: 32, offset: 1568)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !538, file: !4, line: 134, baseType: !45, size: 32, align: 32, offset: 1600)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !538, file: !4, line: 135, baseType: !45, size: 32, align: 32, offset: 1632)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !538, file: !4, line: 136, baseType: !45, size: 32, align: 32, offset: 1664)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !538, file: !4, line: 138, baseType: !45, size: 32, align: 32, offset: 1696)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !538, file: !4, line: 139, baseType: !45, size: 32, align: 32, offset: 1728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !538, file: !4, line: 141, baseType: !371, size: 32, align: 32, offset: 1760)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !538, file: !4, line: 142, baseType: !371, size: 32, align: 32, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !538, file: !4, line: 143, baseType: !371, size: 32, align: 32, offset: 1824)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !538, file: !4, line: 144, baseType: !371, size: 32, align: 32, offset: 1856)
!571 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !9, line: 574, type: !572, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !574)
!574 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !574, file: !4, line: 151, baseType: !371, size: 32, align: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !574, file: !4, line: 153, baseType: !239, size: 32, align: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !574, file: !4, line: 154, baseType: !371, size: 32, align: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !574, file: !4, line: 155, baseType: !371, size: 32, align: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !574, file: !4, line: 156, baseType: !371, size: 32, align: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !574, file: !4, line: 157, baseType: !371, size: 32, align: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !574, file: !4, line: 158, baseType: !239, size: 32, align: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !574, file: !4, line: 159, baseType: !239, size: 32, align: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !574, file: !4, line: 160, baseType: !239, size: 32, align: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !574, file: !4, line: 162, baseType: !371, size: 32, align: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !574, file: !4, line: 163, baseType: !386, size: 256, align: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !574, file: !4, line: 165, baseType: !239, size: 32, align: 32, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !574, file: !4, line: 166, baseType: !239, size: 32, align: 32, offset: 608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !574, file: !4, line: 167, baseType: !239, size: 32, align: 32, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !574, file: !4, line: 168, baseType: !239, size: 32, align: 32, offset: 672)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !574, file: !4, line: 170, baseType: !239, size: 32, align: 32, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !574, file: !4, line: 172, baseType: !371, size: 32, align: 32, offset: 736)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !574, file: !4, line: 173, baseType: !45, size: 32, align: 32, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !574, file: !4, line: 174, baseType: !45, size: 32, align: 32, offset: 800)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !574, file: !4, line: 175, baseType: !239, size: 32, align: 32, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !574, file: !4, line: 177, baseType: !597, size: 8192, align: 32, offset: 864)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8192, align: 32, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !574, file: !4, line: 178, baseType: !239, size: 32, align: 32, offset: 9056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !574, file: !4, line: 179, baseType: !371, size: 32, align: 32, offset: 9088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !574, file: !4, line: 180, baseType: !239, size: 32, align: 32, offset: 9120)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !574, file: !4, line: 181, baseType: !239, size: 32, align: 32, offset: 9152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !574, file: !4, line: 182, baseType: !371, size: 32, align: 32, offset: 9184)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !574, file: !4, line: 184, baseType: !371, size: 32, align: 32, offset: 9216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !574, file: !4, line: 185, baseType: !371, size: 32, align: 32, offset: 9248)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !574, file: !4, line: 186, baseType: !371, size: 32, align: 32, offset: 9280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !574, file: !4, line: 187, baseType: !239, size: 32, align: 32, offset: 9312)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !574, file: !4, line: 188, baseType: !239, size: 32, align: 32, offset: 9344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !574, file: !4, line: 189, baseType: !239, size: 32, align: 32, offset: 9376)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !574, file: !4, line: 190, baseType: !239, size: 32, align: 32, offset: 9408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !574, file: !4, line: 191, baseType: !371, size: 32, align: 32, offset: 9440)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !574, file: !4, line: 192, baseType: !614, size: 7584, align: 32, offset: 9472)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !615)
!615 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !615, file: !4, line: 65, baseType: !371, size: 32, align: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !615, file: !4, line: 66, baseType: !239, size: 32, align: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !615, file: !4, line: 67, baseType: !239, size: 32, align: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !615, file: !4, line: 68, baseType: !239, size: 32, align: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !615, file: !4, line: 69, baseType: !371, size: 32, align: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !615, file: !4, line: 70, baseType: !371, size: 32, align: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !615, file: !4, line: 71, baseType: !371, size: 32, align: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !615, file: !4, line: 72, baseType: !239, size: 32, align: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !615, file: !4, line: 73, baseType: !371, size: 32, align: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !615, file: !4, line: 74, baseType: !371, size: 32, align: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !615, file: !4, line: 75, baseType: !239, size: 32, align: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !615, file: !4, line: 76, baseType: !239, size: 32, align: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !615, file: !4, line: 77, baseType: !239, size: 32, align: 32, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !615, file: !4, line: 78, baseType: !371, size: 32, align: 32, offset: 416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !615, file: !4, line: 79, baseType: !239, size: 32, align: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !615, file: !4, line: 80, baseType: !239, size: 32, align: 32, offset: 480)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !615, file: !4, line: 81, baseType: !371, size: 32, align: 32, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !615, file: !4, line: 82, baseType: !239, size: 32, align: 32, offset: 544)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !615, file: !4, line: 83, baseType: !239, size: 32, align: 32, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !615, file: !4, line: 84, baseType: !371, size: 32, align: 32, offset: 608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !615, file: !4, line: 85, baseType: !371, size: 32, align: 32, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !615, file: !4, line: 86, baseType: !639, size: 3296, align: 32, offset: 672)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !640)
!640 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !641)
!641 = !{!642, !643, !644, !645, !649, !650, !651, !652, !653, !654}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !640, file: !4, line: 50, baseType: !239, size: 32, align: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !640, file: !4, line: 51, baseType: !239, size: 32, align: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !640, file: !4, line: 52, baseType: !239, size: 32, align: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !640, file: !4, line: 53, baseType: !646, size: 1024, align: 32, offset: 96)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1024, align: 32, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !640, file: !4, line: 54, baseType: !646, size: 1024, align: 32, offset: 1120)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !640, file: !4, line: 55, baseType: !646, size: 1024, align: 32, offset: 2144)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !640, file: !4, line: 56, baseType: !239, size: 32, align: 32, offset: 3168)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !640, file: !4, line: 57, baseType: !239, size: 32, align: 32, offset: 3200)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !640, file: !4, line: 58, baseType: !239, size: 32, align: 32, offset: 3232)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !640, file: !4, line: 59, baseType: !239, size: 32, align: 32, offset: 3264)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !615, file: !4, line: 87, baseType: !371, size: 32, align: 32, offset: 3968)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !615, file: !4, line: 88, baseType: !639, size: 3296, align: 32, offset: 4000)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !615, file: !4, line: 90, baseType: !371, size: 32, align: 32, offset: 7296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !615, file: !4, line: 91, baseType: !371, size: 32, align: 32, offset: 7328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !615, file: !4, line: 92, baseType: !371, size: 32, align: 32, offset: 7360)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !615, file: !4, line: 93, baseType: !239, size: 32, align: 32, offset: 7392)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !615, file: !4, line: 94, baseType: !239, size: 32, align: 32, offset: 7424)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !615, file: !4, line: 95, baseType: !239, size: 32, align: 32, offset: 7456)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !615, file: !4, line: 96, baseType: !239, size: 32, align: 32, offset: 7488)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !615, file: !4, line: 97, baseType: !239, size: 32, align: 32, offset: 7520)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !615, file: !4, line: 98, baseType: !239, size: 32, align: 32, offset: 7552)
!666 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !9, line: 578, type: !45, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!667 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !9, line: 579, type: !45, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!668 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !9, line: 583, type: !669, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!670 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !9, line: 584, type: !669, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!671 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !9, line: 585, type: !672, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!673 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !9, line: 586, type: !45, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!674 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !9, line: 587, type: !45, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!675 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !9, line: 588, type: !45, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!676 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !9, line: 589, type: !45, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!677 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !9, line: 592, type: !99, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!678 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !9, line: 593, type: !99, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!679 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !9, line: 595, type: !528, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!680 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !9, line: 596, type: !528, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!681 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !9, line: 598, type: !99, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!682 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !9, line: 599, type: !528, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!683 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !9, line: 601, type: !99, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!684 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !9, line: 602, type: !528, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!685 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !9, line: 604, type: !686, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!690 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !9, line: 605, type: !687, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!691 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !9, line: 608, type: !692, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!693 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !9, line: 609, type: !692, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!694 = !DIGlobalVariable(name: "intras", scope: !0, file: !9, line: 610, type: !45, isLocal: false, isDefinition: true, variable: i32* @intras)
!695 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !9, line: 612, type: !45, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!696 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !9, line: 612, type: !45, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!697 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !9, line: 612, type: !45, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!698 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !9, line: 613, type: !45, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!699 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !9, line: 613, type: !45, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!700 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !9, line: 613, type: !45, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!701 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !9, line: 614, type: !45, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!702 = !DIGlobalVariable(name: "errortext", scope: !0, file: !9, line: 617, type: !703, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 2400, align: 8, elements: !705)
!704 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!705 = !{!706}
!706 = !DISubrange(count: 300)
!707 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !9, line: 620, type: !708, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8192, align: 32, elements: !709)
!709 = !{!397, !397}
!710 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !9, line: 620, type: !708, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!711 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !9, line: 620, type: !708, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!712 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !9, line: 621, type: !708, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!713 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !9, line: 621, type: !708, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!714 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !9, line: 621, type: !708, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!715 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !9, line: 622, type: !716, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 24576, align: 32, elements: !717)
!717 = !{!302, !397, !397}
!718 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !9, line: 623, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 1024, align: 32, elements: !720)
!720 = !{!129, !130, !130}
!721 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !9, line: 623, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!722 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !9, line: 624, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!723 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !9, line: 624, type: !719, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!724 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !9, line: 625, type: !725, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 32, elements: !726)
!726 = !{!130, !130}
!727 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !9, line: 625, type: !395, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!728 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !9, line: 1201, type: !729, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !9, line: 1190, baseType: !731)
!731 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1182, size: 192, align: 32, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !731, file: !9, line: 1184, baseType: !45, size: 32, align: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !731, file: !9, line: 1185, baseType: !45, size: 32, align: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !731, file: !9, line: 1186, baseType: !45, size: 32, align: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !731, file: !9, line: 1187, baseType: !45, size: 32, align: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !731, file: !9, line: 1188, baseType: !45, size: 32, align: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !731, file: !9, line: 1189, baseType: !45, size: 32, align: 32, offset: 160)
!739 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !9, line: 1202, type: !740, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !9, line: 1177, baseType: !742)
!742 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 1145, size: 26880, align: 64, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !763, !764, !765, !766, !768, !769, !770, !771, !772, !773, !774}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !742, file: !9, line: 1147, baseType: !46, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !742, file: !9, line: 1149, baseType: !708, size: 8192, align: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !742, file: !9, line: 1150, baseType: !708, size: 8192, align: 32, offset: 8256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !742, file: !9, line: 1150, baseType: !708, size: 8192, align: 32, offset: 16448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !742, file: !9, line: 1151, baseType: !672, size: 64, align: 64, offset: 24640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !742, file: !9, line: 1152, baseType: !669, size: 64, align: 64, offset: 24704)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !742, file: !9, line: 1153, baseType: !45, size: 32, align: 32, offset: 24768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !742, file: !9, line: 1155, baseType: !45, size: 32, align: 32, offset: 24800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !742, file: !9, line: 1157, baseType: !402, size: 128, align: 32, offset: 24832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !742, file: !9, line: 1157, baseType: !402, size: 128, align: 32, offset: 24960)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !742, file: !9, line: 1158, baseType: !530, size: 64, align: 64, offset: 25088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !742, file: !9, line: 1159, baseType: !395, size: 512, align: 32, offset: 25152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !742, file: !9, line: 1160, baseType: !45, size: 32, align: 32, offset: 25664)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !742, file: !9, line: 1161, baseType: !187, size: 64, align: 64, offset: 25728)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !742, file: !9, line: 1162, baseType: !45, size: 32, align: 32, offset: 25792)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !742, file: !9, line: 1163, baseType: !760, size: 64, align: 64, offset: 25856)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !742, file: !9, line: 1164, baseType: !760, size: 64, align: 64, offset: 25920)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !742, file: !9, line: 1165, baseType: !760, size: 64, align: 64, offset: 25984)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !742, file: !9, line: 1166, baseType: !760, size: 64, align: 64, offset: 26048)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !742, file: !9, line: 1167, baseType: !767, size: 512, align: 16, offset: 26112)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 512, align: 16, elements: !720)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !742, file: !9, line: 1168, baseType: !45, size: 32, align: 32, offset: 26624)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !742, file: !9, line: 1169, baseType: !45, size: 32, align: 32, offset: 26656)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !742, file: !9, line: 1171, baseType: !45, size: 32, align: 32, offset: 26688)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !742, file: !9, line: 1172, baseType: !45, size: 32, align: 32, offset: 26720)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !742, file: !9, line: 1174, baseType: !45, size: 32, align: 32, offset: 26752)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !742, file: !9, line: 1175, baseType: !45, size: 32, align: 32, offset: 26784)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !742, file: !9, line: 1176, baseType: !45, size: 32, align: 32, offset: 26816)
!775 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !9, line: 1203, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!776 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !9, line: 1203, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!777 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !9, line: 1204, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!778 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !9, line: 1204, type: !741, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!779 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !9, line: 1230, type: !780, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !782, line: 153, baseType: !783)
!782 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !782, line: 122, size: 1216, align: 64, elements: !784)
!784 = !{!785, !787, !788, !789, !790, !791, !796, !797, !799, !803, !808, !817, !823, !824, !827, !828, !830, !834, !835, !836}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !783, file: !782, line: 123, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !783, file: !782, line: 124, baseType: !45, size: 32, align: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !783, file: !782, line: 125, baseType: !45, size: 32, align: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !783, file: !782, line: 126, baseType: !689, size: 16, align: 16, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !783, file: !782, line: 127, baseType: !689, size: 16, align: 16, offset: 144)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !783, file: !782, line: 128, baseType: !792, size: 128, align: 64, offset: 192)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !782, line: 88, size: 128, align: 64, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !792, file: !782, line: 89, baseType: !786, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !792, file: !782, line: 90, baseType: !45, size: 32, align: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !783, file: !782, line: 129, baseType: !45, size: 32, align: 32, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !783, file: !782, line: 132, baseType: !798, size: 64, align: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !783, file: !782, line: 133, baseType: !800, size: 64, align: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!45, !798}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !783, file: !782, line: 134, baseType: !804, size: 64, align: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!45, !798, !807, !45}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !783, file: !782, line: 135, baseType: !809, size: 64, align: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !798, !812, !45}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !782, line: 77, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !814, line: 71, baseType: !815)
!814 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !816, line: 46, baseType: !190)
!816 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !783, file: !782, line: 136, baseType: !818, size: 64, align: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!45, !798, !821, !45}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !783, file: !782, line: 139, baseType: !792, size: 128, align: 64, offset: 704)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !783, file: !782, line: 140, baseType: !825, size: 64, align: 64, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !782, line: 94, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !783, file: !782, line: 141, baseType: !45, size: 32, align: 32, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !783, file: !782, line: 144, baseType: !829, size: 24, align: 8, offset: 928)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 24, align: 8, elements: !322)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !783, file: !782, line: 145, baseType: !831, size: 8, align: 8, offset: 952)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 8, align: 8, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 1)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !783, file: !782, line: 148, baseType: !792, size: 128, align: 64, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !783, file: !782, line: 151, baseType: !45, size: 32, align: 32, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !783, file: !782, line: 152, baseType: !812, size: 64, align: 64, offset: 1152)
!837 = !DIGlobalVariable(name: "p_log", scope: !0, file: !9, line: 1231, type: !780, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!838 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !9, line: 1232, type: !780, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!839 = !DIGlobalVariable(name: "p_in", scope: !0, file: !9, line: 1233, type: !45, isLocal: false, isDefinition: true, variable: i32* @p_in)
!840 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !9, line: 1234, type: !45, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!841 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !9, line: 1237, type: !842, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 640, align: 32, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 20)
!845 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !9, line: 1238, type: !842, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!846 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !9, line: 1239, type: !842, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!847 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !9, line: 1240, type: !842, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!848 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !9, line: 1241, type: !842, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!849 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !9, line: 1242, type: !842, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!850 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !9, line: 1456, type: !45, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!851 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !9, line: 1465, type: !45, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!852 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !9, line: 1466, type: !45, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!853 = !DIGlobalVariable(name: "cofAC8x8_chroma", scope: !0, file: !1, line: 33, type: !854, isLocal: false, isDefinition: true, variable: [2 x [4 x [2 x [18 x i32]]]]* @cofAC8x8_chroma)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 9216, align: 32, elements: !855)
!855 = !{!129, !130, !129, !856}
!856 = !DISubrange(count: 18)
!857 = !{}
!858 = !{i32 2, !"Dwarf Version", i32 2}
!859 = !{i32 2, !"Debug Info Version", i32 700000003}
