; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/vlc.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !33, subprograms: !36, globals: !314, imports: !809)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/vlc.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !28}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 119, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!6 = !DIEnumerator(name: "SE_HEADER", value: 0)
!7 = !DIEnumerator(name: "SE_PTYPE", value: 1)
!8 = !DIEnumerator(name: "SE_MBTYPE", value: 2)
!9 = !DIEnumerator(name: "SE_REFFRAME", value: 3)
!10 = !DIEnumerator(name: "SE_INTRAPREDMODE", value: 4)
!11 = !DIEnumerator(name: "SE_MVD", value: 5)
!12 = !DIEnumerator(name: "SE_CBP_INTRA", value: 6)
!13 = !DIEnumerator(name: "SE_LUM_DC_INTRA", value: 7)
!14 = !DIEnumerator(name: "SE_CHR_DC_INTRA", value: 8)
!15 = !DIEnumerator(name: "SE_LUM_AC_INTRA", value: 9)
!16 = !DIEnumerator(name: "SE_CHR_AC_INTRA", value: 10)
!17 = !DIEnumerator(name: "SE_CBP_INTER", value: 11)
!18 = !DIEnumerator(name: "SE_LUM_DC_INTER", value: 12)
!19 = !DIEnumerator(name: "SE_CHR_DC_INTER", value: 13)
!20 = !DIEnumerator(name: "SE_LUM_AC_INTER", value: 14)
!21 = !DIEnumerator(name: "SE_CHR_AC_INTER", value: 15)
!22 = !DIEnumerator(name: "SE_DELTA_QUANT_INTER", value: 16)
!23 = !DIEnumerator(name: "SE_DELTA_QUANT_INTRA", value: 17)
!24 = !DIEnumerator(name: "SE_BFRAME", value: 18)
!25 = !DIEnumerator(name: "SE_EOS", value: 19)
!26 = !DIEnumerator(name: "SE_TRANSFORM_SIZE_FLAG", value: 20)
!27 = !DIEnumerator(name: "SE_MAX_ELEMENTS", value: 21)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 42, size: 32, align: 32, elements: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/parsetcommon.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "FALSE", value: 0)
!32 = !DIEnumerator(name: "TRUE", value: 1)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !{!37, !126, !133, !140, !150, !158, !168, !174, !180, !191, !202, !213, !219, !225, !229, !233, !239, !247, !251, !255, !259, !264, !269, !274, !280, !285, !292, !309}
!37 = !DISubprogram(name: "ue_v", scope: !1, file: !1, line: 58, type: !38, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, %struct.datapartition*)* @ue_v, variables: !120)
!38 = !DISubroutineType(types: !39)
!39 = !{!35, !40, !35, !42}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !4, line: 440, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !4, line: 430, size: 960, align: 64, elements: !45)
!45 = !{!46, !66, !92}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !44, file: !4, line: 433, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !4, line: 427, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 411, size: 384, align: 64, elements: !50)
!50 = !{!51, !52, !53, !57, !58, !59, !60, !61, !62, !63, !65}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !49, file: !4, line: 413, baseType: !35, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !49, file: !4, line: 414, baseType: !35, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !49, file: !4, line: 415, baseType: !54, size: 8, align: 8, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !55, line: 30, baseType: !56)
!55 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !49, file: !4, line: 416, baseType: !35, size: 32, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !49, file: !4, line: 417, baseType: !35, size: 32, align: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !49, file: !4, line: 418, baseType: !54, size: 8, align: 8, offset: 160)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !49, file: !4, line: 420, baseType: !54, size: 8, align: 8, offset: 168)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !49, file: !4, line: 421, baseType: !35, size: 32, align: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !49, file: !4, line: 422, baseType: !35, size: 32, align: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !49, file: !4, line: 424, baseType: !64, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !49, file: !4, line: 425, baseType: !35, size: 32, align: 32, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !44, file: !4, line: 434, baseType: !67, size: 832, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !4, line: 226, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 207, size: 832, align: 64, elements: !69)
!69 = !{!70, !72, !73, !74, !75, !76, !77, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !68, file: !4, line: 209, baseType: !71, size: 32, align: 32)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !68, file: !4, line: 209, baseType: !71, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !68, file: !4, line: 210, baseType: !71, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !68, file: !4, line: 211, baseType: !71, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !68, file: !4, line: 212, baseType: !71, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !68, file: !4, line: 213, baseType: !64, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !68, file: !4, line: 214, baseType: !78, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !68, file: !4, line: 217, baseType: !71, size: 32, align: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !68, file: !4, line: 217, baseType: !71, size: 32, align: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !68, file: !4, line: 218, baseType: !71, size: 32, align: 32, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !68, file: !4, line: 219, baseType: !71, size: 32, align: 32, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !68, file: !4, line: 220, baseType: !71, size: 32, align: 32, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !68, file: !4, line: 221, baseType: !64, size: 64, align: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !68, file: !4, line: 222, baseType: !78, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !68, file: !4, line: 223, baseType: !35, size: 32, align: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !68, file: !4, line: 223, baseType: !35, size: 32, align: 32, offset: 672)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !68, file: !4, line: 224, baseType: !35, size: 32, align: 32, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !68, file: !4, line: 224, baseType: !35, size: 32, align: 32, offset: 736)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !68, file: !4, line: 225, baseType: !35, size: 32, align: 32, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !68, file: !4, line: 225, baseType: !35, size: 32, align: 32, offset: 800)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !44, file: !4, line: 436, baseType: !93, size: 64, align: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!35, !96, !119}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !4, line: 348, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !4, line: 327, size: 384, align: 64, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !112}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !4, line: 329, baseType: !35, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !98, file: !4, line: 330, baseType: !35, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !98, file: !4, line: 331, baseType: !35, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !98, file: !4, line: 332, baseType: !35, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !98, file: !4, line: 333, baseType: !35, size: 32, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !98, file: !4, line: 334, baseType: !71, size: 32, align: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !98, file: !4, line: 335, baseType: !35, size: 32, align: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !98, file: !4, line: 336, baseType: !35, size: 32, align: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !98, file: !4, line: 344, baseType: !109, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !35, !35, !78, !78}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !98, file: !4, line: 346, baseType: !113, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !116, !117}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !4, line: 228, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tracestring", arg: 1, scope: !37, file: !1, line: 58, type: !40)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !37, file: !1, line: 58, type: !35)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "part", arg: 3, scope: !37, file: !1, line: 58, type: !42)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol", scope: !37, file: !1, line: 60, type: !97)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !37, file: !1, line: 60, type: !96)
!126 = !DISubprogram(name: "se_v", scope: !1, file: !1, line: 96, type: !38, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, %struct.datapartition*)* @se_v, variables: !127)
!127 = !{!128, !129, !130, !131, !132}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tracestring", arg: 1, scope: !126, file: !1, line: 96, type: !40)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !126, file: !1, line: 96, type: !35)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "part", arg: 3, scope: !126, file: !1, line: 96, type: !42)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol", scope: !126, file: !1, line: 98, type: !97)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !126, file: !1, line: 98, type: !96)
!133 = !DISubprogram(name: "u_1", scope: !1, file: !1, line: 135, type: !38, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, %struct.datapartition*)* @u_1, variables: !134)
!134 = !{!135, !136, !137, !138, !139}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tracestring", arg: 1, scope: !133, file: !1, line: 135, type: !40)
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !133, file: !1, line: 135, type: !35)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "part", arg: 3, scope: !133, file: !1, line: 135, type: !42)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol", scope: !133, file: !1, line: 137, type: !97)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !133, file: !1, line: 137, type: !96)
!140 = !DISubprogram(name: "u_v", scope: !1, file: !1, line: 178, type: !141, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*, i32, %struct.datapartition*)* @u_v, variables: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{!35, !35, !40, !35, !42}
!143 = !{!144, !145, !146, !147, !148, !149}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !140, file: !1, line: 178, type: !35)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tracestring", arg: 2, scope: !140, file: !1, line: 178, type: !40)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !140, file: !1, line: 178, type: !35)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "part", arg: 4, scope: !140, file: !1, line: 178, type: !42)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "symbol", scope: !140, file: !1, line: 180, type: !97)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !140, file: !1, line: 180, type: !96)
!150 = !DISubprogram(name: "ue_linfo", scope: !1, file: !1, line: 209, type: !110, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @ue_linfo, variables: !151)
!151 = !{!152, !153, !154, !155, !156, !157}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ue", arg: 1, scope: !150, file: !1, line: 209, type: !35)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !150, file: !1, line: 209, type: !35)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !150, file: !1, line: 209, type: !78)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !150, file: !1, line: 209, type: !78)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !150, file: !1, line: 211, type: !35)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !150, file: !1, line: 211, type: !35)
!158 = !DISubprogram(name: "se_linfo", scope: !1, file: !1, line: 238, type: !110, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @se_linfo, variables: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !158, file: !1, line: 238, type: !35)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !158, file: !1, line: 238, type: !35)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !158, file: !1, line: 238, type: !78)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !158, file: !1, line: 238, type: !78)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !158, file: !1, line: 241, type: !35)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !158, file: !1, line: 241, type: !35)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !158, file: !1, line: 241, type: !35)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !158, file: !1, line: 241, type: !35)
!168 = !DISubprogram(name: "cbp_linfo_intra", scope: !1, file: !1, line: 273, type: !110, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @cbp_linfo_intra, variables: !169)
!169 = !{!170, !171, !172, !173}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp", arg: 1, scope: !168, file: !1, line: 273, type: !35)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !168, file: !1, line: 273, type: !35)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !168, file: !1, line: 273, type: !78)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !168, file: !1, line: 273, type: !78)
!174 = !DISubprogram(name: "cbp_linfo_inter", scope: !1, file: !1, line: 288, type: !110, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @cbp_linfo_inter, variables: !175)
!175 = !{!176, !177, !178, !179}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cbp", arg: 1, scope: !174, file: !1, line: 288, type: !35)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !174, file: !1, line: 288, type: !35)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !174, file: !1, line: 288, type: !78)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !174, file: !1, line: 288, type: !78)
!180 = !DISubprogram(name: "levrun_linfo_c2x2", scope: !1, file: !1, line: 307, type: !110, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @levrun_linfo_c2x2, variables: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190}
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 1, scope: !180, file: !1, line: 307, type: !35)
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "run", arg: 2, scope: !180, file: !1, line: 307, type: !35)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !180, file: !1, line: 307, type: !78)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !180, file: !1, line: 307, type: !78)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levabs", scope: !180, file: !1, line: 319, type: !35)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !180, file: !1, line: 319, type: !35)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !180, file: !1, line: 319, type: !35)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !180, file: !1, line: 319, type: !35)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !180, file: !1, line: 319, type: !35)
!191 = !DISubprogram(name: "levrun_linfo_inter", scope: !1, file: !1, line: 364, type: !110, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @levrun_linfo_inter, variables: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 1, scope: !191, file: !1, line: 364, type: !35)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "run", arg: 2, scope: !191, file: !1, line: 364, type: !35)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !191, file: !1, line: 364, type: !78)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !191, file: !1, line: 364, type: !78)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levabs", scope: !191, file: !1, line: 378, type: !35)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !191, file: !1, line: 378, type: !35)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !191, file: !1, line: 378, type: !35)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !191, file: !1, line: 378, type: !35)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !191, file: !1, line: 378, type: !35)
!202 = !DISubprogram(name: "levrun_linfo_intra", scope: !1, file: !1, line: 425, type: !110, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*, i32*)* @levrun_linfo_intra, variables: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 1, scope: !202, file: !1, line: 425, type: !35)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "run", arg: 2, scope: !202, file: !1, line: 425, type: !35)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !202, file: !1, line: 425, type: !78)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 4, scope: !202, file: !1, line: 425, type: !78)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levabs", scope: !202, file: !1, line: 445, type: !35)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !202, file: !1, line: 445, type: !35)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !202, file: !1, line: 445, type: !35)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !202, file: !1, line: 445, type: !35)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !202, file: !1, line: 445, type: !35)
!213 = !DISubprogram(name: "symbol2uvlc", scope: !1, file: !1, line: 490, type: !214, isLocal: false, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*)* @symbol2uvlc, variables: !216)
!214 = !DISubroutineType(types: !215)
!215 = !{!35, !96}
!216 = !{!217, !218}
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sym", arg: 1, scope: !213, file: !1, line: 490, type: !96)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "suffix_len", scope: !213, file: !1, line: 492, type: !35)
!219 = !DISubprogram(name: "writeSyntaxElement_UVLC", scope: !1, file: !1, line: 504, type: !220, isLocal: false, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_UVLC, variables: !222)
!220 = !DISubroutineType(types: !221)
!221 = !{!35, !96, !42}
!222 = !{!223, !224}
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !219, file: !1, line: 504, type: !96)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !219, file: !1, line: 504, type: !42)
!225 = !DISubprogram(name: "writeSyntaxElement_fixed", scope: !1, file: !1, line: 529, type: !220, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_fixed, variables: !226)
!226 = !{!227, !228}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !225, file: !1, line: 529, type: !96)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !225, file: !1, line: 529, type: !42)
!229 = !DISubprogram(name: "writeSyntaxElement_Intra4x4PredictionMode", scope: !1, file: !1, line: 551, type: !220, isLocal: false, isDefinition: true, scopeLine: 552, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_Intra4x4PredictionMode, variables: !230)
!230 = !{!231, !232}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !229, file: !1, line: 551, type: !96)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !229, file: !1, line: 551, type: !42)
!233 = !DISubprogram(name: "writeSyntaxElement2Buf_UVLC", scope: !1, file: !1, line: 588, type: !234, isLocal: false, isDefinition: true, scopeLine: 589, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.Bitstream*)* @writeSyntaxElement2Buf_UVLC, variables: !236)
!234 = !DISubroutineType(types: !235)
!235 = !{!35, !96, !47}
!236 = !{!237, !238}
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !233, file: !1, line: 588, type: !96)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_streamBuffer", arg: 2, scope: !233, file: !1, line: 588, type: !47)
!239 = !DISubprogram(name: "writeUVLC2buffer", scope: !1, file: !1, line: 612, type: !240, isLocal: false, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.syntaxelement*, %struct.Bitstream*)* @writeUVLC2buffer, variables: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !96, !47}
!242 = !{!243, !244, !245, !246}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !239, file: !1, line: 612, type: !96)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currStream", arg: 2, scope: !239, file: !1, line: 612, type: !47)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !239, file: !1, line: 615, type: !35)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !239, file: !1, line: 616, type: !71)
!247 = !DISubprogram(name: "writeSyntaxElement2Buf_Fixed", scope: !1, file: !1, line: 645, type: !234, isLocal: false, isDefinition: true, scopeLine: 646, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.Bitstream*)* @writeSyntaxElement2Buf_Fixed, variables: !248)
!248 = !{!249, !250}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !247, file: !1, line: 645, type: !96)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_streamBuffer", arg: 2, scope: !247, file: !1, line: 645, type: !47)
!251 = !DISubprogram(name: "symbol2vlc", scope: !1, file: !1, line: 670, type: !214, isLocal: false, isDefinition: true, scopeLine: 671, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*)* @symbol2vlc, variables: !252)
!252 = !{!253, !254}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sym", arg: 1, scope: !251, file: !1, line: 670, type: !96)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info_len", scope: !251, file: !1, line: 672, type: !35)
!255 = !DISubprogram(name: "writeSyntaxElement_VLC", scope: !1, file: !1, line: 693, type: !220, isLocal: false, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_VLC, variables: !256)
!256 = !{!257, !258}
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !255, file: !1, line: 693, type: !96)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !255, file: !1, line: 693, type: !42)
!259 = !DISubprogram(name: "writeSyntaxElement_NumCoeffTrailingOnes", scope: !1, file: !1, line: 717, type: !220, isLocal: false, isDefinition: true, scopeLine: 718, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_NumCoeffTrailingOnes, variables: !260)
!260 = !{!261, !262, !263}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !259, file: !1, line: 717, type: !96)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !259, file: !1, line: 717, type: !42)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vlcnum", scope: !259, file: !1, line: 763, type: !35)
!264 = !DISubprogram(name: "writeSyntaxElement_NumCoeffTrailingOnesChromaDC", scope: !1, file: !1, line: 814, type: !220, isLocal: false, isDefinition: true, scopeLine: 815, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_NumCoeffTrailingOnesChromaDC, variables: !265)
!265 = !{!266, !267, !268}
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !264, file: !1, line: 814, type: !96)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !264, file: !1, line: 814, type: !42)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yuv", scope: !264, file: !1, line: 854, type: !35)
!269 = !DISubprogram(name: "writeSyntaxElement_TotalZeros", scope: !1, file: !1, line: 886, type: !220, isLocal: false, isDefinition: true, scopeLine: 887, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_TotalZeros, variables: !270)
!270 = !{!271, !272, !273}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !269, file: !1, line: 886, type: !96)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !269, file: !1, line: 886, type: !42)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vlcnum", scope: !269, file: !1, line: 925, type: !35)
!274 = !DISubprogram(name: "writeSyntaxElement_TotalZerosChromaDC", scope: !1, file: !1, line: 957, type: !220, isLocal: false, isDefinition: true, scopeLine: 958, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_TotalZerosChromaDC, variables: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !274, file: !1, line: 957, type: !96)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !274, file: !1, line: 957, type: !42)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vlcnum", scope: !274, file: !1, line: 1022, type: !35)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yuv", scope: !274, file: !1, line: 1023, type: !35)
!280 = !DISubprogram(name: "writeSyntaxElement_Run", scope: !1, file: !1, line: 1055, type: !220, isLocal: false, isDefinition: true, scopeLine: 1056, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_Run, variables: !281)
!281 = !{!282, !283, !284}
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !280, file: !1, line: 1055, type: !96)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !280, file: !1, line: 1055, type: !42)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vlcnum", scope: !280, file: !1, line: 1078, type: !35)
!285 = !DISubprogram(name: "writeSyntaxElement_Level_VLC1", scope: !1, file: !1, line: 1110, type: !220, isLocal: false, isDefinition: true, scopeLine: 1111, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, %struct.datapartition*)* @writeSyntaxElement_Level_VLC1, variables: !286)
!286 = !{!287, !288, !289, !290, !291}
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !285, file: !1, line: 1110, type: !96)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 2, scope: !285, file: !1, line: 1110, type: !42)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !285, file: !1, line: 1112, type: !35)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levabs", scope: !285, file: !1, line: 1112, type: !35)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !285, file: !1, line: 1112, type: !35)
!292 = !DISubprogram(name: "writeSyntaxElement_Level_VLCN", scope: !1, file: !1, line: 1156, type: !293, isLocal: false, isDefinition: true, scopeLine: 1157, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.syntaxelement*, i32, %struct.datapartition*)* @writeSyntaxElement_Level_VLCN, variables: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!35, !96, !35, !42}
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 1, scope: !292, file: !1, line: 1156, type: !96)
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vlc", arg: 2, scope: !292, file: !1, line: 1156, type: !35)
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "this_dataPart", arg: 3, scope: !292, file: !1, line: 1156, type: !42)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iCodeword", scope: !292, file: !1, line: 1158, type: !35)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iLength", scope: !292, file: !1, line: 1159, type: !35)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !292, file: !1, line: 1161, type: !35)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levabs", scope: !292, file: !1, line: 1163, type: !35)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !292, file: !1, line: 1164, type: !35)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !292, file: !1, line: 1166, type: !35)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "escape", scope: !292, file: !1, line: 1167, type: !35)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numPrefix", scope: !292, file: !1, line: 1169, type: !35)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sufmask", scope: !292, file: !1, line: 1171, type: !35)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "suffix", scope: !292, file: !1, line: 1172, type: !35)
!309 = !DISubprogram(name: "writeVlcByteAlign", scope: !1, file: !1, line: 1256, type: !310, isLocal: false, isDefinition: true, scopeLine: 1257, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.Bitstream*)* @writeVlcByteAlign, variables: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !47}
!312 = !{!313}
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currStream", arg: 1, scope: !309, file: !1, line: 1256, type: !47)
!314 = !{!315, !320, !324, !329, !333, !337, !342, !347, !348, !349, !350, !354, !355, !358, !359, !360, !361, !471, !472, !473, !474, !475, !478, !480, !482, !483, !484, !485, !486, !523, !618, !619, !620, !622, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !642, !643, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !658, !661, !662, !663, !664, !665, !666, !669, !672, !673, !674, !675, !678, !680, !691, !733, !734, !735, !736, !737, !793, !794, !795, !796, !797, !801, !802, !803, !804, !805, !806, !807, !808}
!315 = !DIGlobalVariable(name: "NTAB", scope: !180, file: !1, line: 309, type: !316, isLocal: true, isDefinition: true, variable: [2 x [2 x i32]]* @levrun_linfo_c2x2.NTAB)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 128, align: 32, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!318 = !{!319, !319}
!319 = !DISubrange(count: 2)
!320 = !DIGlobalVariable(name: "LEVRUN", scope: !180, file: !1, line: 314, type: !321, isLocal: true, isDefinition: true, variable: [4 x i32]* @levrun_linfo_c2x2.LEVRUN)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 128, align: 32, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 4)
!324 = !DIGlobalVariable(name: "LEVRUN", scope: !191, file: !1, line: 366, type: !325, isLocal: true, isDefinition: true, variable: [16 x i8]* @levrun_linfo_inter.LEVRUN)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 128, align: 8, elements: !327)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!327 = !{!328}
!328 = !DISubrange(count: 16)
!329 = !DIGlobalVariable(name: "NTAB", scope: !191, file: !1, line: 370, type: !330, isLocal: true, isDefinition: true, variable: [4 x [10 x i8]]* @levrun_linfo_inter.NTAB)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 320, align: 8, elements: !331)
!331 = !{!323, !332}
!332 = !DISubrange(count: 10)
!333 = !DIGlobalVariable(name: "LEVRUN", scope: !202, file: !1, line: 427, type: !334, isLocal: true, isDefinition: true, variable: [8 x i8]* @levrun_linfo_intra.LEVRUN)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 64, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 8)
!337 = !DIGlobalVariable(name: "NTAB", scope: !202, file: !1, line: 432, type: !338, isLocal: true, isDefinition: true, variable: [9 x [5 x i8]]* @levrun_linfo_intra.NTAB)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 360, align: 8, elements: !339)
!339 = !{!340, !341}
!340 = !DISubrange(count: 9)
!341 = !DISubrange(count: 5)
!342 = !DIGlobalVariable(name: "lentab", scope: !259, file: !1, line: 719, type: !343, isLocal: true, isDefinition: true, variable: [3 x [4 x [17 x i32]]]* @writeSyntaxElement_NumCoeffTrailingOnes.lentab)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 6528, align: 32, elements: !344)
!344 = !{!345, !323, !346}
!345 = !DISubrange(count: 3)
!346 = !DISubrange(count: 17)
!347 = !DIGlobalVariable(name: "codtab", scope: !259, file: !1, line: 742, type: !343, isLocal: true, isDefinition: true, variable: [3 x [4 x [17 x i32]]]* @writeSyntaxElement_NumCoeffTrailingOnes.codtab)
!348 = !DIGlobalVariable(name: "lentab", scope: !264, file: !1, line: 816, type: !343, isLocal: true, isDefinition: true, variable: [3 x [4 x [17 x i32]]]* @writeSyntaxElement_NumCoeffTrailingOnesChromaDC.lentab)
!349 = !DIGlobalVariable(name: "codtab", scope: !264, file: !1, line: 835, type: !343, isLocal: true, isDefinition: true, variable: [3 x [4 x [17 x i32]]]* @writeSyntaxElement_NumCoeffTrailingOnesChromaDC.codtab)
!350 = !DIGlobalVariable(name: "lentab", scope: !269, file: !1, line: 888, type: !351, isLocal: true, isDefinition: true, variable: [15 x [16 x i32]]* @writeSyntaxElement_TotalZeros.lentab)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 7680, align: 32, elements: !352)
!352 = !{!353, !328}
!353 = !DISubrange(count: 15)
!354 = !DIGlobalVariable(name: "codtab", scope: !269, file: !1, line: 907, type: !351, isLocal: true, isDefinition: true, variable: [15 x [16 x i32]]* @writeSyntaxElement_TotalZeros.codtab)
!355 = !DIGlobalVariable(name: "lentab", scope: !274, file: !1, line: 959, type: !356, isLocal: true, isDefinition: true, variable: [3 x [15 x [16 x i32]]]* @writeSyntaxElement_TotalZerosChromaDC.lentab)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 23040, align: 32, elements: !357)
!357 = !{!345, !353, !328}
!358 = !DIGlobalVariable(name: "codtab", scope: !274, file: !1, line: 991, type: !356, isLocal: true, isDefinition: true, variable: [3 x [15 x [16 x i32]]]* @writeSyntaxElement_TotalZerosChromaDC.codtab)
!359 = !DIGlobalVariable(name: "lentab", scope: !280, file: !1, line: 1057, type: !351, isLocal: true, isDefinition: true, variable: [15 x [16 x i32]]* @writeSyntaxElement_Run.lentab)
!360 = !DIGlobalVariable(name: "codtab", scope: !280, file: !1, line: 1068, type: !351, isLocal: true, isDefinition: true, variable: [15 x [16 x i32]]* @writeSyntaxElement_Run.codtab)
!361 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !4, line: 558, type: !362, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !4, line: 484, baseType: !364)
!364 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 475, size: 6592, align: 64, elements: !365)
!365 = !{!366, !367, !368, !466, !467, !469, !470}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !364, file: !4, line: 477, baseType: !35, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !364, file: !4, line: 478, baseType: !35, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !364, file: !4, line: 479, baseType: !369, size: 6400, align: 64, offset: 64)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 6400, align: 64, elements: !464)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !4, line: 471, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 443, size: 1216, align: 64, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !414, !439, !448, !449, !450, !451, !452, !453, !454, !455, !456, !461}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !372, file: !4, line: 445, baseType: !35, size: 32, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !372, file: !4, line: 446, baseType: !35, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !372, file: !4, line: 447, baseType: !35, size: 32, align: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !372, file: !4, line: 448, baseType: !35, size: 32, align: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !372, file: !4, line: 449, baseType: !35, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !372, file: !4, line: 450, baseType: !35, size: 32, align: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !372, file: !4, line: 451, baseType: !42, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !372, file: !4, line: 452, baseType: !382, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !4, line: 268, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 258, size: 12032, align: 64, elements: !385)
!385 = !{!386, !398, !401, !404, !408, !410, !411}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !384, file: !4, line: 260, baseType: !387, size: 4224, align: 64)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 4224, align: 64, elements: !396)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !4, line: 238, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 231, size: 128, align: 64, elements: !390)
!390 = !{!391, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !389, file: !4, line: 233, baseType: !392, size: 16, align: 16)
!392 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !389, file: !4, line: 234, baseType: !56, size: 8, align: 8, offset: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !389, file: !4, line: 236, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!396 = !{!345, !397}
!397 = !DISubrange(count: 11)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !384, file: !4, line: 261, baseType: !399, size: 2304, align: 64, offset: 4224)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 2304, align: 64, elements: !400)
!400 = !{!319, !340}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !384, file: !4, line: 262, baseType: !402, size: 2560, align: 64, offset: 6528)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 2560, align: 64, elements: !403)
!403 = !{!319, !332}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !384, file: !4, line: 263, baseType: !405, size: 1536, align: 64, offset: 9088)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 1536, align: 64, elements: !406)
!406 = !{!319, !407}
!407 = !DISubrange(count: 6)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !384, file: !4, line: 264, baseType: !409, size: 512, align: 64, offset: 10624)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 512, align: 64, elements: !322)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !384, file: !4, line: 265, baseType: !409, size: 512, align: 64, offset: 11136)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !384, file: !4, line: 266, baseType: !412, size: 384, align: 64, offset: 11648)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 384, align: 64, elements: !413)
!413 = !{!345}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !372, file: !4, line: 453, baseType: !415, size: 64, align: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !4, line: 293, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 281, size: 97024, align: 64, elements: !418)
!418 = !{!419, !422, !423, !426, !429, !432, !433, !436, !437, !438}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !417, file: !4, line: 283, baseType: !420, size: 256, align: 64)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 256, align: 64, elements: !421)
!421 = !{!319}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !417, file: !4, line: 284, baseType: !409, size: 512, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !417, file: !4, line: 285, baseType: !424, size: 1536, align: 64, offset: 768)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 1536, align: 64, elements: !425)
!425 = !{!345, !323}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !417, file: !4, line: 286, baseType: !427, size: 5120, align: 64, offset: 2304)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 5120, align: 64, elements: !428)
!428 = !{!332, !323}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !417, file: !4, line: 287, baseType: !430, size: 19200, align: 64, offset: 7424)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 19200, align: 64, elements: !431)
!431 = !{!332, !353}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !417, file: !4, line: 288, baseType: !430, size: 19200, align: 64, offset: 26624)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !417, file: !4, line: 289, baseType: !434, size: 6400, align: 64, offset: 45824)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 6400, align: 64, elements: !435)
!435 = !{!332, !341}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !417, file: !4, line: 290, baseType: !434, size: 6400, align: 64, offset: 52224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !417, file: !4, line: 291, baseType: !430, size: 19200, align: 64, offset: 58624)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !417, file: !4, line: 292, baseType: !430, size: 19200, align: 64, offset: 77824)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !372, file: !4, line: 456, baseType: !440, size: 64, align: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !4, line: 313, baseType: !442)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !4, line: 308, size: 128, align: 64, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !442, file: !4, line: 310, baseType: !35, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !442, file: !4, line: 311, baseType: !35, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !442, file: !4, line: 312, baseType: !447, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !372, file: !4, line: 458, baseType: !35, size: 32, align: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !372, file: !4, line: 459, baseType: !78, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !372, file: !4, line: 460, baseType: !78, size: 64, align: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !372, file: !4, line: 461, baseType: !78, size: 64, align: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !372, file: !4, line: 462, baseType: !35, size: 32, align: 32, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !372, file: !4, line: 463, baseType: !78, size: 64, align: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !372, file: !4, line: 464, baseType: !78, size: 64, align: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !372, file: !4, line: 465, baseType: !78, size: 64, align: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !372, file: !4, line: 467, baseType: !457, size: 64, align: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !35}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !29, line: 45, baseType: !28)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !372, file: !4, line: 469, baseType: !462, size: 192, align: 32, offset: 1024)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, align: 32, elements: !463)
!463 = !{!345, !319}
!464 = !{!465}
!465 = !DISubrange(count: 100)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !364, file: !4, line: 480, baseType: !35, size: 32, align: 32, offset: 6464)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !364, file: !4, line: 481, baseType: !468, size: 32, align: 32, offset: 6496)
!468 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !364, file: !4, line: 482, baseType: !468, size: 32, align: 32, offset: 6528)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !364, file: !4, line: 483, baseType: !468, size: 32, align: 32, offset: 6560)
!471 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !4, line: 559, type: !362, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!472 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !4, line: 560, type: !362, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!473 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !4, line: 561, type: !362, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!474 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !4, line: 562, type: !362, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!475 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !4, line: 565, type: !476, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!478 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !4, line: 566, type: !479, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!480 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !4, line: 567, type: !481, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!482 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !4, line: 569, type: !71, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!483 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !4, line: 570, type: !71, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!484 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !4, line: 572, type: !35, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!485 = !DIGlobalVariable(name: "me_time", scope: !0, file: !4, line: 572, type: !35, isLocal: false, isDefinition: true, variable: i32* @me_time)
!486 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !4, line: 573, type: !487, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !29, line: 145, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 103, size: 1920, align: 64, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !489, file: !29, line: 105, baseType: !460, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !489, file: !29, line: 106, baseType: !71, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !489, file: !29, line: 107, baseType: !71, size: 32, align: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !489, file: !29, line: 108, baseType: !460, size: 32, align: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !489, file: !29, line: 110, baseType: !460, size: 32, align: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !489, file: !29, line: 111, baseType: !460, size: 32, align: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !489, file: !29, line: 112, baseType: !498, size: 256, align: 32, offset: 192)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256, align: 32, elements: !335)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !489, file: !29, line: 115, baseType: !460, size: 32, align: 32, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !489, file: !29, line: 116, baseType: !71, size: 32, align: 32, offset: 480)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !489, file: !29, line: 117, baseType: !71, size: 32, align: 32, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !489, file: !29, line: 119, baseType: !503, size: 256, align: 32, offset: 544)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 256, align: 32, elements: !335)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !489, file: !29, line: 121, baseType: !503, size: 256, align: 32, offset: 800)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !489, file: !29, line: 122, baseType: !503, size: 256, align: 32, offset: 1056)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !489, file: !29, line: 124, baseType: !460, size: 32, align: 32, offset: 1312)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !489, file: !29, line: 125, baseType: !71, size: 32, align: 32, offset: 1344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !489, file: !29, line: 127, baseType: !71, size: 32, align: 32, offset: 1376)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !489, file: !29, line: 128, baseType: !64, size: 64, align: 64, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !489, file: !29, line: 130, baseType: !35, size: 32, align: 32, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !489, file: !29, line: 131, baseType: !35, size: 32, align: 32, offset: 1504)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !489, file: !29, line: 132, baseType: !460, size: 32, align: 32, offset: 1536)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !489, file: !29, line: 133, baseType: !71, size: 32, align: 32, offset: 1568)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !489, file: !29, line: 134, baseType: !35, size: 32, align: 32, offset: 1600)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !489, file: !29, line: 135, baseType: !35, size: 32, align: 32, offset: 1632)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !489, file: !29, line: 136, baseType: !35, size: 32, align: 32, offset: 1664)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !489, file: !29, line: 138, baseType: !35, size: 32, align: 32, offset: 1696)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !489, file: !29, line: 139, baseType: !35, size: 32, align: 32, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !489, file: !29, line: 141, baseType: !460, size: 32, align: 32, offset: 1760)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !489, file: !29, line: 142, baseType: !460, size: 32, align: 32, offset: 1792)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !489, file: !29, line: 143, baseType: !460, size: 32, align: 32, offset: 1824)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !489, file: !29, line: 144, baseType: !460, size: 32, align: 32, offset: 1856)
!523 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !4, line: 574, type: !524, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !29, line: 193, baseType: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 149, size: 17056, align: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !526, file: !29, line: 151, baseType: !460, size: 32, align: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !526, file: !29, line: 153, baseType: !71, size: 32, align: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !526, file: !29, line: 154, baseType: !460, size: 32, align: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !526, file: !29, line: 155, baseType: !460, size: 32, align: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !526, file: !29, line: 156, baseType: !460, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !526, file: !29, line: 157, baseType: !460, size: 32, align: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !526, file: !29, line: 158, baseType: !71, size: 32, align: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !526, file: !29, line: 159, baseType: !71, size: 32, align: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !526, file: !29, line: 160, baseType: !71, size: 32, align: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !526, file: !29, line: 162, baseType: !460, size: 32, align: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !526, file: !29, line: 163, baseType: !498, size: 256, align: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !526, file: !29, line: 165, baseType: !71, size: 32, align: 32, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !526, file: !29, line: 166, baseType: !71, size: 32, align: 32, offset: 608)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !526, file: !29, line: 167, baseType: !71, size: 32, align: 32, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !526, file: !29, line: 168, baseType: !71, size: 32, align: 32, offset: 672)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !526, file: !29, line: 170, baseType: !71, size: 32, align: 32, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !526, file: !29, line: 172, baseType: !460, size: 32, align: 32, offset: 736)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !526, file: !29, line: 173, baseType: !35, size: 32, align: 32, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !526, file: !29, line: 174, baseType: !35, size: 32, align: 32, offset: 800)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !526, file: !29, line: 175, baseType: !71, size: 32, align: 32, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !526, file: !29, line: 177, baseType: !549, size: 8192, align: 32, offset: 864)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, align: 32, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !526, file: !29, line: 178, baseType: !71, size: 32, align: 32, offset: 9056)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !526, file: !29, line: 179, baseType: !460, size: 32, align: 32, offset: 9088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !526, file: !29, line: 180, baseType: !71, size: 32, align: 32, offset: 9120)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !526, file: !29, line: 181, baseType: !71, size: 32, align: 32, offset: 9152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !526, file: !29, line: 182, baseType: !460, size: 32, align: 32, offset: 9184)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !526, file: !29, line: 184, baseType: !460, size: 32, align: 32, offset: 9216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !526, file: !29, line: 185, baseType: !460, size: 32, align: 32, offset: 9248)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !526, file: !29, line: 186, baseType: !460, size: 32, align: 32, offset: 9280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !526, file: !29, line: 187, baseType: !71, size: 32, align: 32, offset: 9312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !526, file: !29, line: 188, baseType: !71, size: 32, align: 32, offset: 9344)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !526, file: !29, line: 189, baseType: !71, size: 32, align: 32, offset: 9376)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !526, file: !29, line: 190, baseType: !71, size: 32, align: 32, offset: 9408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !526, file: !29, line: 191, baseType: !460, size: 32, align: 32, offset: 9440)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !526, file: !29, line: 192, baseType: !566, size: 7584, align: 32, offset: 9472)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !29, line: 99, baseType: !567)
!567 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 63, size: 7584, align: 32, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !567, file: !29, line: 65, baseType: !460, size: 32, align: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !567, file: !29, line: 66, baseType: !71, size: 32, align: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !567, file: !29, line: 67, baseType: !71, size: 32, align: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !567, file: !29, line: 68, baseType: !71, size: 32, align: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !567, file: !29, line: 69, baseType: !460, size: 32, align: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !567, file: !29, line: 70, baseType: !460, size: 32, align: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !567, file: !29, line: 71, baseType: !460, size: 32, align: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !567, file: !29, line: 72, baseType: !71, size: 32, align: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !567, file: !29, line: 73, baseType: !460, size: 32, align: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !567, file: !29, line: 74, baseType: !460, size: 32, align: 32, offset: 288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !567, file: !29, line: 75, baseType: !71, size: 32, align: 32, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !567, file: !29, line: 76, baseType: !71, size: 32, align: 32, offset: 352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !567, file: !29, line: 77, baseType: !71, size: 32, align: 32, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !567, file: !29, line: 78, baseType: !460, size: 32, align: 32, offset: 416)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !567, file: !29, line: 79, baseType: !71, size: 32, align: 32, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !567, file: !29, line: 80, baseType: !71, size: 32, align: 32, offset: 480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !567, file: !29, line: 81, baseType: !460, size: 32, align: 32, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !567, file: !29, line: 82, baseType: !71, size: 32, align: 32, offset: 544)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !567, file: !29, line: 83, baseType: !71, size: 32, align: 32, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !567, file: !29, line: 84, baseType: !460, size: 32, align: 32, offset: 608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !567, file: !29, line: 85, baseType: !460, size: 32, align: 32, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !567, file: !29, line: 86, baseType: !591, size: 3296, align: 32, offset: 672)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !29, line: 60, baseType: !592)
!592 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 48, size: 3296, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !601, !602, !603, !604, !605, !606}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !592, file: !29, line: 50, baseType: !71, size: 32, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !592, file: !29, line: 51, baseType: !71, size: 32, align: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !592, file: !29, line: 52, baseType: !71, size: 32, align: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !592, file: !29, line: 53, baseType: !598, size: 1024, align: 32, offset: 96)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1024, align: 32, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !592, file: !29, line: 54, baseType: !598, size: 1024, align: 32, offset: 1120)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !592, file: !29, line: 55, baseType: !598, size: 1024, align: 32, offset: 2144)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !592, file: !29, line: 56, baseType: !71, size: 32, align: 32, offset: 3168)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !592, file: !29, line: 57, baseType: !71, size: 32, align: 32, offset: 3200)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !592, file: !29, line: 58, baseType: !71, size: 32, align: 32, offset: 3232)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !592, file: !29, line: 59, baseType: !71, size: 32, align: 32, offset: 3264)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !567, file: !29, line: 87, baseType: !460, size: 32, align: 32, offset: 3968)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !567, file: !29, line: 88, baseType: !591, size: 3296, align: 32, offset: 4000)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !567, file: !29, line: 90, baseType: !460, size: 32, align: 32, offset: 7296)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !567, file: !29, line: 91, baseType: !460, size: 32, align: 32, offset: 7328)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !567, file: !29, line: 92, baseType: !460, size: 32, align: 32, offset: 7360)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !567, file: !29, line: 93, baseType: !71, size: 32, align: 32, offset: 7392)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !567, file: !29, line: 94, baseType: !71, size: 32, align: 32, offset: 7424)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !567, file: !29, line: 95, baseType: !71, size: 32, align: 32, offset: 7456)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !567, file: !29, line: 96, baseType: !71, size: 32, align: 32, offset: 7488)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !567, file: !29, line: 97, baseType: !71, size: 32, align: 32, offset: 7520)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !567, file: !29, line: 98, baseType: !71, size: 32, align: 32, offset: 7552)
!618 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !4, line: 578, type: !35, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!619 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !4, line: 579, type: !35, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!620 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !4, line: 583, type: !621, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!622 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !4, line: 584, type: !621, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!623 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !4, line: 585, type: !624, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!625 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !4, line: 586, type: !35, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!626 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !4, line: 587, type: !35, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!627 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !4, line: 588, type: !35, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!628 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !4, line: 589, type: !35, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!629 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !4, line: 592, type: !476, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!630 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !4, line: 593, type: !476, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!631 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !4, line: 595, type: !479, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!632 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !4, line: 596, type: !479, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!633 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !4, line: 598, type: !476, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!634 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !4, line: 599, type: !479, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!635 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !4, line: 601, type: !476, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!636 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !4, line: 602, type: !479, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!637 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !4, line: 604, type: !638, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!642 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !4, line: 605, type: !639, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!643 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !4, line: 608, type: !644, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!645 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !4, line: 609, type: !644, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!646 = !DIGlobalVariable(name: "intras", scope: !0, file: !4, line: 610, type: !35, isLocal: false, isDefinition: true, variable: i32* @intras)
!647 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !4, line: 612, type: !35, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!648 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !4, line: 612, type: !35, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!649 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !4, line: 612, type: !35, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!650 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !4, line: 613, type: !35, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!651 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !4, line: 613, type: !35, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!652 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !4, line: 613, type: !35, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!653 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !4, line: 614, type: !35, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!654 = !DIGlobalVariable(name: "errortext", scope: !0, file: !4, line: 617, type: !655, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2400, align: 8, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 300)
!658 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !4, line: 620, type: !659, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, align: 32, elements: !660)
!660 = !{!328, !328}
!661 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !4, line: 620, type: !659, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!662 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !4, line: 620, type: !659, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!663 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !4, line: 621, type: !659, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!664 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !4, line: 621, type: !659, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!665 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !4, line: 621, type: !659, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!666 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !4, line: 622, type: !667, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 24576, align: 32, elements: !668)
!668 = !{!345, !328, !328}
!669 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !4, line: 623, type: !670, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, align: 32, elements: !671)
!671 = !{!319, !323, !323}
!672 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !4, line: 623, type: !670, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!673 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !4, line: 624, type: !670, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!674 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !4, line: 624, type: !670, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!675 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !4, line: 625, type: !676, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, align: 32, elements: !677)
!677 = !{!323, !323}
!678 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !4, line: 625, type: !679, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, align: 32, elements: !327)
!680 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !4, line: 1201, type: !681, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !4, line: 1190, baseType: !683)
!683 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1182, size: 192, align: 32, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !683, file: !4, line: 1184, baseType: !35, size: 32, align: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !683, file: !4, line: 1185, baseType: !35, size: 32, align: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !683, file: !4, line: 1186, baseType: !35, size: 32, align: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !683, file: !4, line: 1187, baseType: !35, size: 32, align: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !683, file: !4, line: 1188, baseType: !35, size: 32, align: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !683, file: !4, line: 1189, baseType: !35, size: 32, align: 32, offset: 160)
!691 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !4, line: 1202, type: !692, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !4, line: 1177, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1145, size: 26880, align: 64, elements: !695)
!695 = !{!696, !698, !699, !700, !701, !702, !703, !704, !705, !707, !708, !709, !710, !711, !716, !717, !721, !722, !723, !724, !726, !727, !728, !729, !730, !731, !732}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !694, file: !4, line: 1147, baseType: !697, size: 64, align: 64)
!697 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !694, file: !4, line: 1149, baseType: !659, size: 8192, align: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !694, file: !4, line: 1150, baseType: !659, size: 8192, align: 32, offset: 8256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !694, file: !4, line: 1150, baseType: !659, size: 8192, align: 32, offset: 16448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !694, file: !4, line: 1151, baseType: !624, size: 64, align: 64, offset: 24640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !694, file: !4, line: 1152, baseType: !621, size: 64, align: 64, offset: 24704)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !694, file: !4, line: 1153, baseType: !35, size: 32, align: 32, offset: 24768)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !694, file: !4, line: 1155, baseType: !35, size: 32, align: 32, offset: 24800)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !694, file: !4, line: 1157, baseType: !706, size: 128, align: 32, offset: 24832)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, align: 32, elements: !322)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !694, file: !4, line: 1157, baseType: !706, size: 128, align: 32, offset: 24960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !694, file: !4, line: 1158, baseType: !481, size: 64, align: 64, offset: 25088)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !694, file: !4, line: 1159, baseType: !679, size: 512, align: 32, offset: 25152)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !694, file: !4, line: 1160, baseType: !35, size: 32, align: 32, offset: 25664)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !694, file: !4, line: 1161, baseType: !712, size: 64, align: 64, offset: 25728)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !4, line: 62, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !714, line: 30, baseType: !715)
!714 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!715 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !694, file: !4, line: 1162, baseType: !35, size: 32, align: 32, offset: 25792)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !694, file: !4, line: 1163, baseType: !718, size: 64, align: 64, offset: 25856)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !694, file: !4, line: 1164, baseType: !718, size: 64, align: 64, offset: 25920)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !694, file: !4, line: 1165, baseType: !718, size: 64, align: 64, offset: 25984)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !694, file: !4, line: 1166, baseType: !718, size: 64, align: 64, offset: 26048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !694, file: !4, line: 1167, baseType: !725, size: 512, align: 16, offset: 26112)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 512, align: 16, elements: !671)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !694, file: !4, line: 1168, baseType: !35, size: 32, align: 32, offset: 26624)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !694, file: !4, line: 1169, baseType: !35, size: 32, align: 32, offset: 26656)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !694, file: !4, line: 1171, baseType: !35, size: 32, align: 32, offset: 26688)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !694, file: !4, line: 1172, baseType: !35, size: 32, align: 32, offset: 26720)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !694, file: !4, line: 1174, baseType: !35, size: 32, align: 32, offset: 26752)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !694, file: !4, line: 1175, baseType: !35, size: 32, align: 32, offset: 26784)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !694, file: !4, line: 1176, baseType: !35, size: 32, align: 32, offset: 26816)
!733 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !4, line: 1203, type: !693, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!734 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !4, line: 1203, type: !693, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!735 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !4, line: 1204, type: !693, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!736 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !4, line: 1204, type: !693, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!737 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !4, line: 1230, type: !738, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !740, line: 153, baseType: !741)
!740 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !740, line: 122, size: 1216, align: 64, elements: !742)
!742 = !{!743, !745, !746, !747, !748, !749, !754, !755, !756, !760, !764, !773, !779, !780, !783, !784, !786, !790, !791, !792}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !741, file: !740, line: 123, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !741, file: !740, line: 124, baseType: !35, size: 32, align: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !741, file: !740, line: 125, baseType: !35, size: 32, align: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !741, file: !740, line: 126, baseType: !641, size: 16, align: 16, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !741, file: !740, line: 127, baseType: !641, size: 16, align: 16, offset: 144)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !741, file: !740, line: 128, baseType: !750, size: 128, align: 64, offset: 192)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !740, line: 88, size: 128, align: 64, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !750, file: !740, line: 89, baseType: !744, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !750, file: !740, line: 90, baseType: !35, size: 32, align: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !741, file: !740, line: 129, baseType: !35, size: 32, align: 32, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !741, file: !740, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !741, file: !740, line: 133, baseType: !757, size: 64, align: 64, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!35, !34}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !741, file: !740, line: 134, baseType: !761, size: 64, align: 64, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!35, !34, !40, !35}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !741, file: !740, line: 135, baseType: !765, size: 64, align: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !34, !768, !35}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !740, line: 77, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !770, line: 71, baseType: !771)
!770 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !772, line: 46, baseType: !715)
!772 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !741, file: !740, line: 136, baseType: !774, size: 64, align: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!35, !34, !777, !35}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !741, file: !740, line: 139, baseType: !750, size: 128, align: 64, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !741, file: !740, line: 140, baseType: !781, size: 64, align: 64, offset: 832)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !740, line: 94, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !741, file: !740, line: 141, baseType: !35, size: 32, align: 32, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !741, file: !740, line: 144, baseType: !785, size: 24, align: 8, offset: 928)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 24, align: 8, elements: !413)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !741, file: !740, line: 145, baseType: !787, size: 8, align: 8, offset: 952)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 1)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !741, file: !740, line: 148, baseType: !750, size: 128, align: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !741, file: !740, line: 151, baseType: !35, size: 32, align: 32, offset: 1088)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !741, file: !740, line: 152, baseType: !768, size: 64, align: 64, offset: 1152)
!793 = !DIGlobalVariable(name: "p_log", scope: !0, file: !4, line: 1231, type: !738, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!794 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !4, line: 1232, type: !738, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!795 = !DIGlobalVariable(name: "p_in", scope: !0, file: !4, line: 1233, type: !35, isLocal: false, isDefinition: true, variable: i32* @p_in)
!796 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !4, line: 1234, type: !35, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!797 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !4, line: 1237, type: !798, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 640, align: 32, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 20)
!801 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !4, line: 1238, type: !798, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!802 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !4, line: 1239, type: !798, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!803 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !4, line: 1240, type: !798, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!804 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !4, line: 1241, type: !798, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
