; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/weighted_prediction.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.ImageParameters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32**, i32**, i32, i32***, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [9 x [16 x [16 x i16]]], [5 x [16 x [16 x i16]]], [9 x [8 x [8 x i16]]], [2 x [4 x [16 x [16 x i16]]]], [16 x [16 x i16]], [16 x [16 x i32]], i32****, i32***, %struct.Picture*, %struct.Slice*, %struct.macroblock*, [1200 x %struct.syntaxelement], i32*, i32*, i32, i32, i32, i32, [4 x [4 x i32]], i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i16******, i16******, i16******, i16******, [15 x i16], i32, i32, i32, i32, i32, i32, i32, i32, [6 x [15 x i32]], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, [2 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.DecRefPicMarking_s*, i32, i32, i32, i32, i32, double, i32, i32, i32, i32, i32, i32, i32, double*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32 }
%struct.Picture = type { i32, i32, [100 x %struct.Slice*], i32, float, float, float }

!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic_w", scope: !83, file: !1, line: 424, type: !28)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_weight", scope: !83, file: !1, line: 425, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_weight_chroma", scope: !83, file: !1, line: 426, type: !10)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !83, file: !1, line: 427, type: !10)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !83, file: !1, line: 428, type: !37)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !83, file: !1, line: 429, type: !37)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clist", scope: !83, file: !1, line: 430, type: !10)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perform_wp", scope: !83, file: !1, line: 431, type: !10)
!104 = !DISubprogram(name: "test_wp_B_slice", scope: !1, file: !1, line: 531, type: !84, isLocal: false, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @test_wp_B_slice, variables: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !137}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "select_method", arg: 1, scope: !104, file: !1, line: 531, type: !10)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !104, file: !1, line: 533, type: !10)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !104, file: !1, line: 533, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !104, file: !1, line: 533, type: !10)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tx", scope: !104, file: !1, line: 535, type: !10)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DistScaleFactor", scope: !104, file: !1, line: 535, type: !10)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dc_org", scope: !104, file: !1, line: 536, type: !9)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !104, file: !1, line: 537, type: !10)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comp", scope: !104, file: !1, line: 538, type: !10)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dc_ref", scope: !104, file: !1, line: 539, type: !56)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "log_weight_denom", scope: !104, file: !1, line: 541, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic", scope: !104, file: !1, line: 543, type: !28)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref_pic_w", scope: !104, file: !1, line: 544, type: !28)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_weight", scope: !104, file: !1, line: 545, type: !10)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_weight_chroma", scope: !104, file: !1, line: 546, type: !10)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list_offset", scope: !104, file: !1, line: 547, type: !10)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weight", scope: !104, file: !1, line: 548, type: !65)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !104, file: !1, line: 549, type: !65)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im_weight", scope: !104, file: !1, line: 550, type: !69)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im_offset", scope: !104, file: !1, line: 551, type: !69)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clist", scope: !104, file: !1, line: 552, type: !10)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf_weight", scope: !104, file: !1, line: 553, type: !10)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf_offset", scope: !104, file: !1, line: 553, type: !10)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perform_wp", scope: !104, file: !1, line: 554, type: !10)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "td", scope: !131, file: !1, line: 582, type: !10)
!131 = distinct !DILexicalBlock(scope: !132, file: !1, line: 581, column: 5)
!132 = distinct !DILexicalBlock(scope: !133, file: !1, line: 580, column: 5)
!133 = distinct !DILexicalBlock(scope: !134, file: !1, line: 580, column: 5)
!134 = distinct !DILexicalBlock(scope: !135, file: !1, line: 579, column: 3)
!135 = distinct !DILexicalBlock(scope: !136, file: !1, line: 578, column: 3)
!136 = distinct !DILexicalBlock(scope: !104, file: !1, line: 578, column: 3)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !131, file: !1, line: 582, type: !10)
!138 = !{!139, !330, !331, !332, !333, !334, !336, !338, !340, !341, !342, !343, !344, !383, !478, !479, !480, !482, !483, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !502, !503, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !519, !523, !524, !525, !526, !527, !528, !531, !534, !535, !536, !537, !540, !543, !554, !595, !596, !597, !598, !599, !657, !658, !659, !660, !661, !665, !666, !667, !668, !669, !670, !671, !672}
!139 = !DIGlobalVariable(name: "top_pic", scope: !0, file: !140, line: 558, type: !141, isLocal: false, isDefinition: true, variable: %struct.Picture** @top_pic)
!140 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/global.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !140, line: 484, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 475, size: 6592, align: 64, elements: !144)
!144 = !{!145, !146, !147, !325, !326, !328, !329}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "no_slices", scope: !143, file: !140, line: 477, baseType: !10, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !143, file: !140, line: 478, baseType: !10, size: 32, align: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !143, file: !140, line: 479, baseType: !148, size: 6400, align: 64, offset: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 6400, align: 64, elements: !323)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !140, line: 471, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 443, size: 1216, align: 64, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !238, !272, !298, !307, !308, !309, !310, !311, !312, !313, !314, !315, !320}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "picture_id", scope: !151, file: !140, line: 445, baseType: !10, size: 32, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !151, file: !140, line: 446, baseType: !10, size: 32, align: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "picture_type", scope: !151, file: !140, line: 447, baseType: !10, size: 32, align: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !151, file: !140, line: 448, baseType: !10, size: 32, align: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !151, file: !140, line: 449, baseType: !10, size: 32, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "num_mb", scope: !151, file: !140, line: 450, baseType: !10, size: 32, align: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !151, file: !140, line: 451, baseType: !160, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !140, line: 440, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !140, line: 430, size: 960, align: 64, elements: !163)
!163 = !{!164, !184, !210}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !162, file: !140, line: 433, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !140, line: 427, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 411, size: 384, align: 64, elements: !168)
!168 = !{!169, !170, !171, !175, !176, !177, !178, !179, !180, !181, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos", scope: !167, file: !140, line: 413, baseType: !10, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go", scope: !167, file: !140, line: 414, baseType: !10, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf", scope: !167, file: !140, line: 415, baseType: !172, size: 8, align: 8, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !173, line: 30, baseType: !174)
!173 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/464.h264ref/src/defines.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!174 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_pos", scope: !167, file: !140, line: 416, baseType: !10, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "stored_bits_to_go", scope: !167, file: !140, line: 417, baseType: !10, size: 32, align: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "stored_byte_buf", scope: !167, file: !140, line: 418, baseType: !172, size: 8, align: 8, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buf_skip", scope: !167, file: !140, line: 420, baseType: !172, size: 8, align: 8, offset: 168)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "byte_pos_skip", scope: !167, file: !140, line: 421, baseType: !10, size: 32, align: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bits_to_go_skip", scope: !167, file: !140, line: 422, baseType: !10, size: 32, align: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !167, file: !140, line: 424, baseType: !182, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !167, file: !140, line: 425, baseType: !10, size: 32, align: 32, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ee_cabac", scope: !162, file: !140, line: 434, baseType: !185, size: 832, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironment", file: !140, line: 226, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 207, size: 832, align: 64, elements: !187)
!187 = !{!188, !190, !191, !192, !193, !194, !195, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Elow", scope: !186, file: !140, line: 209, baseType: !189, size: 32, align: 32)
!189 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Erange", scope: !186, file: !140, line: 209, baseType: !189, size: 32, align: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Ebuffer", scope: !186, file: !140, line: 210, baseType: !189, size: 32, align: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_go", scope: !186, file: !140, line: 211, baseType: !189, size: 32, align: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_follow", scope: !186, file: !140, line: 212, baseType: !189, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm", scope: !186, file: !140, line: 213, baseType: !182, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_len", scope: !186, file: !140, line: 214, baseType: !196, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ElowS", scope: !186, file: !140, line: 217, baseType: !189, size: 32, align: 32, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ErangeS", scope: !186, file: !140, line: 217, baseType: !189, size: 32, align: 32, offset: 352)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "EbufferS", scope: !186, file: !140, line: 218, baseType: !189, size: 32, align: 32, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_goS", scope: !186, file: !140, line: 219, baseType: !189, size: 32, align: 32, offset: 416)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Ebits_to_followS", scope: !186, file: !140, line: 220, baseType: !189, size: 32, align: 32, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "EcodestrmS", scope: !186, file: !140, line: 221, baseType: !182, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Ecodestrm_lenS", scope: !186, file: !140, line: 222, baseType: !196, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !186, file: !140, line: 223, baseType: !10, size: 32, align: 32, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "CS", scope: !186, file: !140, line: 223, baseType: !10, size: 32, align: 32, offset: 672)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !186, file: !140, line: 224, baseType: !10, size: 32, align: 32, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ES", scope: !186, file: !140, line: 224, baseType: !10, size: 32, align: 32, offset: 736)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !186, file: !140, line: 225, baseType: !10, size: 32, align: 32, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "BS", scope: !186, file: !140, line: 225, baseType: !10, size: 32, align: 32, offset: 800)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "writeSyntaxElement", scope: !162, file: !140, line: 436, baseType: !211, size: 64, align: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!10, !214, !237}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !140, line: 348, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !140, line: 327, size: 384, align: 64, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !230}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !140, line: 329, baseType: !10, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !216, file: !140, line: 330, baseType: !10, size: 32, align: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !216, file: !140, line: 331, baseType: !10, size: 32, align: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !216, file: !140, line: 332, baseType: !10, size: 32, align: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !216, file: !140, line: 333, baseType: !10, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !216, file: !140, line: 334, baseType: !189, size: 32, align: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !216, file: !140, line: 335, baseType: !10, size: 32, align: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !216, file: !140, line: 336, baseType: !10, size: 32, align: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !216, file: !140, line: 344, baseType: !227, size: 64, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !10, !10, !196, !196}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !216, file: !140, line: 346, baseType: !231, size: 64, align: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234, !235}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodingEnvironmentPtr", file: !140, line: 228, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !151, file: !140, line: 452, baseType: !239, size: 64, align: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !140, line: 268, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 258, size: 12032, align: 64, elements: !242)
!242 = !{!243, !254, !258, !262, !265, !269, !270}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !241, file: !140, line: 260, baseType: !244, size: 4224, align: 64)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 4224, align: 64, elements: !252)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !140, line: 238, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 231, size: 128, align: 64, elements: !247)
!247 = !{!248, !249, !250}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !246, file: !140, line: 233, baseType: !29, size: 16, align: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !246, file: !140, line: 234, baseType: !174, size: 8, align: 8, offset: 16)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !246, file: !140, line: 236, baseType: !251, size: 64, align: 64, offset: 64)
!251 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!252 = !{!34, !253}
!253 = !DISubrange(count: 11)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !241, file: !140, line: 261, baseType: !255, size: 2304, align: 64, offset: 4224)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 2304, align: 64, elements: !256)
!256 = !{!39, !257}
!257 = !DISubrange(count: 9)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !241, file: !140, line: 262, baseType: !259, size: 2560, align: 64, offset: 6528)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 2560, align: 64, elements: !260)
!260 = !{!39, !261}
!261 = !DISubrange(count: 10)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !241, file: !140, line: 263, baseType: !263, size: 1536, align: 64, offset: 9088)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 1536, align: 64, elements: !264)
!264 = !{!39, !58}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !241, file: !140, line: 264, baseType: !266, size: 512, align: 64, offset: 10624)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 512, align: 64, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !241, file: !140, line: 265, baseType: !266, size: 512, align: 64, offset: 11136)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !241, file: !140, line: 266, baseType: !271, size: 384, align: 64, offset: 11648)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 384, align: 64, elements: !33)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !151, file: !140, line: 453, baseType: !273, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !140, line: 293, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 281, size: 97024, align: 64, elements: !276)
!276 = !{!277, !280, !281, !284, !287, !290, !291, !295, !296, !297}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !275, file: !140, line: 283, baseType: !278, size: 256, align: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 256, align: 64, elements: !279)
!279 = !{!39}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !275, file: !140, line: 284, baseType: !266, size: 512, align: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !275, file: !140, line: 285, baseType: !282, size: 1536, align: 64, offset: 768)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 1536, align: 64, elements: !283)
!283 = !{!34, !268}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !275, file: !140, line: 286, baseType: !285, size: 5120, align: 64, offset: 2304)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 5120, align: 64, elements: !286)
!286 = !{!261, !268}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !275, file: !140, line: 287, baseType: !288, size: 19200, align: 64, offset: 7424)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 19200, align: 64, elements: !289)
!289 = !{!261, !26}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !275, file: !140, line: 288, baseType: !288, size: 19200, align: 64, offset: 26624)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !275, file: !140, line: 289, baseType: !292, size: 6400, align: 64, offset: 45824)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 6400, align: 64, elements: !293)
!293 = !{!261, !294}
!294 = !DISubrange(count: 5)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !275, file: !140, line: 290, baseType: !292, size: 6400, align: 64, offset: 52224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "fld_map_contexts", scope: !275, file: !140, line: 291, baseType: !288, size: 19200, align: 64, offset: 58624)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fld_last_contexts", scope: !275, file: !140, line: 292, baseType: !288, size: 19200, align: 64, offset: 77824)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rmpni_buffer", scope: !151, file: !140, line: 456, baseType: !299, size: 64, align: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "RMPNIbuffer_t", file: !140, line: 313, baseType: !301)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "RMPNIbuffer_s", file: !140, line: 308, size: 128, align: 64, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "RMPNI", scope: !301, file: !140, line: 310, baseType: !10, size: 32, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !301, file: !140, line: 311, baseType: !10, size: 32, align: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !301, file: !140, line: 312, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l0", scope: !151, file: !140, line: 458, baseType: !10, size: 32, align: 32, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l0", scope: !151, file: !140, line: 459, baseType: !196, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l0", scope: !151, file: !140, line: 460, baseType: !196, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l0", scope: !151, file: !140, line: 461, baseType: !196, size: 64, align: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag_l1", scope: !151, file: !140, line: 462, baseType: !10, size: 32, align: 32, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "remapping_of_pic_nums_idc_l1", scope: !151, file: !140, line: 463, baseType: !196, size: 64, align: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1_l1", scope: !151, file: !140, line: 464, baseType: !196, size: 64, align: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx_l1", scope: !151, file: !140, line: 465, baseType: !196, size: 64, align: 64, offset: 896)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "slice_too_big", scope: !151, file: !140, line: 467, baseType: !316, size: 64, align: 64, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !10}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 45, baseType: !3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "field_ctx", scope: !151, file: !140, line: 469, baseType: !321, size: 192, align: 32, offset: 1024)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, align: 32, elements: !322)
!322 = !{!34, !39}
!323 = !{!324}
!324 = !DISubrange(count: 100)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_picture", scope: !143, file: !140, line: 480, baseType: !10, size: 32, align: 32, offset: 6464)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_y", scope: !143, file: !140, line: 481, baseType: !327, size: 32, align: 32, offset: 6496)
!327 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_u", scope: !143, file: !140, line: 482, baseType: !327, size: 32, align: 32, offset: 6528)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_v", scope: !143, file: !140, line: 483, baseType: !327, size: 32, align: 32, offset: 6560)
!330 = !DIGlobalVariable(name: "bottom_pic", scope: !0, file: !140, line: 559, type: !141, isLocal: false, isDefinition: true, variable: %struct.Picture** @bottom_pic)
!331 = !DIGlobalVariable(name: "frame_pic", scope: !0, file: !140, line: 560, type: !141, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic)
!332 = !DIGlobalVariable(name: "frame_pic2", scope: !0, file: !140, line: 561, type: !141, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic2)
!333 = !DIGlobalVariable(name: "frame_pic3", scope: !0, file: !140, line: 562, type: !141, isLocal: false, isDefinition: true, variable: %struct.Picture** @frame_pic3)
!334 = !DIGlobalVariable(name: "imgY_org", scope: !0, file: !140, line: 565, type: !335, isLocal: false, isDefinition: true, variable: i16*** @imgY_org)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!336 = !DIGlobalVariable(name: "imgUV_org", scope: !0, file: !140, line: 566, type: !337, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!338 = !DIGlobalVariable(name: "img4Y_tmp", scope: !0, file: !140, line: 567, type: !339, isLocal: false, isDefinition: true, variable: i32*** @img4Y_tmp)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!340 = !DIGlobalVariable(name: "log2_max_frame_num_minus4", scope: !0, file: !140, line: 569, type: !189, isLocal: false, isDefinition: true, variable: i32* @log2_max_frame_num_minus4)
!341 = !DIGlobalVariable(name: "log2_max_pic_order_cnt_lsb_minus4", scope: !0, file: !140, line: 570, type: !189, isLocal: false, isDefinition: true, variable: i32* @log2_max_pic_order_cnt_lsb_minus4)
!342 = !DIGlobalVariable(name: "me_tot_time", scope: !0, file: !140, line: 572, type: !10, isLocal: false, isDefinition: true, variable: i32* @me_tot_time)
!343 = !DIGlobalVariable(name: "me_time", scope: !0, file: !140, line: 572, type: !10, isLocal: false, isDefinition: true, variable: i32* @me_time)
!344 = !DIGlobalVariable(name: "active_pps", scope: !0, file: !140, line: 573, type: !345, isLocal: false, isDefinition: true, variable: %struct.pic_parameter_set_rbsp_t** @active_pps)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !4, line: 145, baseType: !347)
!347 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 103, size: 1920, align: 64, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !359, !360, !361, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !347, file: !4, line: 105, baseType: !319, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !347, file: !4, line: 106, baseType: !189, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !347, file: !4, line: 107, baseType: !189, size: 32, align: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !347, file: !4, line: 108, baseType: !319, size: 32, align: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !347, file: !4, line: 110, baseType: !319, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !347, file: !4, line: 111, baseType: !319, size: 32, align: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !347, file: !4, line: 112, baseType: !356, size: 256, align: 32, offset: 192)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 256, align: 32, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present_flag", scope: !347, file: !4, line: 115, baseType: !319, size: 32, align: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !347, file: !4, line: 116, baseType: !189, size: 32, align: 32, offset: 480)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !347, file: !4, line: 117, baseType: !189, size: 32, align: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !347, file: !4, line: 119, baseType: !363, size: 256, align: 32, offset: 544)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 256, align: 32, elements: !357)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !347, file: !4, line: 121, baseType: !363, size: 256, align: 32, offset: 800)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !347, file: !4, line: 122, baseType: !363, size: 256, align: 32, offset: 1056)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !347, file: !4, line: 124, baseType: !319, size: 32, align: 32, offset: 1312)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !347, file: !4, line: 125, baseType: !189, size: 32, align: 32, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !347, file: !4, line: 127, baseType: !189, size: 32, align: 32, offset: 1376)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !347, file: !4, line: 128, baseType: !182, size: 64, align: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !347, file: !4, line: 130, baseType: !10, size: 32, align: 32, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !347, file: !4, line: 131, baseType: !10, size: 32, align: 32, offset: 1504)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !347, file: !4, line: 132, baseType: !319, size: 32, align: 32, offset: 1536)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !347, file: !4, line: 133, baseType: !189, size: 32, align: 32, offset: 1568)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !347, file: !4, line: 134, baseType: !10, size: 32, align: 32, offset: 1600)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !347, file: !4, line: 135, baseType: !10, size: 32, align: 32, offset: 1632)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !347, file: !4, line: 136, baseType: !10, size: 32, align: 32, offset: 1664)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_index_offset", scope: !347, file: !4, line: 138, baseType: !10, size: 32, align: 32, offset: 1696)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_index_offset", scope: !347, file: !4, line: 139, baseType: !10, size: 32, align: 32, offset: 1728)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !347, file: !4, line: 141, baseType: !319, size: 32, align: 32, offset: 1760)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !347, file: !4, line: 142, baseType: !319, size: 32, align: 32, offset: 1792)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !347, file: !4, line: 143, baseType: !319, size: 32, align: 32, offset: 1824)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vui_pic_parameters_flag", scope: !347, file: !4, line: 144, baseType: !319, size: 32, align: 32, offset: 1856)
!383 = !DIGlobalVariable(name: "active_sps", scope: !0, file: !140, line: 574, type: !384, isLocal: false, isDefinition: true, variable: %struct.seq_parameter_set_rbsp_t** @active_sps)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !4, line: 193, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 149, size: 17056, align: 32, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !386, file: !4, line: 151, baseType: !319, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !386, file: !4, line: 153, baseType: !189, size: 32, align: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !386, file: !4, line: 154, baseType: !319, size: 32, align: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !386, file: !4, line: 155, baseType: !319, size: 32, align: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !386, file: !4, line: 156, baseType: !319, size: 32, align: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !386, file: !4, line: 157, baseType: !319, size: 32, align: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !386, file: !4, line: 158, baseType: !189, size: 32, align: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !386, file: !4, line: 159, baseType: !189, size: 32, align: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !386, file: !4, line: 160, baseType: !189, size: 32, align: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !386, file: !4, line: 162, baseType: !319, size: 32, align: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !386, file: !4, line: 163, baseType: !356, size: 256, align: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !386, file: !4, line: 165, baseType: !189, size: 32, align: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !386, file: !4, line: 166, baseType: !189, size: 32, align: 32, offset: 608)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !386, file: !4, line: 167, baseType: !189, size: 32, align: 32, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !386, file: !4, line: 168, baseType: !189, size: 32, align: 32, offset: 672)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !386, file: !4, line: 170, baseType: !189, size: 32, align: 32, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !386, file: !4, line: 172, baseType: !319, size: 32, align: 32, offset: 736)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !386, file: !4, line: 173, baseType: !10, size: 32, align: 32, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !386, file: !4, line: 174, baseType: !10, size: 32, align: 32, offset: 800)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !386, file: !4, line: 175, baseType: !189, size: 32, align: 32, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !386, file: !4, line: 177, baseType: !409, size: 8192, align: 32, offset: 864)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !386, file: !4, line: 178, baseType: !189, size: 32, align: 32, offset: 9056)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !386, file: !4, line: 179, baseType: !319, size: 32, align: 32, offset: 9088)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !386, file: !4, line: 180, baseType: !189, size: 32, align: 32, offset: 9120)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !386, file: !4, line: 181, baseType: !189, size: 32, align: 32, offset: 9152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !386, file: !4, line: 182, baseType: !319, size: 32, align: 32, offset: 9184)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !386, file: !4, line: 184, baseType: !319, size: 32, align: 32, offset: 9216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !386, file: !4, line: 185, baseType: !319, size: 32, align: 32, offset: 9248)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !386, file: !4, line: 186, baseType: !319, size: 32, align: 32, offset: 9280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !386, file: !4, line: 187, baseType: !189, size: 32, align: 32, offset: 9312)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !386, file: !4, line: 188, baseType: !189, size: 32, align: 32, offset: 9344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !386, file: !4, line: 189, baseType: !189, size: 32, align: 32, offset: 9376)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !386, file: !4, line: 190, baseType: !189, size: 32, align: 32, offset: 9408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !386, file: !4, line: 191, baseType: !319, size: 32, align: 32, offset: 9440)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !386, file: !4, line: 192, baseType: !426, size: 7584, align: 32, offset: 9472)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !4, line: 99, baseType: !427)
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 7584, align: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !427, file: !4, line: 65, baseType: !319, size: 32, align: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !427, file: !4, line: 66, baseType: !189, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !427, file: !4, line: 67, baseType: !189, size: 32, align: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !427, file: !4, line: 68, baseType: !189, size: 32, align: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !427, file: !4, line: 69, baseType: !319, size: 32, align: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !427, file: !4, line: 70, baseType: !319, size: 32, align: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !427, file: !4, line: 71, baseType: !319, size: 32, align: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !427, file: !4, line: 72, baseType: !189, size: 32, align: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !427, file: !4, line: 73, baseType: !319, size: 32, align: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !427, file: !4, line: 74, baseType: !319, size: 32, align: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !427, file: !4, line: 75, baseType: !189, size: 32, align: 32, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !427, file: !4, line: 76, baseType: !189, size: 32, align: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !427, file: !4, line: 77, baseType: !189, size: 32, align: 32, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !427, file: !4, line: 78, baseType: !319, size: 32, align: 32, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_frame", scope: !427, file: !4, line: 79, baseType: !189, size: 32, align: 32, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_field", scope: !427, file: !4, line: 80, baseType: !189, size: 32, align: 32, offset: 480)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !427, file: !4, line: 81, baseType: !319, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !427, file: !4, line: 82, baseType: !189, size: 32, align: 32, offset: 544)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !427, file: !4, line: 83, baseType: !189, size: 32, align: 32, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !427, file: !4, line: 84, baseType: !319, size: 32, align: 32, offset: 608)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !427, file: !4, line: 85, baseType: !319, size: 32, align: 32, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !427, file: !4, line: 86, baseType: !451, size: 3296, align: 32, offset: 672)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !4, line: 60, baseType: !452)
!452 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 3296, align: 32, elements: !453)
!453 = !{!454, !455, !456, !457, !461, !462, !463, !464, !465, !466}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !452, file: !4, line: 50, baseType: !189, size: 32, align: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !452, file: !4, line: 51, baseType: !189, size: 32, align: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !452, file: !4, line: 52, baseType: !189, size: 32, align: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value", scope: !452, file: !4, line: 53, baseType: !458, size: 1024, align: 32, offset: 96)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 1024, align: 32, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value", scope: !452, file: !4, line: 54, baseType: !458, size: 1024, align: 32, offset: 1120)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vbr_cbr_flag", scope: !452, file: !4, line: 55, baseType: !458, size: 1024, align: 32, offset: 2144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !452, file: !4, line: 56, baseType: !189, size: 32, align: 32, offset: 3168)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !452, file: !4, line: 57, baseType: !189, size: 32, align: 32, offset: 3200)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !452, file: !4, line: 58, baseType: !189, size: 32, align: 32, offset: 3232)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !452, file: !4, line: 59, baseType: !189, size: 32, align: 32, offset: 3264)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !427, file: !4, line: 87, baseType: !319, size: 32, align: 32, offset: 3968)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !427, file: !4, line: 88, baseType: !451, size: 3296, align: 32, offset: 4000)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !427, file: !4, line: 90, baseType: !319, size: 32, align: 32, offset: 7296)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !427, file: !4, line: 91, baseType: !319, size: 32, align: 32, offset: 7328)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !427, file: !4, line: 92, baseType: !319, size: 32, align: 32, offset: 7360)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !427, file: !4, line: 93, baseType: !189, size: 32, align: 32, offset: 7392)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !427, file: !4, line: 94, baseType: !189, size: 32, align: 32, offset: 7424)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !427, file: !4, line: 95, baseType: !189, size: 32, align: 32, offset: 7456)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !427, file: !4, line: 96, baseType: !189, size: 32, align: 32, offset: 7488)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_reordering", scope: !427, file: !4, line: 97, baseType: !189, size: 32, align: 32, offset: 7520)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !427, file: !4, line: 98, baseType: !189, size: 32, align: 32, offset: 7552)
!478 = !DIGlobalVariable(name: "mb_adaptive", scope: !0, file: !140, line: 578, type: !10, isLocal: false, isDefinition: true, variable: i32* @mb_adaptive)
!479 = !DIGlobalVariable(name: "MBPairIsField", scope: !0, file: !140, line: 579, type: !10, isLocal: false, isDefinition: true, variable: i32* @MBPairIsField)
!480 = !DIGlobalVariable(name: "wp_weight", scope: !0, file: !140, line: 583, type: !481, isLocal: false, isDefinition: true, variable: i32**** @wp_weight)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!482 = !DIGlobalVariable(name: "wp_offset", scope: !0, file: !140, line: 584, type: !481, isLocal: false, isDefinition: true, variable: i32**** @wp_offset)
!483 = !DIGlobalVariable(name: "wbp_weight", scope: !0, file: !140, line: 585, type: !484, isLocal: false, isDefinition: true, variable: i32***** @wbp_weight)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!485 = !DIGlobalVariable(name: "luma_log_weight_denom", scope: !0, file: !140, line: 586, type: !10, isLocal: false, isDefinition: true, variable: i32* @luma_log_weight_denom)
!486 = !DIGlobalVariable(name: "chroma_log_weight_denom", scope: !0, file: !140, line: 587, type: !10, isLocal: false, isDefinition: true, variable: i32* @chroma_log_weight_denom)
!487 = !DIGlobalVariable(name: "wp_luma_round", scope: !0, file: !140, line: 588, type: !10, isLocal: false, isDefinition: true, variable: i32* @wp_luma_round)
!488 = !DIGlobalVariable(name: "wp_chroma_round", scope: !0, file: !140, line: 589, type: !10, isLocal: false, isDefinition: true, variable: i32* @wp_chroma_round)
!489 = !DIGlobalVariable(name: "imgY_org_top", scope: !0, file: !140, line: 592, type: !335, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_top)
!490 = !DIGlobalVariable(name: "imgY_org_bot", scope: !0, file: !140, line: 593, type: !335, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_bot)
!491 = !DIGlobalVariable(name: "imgUV_org_top", scope: !0, file: !140, line: 595, type: !337, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_top)
!492 = !DIGlobalVariable(name: "imgUV_org_bot", scope: !0, file: !140, line: 596, type: !337, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_bot)
!493 = !DIGlobalVariable(name: "imgY_org_frm", scope: !0, file: !140, line: 598, type: !335, isLocal: false, isDefinition: true, variable: i16*** @imgY_org_frm)
!494 = !DIGlobalVariable(name: "imgUV_org_frm", scope: !0, file: !140, line: 599, type: !337, isLocal: false, isDefinition: true, variable: i16**** @imgUV_org_frm)
!495 = !DIGlobalVariable(name: "imgY_com", scope: !0, file: !140, line: 601, type: !335, isLocal: false, isDefinition: true, variable: i16*** @imgY_com)
!496 = !DIGlobalVariable(name: "imgUV_com", scope: !0, file: !140, line: 602, type: !337, isLocal: false, isDefinition: true, variable: i16**** @imgUV_com)
!497 = !DIGlobalVariable(name: "direct_ref_idx", scope: !0, file: !140, line: 604, type: !498, isLocal: false, isDefinition: true, variable: i16**** @direct_ref_idx)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!502 = !DIGlobalVariable(name: "direct_pdir", scope: !0, file: !140, line: 605, type: !499, isLocal: false, isDefinition: true, variable: i16*** @direct_pdir)
!503 = !DIGlobalVariable(name: "pixel_map", scope: !0, file: !140, line: 608, type: !504, isLocal: false, isDefinition: true, variable: i8*** @pixel_map)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!505 = !DIGlobalVariable(name: "refresh_map", scope: !0, file: !140, line: 609, type: !504, isLocal: false, isDefinition: true, variable: i8*** @refresh_map)
!506 = !DIGlobalVariable(name: "intras", scope: !0, file: !140, line: 610, type: !10, isLocal: false, isDefinition: true, variable: i32* @intras)
!507 = !DIGlobalVariable(name: "Iframe_ctr", scope: !0, file: !140, line: 612, type: !10, isLocal: false, isDefinition: true, variable: i32* @Iframe_ctr)
!508 = !DIGlobalVariable(name: "Pframe_ctr", scope: !0, file: !140, line: 612, type: !10, isLocal: false, isDefinition: true, variable: i32* @Pframe_ctr)
!509 = !DIGlobalVariable(name: "Bframe_ctr", scope: !0, file: !140, line: 612, type: !10, isLocal: false, isDefinition: true, variable: i32* @Bframe_ctr)
!510 = !DIGlobalVariable(name: "frame_no", scope: !0, file: !140, line: 613, type: !10, isLocal: false, isDefinition: true, variable: i32* @frame_no)
!511 = !DIGlobalVariable(name: "nextP_tr_fld", scope: !0, file: !140, line: 613, type: !10, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_fld)
!512 = !DIGlobalVariable(name: "nextP_tr_frm", scope: !0, file: !140, line: 613, type: !10, isLocal: false, isDefinition: true, variable: i32* @nextP_tr_frm)
!513 = !DIGlobalVariable(name: "tot_time", scope: !0, file: !140, line: 614, type: !10, isLocal: false, isDefinition: true, variable: i32* @tot_time)
!514 = !DIGlobalVariable(name: "errortext", scope: !0, file: !140, line: 617, type: !515, isLocal: false, isDefinition: true, variable: [300 x i8]* @errortext)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 2400, align: 8, elements: !517)
!516 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!517 = !{!518}
!518 = !DISubrange(count: 300)
!519 = !DIGlobalVariable(name: "resTrans_R", scope: !0, file: !140, line: 620, type: !520, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_R)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !521)
!521 = !{!522, !522}
!522 = !DISubrange(count: 16)
!523 = !DIGlobalVariable(name: "resTrans_G", scope: !0, file: !140, line: 620, type: !520, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_G)
!524 = !DIGlobalVariable(name: "resTrans_B", scope: !0, file: !140, line: 620, type: !520, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @resTrans_B)
!525 = !DIGlobalVariable(name: "rec_resR", scope: !0, file: !140, line: 621, type: !520, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resR)
!526 = !DIGlobalVariable(name: "rec_resG", scope: !0, file: !140, line: 621, type: !520, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resG)
!527 = !DIGlobalVariable(name: "rec_resB", scope: !0, file: !140, line: 621, type: !520, isLocal: false, isDefinition: true, variable: [16 x [16 x i32]]* @rec_resB)
!528 = !DIGlobalVariable(name: "mprRGB", scope: !0, file: !140, line: 622, type: !529, isLocal: false, isDefinition: true, variable: [3 x [16 x [16 x i32]]]* @mprRGB)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 24576, align: 32, elements: !530)
!530 = !{!34, !522, !522}
!531 = !DIGlobalVariable(name: "dc_level", scope: !0, file: !140, line: 623, type: !532, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 32, elements: !533)
!533 = !{!39, !268, !268}
!534 = !DIGlobalVariable(name: "dc_level_temp", scope: !0, file: !140, line: 623, type: !532, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @dc_level_temp)
!535 = !DIGlobalVariable(name: "cbp_chroma_block", scope: !0, file: !140, line: 624, type: !532, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block)
!536 = !DIGlobalVariable(name: "cbp_chroma_block_temp", scope: !0, file: !140, line: 624, type: !532, isLocal: false, isDefinition: true, variable: [2 x [4 x [4 x i32]]]* @cbp_chroma_block_temp)
!537 = !DIGlobalVariable(name: "b8_ipredmode8x8", scope: !0, file: !140, line: 625, type: !538, isLocal: false, isDefinition: true, variable: [4 x [4 x i32]]* @b8_ipredmode8x8)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 32, elements: !539)
!539 = !{!268, !268}
!540 = !DIGlobalVariable(name: "b8_intra_pred_modes8x8", scope: !0, file: !140, line: 625, type: !541, isLocal: false, isDefinition: true, variable: [16 x i32]* @b8_intra_pred_modes8x8)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 32, elements: !542)
!542 = !{!522}
!543 = !DIGlobalVariable(name: "gop_structure", scope: !0, file: !140, line: 1201, type: !544, isLocal: false, isDefinition: true, variable: %struct.GOP_DATA** @gop_structure)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOP_DATA", file: !140, line: 1190, baseType: !546)
!546 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 1182, size: 192, align: 32, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !546, file: !140, line: 1184, baseType: !10, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "display_no", scope: !546, file: !140, line: 1185, baseType: !10, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reference_idc", scope: !546, file: !140, line: 1186, baseType: !10, size: 32, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp", scope: !546, file: !140, line: 1187, baseType: !10, size: 32, align: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pyramid_layer", scope: !546, file: !140, line: 1188, baseType: !10, size: 32, align: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pyramidPocDelta", scope: !546, file: !140, line: 1189, baseType: !10, size: 32, align: 32, offset: 160)
!554 = !DIGlobalVariable(name: "rdopt", scope: !0, file: !140, line: 1202, type: !555, isLocal: false, isDefinition: true, variable: %struct.RD_DATA** @rdopt)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_DATA", file: !140, line: 1177, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 1145, size: 26880, align: 64, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !569, !570, !571, !572, !573, !578, !579, !583, !584, !585, !586, !588, !589, !590, !591, !592, !593, !594}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "min_rdcost", scope: !557, file: !140, line: 1147, baseType: !9, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbY", scope: !557, file: !140, line: 1149, baseType: !520, size: 8192, align: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbU", scope: !557, file: !140, line: 1150, baseType: !520, size: 8192, align: 32, offset: 8256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rec_mbV", scope: !557, file: !140, line: 1150, baseType: !520, size: 8192, align: 32, offset: 16448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cofAC", scope: !557, file: !140, line: 1151, baseType: !484, size: 64, align: 64, offset: 24640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cofDC", scope: !557, file: !140, line: 1152, baseType: !481, size: 64, align: 64, offset: 24704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !557, file: !140, line: 1153, baseType: !10, size: 32, align: 32, offset: 24768)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bi_pred_me", scope: !557, file: !140, line: 1155, baseType: !10, size: 32, align: 32, offset: 24800)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !557, file: !140, line: 1157, baseType: !568, size: 128, align: 32, offset: 24832)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, align: 32, elements: !267)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !557, file: !140, line: 1157, baseType: !568, size: 128, align: 32, offset: 24960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !557, file: !140, line: 1158, baseType: !339, size: 64, align: 64, offset: 25088)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pred_modes", scope: !557, file: !140, line: 1159, baseType: !541, size: 512, align: 32, offset: 25152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !557, file: !140, line: 1160, baseType: !10, size: 32, align: 32, offset: 25664)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !557, file: !140, line: 1161, baseType: !574, size: 64, align: 64, offset: 25728)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !140, line: 62, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !576, line: 30, baseType: !577)
!576 = !DIFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!577 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !557, file: !140, line: 1162, baseType: !10, size: 32, align: 32, offset: 25792)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pred_mv", scope: !557, file: !140, line: 1163, baseType: !580, size: 64, align: 64, offset: 25856)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "all_mv", scope: !557, file: !140, line: 1164, baseType: !580, size: 64, align: 64, offset: 25920)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv1", scope: !557, file: !140, line: 1165, baseType: !580, size: 64, align: 64, offset: 25984)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_mv2", scope: !557, file: !140, line: 1166, baseType: !580, size: 64, align: 64, offset: 26048)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "refar", scope: !557, file: !140, line: 1167, baseType: !587, size: 512, align: 16, offset: 26112)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 512, align: 16, elements: !533)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i16offset", scope: !557, file: !140, line: 1168, baseType: !10, size: 32, align: 32, offset: 26624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !557, file: !140, line: 1169, baseType: !10, size: 32, align: 32, offset: 26656)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !557, file: !140, line: 1171, baseType: !10, size: 32, align: 32, offset: 26688)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !557, file: !140, line: 1172, baseType: !10, size: 32, align: 32, offset: 26720)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !557, file: !140, line: 1174, baseType: !10, size: 32, align: 32, offset: 26752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "prev_qp", scope: !557, file: !140, line: 1175, baseType: !10, size: 32, align: 32, offset: 26784)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "prev_delta_qp", scope: !557, file: !140, line: 1176, baseType: !10, size: 32, align: 32, offset: 26816)
!595 = !DIGlobalVariable(name: "rddata_top_frame_mb", scope: !0, file: !140, line: 1203, type: !556, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_frame_mb)
!596 = !DIGlobalVariable(name: "rddata_bot_frame_mb", scope: !0, file: !140, line: 1203, type: !556, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_frame_mb)
!597 = !DIGlobalVariable(name: "rddata_top_field_mb", scope: !0, file: !140, line: 1204, type: !556, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_top_field_mb)
!598 = !DIGlobalVariable(name: "rddata_bot_field_mb", scope: !0, file: !140, line: 1204, type: !556, isLocal: false, isDefinition: true, variable: %struct.RD_DATA* @rddata_bot_field_mb)
!599 = !DIGlobalVariable(name: "p_stat", scope: !0, file: !140, line: 1230, type: !600, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_stat)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !602, line: 153, baseType: !603)
!602 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !602, line: 122, size: 1216, align: 64, elements: !604)
!604 = !{!605, !607, !608, !609, !610, !611, !616, !617, !619, !623, !628, !637, !643, !644, !647, !648, !650, !654, !655, !656}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !603, file: !602, line: 123, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !603, file: !602, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !603, file: !602, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !603, file: !602, line: 126, baseType: !501, size: 16, align: 16, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !603, file: !602, line: 127, baseType: !501, size: 16, align: 16, offset: 144)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !603, file: !602, line: 128, baseType: !612, size: 128, align: 64, offset: 192)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !602, line: 88, size: 128, align: 64, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !612, file: !602, line: 89, baseType: !606, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !612, file: !602, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !603, file: !602, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !603, file: !602, line: 132, baseType: !618, size: 64, align: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !603, file: !602, line: 133, baseType: !620, size: 64, align: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!10, !618}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !603, file: !602, line: 134, baseType: !624, size: 64, align: 64, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!10, !618, !627, !10}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !603, file: !602, line: 135, baseType: !629, size: 64, align: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !618, !632, !10}
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !602, line: 77, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !634, line: 71, baseType: !635)
!634 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !636, line: 46, baseType: !577)
!636 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !603, file: !602, line: 136, baseType: !638, size: 64, align: 64, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!10, !618, !641, !10}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !603, file: !602, line: 139, baseType: !612, size: 128, align: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !603, file: !602, line: 140, baseType: !645, size: 64, align: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !602, line: 94, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !603, file: !602, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !603, file: !602, line: 144, baseType: !649, size: 24, align: 8, offset: 928)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 24, align: 8, elements: !33)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !603, file: !602, line: 145, baseType: !651, size: 8, align: 8, offset: 952)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 8, align: 8, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 1)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !603, file: !602, line: 148, baseType: !612, size: 128, align: 64, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !603, file: !602, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !603, file: !602, line: 152, baseType: !632, size: 64, align: 64, offset: 1152)
!657 = !DIGlobalVariable(name: "p_log", scope: !0, file: !140, line: 1231, type: !600, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_log)
!658 = !DIGlobalVariable(name: "p_trace", scope: !0, file: !140, line: 1232, type: !600, isLocal: false, isDefinition: true, variable: %struct.__sFILE** @p_trace)
!659 = !DIGlobalVariable(name: "p_in", scope: !0, file: !140, line: 1233, type: !10, isLocal: false, isDefinition: true, variable: i32* @p_in)
!660 = !DIGlobalVariable(name: "p_dec", scope: !0, file: !140, line: 1234, type: !10, isLocal: false, isDefinition: true, variable: i32* @p_dec)
!661 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l0", scope: !0, file: !140, line: 1237, type: !662, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l0)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 640, align: 32, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 20)
!665 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l0", scope: !0, file: !140, line: 1238, type: !662, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l0)
!666 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l0", scope: !0, file: !140, line: 1239, type: !662, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l0)
!667 = !DIGlobalVariable(name: "glob_remapping_of_pic_nums_idc_l1", scope: !0, file: !140, line: 1240, type: !662, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_remapping_of_pic_nums_idc_l1)
!668 = !DIGlobalVariable(name: "glob_abs_diff_pic_num_minus1_l1", scope: !0, file: !140, line: 1241, type: !662, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_abs_diff_pic_num_minus1_l1)
!669 = !DIGlobalVariable(name: "glob_long_term_pic_idx_l1", scope: !0, file: !140, line: 1242, type: !662, isLocal: false, isDefinition: true, variable: [20 x i32]* @glob_long_term_pic_idx_l1)
!670 = !DIGlobalVariable(name: "Bytes_After_Header", scope: !0, file: !140, line: 1456, type: !10, isLocal: false, isDefinition: true, variable: i32* @Bytes_After_Header)
!671 = !DIGlobalVariable(name: "rpc_bytes_to_go", scope: !0, file: !140, line: 1465, type: !10, isLocal: false, isDefinition: true, variable: i32* @rpc_bytes_to_go)
!672 = !DIGlobalVariable(name: "rpc_bits_to_go", scope: !0, file: !140, line: 1466, type: !10, isLocal: false, isDefinition: true, variable: i32* @rpc_bits_to_go)
!673 = !{}
!674 = !{i32 2, !"Dwarf Version", i32 2}
!675 = !{i32 2, !"Debug Info Version", i32 700000003}
!676 = !{i32 1, !"PIC Level", i32 2}
!677 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!678 = !DIExpression()
!679 = !DILocation(line: 28, column: 44, scope: !12)
!680 = !DILocation(line: 32, column: 10, scope: !12)
!681 = !DILocation(line: 39, column: 7, scope: !12)
!682 = !DILocation(line: 41, column: 25, scope: !12)
!683 = !{!684, !684, i64 0}
!684 = !{!"any pointer", !685, i64 0}
!685 = !{!"omnipotent char", !686, i64 0}
!686 = !{!"Simple C/C++ TBAA"}
!687 = !DILocation(line: 41, column: 30, scope: !12)
!688 = !{!689, !690, i64 72400}
