; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/3dview.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_3dview = type { [3 x [3 x float]], [4 x float], [4 x float], [4 x [4 x float]], [4 x [4 x float]], float, float }

@.str = private unnamed_addr constant [5 x i8] c"%s: \00", align 1
@.str2 = private unnamed_addr constant [7 x i8] c"%10.5f\00", align 1
@.str4 = private unnamed_addr constant [24 x i8] c"Error: invalid axis: %d\00", align 1
@.str5 = private unnamed_addr constant [46 x i8] c"Error: Zero Length Vector - No View Specified\00", align 1
@rotate_3d.RotP = internal global [3 x [4 x [4 x float]]] zeroinitializer, align 16
@rotate_3d.RotM = internal global [3 x [4 x [4 x float]]] zeroinitializer, align 16
@.str6 = private unnamed_addr constant [5 x i8] c"view\00", align 1
@.str7 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/3dview.c\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable
define i32 @__sputc(i32 %_c, %struct.__sFILE* %_p) #0 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !250, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/3dview.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !6, line: 87, baseType: !7)
!6 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!7 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!8 = !{!9, !78, !84, !97, !104, !113, !122, !132, !139, !147, !189, !200, !213, !218, !222, !232, !238, !245}
!9 = !DISubprogram(name: "__sputc", scope: !10, file: !10, line: 348, type: !11, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !75)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !13, !14}
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !10, line: 153, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !10, line: 122, size: 1216, align: 64, elements: !17)
!17 = !{!18, !21, !22, !23, !25, !26, !31, !32, !34, !38, !43, !53, !59, !60, !63, !64, !68, !72, !73, !74}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !16, file: !10, line: 123, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !16, file: !10, line: 124, baseType: !13, size: 32, align: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !16, file: !10, line: 125, baseType: !13, size: 32, align: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !16, file: !10, line: 126, baseType: !24, size: 16, align: 16, offset: 128)
!24 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !16, file: !10, line: 127, baseType: !24, size: 16, align: 16, offset: 144)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !16, file: !10, line: 128, baseType: !27, size: 128, align: 64, offset: 192)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !10, line: 88, size: 128, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !27, file: !10, line: 89, baseType: !19, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !27, file: !10, line: 90, baseType: !13, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !16, file: !10, line: 129, baseType: !13, size: 32, align: 32, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !16, file: !10, line: 132, baseType: !33, size: 64, align: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !16, file: !10, line: 133, baseType: !35, size: 64, align: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!13, !33}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !16, file: !10, line: 134, baseType: !39, size: 64, align: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!13, !33, !42, !13}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !16, file: !10, line: 135, baseType: !44, size: 64, align: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !33, !47, !13}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !10, line: 77, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !49, line: 71, baseType: !50)
!49 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !16, file: !10, line: 136, baseType: !54, size: 64, align: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!13, !33, !57, !13}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !16, file: !10, line: 139, baseType: !27, size: 128, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !16, file: !10, line: 140, baseType: !61, size: 64, align: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !10, line: 94, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !16, file: !10, line: 141, baseType: !13, size: 32, align: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !16, file: !10, line: 144, baseType: !65, size: 24, align: 8, offset: 928)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24, align: 8, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !16, file: !10, line: 145, baseType: !69, size: 8, align: 8, offset: 952)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !16, file: !10, line: 148, baseType: !27, size: 128, align: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !16, file: !10, line: 151, baseType: !13, size: 32, align: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !16, file: !10, line: 152, baseType: !47, size: 64, align: 64, offset: 1152)
!75 = !{!76, !77}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !9, file: !10, line: 348, type: !13)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !9, file: !10, line: 348, type: !14)
!78 = !DISubprogram(name: "__sigbits", scope: !79, file: !79, line: 114, type: !80, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !82)
!79 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!80 = !DISubroutineType(types: !81)
!81 = !{!13, !13}
!82 = !{!83}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !78, file: !79, line: 114, type: !13)
!84 = !DISubprogram(name: "m4_op", scope: !1, file: !1, line: 44, type: !85, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void ([4 x float]*, float*, float*)* @m4_op, variables: !92)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !87, !91, !91}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 4)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!92 = !{!93, !94, !95, !96}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !84, file: !1, line: 44, type: !87)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !84, file: !1, line: 44, type: !91)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !84, file: !1, line: 44, type: !91)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !84, file: !1, line: 46, type: !13)
!97 = !DISubprogram(name: "unity_m4", scope: !1, file: !1, line: 52, type: !98, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: void ([4 x float]*)* @unity_m4, variables: !100)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !87}
!100 = !{!101, !102, !103}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !97, file: !1, line: 52, type: !87)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !97, file: !1, line: 54, type: !13)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !97, file: !1, line: 54, type: !13)
!104 = !DISubprogram(name: "print_m4", scope: !1, file: !1, line: 64, type: !105, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, [4 x float]*)* @print_m4, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !14, !42, !87}
!107 = !{!108, !109, !110, !111, !112}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !104, file: !1, line: 64, type: !14)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !104, file: !1, line: 64, type: !42)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "A", arg: 3, scope: !104, file: !1, line: 64, type: !87)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !104, file: !1, line: 66, type: !13)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !104, file: !1, line: 66, type: !13)
!113 = !DISubprogram(name: "print_v4", scope: !1, file: !1, line: 79, type: !114, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, i32, float*)* @print_v4, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !14, !42, !13, !91}
!116 = !{!117, !118, !119, !120, !121}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !113, file: !1, line: 79, type: !14)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !113, file: !1, line: 79, type: !42)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !113, file: !1, line: 79, type: !13)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 4, scope: !113, file: !1, line: 79, type: !91)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !113, file: !1, line: 81, type: !13)
!122 = !DISubprogram(name: "mult_matrix", scope: !1, file: !1, line: 91, type: !123, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: void ([4 x float]*, [4 x float]*, [4 x float]*)* @mult_matrix, variables: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !87, !87, !87}
!125 = !{!126, !127, !128, !129, !130, !131}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "A", arg: 1, scope: !122, file: !1, line: 91, type: !87)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "B", arg: 2, scope: !122, file: !1, line: 91, type: !87)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "C", arg: 3, scope: !122, file: !1, line: 91, type: !87)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !122, file: !1, line: 93, type: !13)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !122, file: !1, line: 93, type: !13)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !122, file: !1, line: 93, type: !13)
!132 = !DISubprogram(name: "rotate", scope: !1, file: !1, line: 103, type: !133, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, float, [4 x float]*)* @rotate, variables: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !13, !5, !87}
!135 = !{!136, !137, !138}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "axis", arg: 1, scope: !132, file: !1, line: 103, type: !13)
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "angle", arg: 2, scope: !132, file: !1, line: 103, type: !5)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "A", arg: 3, scope: !132, file: !1, line: 103, type: !87)
!139 = !DISubprogram(name: "translate", scope: !1, file: !1, line: 131, type: !140, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float, float, [4 x float]*)* @translate, variables: !142)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !5, !5, !5, !87}
!142 = !{!143, !144, !145, !146}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tx", arg: 1, scope: !139, file: !1, line: 131, type: !5)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ty", arg: 2, scope: !139, file: !1, line: 131, type: !5)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tz", arg: 3, scope: !139, file: !1, line: 131, type: !5)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "A", arg: 4, scope: !139, file: !1, line: 131, type: !87)
!147 = !DISubprogram(name: "calculate_view", scope: !1, file: !1, line: 145, type: !148, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_3dview*)* @calculate_view, variables: !169)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_3dview", file: !152, line: 57, baseType: !153)
!152 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/3dview.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 51, size: 1632, align: 32, elements: !154)
!154 = !{!155, !159, !161, !162, !166, !167, !168}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !153, file: !152, line: 52, baseType: !156, size: 288, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !6, line: 103, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, align: 32, elements: !158)
!158 = !{!67, !67}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "eye", scope: !153, file: !152, line: 53, baseType: !160, size: 128, align: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec4", file: !152, line: 45, baseType: !88)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !153, file: !152, line: 53, baseType: !160, size: 128, align: 32, offset: 416)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "proj", scope: !153, file: !152, line: 54, baseType: !163, size: 512, align: 32, offset: 544)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat4", file: !152, line: 47, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, align: 32, elements: !165)
!165 = !{!90, !90}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Rot", scope: !153, file: !152, line: 55, baseType: !163, size: 512, align: 32, offset: 1056)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sc_x", scope: !153, file: !152, line: 56, baseType: !5, size: 32, align: 32, offset: 1568)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sc_y", scope: !153, file: !152, line: 56, baseType: !5, size: 32, align: 32, offset: 1600)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !147, file: !1, line: 145, type: !150)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "To", scope: !147, file: !1, line: 148, type: !163)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Te", scope: !147, file: !1, line: 148, type: !163)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T1", scope: !147, file: !1, line: 148, type: !163)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T2", scope: !147, file: !1, line: 148, type: !163)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T3", scope: !147, file: !1, line: 148, type: !163)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T4", scope: !147, file: !1, line: 148, type: !163)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T5", scope: !147, file: !1, line: 148, type: !163)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "N1", scope: !147, file: !1, line: 148, type: !163)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D1", scope: !147, file: !1, line: 148, type: !163)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D2", scope: !147, file: !1, line: 148, type: !163)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D3", scope: !147, file: !1, line: 148, type: !163)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D4", scope: !147, file: !1, line: 148, type: !163)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "D5", scope: !147, file: !1, line: 148, type: !163)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !147, file: !1, line: 149, type: !5)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !147, file: !1, line: 149, type: !5)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dz", scope: !147, file: !1, line: 149, type: !5)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !147, file: !1, line: 149, type: !5)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !147, file: !1, line: 149, type: !5)
!189 = !DISubprogram(name: "zoom_3d", scope: !1, file: !1, line: 205, type: !190, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_3dview*, float)* @zoom_3d, variables: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{!13, !150, !5}
!192 = !{!193, !194, !195, !196, !197, !198, !199}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !189, file: !1, line: 205, type: !150)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fac", arg: 2, scope: !189, file: !1, line: 205, type: !5)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !189, file: !1, line: 207, type: !5)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bm", scope: !189, file: !1, line: 208, type: !5)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr1", scope: !189, file: !1, line: 208, type: !5)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr2", scope: !189, file: !1, line: 208, type: !5)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !189, file: !1, line: 209, type: !13)
!200 = !DISubprogram(name: "rotate_3d", scope: !1, file: !1, line: 229, type: !201, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_3dview*, i32, i32)* @rotate_3d, variables: !203)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !150, !13, !13}
!203 = !{!204, !205, !206, !207, !208, !209, !210}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !200, file: !1, line: 229, type: !150)
