; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/atomprop.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_prop = type { [10 x i8], [10 x i8], float }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@get_mass.mass = internal global %struct.t_prop* null, align 8
@get_mass.nmass = internal global i32 0, align 4
@get_mass.maxmass = internal global i32 0, align 4
@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [131 x i8] c"WARNING: masses will be determined based on residue and atom names,\0A         this can deviate from the real mass of the atom type\0A\00", align 1
@.str1 = private unnamed_addr constant [13 x i8] c"atommass.dat\00", align 1
@debug = external global %struct.__sFILE*
@.str2 = private unnamed_addr constant [30 x i8] c"Mass of atom %s %s set to %g\0A\00", align 1
@get_vdw.vdwr = internal global %struct.t_prop* null, align 8
@get_vdw.nvdwr = internal global i32 0, align 4
@get_vdw.maxvdwr = internal global i32 0, align 4
@.str3 = private unnamed_addr constant [13 x i8] c"vdwradii.dat\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !189, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/atomprop.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !{!6, !75, !81, !91, !99, !106, !135, !143, !160, !164, !172, !179}
!6 = !DISubprogram(name: "__sputc", scope: !7, file: !7, line: 348, type: !8, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !7, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !7, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !7, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !7, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !7, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !7, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !7, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !7, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !7, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !7, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !7, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !7, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !7, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !7, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !7, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!10, !30, !39, !10}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !7, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !10}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !7, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !7, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!10, !30, !54, !10}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !7, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !7, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !7, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !7, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !7, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !7, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !7, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !7, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !7, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !6, file: !7, line: 348, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !6, file: !7, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!10, !10}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !10)
!81 = !DISubprogram(name: "get_mass", scope: !1, file: !1, line: 163, type: !82, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i8*)* @get_mass, variables: !87)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !39, !39}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !85, line: 87, baseType: !86)
!85 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!87 = !{!88, !89, !90}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resnm", arg: 1, scope: !81, file: !1, line: 163, type: !39)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomnm", arg: 2, scope: !81, file: !1, line: 163, type: !39)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !81, file: !1, line: 165, type: !84)
!91 = !DISubprogram(name: "get_vdw", scope: !1, file: !1, line: 189, type: !92, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i8*, float)* @get_vdw, variables: !94)
!92 = !DISubroutineType(types: !93)
!93 = !{!84, !39, !39, !84}
!94 = !{!95, !96, !97, !98}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resnm", arg: 1, scope: !91, file: !1, line: 189, type: !39)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomnm", arg: 2, scope: !91, file: !1, line: 189, type: !39)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "default_r", arg: 3, scope: !91, file: !1, line: 189, type: !84)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !91, file: !1, line: 191, type: !84)
!99 = !DISubprogram(name: "get_dgsolv", scope: !1, file: !1, line: 211, type: !92, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: float (i8*, i8*, float)* @get_dgsolv, variables: !100)
!100 = !{!101, !102, !103, !104, !105}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resnm", arg: 1, scope: !99, file: !1, line: 211, type: !39)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomnm", arg: 2, scope: !99, file: !1, line: 211, type: !39)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "default_s", arg: 3, scope: !99, file: !1, line: 211, type: !84)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !99, file: !1, line: 216, type: !84)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !99, file: !1, line: 217, type: !10)
!106 = !DISubprogram(name: "read_props", scope: !1, file: !1, line: 64, type: !107, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.t_prop**, i32*)* @read_props, variables: !121)
!107 = !DISubroutineType(types: !108)
!108 = !{!10, !39, !109, !120}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_prop", file: !1, line: 49, baseType: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 45, size: 192, align: 32, elements: !113)
!113 = !{!114, !118, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !112, file: !1, line: 46, baseType: !115, size: 80, align: 8)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 10)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !112, file: !1, line: 47, baseType: !115, size: 80, align: 8, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !112, file: !1, line: 48, baseType: !84, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!121 = !{!122, !123, !124, !125, !126, !130, !131, !132, !134}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "propdata", arg: 1, scope: !106, file: !1, line: 64, type: !39)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "props", arg: 2, scope: !106, file: !1, line: 64, type: !109)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxprop", arg: 3, scope: !106, file: !1, line: 64, type: !120)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !106, file: !1, line: 66, type: !11)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !106, file: !1, line: 67, type: !127)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 4096)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resname", scope: !106, file: !1, line: 67, type: !115)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomname", scope: !106, file: !1, line: 67, type: !115)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !106, file: !1, line: 68, type: !133)
!133 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !106, file: !1, line: 69, type: !10)
!135 = !DISubprogram(name: "write_props", scope: !1, file: !1, line: 87, type: !136, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_prop*)* @write_props, variables: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !11, !10, !110}
!138 = !{!139, !140, !141, !142}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !135, file: !1, line: 87, type: !11)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprop", arg: 2, scope: !135, file: !1, line: 87, type: !10)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "props", arg: 3, scope: !135, file: !1, line: 87, type: !110)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !135, file: !1, line: 89, type: !10)
!143 = !DISubprogram(name: "get_prop", scope: !1, file: !1, line: 117, type: !144, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float*, i8*, i8*, i32, %struct.t_prop*)* @get_prop, variables: !147)
!144 = !DISubroutineType(types: !145)
!145 = !{!10, !146, !39, !39, !10, !110}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !143, file: !1, line: 117, type: !146)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resname", arg: 2, scope: !143, file: !1, line: 117, type: !39)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomnm", arg: 3, scope: !143, file: !1, line: 117, type: !39)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprop", arg: 4, scope: !143, file: !1, line: 118, type: !10)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "props", arg: 5, scope: !143, file: !1, line: 118, type: !110)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !143, file: !1, line: 120, type: !10)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !143, file: !1, line: 120, type: !10)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alen", scope: !143, file: !1, line: 120, type: !10)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rlen", scope: !143, file: !1, line: 120, type: !10)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "malen", scope: !143, file: !1, line: 120, type: !10)
