; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/block_tx.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }

@.str = private unnamed_addr constant [29 x i8] c"TX: Null pointer (size=%d)!\0A\00", align 1
@.str1 = private unnamed_addr constant [29 x i8] c"RX: Null pointer (size=%d)!\0A\00", align 1
@.str2 = private unnamed_addr constant [34 x i8] c"%d: size=%d, len=%d, rx_count=%d\0A\00", align 1
@.str3 = private unnamed_addr constant [13 x i8] c"block->index\00", align 1
@.str4 = private unnamed_addr constant [68 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/block_tx.c\00", align 1
@.str5 = private unnamed_addr constant [9 x i8] c"block->a\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable
define i32 @__sputc(i32 %_c, %struct.__sFILE* %_p) #0 {
  tail call void @llvm.dbg.value(metadata i32 %_c, i64 0, metadata !73, metadata !130), !dbg !131
  tail call void @llvm.dbg.value(metadata %struct.__sFILE* %_p, i64 0, metadata !74, metadata !130), !dbg !132

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/block_tx.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !{!7, !75, !81, !91, !100, !122}
!7 = !DISubprogram(name: "__sputc", scope: !8, file: !8, line: 348, type: !9, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !12}
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 153, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !8, line: 122, size: 1216, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21, !23, !24, !29, !30, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !14, file: !8, line: 123, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !14, file: !8, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !14, file: !8, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !8, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !14, file: !8, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !14, file: !8, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !8, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !8, line: 89, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !8, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !14, file: !8, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !14, file: !8, line: 132, baseType: !5, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !14, file: !8, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!11, !5}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !14, file: !8, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!11, !5, !39, !11}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !14, file: !8, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !44, !11}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !8, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !14, file: !8, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!11, !5, !54, !11}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !14, file: !8, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !14, file: !8, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !8, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !14, file: !8, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !14, file: !8, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !14, file: !8, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !14, file: !8, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !14, file: !8, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !8, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !7, file: !8, line: 348, type: !11)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !7, file: !8, line: 348, type: !12)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!11, !11}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !11)
!81 = !DISubprogram(name: "_blocktx", scope: !1, file: !1, line: 40, type: !82, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i8*)* @_blocktx, variables: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !11, !11, !11, !5}
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !81, file: !1, line: 40, type: !11)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nelem", arg: 2, scope: !81, file: !1, line: 40, type: !11)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !81, file: !1, line: 40, type: !11)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !81, file: !1, line: 40, type: !5)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !81, file: !1, line: 42, type: !11)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !81, file: !1, line: 43, type: !39)
!91 = !DISubprogram(name: "_blockrx", scope: !1, file: !1, line: 56, type: !82, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, i8*)* @_blockrx, variables: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !99}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !91, file: !1, line: 56, type: !11)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nelem", arg: 2, scope: !91, file: !1, line: 56, type: !11)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !91, file: !1, line: 56, type: !11)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !91, file: !1, line: 56, type: !5)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !91, file: !1, line: 58, type: !11)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !91, file: !1, line: 58, type: !11)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !91, file: !1, line: 59, type: !39)
!100 = !DISubprogram(name: "mv_block", scope: !1, file: !1, line: 74, type: !101, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.t_block*)* @mv_block, variables: !119)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !11, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !105, line: 52, baseType: !106)
!105 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 36, size: 8448, align: 64, elements: !107)
!107 = !{!108, !112, !113, !117, !118}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !106, file: !105, line: 37, baseType: !109, size: 8192, align: 32)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8192, align: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !106, file: !105, line: 43, baseType: !11, size: 32, align: 32, offset: 8192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !106, file: !105, line: 44, baseType: !114, size: 64, align: 64, offset: 8256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !116, line: 73, baseType: !11)
!116 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !106, file: !105, line: 45, baseType: !11, size: 32, align: 32, offset: 8320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !106, file: !105, line: 46, baseType: !114, size: 64, align: 64, offset: 8384)
!119 = !{!120, !121}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !100, file: !1, line: 74, type: !11)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 2, scope: !100, file: !1, line: 74, type: !103)
!122 = !DISubprogram(name: "ld_block", scope: !1, file: !1, line: 98, type: !101, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.t_block*)* @ld_block, variables: !123)
!123 = !{!124, !125}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !122, file: !1, line: 98, type: !11)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block", arg: 2, scope: !122, file: !1, line: 98, type: !103)
!126 = !{i32 2, !"Dwarf Version", i32 2}
!127 = !{i32 2, !"Debug Info Version", i32 700000003}
!128 = !{i32 1, !"PIC Level", i32 2}
!129 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!130 = !DIExpression()
!131 = !DILocation(line: 348, column: 40, scope: !7)
!132 = !DILocation(line: 348, column: 50, scope: !7)
!133 = !DILocation(line: 349, column: 12, scope: !134)
!134 = distinct !DILexicalBlock(scope: !7, file: !8, line: 349, column: 6)
!135 = !DILocation(line: 349, column: 6, scope: !134)
!136 = !{!137, !141, i64 12}
!137 = !{!"__sFILE", !138, i64 0, !141, i64 8, !141, i64 12, !142, i64 16, !142, i64 18, !143, i64 24, !141, i64 40, !138, i64 48, !138, i64 56, !138, i64 64, !138, i64 72, !138, i64 80, !143, i64 88, !138, i64 104, !141, i64 112, !139, i64 116, !139, i64 119, !143, i64 120, !141, i64 136, !144, i64 144}
!138 = !{!"any pointer", !139, i64 0}
!139 = !{!"omnipotent char", !140, i64 0}
!140 = !{!"Simple C/C++ TBAA"}
!141 = !{!"int", !139, i64 0}
!142 = !{!"short", !139, i64 0}
!143 = !{!"__sbuf", !138, i64 0, !141, i64 8}
!144 = !{!"long long", !139, i64 0}
!145 = !DILocation(line: 349, column: 15, scope: !134)
!146 = !DILocation(line: 349, column: 20, scope: !134)
!147 = !DILocation(line: 350, column: 10, scope: !134)
!148 = !DILocation(line: 349, column: 38, scope: !134)
!149 = !{!137, !141, i64 40}
!150 = !DILocation(line: 349, column: 31, scope: !134)
!151 = !DILocation(line: 349, column: 59, scope: !134)
!152 = !DILocation(line: 349, column: 47, scope: !134)
!153 = !DILocation(line: 350, column: 23, scope: !134)
!154 = !DILocation(line: 350, column: 16, scope: !134)
!155 = !DILocation(line: 350, column: 18, scope: !134)
!156 = !{!137, !138, i64 0}
!157 = !DILocation(line: 350, column: 21, scope: !134)
!158 = !{!139, !139, i64 0}
!159 = !DILocation(line: 350, column: 3, scope: !134)
!160 = !DILocation(line: 352, column: 11, scope: !134)
!161 = !DILocation(line: 352, column: 3, scope: !134)
!162 = !DILocation(line: 353, column: 1, scope: !7)
!163 = !DILocation(line: 114, column: 15, scope: !75)
!164 = !DILocation(line: 116, column: 20, scope: !75)
!165 = !DILocation(line: 116, column: 12, scope: !75)
!166 = !DILocation(line: 116, column: 57, scope: !75)
!167 = !DILocation(line: 116, column: 45, scope: !75)
!168 = !DILocation(line: 116, column: 5, scope: !75)
!169 = !DILocation(line: 40, column: 19, scope: !81)
!170 = !DILocation(line: 40, column: 28, scope: !81)
!171 = !DILocation(line: 40, column: 38, scope: !81)
!172 = !{!141, !141, i64 0}
!173 = !DILocation(line: 40, column: 49, scope: !81)
!174 = !DILocation(line: 43, column: 9, scope: !81)
!175 = !DILocation(line: 45, column: 12, scope: !176)
!176 = distinct !DILexicalBlock(scope: !81, file: !1, line: 45, column: 7)
!177 = !DILocation(line: 45, column: 29, scope: !176)
!178 = !DILocation(line: 45, column: 20, scope: !176)
!179 = !DILocation(line: 46, column: 5, scope: !176)
!180 = !DILocation(line: 48, column: 14, scope: !181)
!181 = distinct !DILexicalBlock(scope: !182, file: !1, line: 48, column: 3)
!182 = distinct !DILexicalBlock(scope: !81, file: !1, line: 48, column: 3)
