; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/calcmu.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

; Function Attrs: alwaysinline nounwind optsize readnone ssp uwtable
define i32 @__sigbits(i32 %__signo) #0 {
  tail call void @llvm.dbg.value(metadata i32 %__signo, i64 0, metadata !16, metadata !261), !dbg !262
  %1 = icmp sgt i32 %__signo, 32, !dbg !263
  br i1 %1, label %5, label %2, !dbg !264

; <label>:2                                       ; preds = %0
  %3 = add nsw i32 %__signo, -1, !dbg !265
  %4 = shl i32 1, %3, !dbg !266
  br label %5, !dbg !264

; <label>:5                                       ; preds = %0, %2
  %6 = phi i32 [ %4, %2 ], [ 0, %0 ], !dbg !264
  ret i32 %6, !dbg !267
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1


!27 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!28 = !{!29}
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !24, file: !18, line: 207, type: !27)
!30 = !DISubprogram(name: "__inline_isfinitel", scope: !18, file: !18, line: 210, type: !31, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !34)
!31 = !DISubroutineType(types: !32)
!32 = !{!4, !33}
!33 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!34 = !{!35}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !30, file: !18, line: 210, type: !33)
!36 = !DISubprogram(name: "__inline_isinff", scope: !18, file: !18, line: 213, type: !19, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !37)
!37 = !{!38}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !36, file: !18, line: 213, type: !21)
!39 = !DISubprogram(name: "__inline_isinfd", scope: !18, file: !18, line: 216, type: !25, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !40)
!40 = !{!41}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !39, file: !18, line: 216, type: !27)
!42 = !DISubprogram(name: "__inline_isinfl", scope: !18, file: !18, line: 219, type: !31, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !43)
!43 = !{!44}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !42, file: !18, line: 219, type: !33)
!45 = !DISubprogram(name: "__inline_isnanf", scope: !18, file: !18, line: 222, type: !19, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !46)
!46 = !{!47}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !45, file: !18, line: 222, type: !21)
!48 = !DISubprogram(name: "__inline_isnand", scope: !18, file: !18, line: 225, type: !25, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !49)
!49 = !{!50}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !48, file: !18, line: 225, type: !27)
!51 = !DISubprogram(name: "__inline_isnanl", scope: !18, file: !18, line: 228, type: !31, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !52)
!52 = !{!53}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !51, file: !18, line: 228, type: !33)
!54 = !DISubprogram(name: "__inline_signbitf", scope: !18, file: !18, line: 231, type: !19, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !55)
!55 = !{!56, !57}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !54, file: !18, line: 231, type: !21)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !54, file: !18, line: 232, type: !58)
!58 = !DICompositeType(tag: DW_TAG_union_type, scope: !54, file: !18, line: 232, size: 32, align: 32, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !58, file: !18, line: 232, baseType: !21, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !58, file: !18, line: 232, baseType: !62, size: 32, align: 32)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "__inline_signbitd", scope: !18, file: !18, line: 236, type: !25, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !64)
!64 = !{!65, !66}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !63, file: !18, line: 236, type: !27)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !63, file: !18, line: 237, type: !67)
!67 = !DICompositeType(tag: DW_TAG_union_type, scope: !63, file: !18, line: 237, size: 64, align: 64, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !67, file: !18, line: 237, baseType: !27, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !67, file: !18, line: 237, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!72 = !DISubprogram(name: "__inline_signbitl", scope: !18, file: !18, line: 242, type: !31, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !73)
!73 = !{!74, !75}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !72, file: !18, line: 242, type: !33)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !72, file: !18, line: 246, type: !76)
!76 = !DICompositeType(tag: DW_TAG_union_type, scope: !72, file: !18, line: 243, size: 128, align: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !76, file: !18, line: 244, baseType: !33, size: 128, align: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !76, file: !18, line: 245, baseType: !80, size: 128, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !18, line: 245, size: 128, align: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !80, file: !18, line: 245, baseType: !71, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !80, file: !18, line: 245, baseType: !84, size: 16, align: 16, offset: 64)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DISubprogram(name: "__inline_isnormalf", scope: !18, file: !18, line: 257, type: !19, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !86)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !85, file: !18, line: 257, type: !21)
!88 = !DISubprogram(name: "__inline_isnormald", scope: !18, file: !18, line: 260, type: !25, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !89)
!89 = !{!90}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !88, file: !18, line: 260, type: !27)
!91 = !DISubprogram(name: "__inline_isnormall", scope: !18, file: !18, line: 263, type: !31, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !92)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !91, file: !18, line: 263, type: !33)
!94 = !DISubprogram(name: "__sincosf", scope: !18, file: !18, line: 642, type: !95, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !21, !97, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!98 = !{!99, !100, !101, !102}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !94, file: !18, line: 642, type: !21)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !94, file: !18, line: 642, type: !97)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !94, file: !18, line: 642, type: !97)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !94, file: !18, line: 643, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !18, line: 634, size: 64, align: 32, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !104, file: !18, line: 634, baseType: !21, size: 32, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !104, file: !18, line: 634, baseType: !21, size: 32, align: 32, offset: 32)
!108 = !DISubprogram(name: "__sincos", scope: !18, file: !18, line: 647, type: !109, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !27, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!112 = !{!113, !114, !115, !116}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !108, file: !18, line: 647, type: !27)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !108, file: !18, line: 647, type: !111)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !108, file: !18, line: 647, type: !111)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !108, file: !18, line: 648, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !18, line: 635, size: 128, align: 64, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !118, file: !18, line: 635, baseType: !27, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !118, file: !18, line: 635, baseType: !27, size: 64, align: 64, offset: 64)
!122 = !DISubprogram(name: "__sincospif", scope: !18, file: !18, line: 652, type: !95, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !123)
!123 = !{!124, !125, !126, !127}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !122, file: !18, line: 652, type: !21)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !122, file: !18, line: 652, type: !97)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !122, file: !18, line: 652, type: !97)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !122, file: !18, line: 653, type: !103)
!128 = !DISubprogram(name: "__sincospi", scope: !18, file: !18, line: 657, type: !109, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !128, file: !18, line: 657, type: !27)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !128, file: !18, line: 657, type: !111)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !128, file: !18, line: 657, type: !111)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !128, file: !18, line: 658, type: !117)
!134 = !DISubprogram(name: "calc_mu_and_q", scope: !1, file: !1, line: 43, type: !135, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nsborder*, [3 x float]*, float*, float*, float*)* @calc_mu_and_q, variables: !164)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !156, !163, !163, !163}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !139, line: 59, baseType: !140)
!139 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!140 = !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 36, size: 32992, align: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !153, !154, !155}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !140, file: !139, line: 37, baseType: !4, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !140, file: !139, line: 38, baseType: !4, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !140, file: !139, line: 39, baseType: !4, size: 32, align: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !140, file: !139, line: 40, baseType: !4, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !140, file: !139, line: 41, baseType: !4, size: 32, align: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !140, file: !139, line: 43, baseType: !4, size: 32, align: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !140, file: !139, line: 43, baseType: !4, size: 32, align: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !140, file: !139, line: 50, baseType: !150, size: 8192, align: 32, offset: 224)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !140, file: !139, line: 51, baseType: !150, size: 8192, align: 32, offset: 8416)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !140, file: !139, line: 52, baseType: !150, size: 8192, align: 32, offset: 16608)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !140, file: !139, line: 55, baseType: !150, size: 8192, align: 32, offset: 24800)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !158, line: 101, baseType: !159)
!158 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 96, align: 32, elements: !161)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !158, line: 87, baseType: !21)
!161 = !{!162}
!162 = !DISubrange(count: 3)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 1, scope: !134, file: !1, line: 43, type: !137)
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !134, file: !1, line: 43, type: !156)
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "q", arg: 3, scope: !134, file: !1, line: 43, type: !163)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mu", arg: 4, scope: !134, file: !1, line: 43, type: !163)
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qsum", arg: 5, scope: !134, file: !1, line: 43, type: !163)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !134, file: !1, line: 45, type: !4)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !134, file: !1, line: 45, type: !4)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !134, file: !1, line: 45, type: !4)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !134, file: !1, line: 45, type: !4)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpmu", scope: !134, file: !1, line: 47, type: !175)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 192, align: 64, elements: !161)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpq", scope: !134, file: !1, line: 48, type: !27)
!177 = !DISubprogram(name: "read_mu", scope: !1, file: !1, line: 69, type: !178, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, float*, float*)* @read_mu, variables: !240)
!178 = !DISubroutineType(types: !179)
!179 = !{!4, !180, !163, !163}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !182, line: 153, baseType: !183)
!182 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !182, line: 122, size: 1216, align: 64, elements: !184)
!184 = !{!185, !188, !189, !190, !192, !193, !198, !199, !201, !205, !211, !220, !226, !227, !230, !231, !233, !237, !238, !239}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !183, file: !182, line: 123, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !183, file: !182, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !183, file: !182, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !183, file: !182, line: 126, baseType: !191, size: 16, align: 16, offset: 128)
!191 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !183, file: !182, line: 127, baseType: !191, size: 16, align: 16, offset: 144)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !183, file: !182, line: 128, baseType: !194, size: 128, align: 64, offset: 192)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !182, line: 88, size: 128, align: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !194, file: !182, line: 89, baseType: !186, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !194, file: !182, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !183, file: !182, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !183, file: !182, line: 132, baseType: !200, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !183, file: !182, line: 133, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!4, !200}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !183, file: !182, line: 134, baseType: !206, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!4, !200, !209, !4}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !183, file: !182, line: 135, baseType: !212, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!215, !200, !215, !4}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !182, line: 77, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !217, line: 71, baseType: !218)
!217 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !8, line: 46, baseType: !219)
!219 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !183, file: !182, line: 136, baseType: !221, size: 64, align: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!4, !200, !224, !4}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !183, file: !182, line: 139, baseType: !194, size: 128, align: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !183, file: !182, line: 140, baseType: !228, size: 64, align: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !182, line: 94, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !183, file: !182, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !183, file: !182, line: 144, baseType: !232, size: 24, align: 8, offset: 928)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 24, align: 8, elements: !161)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !183, file: !182, line: 145, baseType: !234, size: 8, align: 8, offset: 952)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8, align: 8, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 1)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !183, file: !182, line: 148, baseType: !194, size: 128, align: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !183, file: !182, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !183, file: !182, line: 152, baseType: !215, size: 64, align: 64, offset: 1152)
!240 = !{!241, !242, !243, !244}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !177, file: !1, line: 69, type: !180)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mu", arg: 2, scope: !177, file: !1, line: 69, type: !163)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vol", arg: 3, scope: !177, file: !1, line: 69, type: !163)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mmm", scope: !177, file: !1, line: 72, type: !245)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, align: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 4)
!248 = !DISubprogram(name: "copy_rvec", scope: !249, file: !249, line: 270, type: !250, isLocal: true, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, variables: !254)
!249 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!250 = !DISubroutineType(types: !251)
!251 = !{null, !252, !163}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!254 = !{!255, !256}
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !248, file: !249, line: 270, type: !252)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !248, file: !249, line: 270, type: !163)
!257 = !{i32 2, !"Dwarf Version", i32 2}
!258 = !{i32 2, !"Debug Info Version", i32 700000003}
!259 = !{i32 1, !"PIC Level", i32 2}
!260 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!261 = !DIExpression()
!262 = !DILocation(line: 114, column: 15, scope: !11)
!263 = !DILocation(line: 116, column: 20, scope: !11)
!264 = !DILocation(line: 116, column: 12, scope: !11)
!265 = !DILocation(line: 116, column: 57, scope: !11)
!266 = !DILocation(line: 116, column: 45, scope: !11)
!267 = !DILocation(line: 116, column: 5, scope: !11)
!268 = !DILocation(line: 204, column: 53, scope: !17)
!269 = !DILocation(line: 205, column: 16, scope: !17)
!270 = !DILocation(line: 205, column: 23, scope: !17)
!271 = !DILocation(line: 205, column: 26, scope: !17)
!272 = !DILocation(line: 205, column: 47, scope: !17)
!273 = !DILocation(line: 205, column: 5, scope: !17)
!274 = !DILocation(line: 207, column: 54, scope: !24)
!275 = !DILocation(line: 208, column: 16, scope: !24)
!276 = !DILocation(line: 208, column: 23, scope: !24)
!277 = !DILocation(line: 208, column: 26, scope: !24)
!278 = !DILocation(line: 208, column: 46, scope: !24)
!279 = !DILocation(line: 208, column: 5, scope: !24)
!280 = !DILocation(line: 210, column: 59, scope: !30)
!281 = !DILocation(line: 211, column: 16, scope: !30)
!282 = !DILocation(line: 211, column: 23, scope: !30)
!283 = !DILocation(line: 211, column: 26, scope: !30)
!284 = !DILocation(line: 211, column: 47, scope: !30)
!285 = !DILocation(line: 211, column: 5, scope: !30)
!286 = !DILocation(line: 213, column: 50, scope: !36)
!287 = !DILocation(line: 214, column: 12, scope: !36)
!288 = !DILocation(line: 214, column: 33, scope: !36)
!289 = !DILocation(line: 214, column: 5, scope: !36)
!290 = !DILocation(line: 216, column: 51, scope: !39)
!291 = !DILocation(line: 217, column: 12, scope: !39)
!292 = !DILocation(line: 217, column: 32, scope: !39)
!293 = !DILocation(line: 217, column: 5, scope: !39)
!294 = !DILocation(line: 219, column: 56, scope: !42)
!295 = !DILocation(line: 220, column: 12, scope: !42)
!296 = !DILocation(line: 220, column: 33, scope: !42)
!297 = !DILocation(line: 220, column: 5, scope: !42)
!298 = !DILocation(line: 222, column: 50, scope: !45)
!299 = !DILocation(line: 223, column: 16, scope: !45)
!300 = !DILocation(line: 223, column: 5, scope: !45)
!301 = !DILocation(line: 225, column: 51, scope: !48)
