; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/calcgrid.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@factor = global [6 x i32] [i32 2, i32 3, i32 5, i32 7, i32 11, i32 13], align 16
@.str = private unnamed_addr constant [33 x i8] c"invalid fourier grid spacing: %g\00", align 1
@ng = common global i32 0, align 4
@ng_max = common global i32 0, align 4
@n_list = common global i32 0, align 4
@n_list_alloc = common global i32 0, align 4
@list = common global i32* null, align 8
@decomp = common global [6 x i32] zeroinitializer, align 16
@__stderrp = external global %struct.__sFILE*
@.str1 = private unnamed_addr constant [47 x i8] c"Calculating fourier grid dimensions for%s%s%s\0A\00", align 1
@.str2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str3 = private unnamed_addr constant [3 x i8] c" X\00", align 1
@.str4 = private unnamed_addr constant [3 x i8] c" Y\00", align 1
@.str5 = private unnamed_addr constant [3 x i8] c" Z\00", align 1
@debug = external global %struct.__sFILE*
@.str6 = private unnamed_addr constant [10 x i8] c"grid: %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !120, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/calcgrid.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!7 = !{!8, !76, !82, !106, !112}
!8 = !DISubprogram(name: "__sputc", scope: !9, file: !9, line: 348, type: !10, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !73)
!9 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DISubroutineType(types: !11)
!11 = !{!5, !5, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !9, line: 153, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 122, size: 1216, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21, !23, !24, !29, !30, !32, !36, !41, !51, !57, !58, !61, !62, !66, !70, !71, !72}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !14, file: !9, line: 123, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !14, file: !9, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !14, file: !9, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !9, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !14, file: !9, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !14, file: !9, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !9, line: 89, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !9, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !14, file: !9, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !14, file: !9, line: 132, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !14, file: !9, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!5, !31}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !14, file: !9, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!5, !31, !40, !5}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !14, file: !9, line: 135, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !31, !45, !5}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !9, line: 77, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !14, file: !9, line: 136, baseType: !52, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!5, !31, !55, !5}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !14, file: !9, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !14, file: !9, line: 140, baseType: !59, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !9, line: 94, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !14, file: !9, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !14, file: !9, line: 144, baseType: !63, size: 24, align: 8, offset: 928)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !14, file: !9, line: 145, baseType: !67, size: 8, align: 8, offset: 952)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !14, file: !9, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !14, file: !9, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !9, line: 152, baseType: !45, size: 64, align: 64, offset: 1152)
!73 = !{!74, !75}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !8, file: !9, line: 348, type: !5)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !8, file: !9, line: 348, type: !12)
!76 = !DISubprogram(name: "__sigbits", scope: !77, file: !77, line: 114, type: !78, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !80)
!77 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DISubroutineType(types: !79)
!79 = !{!5, !5}
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !76, file: !77, line: 114, type: !5)
!82 = !DISubprogram(name: "calc_grid", scope: !1, file: !1, line: 73, type: !83, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: float ([3 x float]*, float, i32*, i32*, i32*, i32)* @calc_grid, variables: !90)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !88, !85, !6, !6, !6, !5}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !86, line: 87, baseType: !87)
!86 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!87 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, align: 32, elements: !64)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !100, !101, !102, !104, !105}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !82, file: !1, line: 73, type: !88)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gr_sp", arg: 2, scope: !82, file: !1, line: 73, type: !85)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 3, scope: !82, file: !1, line: 73, type: !6)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 4, scope: !82, file: !1, line: 73, type: !6)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 5, scope: !82, file: !1, line: 73, type: !6)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnodes", arg: 6, scope: !82, file: !1, line: 73, type: !5)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !82, file: !1, line: 75, type: !5)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !82, file: !1, line: 75, type: !99)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, align: 32, elements: !64)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !82, file: !1, line: 76, type: !5)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmin", scope: !82, file: !1, line: 76, type: !99)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "box_size", scope: !82, file: !1, line: 77, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !86, line: 101, baseType: !89)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "spacing", scope: !82, file: !1, line: 77, type: !103)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_spacing", scope: !82, file: !1, line: 78, type: !85)
!106 = !DISubprogram(name: "make_list", scope: !1, file: !1, line: 43, type: !107, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @make_list, variables: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !5}
!109 = !{!110, !111}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start_fac", arg: 1, scope: !106, file: !1, line: 43, type: !5)
