; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/confio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_symtab = type { i32, %struct.symbuf* }
%struct.symbuf = type { i32, i8**, %struct.symbuf* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_trxframe = type { i32, i32, i32, float, float, float, i32, i8*, i32, i32, i32, float, i32, float, i32, %struct.t_atoms*, i32, float, i32, [3 x float]*, i32, [3 x float]*, i32, [3 x float]*, i32, [3 x [3 x float]] }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }
%struct.t_tpxheader = type { i32, i32, i32, i32, i32, i32, i32, i32, float, float }
%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !19, globals: !683, imports: !687)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/confio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15}
!6 = !DIEnumerator(name: "egcTC", value: 0)
!7 = !DIEnumerator(name: "egcENER", value: 1)
!8 = !DIEnumerator(name: "egcACC", value: 2)
!9 = !DIEnumerator(name: "egcFREEZE", value: 3)
!10 = !DIEnumerator(name: "egcUser1", value: 4)
!11 = !DIEnumerator(name: "egcUser2", value: 5)
!12 = !DIEnumerator(name: "egcVCM", value: 6)
!13 = !DIEnumerator(name: "egcXTC", value: 7)
!14 = !DIEnumerator(name: "egcORFIT", value: 8)
!15 = !DIEnumerator(name: "egcNR", value: 9)
!16 = !{!17, !18}
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !{!20, !88, !94, !234, !246, !261, !266, !291, !304, !316, !331, !344, !370, !547, !573, !588, !596, !637, !645, !651, !659, !667, !673}
!20 = !DISubprogram(name: "__sputc", scope: !21, file: !21, line: 348, type: !22, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !85)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !24, !25}
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 153, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !21, line: 122, size: 1216, align: 64, elements: !28)
!28 = !{!29, !32, !33, !34, !36, !37, !42, !43, !44, !48, !53, !63, !69, !70, !73, !74, !78, !82, !83, !84}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !27, file: !21, line: 123, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !27, file: !21, line: 124, baseType: !24, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !27, file: !21, line: 125, baseType: !24, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !21, line: 126, baseType: !35, size: 16, align: 16, offset: 128)
!35 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !27, file: !21, line: 127, baseType: !35, size: 16, align: 16, offset: 144)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !27, file: !21, line: 128, baseType: !38, size: 128, align: 64, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !21, line: 88, size: 128, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !38, file: !21, line: 89, baseType: !30, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !38, file: !21, line: 90, baseType: !24, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !27, file: !21, line: 129, baseType: !24, size: 32, align: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !27, file: !21, line: 132, baseType: !18, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !27, file: !21, line: 133, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!24, !18}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !27, file: !21, line: 134, baseType: !49, size: 64, align: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!24, !18, !52, !24}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !27, file: !21, line: 135, baseType: !54, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !18, !57, !24}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !21, line: 77, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !27, file: !21, line: 136, baseType: !64, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!24, !18, !67, !24}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !27, file: !21, line: 139, baseType: !38, size: 128, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !27, file: !21, line: 140, baseType: !71, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !21, line: 94, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !27, file: !21, line: 141, baseType: !24, size: 32, align: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !27, file: !21, line: 144, baseType: !75, size: 24, align: 8, offset: 928)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !27, file: !21, line: 145, baseType: !79, size: 8, align: 8, offset: 952)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !27, file: !21, line: 148, baseType: !38, size: 128, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !27, file: !21, line: 151, baseType: !24, size: 32, align: 32, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !21, line: 152, baseType: !57, size: 64, align: 64, offset: 1152)
!85 = !{!86, !87}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !20, file: !21, line: 348, type: !24)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !20, file: !21, line: 348, type: !25)
!88 = !DISubprogram(name: "__sigbits", scope: !89, file: !89, line: 114, type: !90, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !92)
!89 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!90 = !DISubroutineType(types: !91)
!91 = !{!24, !24}
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !88, file: !89, line: 114, type: !24)
!94 = !DISubprogram(name: "read_g96_conf", scope: !1, file: !1, line: 177, type: !95, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, %struct.t_trxframe*)* @read_g96_conf, variables: !210)
!95 = !DISubroutineType(types: !96)
!96 = !{!24, !25, !52, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_trxframe", file: !99, line: 72, baseType: !100)
!99 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/trx.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 40, size: 1408, align: 64, elements: !101)
!101 = !{!102, !103, !104, !105, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !194, !195, !196, !197, !201, !202, !203, !204, !205, !206}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !99, line: 42, baseType: !24, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "not_ok", scope: !100, file: !99, line: 43, baseType: !24, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !100, file: !99, line: 44, baseType: !24, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "t0", scope: !100, file: !99, line: 45, baseType: !106, size: 32, align: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !107, line: 87, baseType: !108)
!107 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tpf", scope: !100, file: !99, line: 47, baseType: !106, size: 32, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tppf", scope: !100, file: !99, line: 49, baseType: !106, size: 32, align: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bTitle", scope: !100, file: !99, line: 52, baseType: !24, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !100, file: !99, line: 53, baseType: !52, size: 64, align: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bStep", scope: !100, file: !99, line: 54, baseType: !24, size: 32, align: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !100, file: !99, line: 55, baseType: !24, size: 32, align: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bTime", scope: !100, file: !99, line: 56, baseType: !24, size: 32, align: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !100, file: !99, line: 57, baseType: !106, size: 32, align: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bLambda", scope: !100, file: !99, line: 58, baseType: !24, size: 32, align: 32, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !100, file: !99, line: 59, baseType: !106, size: 32, align: 32, offset: 480)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bAtoms", scope: !100, file: !99, line: 60, baseType: !24, size: 32, align: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !100, file: !99, line: 61, baseType: !121, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !4, line: 94, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 75, size: 10240, align: 64, elements: !124)
!124 = !{!125, !126, !145, !148, !149, !150, !151, !152, !153, !154, !169, !177}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !123, file: !4, line: 76, baseType: !24, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !123, file: !4, line: 77, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !4, line: 57, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 320, align: 32, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !137, !138, !139, !140, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !129, file: !4, line: 49, baseType: !106, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !129, file: !4, line: 49, baseType: !106, size: 32, align: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !129, file: !4, line: 50, baseType: !106, size: 32, align: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !129, file: !4, line: 50, baseType: !106, size: 32, align: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !4, line: 51, baseType: !136, size: 16, align: 16, offset: 128)
!136 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !129, file: !4, line: 52, baseType: !136, size: 16, align: 16, offset: 144)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !129, file: !4, line: 53, baseType: !24, size: 32, align: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !129, file: !4, line: 54, baseType: !24, size: 32, align: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !129, file: !4, line: 55, baseType: !141, size: 72, align: 8, offset: 224)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 72, align: 8, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 9)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !129, file: !4, line: 56, baseType: !31, size: 8, align: 8, offset: 296)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !123, file: !4, line: 80, baseType: !146, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !123, file: !4, line: 82, baseType: !146, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !123, file: !4, line: 84, baseType: !146, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !123, file: !4, line: 86, baseType: !24, size: 32, align: 32, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !123, file: !4, line: 87, baseType: !146, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !123, file: !4, line: 89, baseType: !24, size: 32, align: 32, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !123, file: !4, line: 90, baseType: !146, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !123, file: !4, line: 91, baseType: !155, size: 8448, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !156, line: 52, baseType: !157)
!156 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!157 = !DICompositeType(tag: DW_TAG_structure_type, file: !156, line: 36, size: 8448, align: 64, elements: !158)
!158 = !{!159, !163, !164, !167, !168}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !157, file: !156, line: 37, baseType: !160, size: 8192, align: 32)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, align: 32, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !157, file: !156, line: 43, baseType: !24, size: 32, align: 32, offset: 8192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !157, file: !156, line: 44, baseType: !165, size: 64, align: 64, offset: 8256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !107, line: 73, baseType: !24)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !157, file: !156, line: 45, baseType: !24, size: 32, align: 32, offset: 8320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !157, file: !156, line: 46, baseType: !165, size: 64, align: 64, offset: 8384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !123, file: !4, line: 92, baseType: !170, size: 1152, align: 64, offset: 9024)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 1152, align: 64, elements: !142)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !4, line: 73, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 70, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !172, file: !4, line: 71, baseType: !24, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !172, file: !4, line: 72, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !123, file: !4, line: 93, baseType: !178, size: 64, align: 64, offset: 10176)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !4, line: 68, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 59, size: 416, align: 32, elements: !181)
!181 = !{!182, !183, !184, !185, !189, !190, !191, !192}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !4, line: 60, baseType: !24, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !180, file: !4, line: 61, baseType: !24, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !180, file: !4, line: 62, baseType: !17, size: 8, align: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !180, file: !4, line: 63, baseType: !186, size: 48, align: 8, offset: 72)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 48, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 6)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !180, file: !4, line: 64, baseType: !106, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !180, file: !4, line: 65, baseType: !106, size: 32, align: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !180, file: !4, line: 66, baseType: !24, size: 32, align: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !180, file: !4, line: 67, baseType: !193, size: 192, align: 32, offset: 224)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 32, elements: !187)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bPrec", scope: !100, file: !99, line: 62, baseType: !24, size: 32, align: 32, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !100, file: !99, line: 63, baseType: !106, size: 32, align: 32, offset: 672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bX", scope: !100, file: !99, line: 64, baseType: !24, size: 32, align: 32, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !100, file: !99, line: 65, baseType: !198, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !107, line: 101, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 96, align: 32, elements: !76)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "bV", scope: !100, file: !99, line: 66, baseType: !24, size: 32, align: 32, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !100, file: !99, line: 67, baseType: !198, size: 64, align: 64, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bF", scope: !100, file: !99, line: 68, baseType: !24, size: 32, align: 32, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !100, file: !99, line: 69, baseType: !198, size: 64, align: 64, offset: 1024)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bBox", scope: !100, file: !99, line: 70, baseType: !24, size: 32, align: 32, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !100, file: !99, line: 71, baseType: !207, size: 288, align: 32, offset: 1120)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !107, line: 103, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 288, align: 32, elements: !209)
!209 = !{!77, !77}
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !226, !227, !228, !229, !230, !231, !232, !233}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !94, file: !1, line: 177, type: !25)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 2, scope: !94, file: !1, line: 177, type: !52)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 3, scope: !94, file: !1, line: 177, type: !97)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bAtStart", scope: !94, file: !1, line: 182, type: !24)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bTime", scope: !94, file: !1, line: 182, type: !24)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bAtoms", scope: !94, file: !1, line: 182, type: !24)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bPos", scope: !94, file: !1, line: 182, type: !24)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bVel", scope: !94, file: !1, line: 182, type: !24)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bBox", scope: !94, file: !1, line: 182, type: !24)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bEnd", scope: !94, file: !1, line: 182, type: !24)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bFinished", scope: !94, file: !1, line: 182, type: !24)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natoms", scope: !94, file: !1, line: 183, type: !24)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbp", scope: !94, file: !1, line: 183, type: !24)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db1", scope: !94, file: !1, line: 184, type: !225)
!225 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db2", scope: !94, file: !1, line: 184, type: !225)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db3", scope: !94, file: !1, line: 184, type: !225)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db4", scope: !94, file: !1, line: 184, type: !225)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db5", scope: !94, file: !1, line: 184, type: !225)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db6", scope: !94, file: !1, line: 184, type: !225)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db7", scope: !94, file: !1, line: 184, type: !225)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db8", scope: !94, file: !1, line: 184, type: !225)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db9", scope: !94, file: !1, line: 184, type: !225)
!234 = !DISubprogram(name: "write_g96_conf", scope: !1, file: !1, line: 278, type: !235, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_trxframe*, i32, i32*)* @write_g96_conf, variables: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !25, !97, !24, !165}
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !234, file: !1, line: 278, type: !25)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !234, file: !1, line: 278, type: !97)
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nindex", arg: 3, scope: !234, file: !1, line: 279, type: !24)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !234, file: !1, line: 279, type: !165)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atoms", scope: !234, file: !1, line: 281, type: !121)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nout", scope: !234, file: !1, line: 282, type: !24)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !234, file: !1, line: 282, type: !24)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !234, file: !1, line: 282, type: !24)
!246 = !DISubprogram(name: "gro_next_x_or_v", scope: !1, file: !1, line: 565, type: !247, isLocal: false, isDefinition: true, scopeLine: 566, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_trxframe*)* @gro_next_x_or_v, variables: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{!24, !25, !97}
!249 = !{!250, !251, !252, !253, !257, !258, !259, !260}
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !246, file: !1, line: 565, type: !25)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !246, file: !1, line: 565, type: !97)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atoms", scope: !246, file: !1, line: 567, type: !122)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "title", scope: !246, file: !1, line: 568, type: !254)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32768, align: 8, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 4096)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !246, file: !1, line: 568, type: !52)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tt", scope: !246, file: !1, line: 569, type: !225)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndec", scope: !246, file: !1, line: 570, type: !24)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !246, file: !1, line: 570, type: !24)
!261 = !DISubprogram(name: "gro_first_x_or_v", scope: !1, file: !1, line: 613, type: !247, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_trxframe*)* @gro_first_x_or_v, variables: !262)
!262 = !{!263, !264, !265}
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !261, file: !1, line: 613, type: !25)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !261, file: !1, line: 613, type: !97)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "title", scope: !261, file: !1, line: 615, type: !254)
!266 = !DISubprogram(name: "write_hconf_indexed_p", scope: !1, file: !1, line: 634, type: !267, isLocal: false, isDefinition: true, scopeLine: 637, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, %struct.t_atoms*, i32, i32*, i32, [3 x float]*, [3 x float]*, [3 x float]*)* @write_hconf_indexed_p, variables: !270)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !25, !52, !121, !24, !165, !24, !198, !198, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !286, !287, !288, !289, !290}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !266, file: !1, line: 634, type: !25)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !266, file: !1, line: 634, type: !52)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !266, file: !1, line: 634, type: !121)
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 4, scope: !266, file: !1, line: 635, type: !24)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 5, scope: !266, file: !1, line: 635, type: !165)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pr", arg: 6, scope: !266, file: !1, line: 635, type: !24)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 7, scope: !266, file: !1, line: 636, type: !198)
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 8, scope: !266, file: !1, line: 636, type: !198)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 9, scope: !266, file: !1, line: 636, type: !269)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnm", scope: !266, file: !1, line: 638, type: !186)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nm", scope: !266, file: !1, line: 638, type: !186)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !266, file: !1, line: 638, type: !283)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 800, align: 8, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 100)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !266, file: !1, line: 639, type: !24)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !266, file: !1, line: 639, type: !24)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnr", scope: !266, file: !1, line: 639, type: !24)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !266, file: !1, line: 639, type: !24)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vpr", scope: !266, file: !1, line: 639, type: !24)
!291 = !DISubprogram(name: "write_hconf_p", scope: !1, file: !1, line: 706, type: !292, isLocal: false, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, %struct.t_atoms*, i32, [3 x float]*, [3 x float]*, [3 x float]*)* @write_hconf_p, variables: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !25, !52, !121, !24, !198, !198, !269}
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !291, file: !1, line: 706, type: !25)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !291, file: !1, line: 706, type: !52)
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !291, file: !1, line: 706, type: !121)
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pr", arg: 4, scope: !291, file: !1, line: 706, type: !24)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !291, file: !1, line: 707, type: !198)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 6, scope: !291, file: !1, line: 707, type: !198)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !291, file: !1, line: 707, type: !269)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aa", scope: !291, file: !1, line: 709, type: !165)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !291, file: !1, line: 710, type: !24)
!304 = !DISubprogram(name: "write_conf_p", scope: !1, file: !1, line: 719, type: !305, isLocal: false, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, %struct.t_atoms*, i32, [3 x float]*, [3 x float]*, [3 x float]*)* @write_conf_p, variables: !307)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !52, !52, !121, !24, !198, !198, !269}
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outfile", arg: 1, scope: !304, file: !1, line: 719, type: !52)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !304, file: !1, line: 719, type: !52)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !304, file: !1, line: 719, type: !121)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pr", arg: 4, scope: !304, file: !1, line: 719, type: !24)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !304, file: !1, line: 720, type: !198)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 6, scope: !304, file: !1, line: 720, type: !198)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !304, file: !1, line: 720, type: !269)
!315 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !304, file: !1, line: 722, type: !25)
!316 = !DISubprogram(name: "write_sto_conf_indexed", scope: !1, file: !1, line: 736, type: !317, isLocal: false, isDefinition: true, scopeLine: 739, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, %struct.t_atoms*, [3 x float]*, [3 x float]*, [3 x float]*, i32, i32*)* @write_sto_conf_indexed, variables: !319)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !52, !52, !121, !198, !198, !269, !166, !165}
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outfile", arg: 1, scope: !316, file: !1, line: 736, type: !52)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !316, file: !1, line: 736, type: !52)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !316, file: !1, line: 736, type: !121)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !316, file: !1, line: 737, type: !198)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !316, file: !1, line: 737, type: !198)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !316, file: !1, line: 737, type: !269)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nindex", arg: 7, scope: !316, file: !1, line: 738, type: !166)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 8, scope: !316, file: !1, line: 738, type: !165)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !316, file: !1, line: 740, type: !25)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftp", scope: !316, file: !1, line: 741, type: !24)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !316, file: !1, line: 742, type: !98)
!331 = !DISubprogram(name: "write_sto_conf", scope: !1, file: !1, line: 787, type: !332, isLocal: false, isDefinition: true, scopeLine: 789, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, %struct.t_atoms*, [3 x float]*, [3 x float]*, [3 x float]*)* @write_sto_conf, variables: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !52, !52, !121, !198, !198, !269}
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343}
!335 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outfile", arg: 1, scope: !331, file: !1, line: 787, type: !52)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !331, file: !1, line: 787, type: !52)
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !331, file: !1, line: 787, type: !121)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !331, file: !1, line: 788, type: !198)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !331, file: !1, line: 788, type: !198)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !331, file: !1, line: 788, type: !269)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !331, file: !1, line: 790, type: !25)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftp", scope: !331, file: !1, line: 791, type: !24)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !331, file: !1, line: 792, type: !98)
!344 = !DISubprogram(name: "get_stx_coordnum", scope: !1, file: !1, line: 835, type: !345, isLocal: false, isDefinition: true, scopeLine: 836, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32*)* @get_stx_coordnum, variables: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !52, !176}
!347 = !{!348, !349, !350, !351, !352, !353}
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 1, scope: !344, file: !1, line: 835, type: !52)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !344, file: !1, line: 835, type: !176)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !344, file: !1, line: 837, type: !25)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftp", scope: !344, file: !1, line: 838, type: !24)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !344, file: !1, line: 839, type: !98)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpx", scope: !354, file: !1, line: 867, type: !356)
!354 = distinct !DILexicalBlock(scope: !355, file: !1, line: 866, column: 15)
!355 = distinct !DILexicalBlock(scope: !344, file: !1, line: 842, column: 16)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_tpxheader", file: !357, line: 68, baseType: !358)
!357 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/tpxio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!358 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 55, size: 320, align: 32, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bIr", scope: !358, file: !357, line: 57, baseType: !24, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bBox", scope: !358, file: !357, line: 58, baseType: !24, size: 32, align: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bTop", scope: !358, file: !357, line: 59, baseType: !24, size: 32, align: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bX", scope: !358, file: !357, line: 60, baseType: !24, size: 32, align: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bV", scope: !358, file: !357, line: 61, baseType: !24, size: 32, align: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bF", scope: !358, file: !357, line: 62, baseType: !24, size: 32, align: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !358, file: !357, line: 64, baseType: !24, size: 32, align: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !358, file: !357, line: 65, baseType: !24, size: 32, align: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !358, file: !357, line: 66, baseType: !106, size: 32, align: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !358, file: !357, line: 67, baseType: !106, size: 32, align: 32, offset: 288)
!370 = !DISubprogram(name: "read_stx_conf", scope: !1, file: !1, line: 877, type: !332, isLocal: false, isDefinition: true, scopeLine: 879, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, %struct.t_atoms*, [3 x float]*, [3 x float]*, [3 x float]*)* @read_stx_conf, variables: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !381, !539, !540, !541, !542, !543, !544, !545, !546}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 1, scope: !370, file: !1, line: 877, type: !52)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !370, file: !1, line: 877, type: !52)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !370, file: !1, line: 877, type: !121)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !370, file: !1, line: 878, type: !198)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !370, file: !1, line: 878, type: !198)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !370, file: !1, line: 878, type: !269)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !370, file: !1, line: 880, type: !25)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !370, file: !1, line: 881, type: !380)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, align: 8, elements: !161)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top", scope: !370, file: !1, line: 882, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !384, line: 42, baseType: !385)
!384 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 36, size: 402112, align: 64, elements: !386)
!386 = !{!387, !388, !521, !522, !524}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !384, line: 37, baseType: !147, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !385, file: !384, line: 38, baseType: !389, size: 366336, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !390, line: 188, baseType: !391)
!390 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 179, size: 366336, align: 64, elements: !392)
!392 = !{!393, !394, !395, !396, !399, !509}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !391, file: !390, line: 181, baseType: !24, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !391, file: !390, line: 182, baseType: !24, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !391, file: !390, line: 183, baseType: !24, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !391, file: !390, line: 184, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !390, line: 133, baseType: !24)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !391, file: !390, line: 185, baseType: !400, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !390, line: 131, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_union_type, file: !390, line: 97, size: 192, align: 32, elements: !403)
!403 = !{!404, !410, !417, !423, !432, !437, !444, !452, !457, !462, !468, !473, !478, !487, !496, !505}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !402, file: !390, line: 105, baseType: !405, size: 96, align: 32)
!405 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 105, size: 96, align: 32, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !405, file: !390, line: 105, baseType: !106, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !405, file: !390, line: 105, baseType: !106, size: 32, align: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !405, file: !390, line: 105, baseType: !106, size: 32, align: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !402, file: !390, line: 106, baseType: !411, size: 128, align: 32)
!411 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 106, size: 128, align: 32, elements: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !411, file: !390, line: 106, baseType: !106, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !411, file: !390, line: 106, baseType: !106, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !411, file: !390, line: 106, baseType: !106, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !411, file: !390, line: 106, baseType: !106, size: 32, align: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !402, file: !390, line: 108, baseType: !418, size: 96, align: 32)
!418 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 108, size: 96, align: 32, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !418, file: !390, line: 108, baseType: !106, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !418, file: !390, line: 108, baseType: !106, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !418, file: !390, line: 108, baseType: !106, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !402, file: !390, line: 110, baseType: !424, size: 192, align: 32)
!424 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 110, size: 192, align: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !424, file: !390, line: 110, baseType: !106, size: 32, align: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !424, file: !390, line: 110, baseType: !106, size: 32, align: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !424, file: !390, line: 110, baseType: !106, size: 32, align: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !424, file: !390, line: 110, baseType: !106, size: 32, align: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !424, file: !390, line: 110, baseType: !106, size: 32, align: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !424, file: !390, line: 110, baseType: !106, size: 32, align: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !402, file: !390, line: 111, baseType: !433, size: 64, align: 32)
!433 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 111, size: 64, align: 32, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !433, file: !390, line: 111, baseType: !106, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !433, file: !390, line: 111, baseType: !106, size: 32, align: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !402, file: !390, line: 112, baseType: !438, size: 128, align: 32)
!438 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 112, size: 128, align: 32, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !438, file: !390, line: 112, baseType: !106, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !438, file: !390, line: 112, baseType: !106, size: 32, align: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !438, file: !390, line: 112, baseType: !106, size: 32, align: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !438, file: !390, line: 112, baseType: !106, size: 32, align: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !402, file: !390, line: 117, baseType: !445, size: 160, align: 32)
!445 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 117, size: 160, align: 32, elements: !446)
!446 = !{!447, !448, !449, !450, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !445, file: !390, line: 117, baseType: !106, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !445, file: !390, line: 117, baseType: !106, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !445, file: !390, line: 117, baseType: !24, size: 32, align: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !445, file: !390, line: 117, baseType: !106, size: 32, align: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !445, file: !390, line: 117, baseType: !106, size: 32, align: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !402, file: !390, line: 118, baseType: !453, size: 64, align: 32)
!453 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 118, size: 64, align: 32, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !453, file: !390, line: 118, baseType: !106, size: 32, align: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !453, file: !390, line: 118, baseType: !106, size: 32, align: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !402, file: !390, line: 123, baseType: !458, size: 64, align: 32)
!458 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 123, size: 64, align: 32, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !458, file: !390, line: 123, baseType: !106, size: 32, align: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !458, file: !390, line: 123, baseType: !106, size: 32, align: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !402, file: !390, line: 124, baseType: !463, size: 96, align: 32)
!463 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 124, size: 96, align: 32, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !463, file: !390, line: 124, baseType: !106, size: 32, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !463, file: !390, line: 124, baseType: !106, size: 32, align: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !463, file: !390, line: 124, baseType: !106, size: 32, align: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !402, file: !390, line: 125, baseType: !469, size: 192, align: 32)
!469 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 125, size: 192, align: 32, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !469, file: !390, line: 125, baseType: !200, size: 96, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !469, file: !390, line: 125, baseType: !200, size: 96, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !402, file: !390, line: 126, baseType: !474, size: 192, align: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 126, size: 192, align: 32, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !474, file: !390, line: 126, baseType: !477, size: 192, align: 32)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, align: 32, elements: !187)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !402, file: !390, line: 127, baseType: !479, size: 192, align: 32)
!479 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 127, size: 192, align: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !479, file: !390, line: 127, baseType: !106, size: 32, align: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !479, file: !390, line: 127, baseType: !106, size: 32, align: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !479, file: !390, line: 127, baseType: !106, size: 32, align: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !479, file: !390, line: 127, baseType: !106, size: 32, align: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !479, file: !390, line: 127, baseType: !106, size: 32, align: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !479, file: !390, line: 127, baseType: !106, size: 32, align: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !402, file: !390, line: 128, baseType: !488, size: 192, align: 32)
!488 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 128, size: 192, align: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !488, file: !390, line: 128, baseType: !106, size: 32, align: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !488, file: !390, line: 128, baseType: !106, size: 32, align: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !488, file: !390, line: 128, baseType: !106, size: 32, align: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !488, file: !390, line: 128, baseType: !106, size: 32, align: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !390, line: 128, baseType: !24, size: 32, align: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !488, file: !390, line: 128, baseType: !24, size: 32, align: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !402, file: !390, line: 129, baseType: !497, size: 192, align: 32)
!497 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 129, size: 192, align: 32, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !497, file: !390, line: 129, baseType: !24, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !497, file: !390, line: 129, baseType: !24, size: 32, align: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !497, file: !390, line: 129, baseType: !24, size: 32, align: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !497, file: !390, line: 129, baseType: !106, size: 32, align: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !497, file: !390, line: 129, baseType: !106, size: 32, align: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !497, file: !390, line: 129, baseType: !106, size: 32, align: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !402, file: !390, line: 130, baseType: !506, size: 192, align: 32)
!506 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !390, line: 130, size: 192, align: 32, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !506, file: !390, line: 130, baseType: !477, size: 192, align: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !391, file: !390, line: 187, baseType: !510, size: 366080, align: 64, offset: 256)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 366080, align: 64, elements: !519)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !390, line: 140, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 135, size: 8320, align: 64, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !512, file: !390, line: 137, baseType: !24, size: 32, align: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !512, file: !390, line: 138, baseType: !160, size: 8192, align: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !512, file: !390, line: 139, baseType: !517, size: 64, align: 64, offset: 8256)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !390, line: 45, baseType: !166)
!519 = !{!520}
!520 = !DISubrange(count: 44)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !385, file: !384, line: 39, baseType: !122, size: 10240, align: 64, offset: 366400)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !385, file: !384, line: 40, baseType: !523, size: 25344, align: 64, offset: 376640)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 25344, align: 64, elements: !76)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !385, file: !384, line: 41, baseType: !525, size: 128, align: 64, offset: 401984)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !526, line: 46, baseType: !527)
!526 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!527 = !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 42, size: 128, align: 64, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !527, file: !526, line: 44, baseType: !24, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !527, file: !526, line: 45, baseType: !531, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !526, line: 40, baseType: !533)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !526, line: 36, size: 192, align: 64, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !533, file: !526, line: 37, baseType: !24, size: 32, align: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !533, file: !526, line: 38, baseType: !147, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !526, line: 39, baseType: !538, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !370, file: !1, line: 883, type: !98)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !370, file: !1, line: 884, type: !24)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftp", scope: !370, file: !1, line: 884, type: !24)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natoms", scope: !370, file: !1, line: 884, type: !24)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !370, file: !1, line: 884, type: !24)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !370, file: !1, line: 885, type: !106)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r1", scope: !370, file: !1, line: 885, type: !106)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !370, file: !1, line: 885, type: !106)
!547 = !DISubprogram(name: "read_g96_pos", scope: !1, file: !1, line: 56, type: !548, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, variables: !551)
!548 = !DISubroutineType(types: !549)
!549 = !{!24, !52, !550, !25, !52, !97}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !547, file: !1, line: 56, type: !52)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symtab", arg: 2, scope: !547, file: !1, line: 56, type: !550)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 3, scope: !547, file: !1, line: 56, type: !25)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 4, scope: !547, file: !1, line: 56, type: !52)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 5, scope: !547, file: !1, line: 57, type: !97)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atoms", scope: !547, file: !1, line: 59, type: !121)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bEnd", scope: !547, file: !1, line: 60, type: !24)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nwanted", scope: !547, file: !1, line: 61, type: !24)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "natoms", scope: !547, file: !1, line: 61, type: !24)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atnr", scope: !547, file: !1, line: 61, type: !24)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnr", scope: !547, file: !1, line: 61, type: !24)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldres", scope: !547, file: !1, line: 61, type: !24)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newres", scope: !547, file: !1, line: 61, type: !24)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !547, file: !1, line: 61, type: !24)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "anm", scope: !547, file: !1, line: 62, type: !254)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnm", scope: !547, file: !1, line: 62, type: !254)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !547, file: !1, line: 63, type: !17)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !547, file: !1, line: 63, type: !17)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db1", scope: !547, file: !1, line: 64, type: !225)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db2", scope: !547, file: !1, line: 64, type: !225)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db3", scope: !547, file: !1, line: 64, type: !225)
