; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/constr.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_ilist = type { i32, [256 x i32], i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }
%struct.t_symtab = type { i32, %struct.symbuf* }

!144 = !DIEnumerator(name: "eNR_INL3220", value: 64)
!145 = !DIEnumerator(name: "eNR_INL3230", value: 65)
!146 = !DIEnumerator(name: "eNR_INL3300", value: 66)
!147 = !DIEnumerator(name: "eNR_INL3301", value: 67)
!148 = !DIEnumerator(name: "eNR_INL3302", value: 68)
!149 = !DIEnumerator(name: "eNR_INL3310", value: 69)
!150 = !DIEnumerator(name: "eNR_INL3320", value: 70)
!151 = !DIEnumerator(name: "eNR_INL3330", value: 71)
!152 = !DIEnumerator(name: "eNR_INL3400", value: 72)
!153 = !DIEnumerator(name: "eNR_INL3401", value: 73)
!154 = !DIEnumerator(name: "eNR_INL3402", value: 74)
!155 = !DIEnumerator(name: "eNR_INL3410", value: 75)
!156 = !DIEnumerator(name: "eNR_INL3420", value: 76)
!157 = !DIEnumerator(name: "eNR_INL3430", value: 77)
!158 = !DIEnumerator(name: "eNR_INLOOP", value: 78)
!159 = !DIEnumerator(name: "eNR_INL_IATOM", value: 78)
!160 = !DIEnumerator(name: "eNR_WEIGHTS", value: 79)
!161 = !DIEnumerator(name: "eNR_SPREADQ", value: 80)
!162 = !DIEnumerator(name: "eNR_SPREADQBSP", value: 81)
!163 = !DIEnumerator(name: "eNR_GATHERF", value: 82)
!164 = !DIEnumerator(name: "eNR_GATHERFBSP", value: 83)
!165 = !DIEnumerator(name: "eNR_FFT", value: 84)
!166 = !DIEnumerator(name: "eNR_CONV", value: 85)
!167 = !DIEnumerator(name: "eNR_SOLVEPME", value: 86)
!168 = !DIEnumerator(name: "eNR_NS", value: 87)
!169 = !DIEnumerator(name: "eNR_RESETX", value: 88)
!170 = !DIEnumerator(name: "eNR_SHIFTX", value: 89)
!171 = !DIEnumerator(name: "eNR_CGCM", value: 90)
!172 = !DIEnumerator(name: "eNR_FSUM", value: 91)
!173 = !DIEnumerator(name: "eNR_BONDS", value: 92)
!174 = !DIEnumerator(name: "eNR_G96BONDS", value: 93)
!175 = !DIEnumerator(name: "eNR_ANGLES", value: 94)
!176 = !DIEnumerator(name: "eNR_G96ANGLES", value: 95)
!177 = !DIEnumerator(name: "eNR_PROPER", value: 96)
!178 = !DIEnumerator(name: "eNR_IMPROPER", value: 97)
!179 = !DIEnumerator(name: "eNR_RB", value: 98)
!180 = !DIEnumerator(name: "eNR_DISRES", value: 99)
!181 = !DIEnumerator(name: "eNR_ORIRES", value: 100)
!182 = !DIEnumerator(name: "eNR_POSRES", value: 101)
!183 = !DIEnumerator(name: "eNR_ANGRES", value: 102)
!184 = !DIEnumerator(name: "eNR_ANGRESZ", value: 103)
!185 = !DIEnumerator(name: "eNR_MORSE", value: 104)
!186 = !DIEnumerator(name: "eNR_CUBICBONDS", value: 105)
!187 = !DIEnumerator(name: "eNR_WPOL", value: 106)
!188 = !DIEnumerator(name: "eNR_VIRIAL", value: 107)
!189 = !DIEnumerator(name: "eNR_UPDATE", value: 108)
!190 = !DIEnumerator(name: "eNR_EXTUPDATE", value: 109)
!191 = !DIEnumerator(name: "eNR_STOPCM", value: 110)
!192 = !DIEnumerator(name: "eNR_PCOUPL", value: 111)
!193 = !DIEnumerator(name: "eNR_EKIN", value: 112)
!194 = !DIEnumerator(name: "eNR_LINCS", value: 113)
!195 = !DIEnumerator(name: "eNR_LINCSMAT", value: 114)
!196 = !DIEnumerator(name: "eNR_SHAKE", value: 115)
!197 = !DIEnumerator(name: "eNR_SHAKE_V", value: 116)
!198 = !DIEnumerator(name: "eNR_SHAKE_RIJ", value: 117)
!199 = !DIEnumerator(name: "eNR_SHAKE_VIR", value: 118)
!200 = !DIEnumerator(name: "eNR_SETTLE", value: 119)
!201 = !DIEnumerator(name: "eNR_PSHAKEINITLD", value: 120)
!202 = !DIEnumerator(name: "eNR_PSHAKEINITMD", value: 121)
!203 = !DIEnumerator(name: "eNR_PSHAKE", value: 122)
!204 = !DIEnumerator(name: "eNR_DUM2", value: 123)
!205 = !DIEnumerator(name: "eNR_DUM3", value: 124)
!206 = !DIEnumerator(name: "eNR_DUM3FD", value: 125)
!207 = !DIEnumerator(name: "eNR_DUM3FAD", value: 126)
!208 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!209 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!210 = !DIEnumerator(name: "eNRNB", value: 129)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 106, size: 32, align: 32, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIEnumerator(name: "efepNO", value: 0)
!214 = !DIEnumerator(name: "efepYES", value: 1)
!215 = !DIEnumerator(name: "efepNR", value: 2)
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 79, size: 32, align: 32, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224}
!218 = !DIEnumerator(name: "eiMD", value: 0)
!219 = !DIEnumerator(name: "eiSteep", value: 1)
!220 = !DIEnumerator(name: "eiCG", value: 2)
!221 = !DIEnumerator(name: "eiBD", value: 3)
!222 = !DIEnumerator(name: "eiSD", value: 4)
!223 = !DIEnumerator(name: "eiNM", value: 5)
!224 = !DIEnumerator(name: "eiNR", value: 6)
!225 = !{!226, !227, !228, !233, !244, !246}
!226 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!227 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !229, line: 30, baseType: !230)
!229 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !231, line: 92, baseType: !232)
!231 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!232 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_sortblock", file: !1, line: 50, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 47, size: 128, align: 32, elements: !236)
!236 = !{!237, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "iatom", scope: !235, file: !1, line: 48, baseType: !238, size: 96, align: 32)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 96, align: 32, elements: !241)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !240, line: 73, baseType: !227)
!240 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!241 = !{!242}
!242 = !DISubrange(count: 3)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "blocknr", scope: !235, file: !1, line: 49, baseType: !239, size: 32, align: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !240, line: 87, baseType: !245)
!245 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!247 = !{!248, !313, !319, !325, !331, !337, !340, !343, !346, !349, !352, !355, !364, !373, !386, !389, !392, !395, !409, !423, !429, !435, !836, !854, !866, !890, !913, !958, !967, !982, !1028, !1083, !1087, !1093, !1105, !1117, !1122}
!248 = !DISubprogram(name: "__sputc", scope: !249, file: !249, line: 348, type: !250, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !310)
!249 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!250 = !DISubroutineType(types: !251)
!251 = !{!227, !227, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !249, line: 153, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !249, line: 122, size: 1216, align: 64, elements: !255)
!255 = !{!256, !259, !260, !261, !263, !264, !269, !270, !272, !276, !281, !290, !296, !297, !300, !301, !303, !307, !308, !309}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !254, file: !249, line: 123, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !254, file: !249, line: 124, baseType: !227, size: 32, align: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !254, file: !249, line: 125, baseType: !227, size: 32, align: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !254, file: !249, line: 126, baseType: !262, size: 16, align: 16, offset: 128)
!262 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !254, file: !249, line: 127, baseType: !262, size: 16, align: 16, offset: 144)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !254, file: !249, line: 128, baseType: !265, size: 128, align: 64, offset: 192)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !249, line: 88, size: 128, align: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !265, file: !249, line: 89, baseType: !257, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !265, file: !249, line: 90, baseType: !227, size: 32, align: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !254, file: !249, line: 129, baseType: !227, size: 32, align: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !254, file: !249, line: 132, baseType: !271, size: 64, align: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !254, file: !249, line: 133, baseType: !273, size: 64, align: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!227, !271}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !254, file: !249, line: 134, baseType: !277, size: 64, align: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!227, !271, !280, !227}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !254, file: !249, line: 135, baseType: !282, size: 64, align: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !271, !285, !227}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !249, line: 77, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !287, line: 71, baseType: !288)
!287 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !231, line: 46, baseType: !289)
!289 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !254, file: !249, line: 136, baseType: !291, size: 64, align: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!227, !271, !294, !227}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !254, file: !249, line: 139, baseType: !265, size: 128, align: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !254, file: !249, line: 140, baseType: !298, size: 64, align: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !249, line: 94, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !254, file: !249, line: 141, baseType: !227, size: 32, align: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !254, file: !249, line: 144, baseType: !302, size: 24, align: 8, offset: 928)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 24, align: 8, elements: !241)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !254, file: !249, line: 145, baseType: !304, size: 8, align: 8, offset: 952)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 8, align: 8, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 1)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !254, file: !249, line: 148, baseType: !265, size: 128, align: 64, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !254, file: !249, line: 151, baseType: !227, size: 32, align: 32, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !254, file: !249, line: 152, baseType: !285, size: 64, align: 64, offset: 1152)
!310 = !{!311, !312}
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !248, file: !249, line: 348, type: !227)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !248, file: !249, line: 348, type: !252)
!313 = !DISubprogram(name: "__sigbits", scope: !314, file: !314, line: 114, type: !315, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !317)
!314 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!315 = !DISubroutineType(types: !316)
!316 = !{!227, !227}
!317 = !{!318}
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !313, file: !314, line: 114, type: !227)
!319 = !DISubprogram(name: "__inline_isfinitef", scope: !320, file: !320, line: 204, type: !321, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !323)
!320 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!321 = !DISubroutineType(types: !322)
!322 = !{!227, !245}
!323 = !{!324}
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !319, file: !320, line: 204, type: !245)
!325 = !DISubprogram(name: "__inline_isfinited", scope: !320, file: !320, line: 207, type: !326, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !329)
!326 = !DISubroutineType(types: !327)
!327 = !{!227, !328}
!328 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!329 = !{!330}
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !325, file: !320, line: 207, type: !328)
!331 = !DISubprogram(name: "__inline_isfinitel", scope: !320, file: !320, line: 210, type: !332, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !335)
!332 = !DISubroutineType(types: !333)
!333 = !{!227, !334}
!334 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!335 = !{!336}
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !331, file: !320, line: 210, type: !334)
!337 = !DISubprogram(name: "__inline_isinff", scope: !320, file: !320, line: 213, type: !321, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !338)
!338 = !{!339}
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !337, file: !320, line: 213, type: !245)
!340 = !DISubprogram(name: "__inline_isinfd", scope: !320, file: !320, line: 216, type: !326, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !341)
!341 = !{!342}
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !340, file: !320, line: 216, type: !328)
!343 = !DISubprogram(name: "__inline_isinfl", scope: !320, file: !320, line: 219, type: !332, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !344)
!344 = !{!345}
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !343, file: !320, line: 219, type: !334)
!346 = !DISubprogram(name: "__inline_isnanf", scope: !320, file: !320, line: 222, type: !321, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !347)
!347 = !{!348}
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !346, file: !320, line: 222, type: !245)
!349 = !DISubprogram(name: "__inline_isnand", scope: !320, file: !320, line: 225, type: !326, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !350)
!350 = !{!351}
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !349, file: !320, line: 225, type: !328)
!352 = !DISubprogram(name: "__inline_isnanl", scope: !320, file: !320, line: 228, type: !332, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !353)
!353 = !{!354}
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !352, file: !320, line: 228, type: !334)
!355 = !DISubprogram(name: "__inline_signbitf", scope: !320, file: !320, line: 231, type: !321, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !356)
!356 = !{!357, !358}
!357 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !355, file: !320, line: 231, type: !245)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !355, file: !320, line: 232, type: !359)
!359 = !DICompositeType(tag: DW_TAG_union_type, scope: !355, file: !320, line: 232, size: 32, align: 32, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !359, file: !320, line: 232, baseType: !245, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !359, file: !320, line: 232, baseType: !363, size: 32, align: 32)
!363 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!364 = !DISubprogram(name: "__inline_signbitd", scope: !320, file: !320, line: 236, type: !326, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !365)
!365 = !{!366, !367}
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !364, file: !320, line: 236, type: !328)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !364, file: !320, line: 237, type: !368)
!368 = !DICompositeType(tag: DW_TAG_union_type, scope: !364, file: !320, line: 237, size: 64, align: 64, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !368, file: !320, line: 237, baseType: !328, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !368, file: !320, line: 237, baseType: !372, size: 64, align: 64)
!372 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!373 = !DISubprogram(name: "__inline_signbitl", scope: !320, file: !320, line: 242, type: !332, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !374)
!374 = !{!375, !376}
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !373, file: !320, line: 242, type: !334)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !373, file: !320, line: 246, type: !377)
!377 = !DICompositeType(tag: DW_TAG_union_type, scope: !373, file: !320, line: 243, size: 128, align: 128, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !377, file: !320, line: 244, baseType: !334, size: 128, align: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !377, file: !320, line: 245, baseType: !381, size: 128, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !320, line: 245, size: 128, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !381, file: !320, line: 245, baseType: !372, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !381, file: !320, line: 245, baseType: !385, size: 16, align: 16, offset: 64)
!385 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!386 = !DISubprogram(name: "__inline_isnormalf", scope: !320, file: !320, line: 257, type: !321, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !387)
!387 = !{!388}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !386, file: !320, line: 257, type: !245)
!389 = !DISubprogram(name: "__inline_isnormald", scope: !320, file: !320, line: 260, type: !326, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !390)
!390 = !{!391}
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !389, file: !320, line: 260, type: !328)
!392 = !DISubprogram(name: "__inline_isnormall", scope: !320, file: !320, line: 263, type: !332, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !393)
!393 = !{!394}
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !392, file: !320, line: 263, type: !334)
!395 = !DISubprogram(name: "__sincosf", scope: !320, file: !320, line: 642, type: !396, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !399)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !245, !398, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!399 = !{!400, !401, !402, !403}
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !395, file: !320, line: 642, type: !245)
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !395, file: !320, line: 642, type: !398)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !395, file: !320, line: 642, type: !398)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !395, file: !320, line: 643, type: !404)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !320, line: 634, size: 64, align: 32, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !405, file: !320, line: 634, baseType: !245, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !405, file: !320, line: 634, baseType: !245, size: 32, align: 32, offset: 32)
!409 = !DISubprogram(name: "__sincos", scope: !320, file: !320, line: 647, type: !410, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !413)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !328, !412, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!413 = !{!414, !415, !416, !417}
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !409, file: !320, line: 647, type: !328)
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !409, file: !320, line: 647, type: !412)
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !409, file: !320, line: 647, type: !412)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !409, file: !320, line: 648, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !320, line: 635, size: 128, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !419, file: !320, line: 635, baseType: !328, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !419, file: !320, line: 635, baseType: !328, size: 64, align: 64, offset: 64)
!423 = !DISubprogram(name: "__sincospif", scope: !320, file: !320, line: 652, type: !396, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !424)
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !423, file: !320, line: 652, type: !245)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !423, file: !320, line: 652, type: !398)
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !423, file: !320, line: 652, type: !398)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !423, file: !320, line: 653, type: !404)
!429 = !DISubprogram(name: "__sincospi", scope: !320, file: !320, line: 657, type: !410, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !429, file: !320, line: 657, type: !328)
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !429, file: !320, line: 657, type: !412)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !429, file: !320, line: 657, type: !412)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !429, file: !320, line: 658, type: !418)
!435 = !DISubprogram(name: "constrain", scope: !1, file: !1, line: 615, type: !436, isLocal: false, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_topology*, %struct.t_inputrec*, i32, %struct.t_mdatoms*, i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, float, float*, %struct.t_nrnb*, i32)* @constrain, variables: !820)
!436 = !DISubroutineType(types: !437)
!437 = !{!227, !252, !438, !665, !227, !782, !227, !227, !766, !766, !766, !811, !244, !762, !812, !227}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !440, line: 42, baseType: !441)
!440 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 36, size: 402112, align: 64, elements: !442)
!442 = !{!443, !445, !583, !648, !650}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !440, line: 37, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !441, file: !440, line: 38, baseType: !446, size: 366336, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !4, line: 188, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 179, size: 366336, align: 64, elements: !448)
!448 = !{!449, !450, !451, !452, !455, !568}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !447, file: !4, line: 181, baseType: !227, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !447, file: !4, line: 182, baseType: !227, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !447, file: !4, line: 183, baseType: !227, size: 32, align: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !447, file: !4, line: 184, baseType: !453, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !4, line: 133, baseType: !227)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !447, file: !4, line: 185, baseType: !456, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !4, line: 131, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_union_type, file: !4, line: 97, size: 192, align: 32, elements: !459)
!459 = !{!460, !466, !473, !479, !488, !493, !500, !508, !513, !518, !524, !530, !537, !546, !555, !564}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !458, file: !4, line: 105, baseType: !461, size: 96, align: 32)
!461 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 105, size: 96, align: 32, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !461, file: !4, line: 105, baseType: !244, size: 32, align: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !461, file: !4, line: 105, baseType: !244, size: 32, align: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !461, file: !4, line: 105, baseType: !244, size: 32, align: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !458, file: !4, line: 106, baseType: !467, size: 128, align: 32)
!467 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 106, size: 128, align: 32, elements: !468)
!468 = !{!469, !470, !471, !472}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !467, file: !4, line: 106, baseType: !244, size: 32, align: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !467, file: !4, line: 106, baseType: !244, size: 32, align: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !467, file: !4, line: 106, baseType: !244, size: 32, align: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !467, file: !4, line: 106, baseType: !244, size: 32, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !458, file: !4, line: 108, baseType: !474, size: 96, align: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 108, size: 96, align: 32, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !474, file: !4, line: 108, baseType: !244, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !474, file: !4, line: 108, baseType: !244, size: 32, align: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !474, file: !4, line: 108, baseType: !244, size: 32, align: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !458, file: !4, line: 110, baseType: !480, size: 192, align: 32)
!480 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 110, size: 192, align: 32, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !480, file: !4, line: 110, baseType: !244, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !480, file: !4, line: 110, baseType: !244, size: 32, align: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !480, file: !4, line: 110, baseType: !244, size: 32, align: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !480, file: !4, line: 110, baseType: !244, size: 32, align: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !480, file: !4, line: 110, baseType: !244, size: 32, align: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !480, file: !4, line: 110, baseType: !244, size: 32, align: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !458, file: !4, line: 111, baseType: !489, size: 64, align: 32)
!489 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 111, size: 64, align: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !489, file: !4, line: 111, baseType: !244, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !489, file: !4, line: 111, baseType: !244, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !458, file: !4, line: 112, baseType: !494, size: 128, align: 32)
!494 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 112, size: 128, align: 32, elements: !495)
!495 = !{!496, !497, !498, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !494, file: !4, line: 112, baseType: !244, size: 32, align: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !494, file: !4, line: 112, baseType: !244, size: 32, align: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !494, file: !4, line: 112, baseType: !244, size: 32, align: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !494, file: !4, line: 112, baseType: !244, size: 32, align: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !458, file: !4, line: 117, baseType: !501, size: 160, align: 32)
!501 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 117, size: 160, align: 32, elements: !502)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !501, file: !4, line: 117, baseType: !244, size: 32, align: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !501, file: !4, line: 117, baseType: !244, size: 32, align: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !501, file: !4, line: 117, baseType: !227, size: 32, align: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !501, file: !4, line: 117, baseType: !244, size: 32, align: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !501, file: !4, line: 117, baseType: !244, size: 32, align: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !458, file: !4, line: 118, baseType: !509, size: 64, align: 32)
!509 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 118, size: 64, align: 32, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !509, file: !4, line: 118, baseType: !244, size: 32, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !509, file: !4, line: 118, baseType: !244, size: 32, align: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !458, file: !4, line: 123, baseType: !514, size: 64, align: 32)
!514 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 123, size: 64, align: 32, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !514, file: !4, line: 123, baseType: !244, size: 32, align: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !514, file: !4, line: 123, baseType: !244, size: 32, align: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !458, file: !4, line: 124, baseType: !519, size: 96, align: 32)
!519 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 124, size: 96, align: 32, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !519, file: !4, line: 124, baseType: !244, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !519, file: !4, line: 124, baseType: !244, size: 32, align: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !519, file: !4, line: 124, baseType: !244, size: 32, align: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !458, file: !4, line: 125, baseType: !525, size: 192, align: 32)
!525 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 125, size: 192, align: 32, elements: !526)
!526 = !{!527, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !525, file: !4, line: 125, baseType: !528, size: 96, align: 32)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 96, align: 32, elements: !241)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !525, file: !4, line: 125, baseType: !528, size: 96, align: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !458, file: !4, line: 126, baseType: !531, size: 192, align: 32)
!531 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 126, size: 192, align: 32, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !531, file: !4, line: 126, baseType: !534, size: 192, align: 32)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, align: 32, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 6)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !458, file: !4, line: 127, baseType: !538, size: 192, align: 32)
!538 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 127, size: 192, align: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !538, file: !4, line: 127, baseType: !244, size: 32, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !538, file: !4, line: 127, baseType: !244, size: 32, align: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !538, file: !4, line: 127, baseType: !244, size: 32, align: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !538, file: !4, line: 127, baseType: !244, size: 32, align: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !538, file: !4, line: 127, baseType: !244, size: 32, align: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !538, file: !4, line: 127, baseType: !244, size: 32, align: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !458, file: !4, line: 128, baseType: !547, size: 192, align: 32)
!547 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 128, size: 192, align: 32, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !547, file: !4, line: 128, baseType: !244, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !547, file: !4, line: 128, baseType: !244, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !547, file: !4, line: 128, baseType: !244, size: 32, align: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !547, file: !4, line: 128, baseType: !244, size: 32, align: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !547, file: !4, line: 128, baseType: !227, size: 32, align: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !547, file: !4, line: 128, baseType: !227, size: 32, align: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !458, file: !4, line: 129, baseType: !556, size: 192, align: 32)
!556 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 129, size: 192, align: 32, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !556, file: !4, line: 129, baseType: !227, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !556, file: !4, line: 129, baseType: !227, size: 32, align: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !556, file: !4, line: 129, baseType: !227, size: 32, align: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !556, file: !4, line: 129, baseType: !244, size: 32, align: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !556, file: !4, line: 129, baseType: !244, size: 32, align: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !556, file: !4, line: 129, baseType: !244, size: 32, align: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !458, file: !4, line: 130, baseType: !565, size: 192, align: 32)
!565 = !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !4, line: 130, size: 192, align: 32, elements: !566)
!566 = !{!567}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !565, file: !4, line: 130, baseType: !534, size: 192, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !447, file: !4, line: 187, baseType: !569, size: 366080, align: 64, offset: 256)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 366080, align: 64, elements: !581)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !4, line: 140, baseType: !571)
!571 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 135, size: 8320, align: 64, elements: !572)
!572 = !{!573, !574, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !571, file: !4, line: 137, baseType: !227, size: 32, align: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !571, file: !4, line: 138, baseType: !575, size: 8192, align: 32, offset: 32)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 8192, align: 32, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !571, file: !4, line: 139, baseType: !579, size: 64, align: 64, offset: 8256)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !4, line: 45, baseType: !239)
!581 = !{!582}
!582 = !DISubrange(count: 44)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !441, file: !440, line: 39, baseType: !584, size: 10240, align: 64, offset: 366400)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !585, line: 94, baseType: !586)
!585 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!586 = !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 75, size: 10240, align: 64, elements: !587)
!587 = !{!588, !589, !607, !609, !610, !611, !612, !613, !614, !615, !626, !633}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !586, file: !585, line: 76, baseType: !227, size: 32, align: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !586, file: !585, line: 77, baseType: !590, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !585, line: 57, baseType: !592)
!592 = !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 48, size: 320, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !606}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !592, file: !585, line: 49, baseType: !244, size: 32, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !592, file: !585, line: 49, baseType: !244, size: 32, align: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !592, file: !585, line: 50, baseType: !244, size: 32, align: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !592, file: !585, line: 50, baseType: !244, size: 32, align: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !585, line: 51, baseType: !385, size: 16, align: 16, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !592, file: !585, line: 52, baseType: !385, size: 16, align: 16, offset: 144)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !592, file: !585, line: 53, baseType: !227, size: 32, align: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !592, file: !585, line: 54, baseType: !227, size: 32, align: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !592, file: !585, line: 55, baseType: !603, size: 72, align: 8, offset: 224)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 72, align: 8, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 9)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !592, file: !585, line: 56, baseType: !258, size: 8, align: 8, offset: 296)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !586, file: !585, line: 80, baseType: !608, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !586, file: !585, line: 82, baseType: !608, size: 64, align: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !586, file: !585, line: 84, baseType: !608, size: 64, align: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !586, file: !585, line: 86, baseType: !227, size: 32, align: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !586, file: !585, line: 87, baseType: !608, size: 64, align: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !586, file: !585, line: 89, baseType: !227, size: 32, align: 32, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !586, file: !585, line: 90, baseType: !608, size: 64, align: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !586, file: !585, line: 91, baseType: !616, size: 8448, align: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !617, line: 52, baseType: !618)
!617 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!618 = !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 36, size: 8448, align: 64, elements: !619)
!619 = !{!620, !621, !622, !624, !625}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !618, file: !617, line: 37, baseType: !575, size: 8192, align: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !618, file: !617, line: 43, baseType: !227, size: 32, align: 32, offset: 8192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !618, file: !617, line: 44, baseType: !623, size: 64, align: 64, offset: 8256)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !618, file: !617, line: 45, baseType: !227, size: 32, align: 32, offset: 8320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !618, file: !617, line: 46, baseType: !623, size: 64, align: 64, offset: 8384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !586, file: !585, line: 92, baseType: !627, size: 1152, align: 64, offset: 9024)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 1152, align: 64, elements: !604)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !585, line: 73, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 70, size: 128, align: 64, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !629, file: !585, line: 71, baseType: !227, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !629, file: !585, line: 72, baseType: !246, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !586, file: !585, line: 93, baseType: !634, size: 64, align: 64, offset: 10176)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !585, line: 68, baseType: !636)
!636 = !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 59, size: 416, align: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !643, !644, !645, !646}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !636, file: !585, line: 60, baseType: !227, size: 32, align: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !636, file: !585, line: 61, baseType: !227, size: 32, align: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !636, file: !585, line: 62, baseType: !226, size: 8, align: 8, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !636, file: !585, line: 63, baseType: !642, size: 48, align: 8, offset: 72)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 48, align: 8, elements: !535)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !636, file: !585, line: 64, baseType: !244, size: 32, align: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !636, file: !585, line: 65, baseType: !244, size: 32, align: 32, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !636, file: !585, line: 66, baseType: !227, size: 32, align: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !636, file: !585, line: 67, baseType: !647, size: 192, align: 32, offset: 224)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 192, align: 32, elements: !535)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !441, file: !440, line: 40, baseType: !649, size: 25344, align: 64, offset: 376640)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 25344, align: 64, elements: !241)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !441, file: !440, line: 41, baseType: !651, size: 128, align: 64, offset: 401984)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !652, line: 46, baseType: !653)
!652 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!653 = !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 42, size: 128, align: 64, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !653, file: !652, line: 44, baseType: !227, size: 32, align: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !653, file: !652, line: 45, baseType: !657, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !652, line: 40, baseType: !659)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !652, line: 36, size: 192, align: 64, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !659, file: !652, line: 37, baseType: !227, size: 32, align: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !659, file: !652, line: 38, baseType: !444, size: 64, align: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !659, file: !652, line: 39, baseType: !664, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !667, line: 143, baseType: !668)
!667 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!668 = !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 55, size: 4736, align: 64, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !773, !781}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !668, file: !667, line: 56, baseType: !227, size: 32, align: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !668, file: !667, line: 57, baseType: !227, size: 32, align: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !668, file: !667, line: 58, baseType: !227, size: 32, align: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !668, file: !667, line: 59, baseType: !227, size: 32, align: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !668, file: !667, line: 60, baseType: !227, size: 32, align: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !668, file: !667, line: 61, baseType: !227, size: 32, align: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !668, file: !667, line: 62, baseType: !227, size: 32, align: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !668, file: !667, line: 63, baseType: !227, size: 32, align: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !668, file: !667, line: 65, baseType: !227, size: 32, align: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !668, file: !667, line: 66, baseType: !227, size: 32, align: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !668, file: !667, line: 67, baseType: !227, size: 32, align: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !668, file: !667, line: 68, baseType: !227, size: 32, align: 32, offset: 352)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !668, file: !667, line: 69, baseType: !227, size: 32, align: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !668, file: !667, line: 70, baseType: !227, size: 32, align: 32, offset: 416)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !668, file: !667, line: 71, baseType: !244, size: 32, align: 32, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !668, file: !667, line: 72, baseType: !244, size: 32, align: 32, offset: 480)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !668, file: !667, line: 73, baseType: !244, size: 32, align: 32, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !668, file: !667, line: 74, baseType: !227, size: 32, align: 32, offset: 544)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !668, file: !667, line: 74, baseType: !227, size: 32, align: 32, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !668, file: !667, line: 74, baseType: !227, size: 32, align: 32, offset: 608)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !668, file: !667, line: 76, baseType: !227, size: 32, align: 32, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !668, file: !667, line: 77, baseType: !244, size: 32, align: 32, offset: 672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !668, file: !667, line: 79, baseType: !227, size: 32, align: 32, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !668, file: !667, line: 80, baseType: !227, size: 32, align: 32, offset: 736)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !668, file: !667, line: 81, baseType: !227, size: 32, align: 32, offset: 768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !668, file: !667, line: 82, baseType: !227, size: 32, align: 32, offset: 800)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !668, file: !667, line: 83, baseType: !227, size: 32, align: 32, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !668, file: !667, line: 84, baseType: !227, size: 32, align: 32, offset: 864)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !668, file: !667, line: 85, baseType: !227, size: 32, align: 32, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !668, file: !667, line: 86, baseType: !227, size: 32, align: 32, offset: 928)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !668, file: !667, line: 87, baseType: !244, size: 32, align: 32, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !668, file: !667, line: 88, baseType: !702, size: 288, align: 32, offset: 992)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !240, line: 105, baseType: !703)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 288, align: 32, elements: !704)
!704 = !{!242, !242}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !668, file: !667, line: 89, baseType: !702, size: 288, align: 32, offset: 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !668, file: !667, line: 90, baseType: !227, size: 32, align: 32, offset: 1568)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !668, file: !667, line: 91, baseType: !244, size: 32, align: 32, offset: 1600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !668, file: !667, line: 92, baseType: !244, size: 32, align: 32, offset: 1632)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !668, file: !667, line: 93, baseType: !227, size: 32, align: 32, offset: 1664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !668, file: !667, line: 94, baseType: !244, size: 32, align: 32, offset: 1696)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !668, file: !667, line: 95, baseType: !244, size: 32, align: 32, offset: 1728)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !668, file: !667, line: 96, baseType: !227, size: 32, align: 32, offset: 1760)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !668, file: !667, line: 97, baseType: !244, size: 32, align: 32, offset: 1792)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !668, file: !667, line: 98, baseType: !244, size: 32, align: 32, offset: 1824)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !668, file: !667, line: 99, baseType: !244, size: 32, align: 32, offset: 1856)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !668, file: !667, line: 100, baseType: !227, size: 32, align: 32, offset: 1888)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !668, file: !667, line: 101, baseType: !244, size: 32, align: 32, offset: 1920)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !668, file: !667, line: 102, baseType: !244, size: 32, align: 32, offset: 1952)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !668, file: !667, line: 103, baseType: !227, size: 32, align: 32, offset: 1984)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !668, file: !667, line: 104, baseType: !244, size: 32, align: 32, offset: 2016)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !668, file: !667, line: 105, baseType: !244, size: 32, align: 32, offset: 2048)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !668, file: !667, line: 106, baseType: !244, size: 32, align: 32, offset: 2080)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !668, file: !667, line: 107, baseType: !244, size: 32, align: 32, offset: 2112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !668, file: !667, line: 108, baseType: !244, size: 32, align: 32, offset: 2144)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !668, file: !667, line: 109, baseType: !227, size: 32, align: 32, offset: 2176)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !668, file: !667, line: 110, baseType: !227, size: 32, align: 32, offset: 2208)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !668, file: !667, line: 111, baseType: !227, size: 32, align: 32, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !668, file: !667, line: 112, baseType: !244, size: 32, align: 32, offset: 2272)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !668, file: !667, line: 113, baseType: !244, size: 32, align: 32, offset: 2304)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !668, file: !667, line: 114, baseType: !244, size: 32, align: 32, offset: 2336)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !668, file: !667, line: 115, baseType: !227, size: 32, align: 32, offset: 2368)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !668, file: !667, line: 116, baseType: !244, size: 32, align: 32, offset: 2400)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !668, file: !667, line: 117, baseType: !244, size: 32, align: 32, offset: 2432)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !668, file: !667, line: 118, baseType: !227, size: 32, align: 32, offset: 2464)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !668, file: !667, line: 120, baseType: !227, size: 32, align: 32, offset: 2496)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !668, file: !667, line: 122, baseType: !227, size: 32, align: 32, offset: 2528)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !668, file: !667, line: 124, baseType: !227, size: 32, align: 32, offset: 2560)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !668, file: !667, line: 125, baseType: !227, size: 32, align: 32, offset: 2592)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !668, file: !667, line: 126, baseType: !244, size: 32, align: 32, offset: 2624)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !668, file: !667, line: 127, baseType: !227, size: 32, align: 32, offset: 2656)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !668, file: !667, line: 128, baseType: !244, size: 32, align: 32, offset: 2688)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !668, file: !667, line: 129, baseType: !244, size: 32, align: 32, offset: 2720)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !668, file: !667, line: 130, baseType: !227, size: 32, align: 32, offset: 2752)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !668, file: !667, line: 131, baseType: !244, size: 32, align: 32, offset: 2784)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !668, file: !667, line: 132, baseType: !227, size: 32, align: 32, offset: 2816)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !668, file: !667, line: 133, baseType: !227, size: 32, align: 32, offset: 2848)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !668, file: !667, line: 134, baseType: !227, size: 32, align: 32, offset: 2880)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !668, file: !667, line: 135, baseType: !227, size: 32, align: 32, offset: 2912)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !668, file: !667, line: 136, baseType: !244, size: 32, align: 32, offset: 2944)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !668, file: !667, line: 137, baseType: !244, size: 32, align: 32, offset: 2976)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !668, file: !667, line: 138, baseType: !244, size: 32, align: 32, offset: 3008)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !668, file: !667, line: 139, baseType: !244, size: 32, align: 32, offset: 3040)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !668, file: !667, line: 140, baseType: !754, size: 512, align: 64, offset: 3072)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !667, line: 53, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 42, size: 512, align: 64, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !763, !764, !765, !768, !772}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !755, file: !667, line: 43, baseType: !227, size: 32, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !755, file: !667, line: 44, baseType: !227, size: 32, align: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !755, file: !667, line: 45, baseType: !227, size: 32, align: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !755, file: !667, line: 46, baseType: !227, size: 32, align: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !755, file: !667, line: 47, baseType: !762, size: 64, align: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !755, file: !667, line: 48, baseType: !762, size: 64, align: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !755, file: !667, line: 49, baseType: !762, size: 64, align: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !755, file: !667, line: 50, baseType: !766, size: 64, align: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !240, line: 101, baseType: !528)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !755, file: !667, line: 51, baseType: !769, size: 64, align: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !240, line: 107, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 96, align: 32, elements: !241)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !755, file: !667, line: 52, baseType: !246, size: 64, align: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !668, file: !667, line: 141, baseType: !774, size: 576, align: 64, offset: 3584)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 576, align: 64, elements: !241)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !667, line: 40, baseType: !776)
!776 = !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 36, size: 192, align: 64, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !776, file: !667, line: 37, baseType: !227, size: 32, align: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !776, file: !667, line: 38, baseType: !762, size: 64, align: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !776, file: !667, line: 39, baseType: !762, size: 64, align: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !668, file: !667, line: 142, baseType: !774, size: 576, align: 64, offset: 4160)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !784, line: 51, baseType: !785)
!784 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!785 = !DICompositeType(tag: DW_TAG_structure_type, file: !784, line: 40, size: 1408, align: 64, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !785, file: !784, line: 41, baseType: !244, size: 32, align: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !785, file: !784, line: 42, baseType: !227, size: 32, align: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !785, file: !784, line: 43, baseType: !762, size: 64, align: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !785, file: !784, line: 43, baseType: !762, size: 64, align: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !785, file: !784, line: 43, baseType: !762, size: 64, align: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !785, file: !784, line: 43, baseType: !762, size: 64, align: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !785, file: !784, line: 44, baseType: !762, size: 64, align: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !785, file: !784, line: 44, baseType: !762, size: 64, align: 64, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !785, file: !784, line: 44, baseType: !762, size: 64, align: 64, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !785, file: !784, line: 45, baseType: !246, size: 64, align: 64, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !785, file: !784, line: 46, baseType: !246, size: 64, align: 64, offset: 576)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !785, file: !784, line: 47, baseType: !246, size: 64, align: 64, offset: 640)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !785, file: !784, line: 47, baseType: !246, size: 64, align: 64, offset: 704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !785, file: !784, line: 48, baseType: !801, size: 64, align: 64, offset: 768)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !785, file: !784, line: 49, baseType: !801, size: 64, align: 64, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !785, file: !784, line: 49, baseType: !801, size: 64, align: 64, offset: 896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !785, file: !784, line: 49, baseType: !801, size: 64, align: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !785, file: !784, line: 49, baseType: !801, size: 64, align: 64, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !785, file: !784, line: 49, baseType: !801, size: 64, align: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !785, file: !784, line: 49, baseType: !801, size: 64, align: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !785, file: !784, line: 50, baseType: !801, size: 64, align: 64, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !785, file: !784, line: 50, baseType: !801, size: 64, align: 64, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !785, file: !784, line: 50, baseType: !801, size: 64, align: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !78, line: 95, baseType: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 93, size: 8256, align: 64, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !814, file: !78, line: 94, baseType: !817, size: 8256, align: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 8256, align: 64, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 129)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !435, file: !1, line: 615, type: !252)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !435, file: !1, line: 615, type: !438)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 3, scope: !435, file: !1, line: 615, type: !665)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 4, scope: !435, file: !1, line: 615, type: !227)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 5, scope: !435, file: !1, line: 616, type: !782)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 6, scope: !435, file: !1, line: 616, type: !227)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 7, scope: !435, file: !1, line: 616, type: !227)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !435, file: !1, line: 617, type: !766)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xprime", arg: 9, scope: !435, file: !1, line: 617, type: !766)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_proj", arg: 10, scope: !435, file: !1, line: 617, type: !766)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 11, scope: !435, file: !1, line: 617, type: !811)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 12, scope: !435, file: !1, line: 618, type: !244)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvdlambda", arg: 13, scope: !435, file: !1, line: 618, type: !762)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 14, scope: !435, file: !1, line: 618, type: !812)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bCoordinates", arg: 15, scope: !435, file: !1, line: 618, type: !227)
!836 = !DISubprogram(name: "count_constraints", scope: !1, file: !1, line: 624, type: !837, isLocal: false, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_topology*, %struct.t_commrec*)* @count_constraints, variables: !850)
!837 = !DISubroutineType(types: !838)
!838 = !{!227, !438, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !841, line: 40, baseType: !842)
!841 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!842 = !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 36, size: 192, align: 32, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !842, file: !841, line: 37, baseType: !227, size: 32, align: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !842, file: !841, line: 37, baseType: !227, size: 32, align: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !842, file: !841, line: 38, baseType: !227, size: 32, align: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !842, file: !841, line: 38, baseType: !227, size: 32, align: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !842, file: !841, line: 39, baseType: !227, size: 32, align: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !842, file: !841, line: 39, baseType: !227, size: 32, align: 32, offset: 160)
!850 = !{!851, !852, !853}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 1, scope: !836, file: !1, line: 624, type: !438)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !836, file: !1, line: 624, type: !839)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nc", scope: !836, file: !1, line: 626, type: !227)
!854 = !DISubprogram(name: "init_constraints", scope: !1, file: !1, line: 635, type: !855, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_topology*, %struct.t_inputrec*, %struct.t_mdatoms*, i32, i32, i32, %struct.t_commrec*)* @init_constraints, variables: !857)
!855 = !DISubroutineType(types: !856)
!856 = !{!227, !252, !438, !665, !782, !227, !227, !227, !839}
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865}
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !854, file: !1, line: 635, type: !252)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !854, file: !1, line: 635, type: !438)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 3, scope: !854, file: !1, line: 635, type: !665)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 4, scope: !854, file: !1, line: 636, type: !782)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !854, file: !1, line: 636, type: !227)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 6, scope: !854, file: !1, line: 636, type: !227)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOnlyCoords", arg: 7, scope: !854, file: !1, line: 636, type: !227)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 8, scope: !854, file: !1, line: 637, type: !839)
!866 = !DISubprogram(name: "lincs_warning", scope: !1, file: !1, line: 645, type: !867, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, [3 x float]*, i32, i32*, i32*, float*, float)* @lincs_warning, variables: !869)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !766, !766, !227, !246, !246, !762, !244}
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !866, file: !1, line: 645, type: !766)
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xprime", arg: 2, scope: !866, file: !1, line: 645, type: !766)
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ncons", arg: 3, scope: !866, file: !1, line: 646, type: !227)
!873 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bla1", arg: 4, scope: !866, file: !1, line: 646, type: !246)
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bla2", arg: 5, scope: !866, file: !1, line: 646, type: !246)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bllen", arg: 6, scope: !866, file: !1, line: 646, type: !762)
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wangle", arg: 7, scope: !866, file: !1, line: 646, type: !244)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !866, file: !1, line: 648, type: !227)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !866, file: !1, line: 648, type: !227)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !866, file: !1, line: 648, type: !227)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v0", scope: !866, file: !1, line: 649, type: !767)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v1", scope: !866, file: !1, line: 649, type: !767)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wfac", scope: !866, file: !1, line: 650, type: !244)
