; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/copyrite.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_citerec = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str1 = private unnamed_addr constant [4 x i8] c"%ds\00", align 1
@.str3 = private unnamed_addr constant [4 x i8] c"%*s\00", align 1
@.str4 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str6 = private unnamed_addr constant [42 x i8] c"Groningen Machine for Chemical Simulation\00", align 1
@cool_quote.buf = internal global [1024 x i8] zeroinitializer, align 16
@.str8 = private unnamed_addr constant [42 x i8] c"Thanx for Using GROMACS - Have a Nice Day\00", align 1
@.str10 = private unnamed_addr constant [20 x i8] c"G  R  O  M  A  C  S\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7, globals: !179, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/copyrite.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !{!8, !75, !81, !94, !99, !105, !111, !114, !118, !130, !137, !145, !146, !153, !165, !174}
!8 = !DISubprogram(name: "__sputc", scope: !9, file: !9, line: 348, type: !10, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!9 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!10 = !DISubroutineType(types: !11)
!11 = !{!5, !5, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !9, line: 153, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !9, line: 122, size: 1216, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21, !23, !24, !29, !30, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !14, file: !9, line: 123, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !14, file: !9, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !14, file: !9, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !9, line: 126, baseType: !22, size: 16, align: 16, offset: 128)
!22 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !14, file: !9, line: 127, baseType: !22, size: 16, align: 16, offset: 144)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !14, file: !9, line: 128, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !9, line: 88, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !25, file: !9, line: 89, baseType: !17, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !25, file: !9, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !14, file: !9, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !14, file: !9, line: 132, baseType: !6, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !14, file: !9, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !6}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !14, file: !9, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !6, !39, !5}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !14, file: !9, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !6, !44, !5}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !9, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !14, file: !9, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !6, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !14, file: !9, line: 139, baseType: !25, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !14, file: !9, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !9, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !14, file: !9, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !14, file: !9, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !14, file: !9, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !14, file: !9, line: 148, baseType: !25, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !14, file: !9, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !9, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !8, file: !9, line: 348, type: !5)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !8, file: !9, line: 348, type: !12)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !5}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !5)
!81 = !DISubprogram(name: "pr_difftime", scope: !1, file: !1, line: 57, type: !82, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, double)* @pr_difftime, variables: !85)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !12, !84}
!84 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !81, file: !1, line: 57, type: !12)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dt", arg: 2, scope: !81, file: !1, line: 57, type: !84)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndays", scope: !81, file: !1, line: 59, type: !5)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nhours", scope: !81, file: !1, line: 59, type: !5)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmins", scope: !81, file: !1, line: 59, type: !5)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsecs", scope: !81, file: !1, line: 59, type: !5)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bPrint", scope: !81, file: !1, line: 60, type: !5)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bPrinted", scope: !81, file: !1, line: 60, type: !5)
!94 = !DISubprogram(name: "be_cool", scope: !1, file: !1, line: 96, type: !95, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @be_cool, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!5}
!97 = !{!98}
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "envptr", scope: !94, file: !1, line: 99, type: !39)
!99 = !DISubprogram(name: "space", scope: !1, file: !1, line: 115, type: !100, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32)* @space, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !12, !5}
!102 = !{!103, !104}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !99, file: !1, line: 115, type: !12)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !99, file: !1, line: 115, type: !5)
!105 = !DISubprogram(name: "f", scope: !1, file: !1, line: 120, type: !106, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @f, variables: !108)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !39}
!108 = !{!109, !110}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !105, file: !1, line: 120, type: !39)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !105, file: !1, line: 120, type: !5)
!111 = !DISubprogram(name: "bromacs", scope: !1, file: !1, line: 173, type: !112, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @bromacs, variables: !2)
!112 = !DISubroutineType(types: !113)
!113 = !{!39}
!114 = !DISubprogram(name: "cool_quote", scope: !1, file: !1, line: 179, type: !112, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @cool_quote, variables: !115)
!115 = !{!116, !117}
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !114, file: !1, line: 182, type: !39)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !114, file: !1, line: 182, type: !39)
!118 = !DISubprogram(name: "CopyRight", scope: !1, file: !1, line: 199, type: !119, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*)* @CopyRight, variables: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !12, !39}
!121 = !{!122, !123, !124, !128, !129}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !118, file: !1, line: 199, type: !12)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "szProgram", arg: 2, scope: !118, file: !1, line: 199, type: !39)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !118, file: !1, line: 207, type: !125)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 256)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !118, file: !1, line: 208, type: !39)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !118, file: !1, line: 210, type: !5)
!130 = !DISubprogram(name: "thanx", scope: !1, file: !1, line: 245, type: !131, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*)* @thanx, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !12}
!133 = !{!134, !135, !136}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !130, file: !1, line: 245, type: !12)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cq", scope: !130, file: !1, line: 247, type: !39)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !130, file: !1, line: 247, type: !39)
!137 = !DISubprogram(name: "please_cite", scope: !1, file: !1, line: 270, type: !119, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*)* @please_cite, variables: !138)
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !137, file: !1, line: 270, type: !12)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !137, file: !1, line: 270, type: !39)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !137, file: !1, line: 366, type: !5)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !137, file: !1, line: 366, type: !5)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "author", scope: !137, file: !1, line: 367, type: !39)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "title", scope: !137, file: !1, line: 368, type: !39)
!145 = !DISubprogram(name: "GromacsVersion", scope: !1, file: !1, line: 396, type: !112, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @GromacsVersion, variables: !2)
!146 = !DISubprogram(name: "pr_two", scope: !1, file: !1, line: 49, type: !147, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32)* @pr_two, variables: !149)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !12, !5, !5}
!149 = !{!150, !151, !152}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !146, file: !1, line: 49, type: !12)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !146, file: !1, line: 49, type: !5)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !146, file: !1, line: 49, type: !5)
!153 = !DISubprogram(name: "pukeit", scope: !1, file: !1, line: 144, type: !154, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, variables: !156)
!154 = !DISubroutineType(types: !155)
!155 = !{!39, !39, !39}
!156 = !{!157, !158, !159, !160, !162, !163, !164}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "db", arg: 1, scope: !153, file: !1, line: 144, type: !39)
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "defstring", arg: 2, scope: !153, file: !1, line: 144, type: !39)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !153, file: !1, line: 147, type: !12)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "help", scope: !153, file: !1, line: 148, type: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !153, file: !1, line: 149, type: !5)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nhlp", scope: !153, file: !1, line: 149, type: !5)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seed", scope: !153, file: !1, line: 150, type: !5)
!165 = !DISubprogram(name: "ster_print", scope: !1, file: !1, line: 131, type: !119, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*)* @ster_print, variables: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !165, file: !1, line: 131, type: !12)
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !165, file: !1, line: 131, type: !39)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slen", scope: !165, file: !1, line: 133, type: !5)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !165, file: !1, line: 134, type: !171)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, align: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 128)
!174 = !DISubprogram(name: "sp_print", scope: !1, file: !1, line: 122, type: !119, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*)* @sp_print, variables: !175)
!175 = !{!176, !177, !178}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !174, file: !1, line: 122, type: !12)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !174, file: !1, line: 122, type: !39)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slen", scope: !174, file: !1, line: 124, type: !5)
!179 = !{!180, !181, !185, !200, !201, !205, !209, !212, !216}
!180 = !DIGlobalVariable(name: "cool", scope: !94, file: !1, line: 98, type: !5, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariable(name: "buf", scope: !114, file: !1, line: 181, type: !182, isLocal: true, isDefinition: true, variable: [1024 x i8]* @cool_quote.buf)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1024)
!185 = !DIGlobalVariable(name: "citedb", scope: !137, file: !1, line: 272, type: !186, isLocal: true, isDefinition: true, variable: [18 x %struct.t_citerec]* @please_cite.citedb)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 6912, align: 64, elements: !198)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_citerec", file: !1, line: 268, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 262, size: 384, align: 64, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !188, file: !1, line: 263, baseType: !39, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !188, file: !1, line: 264, baseType: !39, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !188, file: !1, line: 265, baseType: !39, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "journal", scope: !188, file: !1, line: 266, baseType: !39, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !188, file: !1, line: 267, baseType: !5, size: 32, align: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !188, file: !1, line: 267, baseType: !5, size: 32, align: 32, offset: 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "p0", scope: !188, file: !1, line: 267, baseType: !5, size: 32, align: 32, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !188, file: !1, line: 267, baseType: !5, size: 32, align: 32, offset: 352)
!198 = !{!199}
!199 = !DISubrange(count: 18)
!200 = !DIGlobalVariable(name: "bFirst", scope: !145, file: !1, line: 398, type: !5, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariable(name: "ver_string", scope: !145, file: !1, line: 399, type: !202, isLocal: true, isDefinition: true, variable: [100 x i8]* @GromacsVersion.ver_string)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, align: 8, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 100)
!205 = !DIGlobalVariable(name: "hulp", scope: !153, file: !1, line: 146, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 4096)
!209 = !DIGlobalVariable(name: "CopyrightText", scope: !0, file: !210, line: 52, type: !211, isLocal: true, isDefinition: true)
!210 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/copyrite.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, align: 64, elements: !67)
!212 = !DIGlobalVariable(name: "GPLText", scope: !0, file: !210, line: 56, type: !213, isLocal: true, isDefinition: true, variable: [4 x i8*]* @GPLText)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, align: 64, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 4)
!216 = !DIGlobalVariable(name: "nran", scope: !0, file: !1, line: 142, type: !5, isLocal: true, isDefinition: true)
!217 = !{i32 2, !"Dwarf Version", i32 2}
!218 = !{i32 2, !"Debug Info Version", i32 700000003}
!219 = !{i32 1, !"PIC Level", i32 2}
!220 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!221 = !DIExpression()
!222 = !DILocation(line: 348, column: 40, scope: !8)
!223 = !DILocation(line: 348, column: 50, scope: !8)
!224 = !DILocation(line: 349, column: 12, scope: !225)
!225 = distinct !DILexicalBlock(scope: !8, file: !9, line: 349, column: 6)
!226 = !DILocation(line: 349, column: 6, scope: !225)
!227 = !{!228, !232, i64 12}
!228 = !{!"__sFILE", !229, i64 0, !232, i64 8, !232, i64 12, !233, i64 16, !233, i64 18, !234, i64 24, !232, i64 40, !229, i64 48, !229, i64 56, !229, i64 64, !229, i64 72, !229, i64 80, !234, i64 88, !229, i64 104, !232, i64 112, !230, i64 116, !230, i64 119, !234, i64 120, !232, i64 136, !235, i64 144}
!229 = !{!"any pointer", !230, i64 0}
!230 = !{!"omnipotent char", !231, i64 0}
!231 = !{!"Simple C/C++ TBAA"}
!232 = !{!"int", !230, i64 0}
!233 = !{!"short", !230, i64 0}
!234 = !{!"__sbuf", !229, i64 0, !232, i64 8}
!235 = !{!"long long", !230, i64 0}
!236 = !DILocation(line: 349, column: 15, scope: !225)
!237 = !DILocation(line: 349, column: 20, scope: !225)
!238 = !DILocation(line: 350, column: 10, scope: !225)
!239 = !DILocation(line: 349, column: 38, scope: !225)
!240 = !{!228, !232, i64 40}
!241 = !DILocation(line: 349, column: 31, scope: !225)
!242 = !DILocation(line: 349, column: 59, scope: !225)
!243 = !DILocation(line: 349, column: 47, scope: !225)
!244 = !DILocation(line: 350, column: 23, scope: !225)
!245 = !DILocation(line: 350, column: 16, scope: !225)
!246 = !DILocation(line: 350, column: 18, scope: !225)
!247 = !{!228, !229, i64 0}
!248 = !DILocation(line: 350, column: 21, scope: !225)
!249 = !{!230, !230, i64 0}
!250 = !DILocation(line: 350, column: 3, scope: !225)
!251 = !DILocation(line: 352, column: 11, scope: !225)
!252 = !DILocation(line: 352, column: 3, scope: !225)
!253 = !DILocation(line: 353, column: 1, scope: !8)
!254 = !DILocation(line: 114, column: 15, scope: !75)
!255 = !DILocation(line: 116, column: 20, scope: !75)
!256 = !DILocation(line: 116, column: 12, scope: !75)
!257 = !DILocation(line: 116, column: 57, scope: !75)
!258 = !DILocation(line: 116, column: 45, scope: !75)
