; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/coupling.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }
%struct.t_cosines = type { i32, float*, float* }
%struct.t_nrnb = type { [129 x double] }

!68 = !DIEnumerator(name: "eNR_INL2410", value: 49)
!69 = !DIEnumerator(name: "eNR_INL2420", value: 50)
!70 = !DIEnumerator(name: "eNR_INL2430", value: 51)
!71 = !DIEnumerator(name: "eNR_INL3000", value: 52)
!72 = !DIEnumerator(name: "eNR_INL3001", value: 53)
!73 = !DIEnumerator(name: "eNR_INL3002", value: 54)
!74 = !DIEnumerator(name: "eNR_INL3010", value: 55)
!75 = !DIEnumerator(name: "eNR_INL3020", value: 56)
!76 = !DIEnumerator(name: "eNR_INL3030", value: 57)
!77 = !DIEnumerator(name: "eNR_INL3100", value: 58)
!78 = !DIEnumerator(name: "eNR_INL3110", value: 59)
!79 = !DIEnumerator(name: "eNR_INL3120", value: 60)
!80 = !DIEnumerator(name: "eNR_INL3130", value: 61)
!81 = !DIEnumerator(name: "eNR_INL3200", value: 62)
!82 = !DIEnumerator(name: "eNR_INL3210", value: 63)
!83 = !DIEnumerator(name: "eNR_INL3220", value: 64)
!84 = !DIEnumerator(name: "eNR_INL3230", value: 65)
!85 = !DIEnumerator(name: "eNR_INL3300", value: 66)
!86 = !DIEnumerator(name: "eNR_INL3301", value: 67)
!87 = !DIEnumerator(name: "eNR_INL3302", value: 68)
!88 = !DIEnumerator(name: "eNR_INL3310", value: 69)
!89 = !DIEnumerator(name: "eNR_INL3320", value: 70)
!90 = !DIEnumerator(name: "eNR_INL3330", value: 71)
!91 = !DIEnumerator(name: "eNR_INL3400", value: 72)
!92 = !DIEnumerator(name: "eNR_INL3401", value: 73)
!93 = !DIEnumerator(name: "eNR_INL3402", value: 74)
!94 = !DIEnumerator(name: "eNR_INL3410", value: 75)
!95 = !DIEnumerator(name: "eNR_INL3420", value: 76)
!96 = !DIEnumerator(name: "eNR_INL3430", value: 77)
!97 = !DIEnumerator(name: "eNR_INLOOP", value: 78)
!98 = !DIEnumerator(name: "eNR_INL_IATOM", value: 78)
!99 = !DIEnumerator(name: "eNR_WEIGHTS", value: 79)
!100 = !DIEnumerator(name: "eNR_SPREADQ", value: 80)
!101 = !DIEnumerator(name: "eNR_SPREADQBSP", value: 81)
!102 = !DIEnumerator(name: "eNR_GATHERF", value: 82)
!103 = !DIEnumerator(name: "eNR_GATHERFBSP", value: 83)
!104 = !DIEnumerator(name: "eNR_FFT", value: 84)
!105 = !DIEnumerator(name: "eNR_CONV", value: 85)
!106 = !DIEnumerator(name: "eNR_SOLVEPME", value: 86)
!107 = !DIEnumerator(name: "eNR_NS", value: 87)
!108 = !DIEnumerator(name: "eNR_RESETX", value: 88)
!109 = !DIEnumerator(name: "eNR_SHIFTX", value: 89)
!110 = !DIEnumerator(name: "eNR_CGCM", value: 90)
!111 = !DIEnumerator(name: "eNR_FSUM", value: 91)
!112 = !DIEnumerator(name: "eNR_BONDS", value: 92)
!113 = !DIEnumerator(name: "eNR_G96BONDS", value: 93)
!114 = !DIEnumerator(name: "eNR_ANGLES", value: 94)
!115 = !DIEnumerator(name: "eNR_G96ANGLES", value: 95)
!116 = !DIEnumerator(name: "eNR_PROPER", value: 96)
!117 = !DIEnumerator(name: "eNR_IMPROPER", value: 97)
!118 = !DIEnumerator(name: "eNR_RB", value: 98)
!119 = !DIEnumerator(name: "eNR_DISRES", value: 99)
!120 = !DIEnumerator(name: "eNR_ORIRES", value: 100)
!121 = !DIEnumerator(name: "eNR_POSRES", value: 101)
!122 = !DIEnumerator(name: "eNR_ANGRES", value: 102)
!123 = !DIEnumerator(name: "eNR_ANGRESZ", value: 103)
!124 = !DIEnumerator(name: "eNR_MORSE", value: 104)
!125 = !DIEnumerator(name: "eNR_CUBICBONDS", value: 105)
!126 = !DIEnumerator(name: "eNR_WPOL", value: 106)
!127 = !DIEnumerator(name: "eNR_VIRIAL", value: 107)
!128 = !DIEnumerator(name: "eNR_UPDATE", value: 108)
!129 = !DIEnumerator(name: "eNR_EXTUPDATE", value: 109)
!130 = !DIEnumerator(name: "eNR_STOPCM", value: 110)
!131 = !DIEnumerator(name: "eNR_PCOUPL", value: 111)
!132 = !DIEnumerator(name: "eNR_EKIN", value: 112)
!133 = !DIEnumerator(name: "eNR_LINCS", value: 113)
!134 = !DIEnumerator(name: "eNR_LINCSMAT", value: 114)
!135 = !DIEnumerator(name: "eNR_SHAKE", value: 115)
!136 = !DIEnumerator(name: "eNR_SHAKE_V", value: 116)
!137 = !DIEnumerator(name: "eNR_SHAKE_RIJ", value: 117)
!138 = !DIEnumerator(name: "eNR_SHAKE_VIR", value: 118)
!139 = !DIEnumerator(name: "eNR_SETTLE", value: 119)
!140 = !DIEnumerator(name: "eNR_PSHAKEINITLD", value: 120)
!141 = !DIEnumerator(name: "eNR_PSHAKEINITMD", value: 121)
!142 = !DIEnumerator(name: "eNR_PSHAKE", value: 122)
!143 = !DIEnumerator(name: "eNR_DUM2", value: 123)
!144 = !DIEnumerator(name: "eNR_DUM3", value: 124)
!145 = !DIEnumerator(name: "eNR_DUM3FD", value: 125)
!146 = !DIEnumerator(name: "eNR_DUM3FAD", value: 126)
!147 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!148 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!149 = !DIEnumerator(name: "eNRNB", value: 129)
!150 = !{!151, !152, !153}
!151 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!152 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!154 = !{!155, !222, !228, !235, !241, !247, !250, !253, !256, !259, !262, !265, !274, !283, !296, !299, !302, !305, !319, !333, !339, !345, !363, !369, !513, !549, !606, !616, !624, !629, !640, !647, !652, !657}
!155 = !DISubprogram(name: "__sputc", scope: !156, file: !156, line: 348, type: !157, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !219)
!156 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!157 = !DISubroutineType(types: !158)
!158 = !{!152, !152, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !156, line: 153, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !156, line: 122, size: 1216, align: 64, elements: !162)
!162 = !{!163, !166, !167, !168, !170, !171, !176, !177, !178, !182, !187, !197, !203, !204, !207, !208, !212, !216, !217, !218}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !161, file: !156, line: 123, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !161, file: !156, line: 124, baseType: !152, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !161, file: !156, line: 125, baseType: !152, size: 32, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !161, file: !156, line: 126, baseType: !169, size: 16, align: 16, offset: 128)
!169 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !161, file: !156, line: 127, baseType: !169, size: 16, align: 16, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !161, file: !156, line: 128, baseType: !172, size: 128, align: 64, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !156, line: 88, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !172, file: !156, line: 89, baseType: !164, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !172, file: !156, line: 90, baseType: !152, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !161, file: !156, line: 129, baseType: !152, size: 32, align: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !161, file: !156, line: 132, baseType: !153, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !161, file: !156, line: 133, baseType: !179, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!152, !153}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !161, file: !156, line: 134, baseType: !183, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!152, !153, !186, !152}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !161, file: !156, line: 135, baseType: !188, size: 64, align: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !153, !191, !152}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !156, line: 77, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !193, line: 71, baseType: !194)
!193 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !195, line: 46, baseType: !196)
!195 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!196 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !161, file: !156, line: 136, baseType: !198, size: 64, align: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!152, !153, !201, !152}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !161, file: !156, line: 139, baseType: !172, size: 128, align: 64, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !161, file: !156, line: 140, baseType: !205, size: 64, align: 64, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !156, line: 94, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !161, file: !156, line: 141, baseType: !152, size: 32, align: 32, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !161, file: !156, line: 144, baseType: !209, size: 24, align: 8, offset: 928)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 24, align: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !161, file: !156, line: 145, baseType: !213, size: 8, align: 8, offset: 952)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 8, align: 8, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 1)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !161, file: !156, line: 148, baseType: !172, size: 128, align: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !161, file: !156, line: 151, baseType: !152, size: 32, align: 32, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !161, file: !156, line: 152, baseType: !191, size: 64, align: 64, offset: 1152)
!219 = !{!220, !221}
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !155, file: !156, line: 348, type: !152)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !155, file: !156, line: 348, type: !159)
!222 = !DISubprogram(name: "__sigbits", scope: !223, file: !223, line: 114, type: !224, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !226)
!223 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!224 = !DISubroutineType(types: !225)
!225 = !{!152, !152}
!226 = !{!227}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !222, file: !223, line: 114, type: !152)
!228 = !DISubprogram(name: "__inline_isfinitef", scope: !229, file: !229, line: 204, type: !230, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !233)
!229 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!230 = !DISubroutineType(types: !231)
!231 = !{!152, !232}
!232 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!233 = !{!234}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !228, file: !229, line: 204, type: !232)
!235 = !DISubprogram(name: "__inline_isfinited", scope: !229, file: !229, line: 207, type: !236, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !239)
!236 = !DISubroutineType(types: !237)
!237 = !{!152, !238}
!238 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!239 = !{!240}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !235, file: !229, line: 207, type: !238)
!241 = !DISubprogram(name: "__inline_isfinitel", scope: !229, file: !229, line: 210, type: !242, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !245)
!242 = !DISubroutineType(types: !243)
!243 = !{!152, !244}
!244 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!245 = !{!246}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !241, file: !229, line: 210, type: !244)
!247 = !DISubprogram(name: "__inline_isinff", scope: !229, file: !229, line: 213, type: !230, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !248)
!248 = !{!249}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !247, file: !229, line: 213, type: !232)
!250 = !DISubprogram(name: "__inline_isinfd", scope: !229, file: !229, line: 216, type: !236, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !251)
!251 = !{!252}
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !250, file: !229, line: 216, type: !238)
!253 = !DISubprogram(name: "__inline_isinfl", scope: !229, file: !229, line: 219, type: !242, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !254)
!254 = !{!255}
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !253, file: !229, line: 219, type: !244)
!256 = !DISubprogram(name: "__inline_isnanf", scope: !229, file: !229, line: 222, type: !230, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !257)
!257 = !{!258}
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !256, file: !229, line: 222, type: !232)
!259 = !DISubprogram(name: "__inline_isnand", scope: !229, file: !229, line: 225, type: !236, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !260)
!260 = !{!261}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !259, file: !229, line: 225, type: !238)
!262 = !DISubprogram(name: "__inline_isnanl", scope: !229, file: !229, line: 228, type: !242, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !263)
!263 = !{!264}
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !262, file: !229, line: 228, type: !244)
!265 = !DISubprogram(name: "__inline_signbitf", scope: !229, file: !229, line: 231, type: !230, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !266)
!266 = !{!267, !268}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !265, file: !229, line: 231, type: !232)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !265, file: !229, line: 232, type: !269)
!269 = !DICompositeType(tag: DW_TAG_union_type, scope: !265, file: !229, line: 232, size: 32, align: 32, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !269, file: !229, line: 232, baseType: !232, size: 32, align: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !269, file: !229, line: 232, baseType: !273, size: 32, align: 32)
!273 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!274 = !DISubprogram(name: "__inline_signbitd", scope: !229, file: !229, line: 236, type: !236, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !275)
!275 = !{!276, !277}
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !274, file: !229, line: 236, type: !238)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !274, file: !229, line: 237, type: !278)
!278 = !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !229, line: 237, size: 64, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !278, file: !229, line: 237, baseType: !238, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !278, file: !229, line: 237, baseType: !282, size: 64, align: 64)
!282 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!283 = !DISubprogram(name: "__inline_signbitl", scope: !229, file: !229, line: 242, type: !242, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !284)
!284 = !{!285, !286}
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !283, file: !229, line: 242, type: !244)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !283, file: !229, line: 246, type: !287)
!287 = !DICompositeType(tag: DW_TAG_union_type, scope: !283, file: !229, line: 243, size: 128, align: 128, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !287, file: !229, line: 244, baseType: !244, size: 128, align: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !287, file: !229, line: 245, baseType: !291, size: 128, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !229, line: 245, size: 128, align: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !291, file: !229, line: 245, baseType: !282, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !291, file: !229, line: 245, baseType: !295, size: 16, align: 16, offset: 64)
!295 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!296 = !DISubprogram(name: "__inline_isnormalf", scope: !229, file: !229, line: 257, type: !230, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !297)
!297 = !{!298}
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !296, file: !229, line: 257, type: !232)
!299 = !DISubprogram(name: "__inline_isnormald", scope: !229, file: !229, line: 260, type: !236, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !300)
!300 = !{!301}
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !299, file: !229, line: 260, type: !238)
!302 = !DISubprogram(name: "__inline_isnormall", scope: !229, file: !229, line: 263, type: !242, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !303)
!303 = !{!304}
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !302, file: !229, line: 263, type: !244)
!305 = !DISubprogram(name: "__sincosf", scope: !229, file: !229, line: 642, type: !306, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !309)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !232, !308, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!309 = !{!310, !311, !312, !313}
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !305, file: !229, line: 642, type: !232)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !305, file: !229, line: 642, type: !308)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !305, file: !229, line: 642, type: !308)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !305, file: !229, line: 643, type: !314)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !229, line: 634, size: 64, align: 32, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !315, file: !229, line: 634, baseType: !232, size: 32, align: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !315, file: !229, line: 634, baseType: !232, size: 32, align: 32, offset: 32)
!319 = !DISubprogram(name: "__sincos", scope: !229, file: !229, line: 647, type: !320, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !323)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !238, !322, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!323 = !{!324, !325, !326, !327}
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !319, file: !229, line: 647, type: !238)
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !319, file: !229, line: 647, type: !322)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !319, file: !229, line: 647, type: !322)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !319, file: !229, line: 648, type: !328)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !229, line: 635, size: 128, align: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !329, file: !229, line: 635, baseType: !238, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !329, file: !229, line: 635, baseType: !238, size: 64, align: 64, offset: 64)
!333 = !DISubprogram(name: "__sincospif", scope: !229, file: !229, line: 652, type: !306, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !333, file: !229, line: 652, type: !232)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !333, file: !229, line: 652, type: !308)
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !333, file: !229, line: 652, type: !308)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !333, file: !229, line: 653, type: !314)
!339 = !DISubprogram(name: "__sincospi", scope: !229, file: !229, line: 657, type: !320, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !339, file: !229, line: 657, type: !238)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !339, file: !229, line: 657, type: !322)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !339, file: !229, line: 657, type: !322)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !339, file: !229, line: 658, type: !328)
!345 = !DISubprogram(name: "calc_pres", scope: !1, file: !1, line: 52, type: !346, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, float)* @calc_pres, variables: !352)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !152, !348, !348, !348, !348, !350}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 96, align: 32, elements: !210)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !351, line: 87, baseType: !232)
!351 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ePBC", arg: 1, scope: !345, file: !1, line: 52, type: !152)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 2, scope: !345, file: !1, line: 52, type: !348)
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ekin", arg: 3, scope: !345, file: !1, line: 52, type: !348)
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vir", arg: 4, scope: !345, file: !1, line: 52, type: !348)
!357 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pres", arg: 5, scope: !345, file: !1, line: 52, type: !348)
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Elr", arg: 6, scope: !345, file: !1, line: 52, type: !350)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !345, file: !1, line: 54, type: !152)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !345, file: !1, line: 54, type: !152)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fac", scope: !345, file: !1, line: 55, type: !350)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Plr", scope: !345, file: !1, line: 55, type: !350)
!363 = !DISubprogram(name: "calc_temp", scope: !1, file: !1, line: 90, type: !364, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float)* @calc_temp, variables: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!350, !350, !350}
!366 = !{!367, !368}
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ekin", arg: 1, scope: !363, file: !1, line: 90, type: !350)
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrdf", arg: 2, scope: !363, file: !1, line: 90, type: !350)
!369 = !DISubprogram(name: "parrinellorahman_pcoupl", scope: !1, file: !1, line: 98, type: !370, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_inputrec*, i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*)* @parrinellorahman_pcoupl, variables: !490)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372, !152, !348, !348, !348, !348}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !374, line: 143, baseType: !375)
!374 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 55, size: 4736, align: 64, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !481, !489}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !375, file: !374, line: 56, baseType: !152, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !375, file: !374, line: 57, baseType: !152, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !375, file: !374, line: 58, baseType: !152, size: 32, align: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !375, file: !374, line: 59, baseType: !152, size: 32, align: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !375, file: !374, line: 60, baseType: !152, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !375, file: !374, line: 61, baseType: !152, size: 32, align: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !375, file: !374, line: 62, baseType: !152, size: 32, align: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !375, file: !374, line: 63, baseType: !152, size: 32, align: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !375, file: !374, line: 65, baseType: !152, size: 32, align: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !375, file: !374, line: 66, baseType: !152, size: 32, align: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !375, file: !374, line: 67, baseType: !152, size: 32, align: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !375, file: !374, line: 68, baseType: !152, size: 32, align: 32, offset: 352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !375, file: !374, line: 69, baseType: !152, size: 32, align: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !375, file: !374, line: 70, baseType: !152, size: 32, align: 32, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !375, file: !374, line: 71, baseType: !350, size: 32, align: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !375, file: !374, line: 72, baseType: !350, size: 32, align: 32, offset: 480)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !375, file: !374, line: 73, baseType: !350, size: 32, align: 32, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !375, file: !374, line: 74, baseType: !152, size: 32, align: 32, offset: 544)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !375, file: !374, line: 74, baseType: !152, size: 32, align: 32, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !375, file: !374, line: 74, baseType: !152, size: 32, align: 32, offset: 608)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !375, file: !374, line: 76, baseType: !152, size: 32, align: 32, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !375, file: !374, line: 77, baseType: !350, size: 32, align: 32, offset: 672)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !375, file: !374, line: 79, baseType: !152, size: 32, align: 32, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !375, file: !374, line: 80, baseType: !152, size: 32, align: 32, offset: 736)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !375, file: !374, line: 81, baseType: !152, size: 32, align: 32, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !375, file: !374, line: 82, baseType: !152, size: 32, align: 32, offset: 800)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !375, file: !374, line: 83, baseType: !152, size: 32, align: 32, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !375, file: !374, line: 84, baseType: !152, size: 32, align: 32, offset: 864)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !375, file: !374, line: 85, baseType: !152, size: 32, align: 32, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !375, file: !374, line: 86, baseType: !152, size: 32, align: 32, offset: 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !375, file: !374, line: 87, baseType: !350, size: 32, align: 32, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !375, file: !374, line: 88, baseType: !409, size: 288, align: 32, offset: 992)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !351, line: 105, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 288, align: 32, elements: !411)
!411 = !{!211, !211}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !375, file: !374, line: 89, baseType: !409, size: 288, align: 32, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !375, file: !374, line: 90, baseType: !152, size: 32, align: 32, offset: 1568)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !375, file: !374, line: 91, baseType: !350, size: 32, align: 32, offset: 1600)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !375, file: !374, line: 92, baseType: !350, size: 32, align: 32, offset: 1632)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !375, file: !374, line: 93, baseType: !152, size: 32, align: 32, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !375, file: !374, line: 94, baseType: !350, size: 32, align: 32, offset: 1696)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !375, file: !374, line: 95, baseType: !350, size: 32, align: 32, offset: 1728)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !375, file: !374, line: 96, baseType: !152, size: 32, align: 32, offset: 1760)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !375, file: !374, line: 97, baseType: !350, size: 32, align: 32, offset: 1792)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !375, file: !374, line: 98, baseType: !350, size: 32, align: 32, offset: 1824)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !375, file: !374, line: 99, baseType: !350, size: 32, align: 32, offset: 1856)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !375, file: !374, line: 100, baseType: !152, size: 32, align: 32, offset: 1888)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !375, file: !374, line: 101, baseType: !350, size: 32, align: 32, offset: 1920)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !375, file: !374, line: 102, baseType: !350, size: 32, align: 32, offset: 1952)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !375, file: !374, line: 103, baseType: !152, size: 32, align: 32, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !375, file: !374, line: 104, baseType: !350, size: 32, align: 32, offset: 2016)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !375, file: !374, line: 105, baseType: !350, size: 32, align: 32, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !375, file: !374, line: 106, baseType: !350, size: 32, align: 32, offset: 2080)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !375, file: !374, line: 107, baseType: !350, size: 32, align: 32, offset: 2112)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !375, file: !374, line: 108, baseType: !350, size: 32, align: 32, offset: 2144)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !375, file: !374, line: 109, baseType: !152, size: 32, align: 32, offset: 2176)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !375, file: !374, line: 110, baseType: !152, size: 32, align: 32, offset: 2208)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !375, file: !374, line: 111, baseType: !152, size: 32, align: 32, offset: 2240)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !375, file: !374, line: 112, baseType: !350, size: 32, align: 32, offset: 2272)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !375, file: !374, line: 113, baseType: !350, size: 32, align: 32, offset: 2304)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !375, file: !374, line: 114, baseType: !350, size: 32, align: 32, offset: 2336)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !375, file: !374, line: 115, baseType: !152, size: 32, align: 32, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !375, file: !374, line: 116, baseType: !350, size: 32, align: 32, offset: 2400)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !375, file: !374, line: 117, baseType: !350, size: 32, align: 32, offset: 2432)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !375, file: !374, line: 118, baseType: !152, size: 32, align: 32, offset: 2464)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !375, file: !374, line: 120, baseType: !152, size: 32, align: 32, offset: 2496)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !375, file: !374, line: 122, baseType: !152, size: 32, align: 32, offset: 2528)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !375, file: !374, line: 124, baseType: !152, size: 32, align: 32, offset: 2560)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !375, file: !374, line: 125, baseType: !152, size: 32, align: 32, offset: 2592)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !375, file: !374, line: 126, baseType: !350, size: 32, align: 32, offset: 2624)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !375, file: !374, line: 127, baseType: !152, size: 32, align: 32, offset: 2656)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !375, file: !374, line: 128, baseType: !350, size: 32, align: 32, offset: 2688)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !375, file: !374, line: 129, baseType: !350, size: 32, align: 32, offset: 2720)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !375, file: !374, line: 130, baseType: !152, size: 32, align: 32, offset: 2752)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !375, file: !374, line: 131, baseType: !350, size: 32, align: 32, offset: 2784)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !375, file: !374, line: 132, baseType: !152, size: 32, align: 32, offset: 2816)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !375, file: !374, line: 133, baseType: !152, size: 32, align: 32, offset: 2848)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !375, file: !374, line: 134, baseType: !152, size: 32, align: 32, offset: 2880)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !375, file: !374, line: 135, baseType: !152, size: 32, align: 32, offset: 2912)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !375, file: !374, line: 136, baseType: !350, size: 32, align: 32, offset: 2944)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !375, file: !374, line: 137, baseType: !350, size: 32, align: 32, offset: 2976)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !375, file: !374, line: 138, baseType: !350, size: 32, align: 32, offset: 3008)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !375, file: !374, line: 139, baseType: !350, size: 32, align: 32, offset: 3040)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !375, file: !374, line: 140, baseType: !461, size: 512, align: 64, offset: 3072)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !374, line: 53, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 42, size: 512, align: 64, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !470, !471, !472, !475, !479}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !462, file: !374, line: 43, baseType: !152, size: 32, align: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !462, file: !374, line: 44, baseType: !152, size: 32, align: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !462, file: !374, line: 45, baseType: !152, size: 32, align: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !462, file: !374, line: 46, baseType: !152, size: 32, align: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !462, file: !374, line: 47, baseType: !469, size: 64, align: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !462, file: !374, line: 48, baseType: !469, size: 64, align: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !462, file: !374, line: 49, baseType: !469, size: 64, align: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !462, file: !374, line: 50, baseType: !473, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !351, line: 101, baseType: !349)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !462, file: !374, line: 51, baseType: !476, size: 64, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !351, line: 107, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 96, align: 32, elements: !210)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !462, file: !374, line: 52, baseType: !480, size: 64, align: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !375, file: !374, line: 141, baseType: !482, size: 576, align: 64, offset: 3584)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 576, align: 64, elements: !210)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !374, line: 40, baseType: !484)
!484 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 36, size: 192, align: 64, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !484, file: !374, line: 37, baseType: !152, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !484, file: !374, line: 38, baseType: !469, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !484, file: !374, line: 39, baseType: !469, size: 64, align: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !375, file: !374, line: 142, baseType: !482, size: 576, align: 64, offset: 4160)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 1, scope: !369, file: !1, line: 98, type: !372)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !369, file: !1, line: 98, type: !152)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pres", arg: 3, scope: !369, file: !1, line: 98, type: !348)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !369, file: !1, line: 99, type: !348)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "boxv", arg: 5, scope: !369, file: !1, line: 99, type: !348)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "M", arg: 6, scope: !369, file: !1, line: 99, type: !348)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !369, file: !1, line: 126, type: !152)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !369, file: !1, line: 126, type: !152)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vol", scope: !369, file: !1, line: 129, type: !350)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fac", scope: !369, file: !1, line: 130, type: !350)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atot", scope: !369, file: !1, line: 131, type: !350)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arel", scope: !369, file: !1, line: 131, type: !350)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "change", scope: !369, file: !1, line: 131, type: !350)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxchange", scope: !369, file: !1, line: 131, type: !350)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy_pressure", scope: !369, file: !1, line: 131, type: !350)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invbox", scope: !369, file: !1, line: 132, type: !409)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdiff", scope: !369, file: !1, line: 132, type: !409)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !369, file: !1, line: 132, type: !409)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !369, file: !1, line: 132, type: !409)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxl", scope: !511, file: !1, line: 135, type: !350)
!511 = distinct !DILexicalBlock(scope: !512, file: !1, line: 134, column: 14)
!512 = distinct !DILexicalBlock(scope: !369, file: !1, line: 134, column: 6)
!513 = !DISubprogram(name: "berendsen_pcoupl", scope: !1, file: !1, line: 228, type: !514, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_inputrec*, i32, [3 x float]*, [3 x float]*, i32, i32, [3 x float]*, i16*, %struct.t_nrnb*, [3 x i32]*)* @berendsen_pcoupl, variables: !525)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !372, !152, !348, !348, !152, !152, !473, !516, !517, !476}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !17, line: 95, baseType: !519)
!519 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 93, size: 8256, align: 64, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !519, file: !17, line: 94, baseType: !522, size: 8256, align: 64)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 8256, align: 64, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 129)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !544, !545}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 1, scope: !513, file: !1, line: 228, type: !372)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 2, scope: !513, file: !1, line: 228, type: !152)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pres", arg: 3, scope: !513, file: !1, line: 228, type: !348)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !513, file: !1, line: 229, type: !348)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !513, file: !1, line: 229, type: !152)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr_atoms", arg: 6, scope: !513, file: !1, line: 229, type: !152)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 7, scope: !513, file: !1, line: 230, type: !473)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cFREEZE", arg: 8, scope: !513, file: !1, line: 230, type: !516)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 9, scope: !513, file: !1, line: 231, type: !517)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nFreeze", arg: 10, scope: !513, file: !1, line: 231, type: !476)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !513, file: !1, line: 233, type: !152)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !513, file: !1, line: 233, type: !152)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !513, file: !1, line: 233, type: !152)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scalar_pressure", scope: !513, file: !1, line: 234, type: !350)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy_pressure", scope: !513, file: !1, line: 234, type: !350)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_corr_z", scope: !513, file: !1, line: 234, type: !350)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mu", scope: !513, file: !1, line: 235, type: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !351, line: 103, baseType: !410)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !513, file: !1, line: 236, type: !186)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !513, file: !1, line: 236, type: !546)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32768, align: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 4096)
!549 = !DISubprogram(name: "berendsen_tcoupl", scope: !1, file: !1, line: 341, type: !550, isLocal: false, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_grpopts*, %struct.t_groups*, float, float)* @berendsen_tcoupl, variables: !597)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !552, !553, !350, !350}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_groups", file: !555, line: 72, baseType: !556)
!555 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/group.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!556 = !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 67, size: 768, align: 64, elements: !557)
!557 = !{!558, !567, !577, !590}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "estat", scope: !556, file: !555, line: 68, baseType: !559, size: 512, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_ener", file: !555, line: 50, baseType: !560)
!560 = !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 46, size: 512, align: 64, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nn", scope: !560, file: !555, line: 47, baseType: !152, size: 32, align: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !560, file: !555, line: 48, baseType: !564, size: 448, align: 64, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 448, align: 64, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 7)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tcstat", scope: !556, file: !555, line: 69, baseType: !568, size: 64, align: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_tcstat", file: !555, line: 44, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 38, size: 416, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !570, file: !555, line: 39, baseType: !350, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !570, file: !555, line: 40, baseType: !350, size: 32, align: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ekin", scope: !570, file: !555, line: 41, baseType: !409, size: 288, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !570, file: !555, line: 42, baseType: !350, size: 32, align: 32, offset: 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !570, file: !555, line: 43, baseType: !350, size: 32, align: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "grpstat", scope: !556, file: !555, line: 70, baseType: !578, size: 64, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_acc", file: !555, line: 59, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 52, size: 448, align: 64, elements: !581)
!581 = !{!582, !583, !586, !587, !588, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nat", scope: !580, file: !555, line: 53, baseType: !152, size: 32, align: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "aid", scope: !580, file: !555, line: 54, baseType: !584, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !351, line: 73, baseType: !152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !580, file: !555, line: 55, baseType: !350, size: 32, align: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !580, file: !555, line: 56, baseType: !474, size: 96, align: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "uold", scope: !580, file: !555, line: 57, baseType: !474, size: 96, align: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ut", scope: !580, file: !555, line: 58, baseType: !474, size: 96, align: 32, offset: 352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cosacc", scope: !556, file: !555, line: 71, baseType: !591, size: 96, align: 32, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cos_acc", file: !555, line: 65, baseType: !592)
!592 = !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 61, size: 96, align: 32, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !592, file: !555, line: 62, baseType: !350, size: 32, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mvcos", scope: !592, file: !555, line: 63, baseType: !350, size: 32, align: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "vcos", scope: !592, file: !555, line: 64, baseType: !350, size: 32, align: 32, offset: 64)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 1, scope: !549, file: !1, line: 341, type: !552)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 2, scope: !549, file: !1, line: 341, type: !553)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dt", arg: 3, scope: !549, file: !1, line: 342, type: !350)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SAfactor", arg: 4, scope: !549, file: !1, line: 342, type: !350)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !549, file: !1, line: 344, type: !152)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !549, file: !1, line: 345, type: !350)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reft", scope: !549, file: !1, line: 345, type: !350)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lll", scope: !549, file: !1, line: 345, type: !350)
!606 = !DISubprogram(name: "nosehoover_tcoupl", scope: !1, file: !1, line: 364, type: !550, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_grpopts*, %struct.t_groups*, float, float)* @nosehoover_tcoupl, variables: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "opts", arg: 1, scope: !606, file: !1, line: 364, type: !552)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 2, scope: !606, file: !1, line: 364, type: !553)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dt", arg: 3, scope: !606, file: !1, line: 365, type: !350)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "SAfactor", arg: 4, scope: !606, file: !1, line: 365, type: !350)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !606, file: !1, line: 368, type: !152)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reft", scope: !606, file: !1, line: 369, type: !350)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xit", scope: !606, file: !1, line: 369, type: !350)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldxi", scope: !606, file: !1, line: 369, type: !350)
!616 = !DISubprogram(name: "clear_mat", scope: !617, file: !617, line: 334, type: !618, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, variables: !620)
!617 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!618 = !DISubroutineType(types: !619)
!619 = !{null, !348}
!620 = !{!621, !622}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !616, file: !617, line: 334, type: !348)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nul", scope: !616, file: !617, line: 336, type: !623)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!624 = !DISubprogram(name: "det", scope: !617, file: !617, line: 478, type: !625, isLocal: true, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, variables: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!350, !348}
!627 = !{!628}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !624, file: !617, line: 478, type: !348)
!629 = !DISubprogram(name: "m_inv", scope: !617, file: !617, line: 524, type: !630, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, variables: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !348, !348}
!632 = !{!633, !634, !635, !636, !637, !638, !639}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !629, file: !617, line: 524, type: !348)
