; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/csettle.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@csettle.bFirst = internal unnamed_addr global i1 false
@csettle.wo = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.wh = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.wohh = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.ra = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.rb = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.rc = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.rc2 = internal unnamed_addr global float 0.000000e+00, align 4
@csettle.rone = internal unnamed_addr global float 0.000000e+00, align 4
@.str = private unnamed_addr constant [35 x i8] c"Going to use C-settle (%d waters)\0A\00", align 1
@.str1 = private unnamed_addr constant [46 x i8] c"wo = %g, wh =%g, wohh = %g, rc = %g, ra = %g\0A\00", align 1
@.str2 = private unnamed_addr constant [50 x i8] c"rb = %g, rc2 = %g, rone = %g, dHH = %g, dOH = %g\0A\00", align 1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !2, subprograms: !3, globals: !183, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/csettle.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !11}
!4 = !DISubprogram(name: "__sigbits", scope: !5, file: !5, line: 114, type: !6, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !9)
!5 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8}
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !{!10}
!10 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !4, file: !5, line: 114, type: !8)
!11 = !DISubprogram(name: "csettle", scope: !1, file: !1, line: 63, type: !12, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*, float*, float*, float, float, float, float, i32*)* @csettle, variables: !82)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14, !8, !77, !78, !78, !79, !79, !79, !79, !77}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !16, line: 153, baseType: !17)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !16, line: 122, size: 1216, align: 64, elements: !18)
!18 = !{!19, !22, !23, !24, !26, !27, !32, !33, !35, !39, !45, !55, !61, !62, !65, !66, !70, !74, !75, !76}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !17, file: !16, line: 123, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !17, file: !16, line: 124, baseType: !8, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !17, file: !16, line: 125, baseType: !8, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !17, file: !16, line: 126, baseType: !25, size: 16, align: 16, offset: 128)
!25 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !17, file: !16, line: 127, baseType: !25, size: 16, align: 16, offset: 144)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !17, file: !16, line: 128, baseType: !28, size: 128, align: 64, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !16, line: 88, size: 128, align: 64, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !28, file: !16, line: 89, baseType: !20, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !28, file: !16, line: 90, baseType: !8, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !17, file: !16, line: 129, baseType: !8, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !17, file: !16, line: 132, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !17, file: !16, line: 133, baseType: !36, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!8, !34}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !17, file: !16, line: 134, baseType: !40, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!8, !34, !43, !8}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !17, file: !16, line: 135, baseType: !46, size: 64, align: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !34, !49, !8}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !16, line: 77, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !51, line: 71, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!54 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !17, file: !16, line: 136, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!8, !34, !59, !8}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !17, file: !16, line: 139, baseType: !28, size: 128, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !17, file: !16, line: 140, baseType: !63, size: 64, align: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !16, line: 94, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !17, file: !16, line: 141, baseType: !8, size: 32, align: 32, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !17, file: !16, line: 144, baseType: !67, size: 24, align: 8, offset: 928)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 24, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 3)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !17, file: !16, line: 145, baseType: !71, size: 8, align: 8, offset: 952)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !17, file: !16, line: 148, baseType: !28, size: 128, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !17, file: !16, line: 151, baseType: !8, size: 32, align: 32, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !17, file: !16, line: 152, baseType: !49, size: 64, align: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !80, line: 87, baseType: !81)
!80 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!81 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !11, file: !1, line: 63, type: !14)
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nshake", arg: 2, scope: !11, file: !1, line: 63, type: !8)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "owptr", arg: 3, scope: !11, file: !1, line: 63, type: !77)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b4", arg: 4, scope: !11, file: !1, line: 63, type: !78)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "after", arg: 5, scope: !11, file: !1, line: 63, type: !78)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dOH", arg: 6, scope: !11, file: !1, line: 64, type: !79)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dHH", arg: 7, scope: !11, file: !1, line: 64, type: !79)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mO", arg: 8, scope: !11, file: !1, line: 64, type: !79)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mH", arg: 9, scope: !11, file: !1, line: 64, type: !79)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error", arg: 10, scope: !11, file: !1, line: 64, type: !77)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gama", scope: !11, file: !1, line: 87, type: !79)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beta", scope: !11, file: !1, line: 87, type: !79)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alpa", scope: !11, file: !1, line: 87, type: !79)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xcom", scope: !11, file: !1, line: 87, type: !79)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ycom", scope: !11, file: !1, line: 87, type: !79)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zcom", scope: !11, file: !1, line: 87, type: !79)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "al2be2", scope: !11, file: !1, line: 87, type: !79)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !11, file: !1, line: 87, type: !79)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp2", scope: !11, file: !1, line: 87, type: !79)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "axlng", scope: !11, file: !1, line: 88, type: !79)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aylng", scope: !11, file: !1, line: 88, type: !79)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "azlng", scope: !11, file: !1, line: 88, type: !79)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trns11", scope: !11, file: !1, line: 88, type: !79)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trns21", scope: !11, file: !1, line: 88, type: !79)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trns31", scope: !11, file: !1, line: 88, type: !79)
