; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/do_fit.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }

@calc_fit_R.omega = internal unnamed_addr global double** null, align 8
@calc_fit_R.om = internal unnamed_addr global double** null, align 8
@.str = private unnamed_addr constant [6 x i8] c"omega\00", align 1
@.str1 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/do_fit.c\00", align 1
@.str2 = private unnamed_addr constant [3 x i8] c"om\00", align 1
@.str3 = private unnamed_addr constant [9 x i8] c"omega[i]\00", align 1
@.str4 = private unnamed_addr constant [6 x i8] c"om[i]\00", align 1
@debug = external global %struct.__sFILE*
@.str5 = private unnamed_addr constant [8 x i8] c"IROT=0\0A\00", align 1

; Function Attrs: alwaysinline nounwind optsize readnone ssp uwtable
define i32 @__inline_isfinitef(float %__x) #0 {

!18 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!19 = !{!20}
!20 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !15, file: !9, line: 207, type: !18)
!21 = !DISubprogram(name: "__inline_isfinitel", scope: !9, file: !9, line: 210, type: !22, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !25)
!22 = !DISubroutineType(types: !23)
!23 = !{!4, !24}
!24 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!25 = !{!26}
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !21, file: !9, line: 210, type: !24)
!27 = !DISubprogram(name: "__inline_isinff", scope: !9, file: !9, line: 213, type: !10, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !28)
!28 = !{!29}
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !27, file: !9, line: 213, type: !12)
!30 = !DISubprogram(name: "__inline_isinfd", scope: !9, file: !9, line: 216, type: !16, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !31)
!31 = !{!32}
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !30, file: !9, line: 216, type: !18)
!33 = !DISubprogram(name: "__inline_isinfl", scope: !9, file: !9, line: 219, type: !22, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !34)
!34 = !{!35}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !33, file: !9, line: 219, type: !24)
!36 = !DISubprogram(name: "__inline_isnanf", scope: !9, file: !9, line: 222, type: !10, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !37)
!37 = !{!38}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !36, file: !9, line: 222, type: !12)
!39 = !DISubprogram(name: "__inline_isnand", scope: !9, file: !9, line: 225, type: !16, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !40)
!40 = !{!41}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !39, file: !9, line: 225, type: !18)
!42 = !DISubprogram(name: "__inline_isnanl", scope: !9, file: !9, line: 228, type: !22, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !43)
!43 = !{!44}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !42, file: !9, line: 228, type: !24)
!45 = !DISubprogram(name: "__inline_signbitf", scope: !9, file: !9, line: 231, type: !10, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !46)
!46 = !{!47, !48}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !45, file: !9, line: 231, type: !12)
!48 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !45, file: !9, line: 232, type: !49)
!49 = !DICompositeType(tag: DW_TAG_union_type, scope: !45, file: !9, line: 232, size: 32, align: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !49, file: !9, line: 232, baseType: !12, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !49, file: !9, line: 232, baseType: !53, size: 32, align: 32)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DISubprogram(name: "__inline_signbitd", scope: !9, file: !9, line: 236, type: !16, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !55)
!55 = !{!56, !57}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !54, file: !9, line: 236, type: !18)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !54, file: !9, line: 237, type: !58)
!58 = !DICompositeType(tag: DW_TAG_union_type, scope: !54, file: !9, line: 237, size: 64, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !58, file: !9, line: 237, baseType: !18, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !58, file: !9, line: 237, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "__inline_signbitl", scope: !9, file: !9, line: 242, type: !22, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !64)
!64 = !{!65, !66}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !63, file: !9, line: 242, type: !24)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !63, file: !9, line: 246, type: !67)
!67 = !DICompositeType(tag: DW_TAG_union_type, scope: !63, file: !9, line: 243, size: 128, align: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !67, file: !9, line: 244, baseType: !24, size: 128, align: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !67, file: !9, line: 245, baseType: !71, size: 128, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !9, line: 245, size: 128, align: 64, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !71, file: !9, line: 245, baseType: !62, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !71, file: !9, line: 245, baseType: !75, size: 16, align: 16, offset: 64)
!75 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!76 = !DISubprogram(name: "__inline_isnormalf", scope: !9, file: !9, line: 257, type: !10, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !77)
!77 = !{!78}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !76, file: !9, line: 257, type: !12)
!79 = !DISubprogram(name: "__inline_isnormald", scope: !9, file: !9, line: 260, type: !16, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !80)
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !79, file: !9, line: 260, type: !18)
!82 = !DISubprogram(name: "__inline_isnormall", scope: !9, file: !9, line: 263, type: !22, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !83)
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !82, file: !9, line: 263, type: !24)
!85 = !DISubprogram(name: "__sincosf", scope: !9, file: !9, line: 642, type: !86, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !89)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !12, !88, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!89 = !{!90, !91, !92, !93}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !85, file: !9, line: 642, type: !12)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !85, file: !9, line: 642, type: !88)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !85, file: !9, line: 642, type: !88)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !85, file: !9, line: 643, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !9, line: 634, size: 64, align: 32, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !95, file: !9, line: 634, baseType: !12, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !95, file: !9, line: 634, baseType: !12, size: 32, align: 32, offset: 32)
!99 = !DISubprogram(name: "__sincos", scope: !9, file: !9, line: 647, type: !100, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !103)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !18, !102, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!103 = !{!104, !105, !106, !107}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !99, file: !9, line: 647, type: !18)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !99, file: !9, line: 647, type: !102)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !99, file: !9, line: 647, type: !102)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !99, file: !9, line: 648, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !9, line: 635, size: 128, align: 64, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !109, file: !9, line: 635, baseType: !18, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !109, file: !9, line: 635, baseType: !18, size: 64, align: 64, offset: 64)
!113 = !DISubprogram(name: "__sincospif", scope: !9, file: !9, line: 652, type: !86, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !113, file: !9, line: 652, type: !12)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !113, file: !9, line: 652, type: !88)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !113, file: !9, line: 652, type: !88)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !113, file: !9, line: 653, type: !94)
!119 = !DISubprogram(name: "__sincospi", scope: !9, file: !9, line: 657, type: !100, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !119, file: !9, line: 657, type: !18)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !119, file: !9, line: 657, type: !102)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !119, file: !9, line: 657, type: !102)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !119, file: !9, line: 658, type: !108)
!125 = !DISubprogram(name: "__sputc", scope: !126, file: !126, line: 348, type: !127, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !189)
!126 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !DISubroutineType(types: !128)
!128 = !{!4, !4, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 153, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !126, line: 122, size: 1216, align: 64, elements: !132)
!132 = !{!133, !136, !137, !138, !140, !141, !146, !147, !148, !152, !157, !167, !173, !174, !177, !178, !182, !186, !187, !188}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !131, file: !126, line: 123, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !131, file: !126, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !131, file: !126, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !131, file: !126, line: 126, baseType: !139, size: 16, align: 16, offset: 128)
!139 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !131, file: !126, line: 127, baseType: !139, size: 16, align: 16, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !131, file: !126, line: 128, baseType: !142, size: 128, align: 64, offset: 192)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !126, line: 88, size: 128, align: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !142, file: !126, line: 89, baseType: !134, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !142, file: !126, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !131, file: !126, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !131, file: !126, line: 132, baseType: !6, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !131, file: !126, line: 133, baseType: !149, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!4, !6}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !131, file: !126, line: 134, baseType: !153, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!4, !6, !156, !4}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !131, file: !126, line: 135, baseType: !158, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !6, !161, !4}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !126, line: 77, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !163, line: 71, baseType: !164)
!163 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !165, line: 46, baseType: !166)
!165 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!166 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !131, file: !126, line: 136, baseType: !168, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!4, !6, !171, !4}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !131, file: !126, line: 139, baseType: !142, size: 128, align: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !131, file: !126, line: 140, baseType: !175, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !126, line: 94, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !131, file: !126, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !131, file: !126, line: 144, baseType: !179, size: 24, align: 8, offset: 928)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 24, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 3)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !131, file: !126, line: 145, baseType: !183, size: 8, align: 8, offset: 952)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 1)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !131, file: !126, line: 148, baseType: !142, size: 128, align: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !131, file: !126, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !131, file: !126, line: 152, baseType: !161, size: 64, align: 64, offset: 1152)
!189 = !{!190, !191}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !125, file: !126, line: 348, type: !4)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !125, file: !126, line: 348, type: !129)
!192 = !DISubprogram(name: "__sigbits", scope: !193, file: !193, line: 114, type: !194, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !196)
!193 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DISubroutineType(types: !195)
!195 = !{!4, !4}
!196 = !{!197}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !192, file: !193, line: 114, type: !4)
!198 = !DISubprogram(name: "calc_similar_ind", scope: !1, file: !1, line: 43, type: !199, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: float (i32, i32, i32*, float*, [3 x float]*, [3 x float]*)* @calc_similar_ind, variables: !209)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !4, !4, !203, !205, !206, !206}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !202, line: 87, baseType: !12)
!202 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !202, line: 73, baseType: !4)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !202, line: 101, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 96, align: 32, elements: !180)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bRho", arg: 1, scope: !198, file: !1, line: 43, type: !4)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nind", arg: 2, scope: !198, file: !1, line: 43, type: !4)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !198, file: !1, line: 43, type: !203)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mass", arg: 4, scope: !198, file: !1, line: 43, type: !205)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 5, scope: !198, file: !1, line: 44, type: !206)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xp", arg: 6, scope: !198, file: !1, line: 44, type: !206)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !198, file: !1, line: 46, type: !4)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !198, file: !1, line: 46, type: !4)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !198, file: !1, line: 46, type: !4)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !198, file: !1, line: 47, type: !201)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !198, file: !1, line: 47, type: !201)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xs", scope: !198, file: !1, line: 47, type: !201)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xd", scope: !198, file: !1, line: 47, type: !201)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rs", scope: !198, file: !1, line: 47, type: !201)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rd", scope: !198, file: !1, line: 47, type: !201)
