; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/do_gct.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }

!42 = !DIEnumerator(name: "F_BHAM", value: 14)
!43 = !DIEnumerator(name: "F_LJLR", value: 15)
!44 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!45 = !DIEnumerator(name: "F_SR", value: 17)
!46 = !DIEnumerator(name: "F_LR", value: 18)
!47 = !DIEnumerator(name: "F_WPOL", value: 19)
!48 = !DIEnumerator(name: "F_POSRES", value: 20)
!49 = !DIEnumerator(name: "F_DISRES", value: 21)
!50 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!51 = !DIEnumerator(name: "F_ORIRES", value: 23)
!52 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!53 = !DIEnumerator(name: "F_ANGRES", value: 25)
!54 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!55 = !DIEnumerator(name: "F_SHAKE", value: 27)
!56 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!57 = !DIEnumerator(name: "F_SETTLE", value: 29)
!58 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!59 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!60 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!61 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!62 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!63 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!64 = !DIEnumerator(name: "F_EQM", value: 36)
!65 = !DIEnumerator(name: "F_EPOT", value: 37)
!66 = !DIEnumerator(name: "F_EKIN", value: 38)
!67 = !DIEnumerator(name: "F_ETOT", value: 39)
!68 = !DIEnumerator(name: "F_TEMP", value: 40)
!69 = !DIEnumerator(name: "F_PRES", value: 41)
!70 = !DIEnumerator(name: "F_DVDL", value: 42)
!71 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!72 = !DIEnumerator(name: "F_NRE", value: 44)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 37, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!76 = !DIEnumerator(name: "efMDP", value: 0)
!77 = !DIEnumerator(name: "efGCT", value: 1)
!78 = !DIEnumerator(name: "efTRX", value: 2)
!79 = !DIEnumerator(name: "efTRN", value: 3)
!80 = !DIEnumerator(name: "efTRR", value: 4)
!81 = !DIEnumerator(name: "efTRJ", value: 5)
!82 = !DIEnumerator(name: "efXTC", value: 6)
!83 = !DIEnumerator(name: "efG87", value: 7)
!84 = !DIEnumerator(name: "efENX", value: 8)
!85 = !DIEnumerator(name: "efEDR", value: 9)
!86 = !DIEnumerator(name: "efENE", value: 10)
!87 = !DIEnumerator(name: "efSTX", value: 11)
!88 = !DIEnumerator(name: "efSTO", value: 12)
!89 = !DIEnumerator(name: "efGRO", value: 13)
!90 = !DIEnumerator(name: "efG96", value: 14)
!91 = !DIEnumerator(name: "efPDB", value: 15)
!92 = !DIEnumerator(name: "efBRK", value: 16)
!93 = !DIEnumerator(name: "efENT", value: 17)
!94 = !DIEnumerator(name: "efLOG", value: 18)
!95 = !DIEnumerator(name: "efXVG", value: 19)
!96 = !DIEnumerator(name: "efOUT", value: 20)
!97 = !DIEnumerator(name: "efNDX", value: 21)
!98 = !DIEnumerator(name: "efTOP", value: 22)
!99 = !DIEnumerator(name: "efITP", value: 23)
!100 = !DIEnumerator(name: "efTPX", value: 24)
!101 = !DIEnumerator(name: "efTPS", value: 25)
!102 = !DIEnumerator(name: "efTPR", value: 26)
!103 = !DIEnumerator(name: "efTPA", value: 27)
!104 = !DIEnumerator(name: "efTPB", value: 28)
!105 = !DIEnumerator(name: "efTEX", value: 29)
!106 = !DIEnumerator(name: "efRTP", value: 30)
!107 = !DIEnumerator(name: "efATP", value: 31)
!108 = !DIEnumerator(name: "efHDB", value: 32)
!109 = !DIEnumerator(name: "efDAT", value: 33)
!110 = !DIEnumerator(name: "efDLG", value: 34)
!111 = !DIEnumerator(name: "efMAP", value: 35)
!112 = !DIEnumerator(name: "efEPS", value: 36)
!113 = !DIEnumerator(name: "efMAT", value: 37)
!114 = !DIEnumerator(name: "efM2P", value: 38)
!115 = !DIEnumerator(name: "efMTX", value: 39)
!116 = !DIEnumerator(name: "efEDI", value: 40)
!117 = !DIEnumerator(name: "efEDO", value: 41)
!118 = !DIEnumerator(name: "efPPA", value: 42)
!119 = !DIEnumerator(name: "efPDO", value: 43)
!120 = !DIEnumerator(name: "efHAT", value: 44)
!121 = !DIEnumerator(name: "efXPM", value: 45)
!122 = !DIEnumerator(name: "efNR", value: 46)
!123 = !{!124, !125, !126}
!124 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!125 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!127 = !{!128, !195, !201, !208, !214, !220, !223, !226, !229, !232, !235, !238, !247, !256, !269, !272, !275, !278, !292, !306, !312, !318, !692, !702, !710, !897, !903, !911, !923, !928, !934, !939, !947, !970, !978, !985, !998, !1008, !1021, !1033}
!128 = !DISubprogram(name: "__sputc", scope: !129, file: !129, line: 348, type: !130, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !192)
!129 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!130 = !DISubroutineType(types: !131)
!131 = !{!125, !125, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !129, line: 153, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !129, line: 122, size: 1216, align: 64, elements: !135)
!135 = !{!136, !139, !140, !141, !143, !144, !149, !150, !151, !155, !160, !170, !176, !177, !180, !181, !185, !189, !190, !191}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !134, file: !129, line: 123, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !134, file: !129, line: 124, baseType: !125, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !134, file: !129, line: 125, baseType: !125, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !134, file: !129, line: 126, baseType: !142, size: 16, align: 16, offset: 128)
!142 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !134, file: !129, line: 127, baseType: !142, size: 16, align: 16, offset: 144)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !134, file: !129, line: 128, baseType: !145, size: 128, align: 64, offset: 192)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !129, line: 88, size: 128, align: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !145, file: !129, line: 89, baseType: !137, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !145, file: !129, line: 90, baseType: !125, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !134, file: !129, line: 129, baseType: !125, size: 32, align: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !134, file: !129, line: 132, baseType: !126, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !134, file: !129, line: 133, baseType: !152, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!125, !126}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !134, file: !129, line: 134, baseType: !156, size: 64, align: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!125, !126, !159, !125}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !134, file: !129, line: 135, baseType: !161, size: 64, align: 64, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !126, !164, !125}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !129, line: 77, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !166, line: 71, baseType: !167)
!166 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !168, line: 46, baseType: !169)
!168 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!169 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !134, file: !129, line: 136, baseType: !171, size: 64, align: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!125, !126, !174, !125}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !134, file: !129, line: 139, baseType: !145, size: 128, align: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !134, file: !129, line: 140, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !129, line: 94, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !134, file: !129, line: 141, baseType: !125, size: 32, align: 32, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !134, file: !129, line: 144, baseType: !182, size: 24, align: 8, offset: 928)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 24, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 3)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !134, file: !129, line: 145, baseType: !186, size: 8, align: 8, offset: 952)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 1)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !134, file: !129, line: 148, baseType: !145, size: 128, align: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !134, file: !129, line: 151, baseType: !125, size: 32, align: 32, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !134, file: !129, line: 152, baseType: !164, size: 64, align: 64, offset: 1152)
!192 = !{!193, !194}
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !128, file: !129, line: 348, type: !125)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !128, file: !129, line: 348, type: !132)
!195 = !DISubprogram(name: "__sigbits", scope: !196, file: !196, line: 114, type: !197, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !199)
!196 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!197 = !DISubroutineType(types: !198)
!198 = !{!125, !125}
!199 = !{!200}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !195, file: !196, line: 114, type: !125)
!201 = !DISubprogram(name: "__inline_isfinitef", scope: !202, file: !202, line: 204, type: !203, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !206)
!202 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!203 = !DISubroutineType(types: !204)
!204 = !{!125, !205}
!205 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!206 = !{!207}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !201, file: !202, line: 204, type: !205)
!208 = !DISubprogram(name: "__inline_isfinited", scope: !202, file: !202, line: 207, type: !209, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !212)
!209 = !DISubroutineType(types: !210)
!210 = !{!125, !211}
!211 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!212 = !{!213}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !208, file: !202, line: 207, type: !211)
!214 = !DISubprogram(name: "__inline_isfinitel", scope: !202, file: !202, line: 210, type: !215, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !218)
!215 = !DISubroutineType(types: !216)
!216 = !{!125, !217}
!217 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!218 = !{!219}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !214, file: !202, line: 210, type: !217)
!220 = !DISubprogram(name: "__inline_isinff", scope: !202, file: !202, line: 213, type: !203, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !221)
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !220, file: !202, line: 213, type: !205)
!223 = !DISubprogram(name: "__inline_isinfd", scope: !202, file: !202, line: 216, type: !209, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !224)
!224 = !{!225}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !223, file: !202, line: 216, type: !211)
!226 = !DISubprogram(name: "__inline_isinfl", scope: !202, file: !202, line: 219, type: !215, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !227)
!227 = !{!228}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !226, file: !202, line: 219, type: !217)
!229 = !DISubprogram(name: "__inline_isnanf", scope: !202, file: !202, line: 222, type: !203, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !230)
!230 = !{!231}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !229, file: !202, line: 222, type: !205)
!232 = !DISubprogram(name: "__inline_isnand", scope: !202, file: !202, line: 225, type: !209, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !233)
!233 = !{!234}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !232, file: !202, line: 225, type: !211)
!235 = !DISubprogram(name: "__inline_isnanl", scope: !202, file: !202, line: 228, type: !215, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !236)
!236 = !{!237}
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !235, file: !202, line: 228, type: !217)
!238 = !DISubprogram(name: "__inline_signbitf", scope: !202, file: !202, line: 231, type: !203, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !239)
!239 = !{!240, !241}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !238, file: !202, line: 231, type: !205)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !238, file: !202, line: 232, type: !242)
!242 = !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !202, line: 232, size: 32, align: 32, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !242, file: !202, line: 232, baseType: !205, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !242, file: !202, line: 232, baseType: !246, size: 32, align: 32)
!246 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!247 = !DISubprogram(name: "__inline_signbitd", scope: !202, file: !202, line: 236, type: !209, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !248)
!248 = !{!249, !250}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !247, file: !202, line: 236, type: !211)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !247, file: !202, line: 237, type: !251)
!251 = !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !202, line: 237, size: 64, align: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !251, file: !202, line: 237, baseType: !211, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !251, file: !202, line: 237, baseType: !255, size: 64, align: 64)
!255 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!256 = !DISubprogram(name: "__inline_signbitl", scope: !202, file: !202, line: 242, type: !215, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !257)
!257 = !{!258, !259}
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !256, file: !202, line: 242, type: !217)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !256, file: !202, line: 246, type: !260)
!260 = !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !202, line: 243, size: 128, align: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !260, file: !202, line: 244, baseType: !217, size: 128, align: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !260, file: !202, line: 245, baseType: !264, size: 128, align: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !202, line: 245, size: 128, align: 64, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !264, file: !202, line: 245, baseType: !255, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !264, file: !202, line: 245, baseType: !268, size: 16, align: 16, offset: 64)
!268 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!269 = !DISubprogram(name: "__inline_isnormalf", scope: !202, file: !202, line: 257, type: !203, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !270)
!270 = !{!271}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !269, file: !202, line: 257, type: !205)
!272 = !DISubprogram(name: "__inline_isnormald", scope: !202, file: !202, line: 260, type: !209, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !273)
!273 = !{!274}
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !272, file: !202, line: 260, type: !211)
!275 = !DISubprogram(name: "__inline_isnormall", scope: !202, file: !202, line: 263, type: !215, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !276)
!276 = !{!277}
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !275, file: !202, line: 263, type: !217)
!278 = !DISubprogram(name: "__sincosf", scope: !202, file: !202, line: 642, type: !279, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !282)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !205, !281, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!282 = !{!283, !284, !285, !286}
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !278, file: !202, line: 642, type: !205)
!284 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !278, file: !202, line: 642, type: !281)
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !278, file: !202, line: 642, type: !281)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !278, file: !202, line: 643, type: !287)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !202, line: 634, size: 64, align: 32, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !288, file: !202, line: 634, baseType: !205, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !288, file: !202, line: 634, baseType: !205, size: 32, align: 32, offset: 32)
!292 = !DISubprogram(name: "__sincos", scope: !202, file: !202, line: 647, type: !293, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !296)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !211, !295, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!296 = !{!297, !298, !299, !300}
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !292, file: !202, line: 647, type: !211)
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !292, file: !202, line: 647, type: !295)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !292, file: !202, line: 647, type: !295)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !292, file: !202, line: 648, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !202, line: 635, size: 128, align: 64, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !302, file: !202, line: 635, baseType: !211, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !302, file: !202, line: 635, baseType: !211, size: 64, align: 64, offset: 64)
!306 = !DISubprogram(name: "__sincospif", scope: !202, file: !202, line: 652, type: !279, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !306, file: !202, line: 652, type: !205)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !306, file: !202, line: 652, type: !281)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !306, file: !202, line: 652, type: !281)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !306, file: !202, line: 653, type: !287)
!312 = !DISubprogram(name: "__sincospi", scope: !202, file: !202, line: 657, type: !293, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !312, file: !202, line: 657, type: !211)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !312, file: !202, line: 657, type: !295)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !312, file: !202, line: 657, type: !295)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !312, file: !202, line: 658, type: !301)
!318 = !DISubprogram(name: "init_coupling", scope: !1, file: !1, line: 53, type: !319, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_coupl_rec* (%struct.__sFILE*, i32, %struct.t_filenm*, %struct.t_commrec*, %struct.t_forcerec*, %struct.t_mdatoms*, %struct.t_idef*)* @init_coupling, variables: !677)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !132, !125, !500, !509, !520, !621, !650}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_rec", file: !4, line: 135, baseType: !323)
!323 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 122, size: 2304, align: 64, elements: !324)
!324 = !{!325, !331, !332, !333, !335, !336, !337, !338, !339, !352, !367, !377, !497, !498, !499}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "act_value", scope: !323, file: !4, line: 123, baseType: !326, size: 448, align: 32)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 448, align: 32, elements: !329)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !328, line: 87, baseType: !205)
!328 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!329 = !{!330}
!330 = !DISubrange(count: 14)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "av_value", scope: !323, file: !4, line: 124, baseType: !326, size: 448, align: 32, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ref_value", scope: !323, file: !4, line: 125, baseType: !326, size: 448, align: 32, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bObsUsed", scope: !323, file: !4, line: 126, baseType: !334, size: 448, align: 32, offset: 1344)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 448, align: 32, elements: !329)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "nLJ", scope: !323, file: !4, line: 127, baseType: !125, size: 32, align: 32, offset: 1792)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nBU", scope: !323, file: !4, line: 127, baseType: !125, size: 32, align: 32, offset: 1824)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nQ", scope: !323, file: !4, line: 127, baseType: !125, size: 32, align: 32, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "nIP", scope: !323, file: !4, line: 127, baseType: !125, size: 32, align: 32, offset: 1888)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tcLJ", scope: !323, file: !4, line: 128, baseType: !340, size: 64, align: 64, offset: 1920)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_LJ", file: !4, line: 97, baseType: !342)
!342 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 91, size: 256, align: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "at_i", scope: !342, file: !4, line: 92, baseType: !125, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "at_j", scope: !342, file: !4, line: 92, baseType: !125, size: 32, align: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !342, file: !4, line: 93, baseType: !125, size: 32, align: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bPrint", scope: !342, file: !4, line: 94, baseType: !125, size: 32, align: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !342, file: !4, line: 95, baseType: !327, size: 32, align: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !342, file: !4, line: 95, baseType: !327, size: 32, align: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "xi_6", scope: !342, file: !4, line: 96, baseType: !327, size: 32, align: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "xi_12", scope: !342, file: !4, line: 96, baseType: !327, size: 32, align: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tcBU", scope: !323, file: !4, line: 129, baseType: !353, size: 64, align: 64, offset: 1984)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_BU", file: !4, line: 105, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 99, size: 320, align: 32, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "at_i", scope: !355, file: !4, line: 100, baseType: !125, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "at_j", scope: !355, file: !4, line: 100, baseType: !125, size: 32, align: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !355, file: !4, line: 101, baseType: !125, size: 32, align: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bPrint", scope: !355, file: !4, line: 102, baseType: !125, size: 32, align: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !355, file: !4, line: 103, baseType: !327, size: 32, align: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !355, file: !4, line: 103, baseType: !327, size: 32, align: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !355, file: !4, line: 103, baseType: !327, size: 32, align: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "xi_a", scope: !355, file: !4, line: 104, baseType: !327, size: 32, align: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "xi_b", scope: !355, file: !4, line: 104, baseType: !327, size: 32, align: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "xi_c", scope: !355, file: !4, line: 104, baseType: !327, size: 32, align: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tcQ", scope: !323, file: !4, line: 130, baseType: !368, size: 64, align: 64, offset: 2048)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_Q", file: !4, line: 113, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 107, size: 160, align: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "at_i", scope: !370, file: !4, line: 108, baseType: !125, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !370, file: !4, line: 109, baseType: !125, size: 32, align: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bPrint", scope: !370, file: !4, line: 110, baseType: !125, size: 32, align: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !370, file: !4, line: 111, baseType: !327, size: 32, align: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "xi_Q", scope: !370, file: !4, line: 112, baseType: !327, size: 32, align: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tIP", scope: !323, file: !4, line: 131, baseType: !378, size: 64, align: 64, offset: 2112)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_iparams", file: !4, line: 120, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 115, size: 448, align: 32, elements: !381)
!381 = !{!382, !383, !384, !496}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !4, line: 116, baseType: !125, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !380, file: !4, line: 117, baseType: !125, size: 32, align: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !380, file: !4, line: 118, baseType: !385, size: 192, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !26, line: 131, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 97, size: 192, align: 32, elements: !387)
!387 = !{!388, !394, !401, !407, !416, !421, !428, !436, !441, !446, !452, !458, !465, !474, !483, !492}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !386, file: !26, line: 105, baseType: !389, size: 96, align: 32)
!389 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 105, size: 96, align: 32, elements: !390)
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !389, file: !26, line: 105, baseType: !327, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !389, file: !26, line: 105, baseType: !327, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !389, file: !26, line: 105, baseType: !327, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !386, file: !26, line: 106, baseType: !395, size: 128, align: 32)
!395 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 106, size: 128, align: 32, elements: !396)
!396 = !{!397, !398, !399, !400}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !395, file: !26, line: 106, baseType: !327, size: 32, align: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !395, file: !26, line: 106, baseType: !327, size: 32, align: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !395, file: !26, line: 106, baseType: !327, size: 32, align: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !395, file: !26, line: 106, baseType: !327, size: 32, align: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !386, file: !26, line: 108, baseType: !402, size: 96, align: 32)
!402 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 108, size: 96, align: 32, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !402, file: !26, line: 108, baseType: !327, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !402, file: !26, line: 108, baseType: !327, size: 32, align: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !402, file: !26, line: 108, baseType: !327, size: 32, align: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !386, file: !26, line: 110, baseType: !408, size: 192, align: 32)
!408 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 110, size: 192, align: 32, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !408, file: !26, line: 110, baseType: !327, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !408, file: !26, line: 110, baseType: !327, size: 32, align: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !408, file: !26, line: 110, baseType: !327, size: 32, align: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !408, file: !26, line: 110, baseType: !327, size: 32, align: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !408, file: !26, line: 110, baseType: !327, size: 32, align: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !408, file: !26, line: 110, baseType: !327, size: 32, align: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !386, file: !26, line: 111, baseType: !417, size: 64, align: 32)
!417 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 111, size: 64, align: 32, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !417, file: !26, line: 111, baseType: !327, size: 32, align: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !417, file: !26, line: 111, baseType: !327, size: 32, align: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !386, file: !26, line: 112, baseType: !422, size: 128, align: 32)
!422 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 112, size: 128, align: 32, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !422, file: !26, line: 112, baseType: !327, size: 32, align: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !422, file: !26, line: 112, baseType: !327, size: 32, align: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !422, file: !26, line: 112, baseType: !327, size: 32, align: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !422, file: !26, line: 112, baseType: !327, size: 32, align: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !386, file: !26, line: 117, baseType: !429, size: 160, align: 32)
!429 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 117, size: 160, align: 32, elements: !430)
!430 = !{!431, !432, !433, !434, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !429, file: !26, line: 117, baseType: !327, size: 32, align: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !429, file: !26, line: 117, baseType: !327, size: 32, align: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !429, file: !26, line: 117, baseType: !125, size: 32, align: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !429, file: !26, line: 117, baseType: !327, size: 32, align: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !429, file: !26, line: 117, baseType: !327, size: 32, align: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !386, file: !26, line: 118, baseType: !437, size: 64, align: 32)
!437 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 118, size: 64, align: 32, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !437, file: !26, line: 118, baseType: !327, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !437, file: !26, line: 118, baseType: !327, size: 32, align: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !386, file: !26, line: 123, baseType: !442, size: 64, align: 32)
!442 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 123, size: 64, align: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !442, file: !26, line: 123, baseType: !327, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !442, file: !26, line: 123, baseType: !327, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !386, file: !26, line: 124, baseType: !447, size: 96, align: 32)
!447 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 124, size: 96, align: 32, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !447, file: !26, line: 124, baseType: !327, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !447, file: !26, line: 124, baseType: !327, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !447, file: !26, line: 124, baseType: !327, size: 32, align: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !386, file: !26, line: 125, baseType: !453, size: 192, align: 32)
!453 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 125, size: 192, align: 32, elements: !454)
!454 = !{!455, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !453, file: !26, line: 125, baseType: !456, size: 96, align: 32)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 96, align: 32, elements: !183)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !453, file: !26, line: 125, baseType: !456, size: 96, align: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !386, file: !26, line: 126, baseType: !459, size: 192, align: 32)
!459 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 126, size: 192, align: 32, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !459, file: !26, line: 126, baseType: !462, size: 192, align: 32)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 192, align: 32, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 6)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !386, file: !26, line: 127, baseType: !466, size: 192, align: 32)
!466 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 127, size: 192, align: 32, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !466, file: !26, line: 127, baseType: !327, size: 32, align: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !466, file: !26, line: 127, baseType: !327, size: 32, align: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !466, file: !26, line: 127, baseType: !327, size: 32, align: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !466, file: !26, line: 127, baseType: !327, size: 32, align: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !466, file: !26, line: 127, baseType: !327, size: 32, align: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !466, file: !26, line: 127, baseType: !327, size: 32, align: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !386, file: !26, line: 128, baseType: !475, size: 192, align: 32)
!475 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 128, size: 192, align: 32, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !475, file: !26, line: 128, baseType: !327, size: 32, align: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !475, file: !26, line: 128, baseType: !327, size: 32, align: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !475, file: !26, line: 128, baseType: !327, size: 32, align: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !475, file: !26, line: 128, baseType: !327, size: 32, align: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !26, line: 128, baseType: !125, size: 32, align: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !475, file: !26, line: 128, baseType: !125, size: 32, align: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !386, file: !26, line: 129, baseType: !484, size: 192, align: 32)
!484 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 129, size: 192, align: 32, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !484, file: !26, line: 129, baseType: !125, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !484, file: !26, line: 129, baseType: !125, size: 32, align: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !484, file: !26, line: 129, baseType: !125, size: 32, align: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !484, file: !26, line: 129, baseType: !327, size: 32, align: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !484, file: !26, line: 129, baseType: !327, size: 32, align: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !484, file: !26, line: 129, baseType: !327, size: 32, align: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !386, file: !26, line: 130, baseType: !493, size: 192, align: 32)
!493 = !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !26, line: 130, size: 192, align: 32, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !493, file: !26, line: 130, baseType: !462, size: 192, align: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "iprint", scope: !380, file: !4, line: 119, baseType: !385, size: 192, align: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nmemory", scope: !323, file: !4, line: 132, baseType: !125, size: 32, align: 32, offset: 2176)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bInter", scope: !323, file: !4, line: 133, baseType: !125, size: 32, align: 32, offset: 2208)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bVirial", scope: !323, file: !4, line: 134, baseType: !125, size: 32, align: 32, offset: 2240)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !74, line: 62, baseType: !502)
!502 = !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 57, size: 256, align: 64, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !502, file: !74, line: 58, baseType: !125, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !502, file: !74, line: 59, baseType: !159, size: 64, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !502, file: !74, line: 60, baseType: !159, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !74, line: 61, baseType: !508, size: 64, align: 64, offset: 192)
!508 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !511, line: 40, baseType: !512)
!511 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 36, size: 192, align: 32, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !512, file: !511, line: 37, baseType: !125, size: 32, align: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !512, file: !511, line: 37, baseType: !125, size: 32, align: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !512, file: !511, line: 38, baseType: !125, size: 32, align: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !512, file: !511, line: 38, baseType: !125, size: 32, align: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !512, file: !511, line: 39, baseType: !125, size: 32, align: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !512, file: !511, line: 39, baseType: !125, size: 32, align: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !522, line: 149, baseType: !523)
!522 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/forcerec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!523 = !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 43, size: 22784, align: 64, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !573, !574, !577, !578, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !523, file: !522, line: 45, baseType: !125, size: 32, align: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !523, file: !522, line: 46, baseType: !327, size: 32, align: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !523, file: !522, line: 46, baseType: !327, size: 32, align: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !523, file: !522, line: 49, baseType: !327, size: 32, align: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !523, file: !522, line: 49, baseType: !327, size: 32, align: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !523, file: !522, line: 50, baseType: !327, size: 32, align: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !523, file: !522, line: 50, baseType: !327, size: 32, align: 32, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !523, file: !522, line: 53, baseType: !125, size: 32, align: 32, offset: 224)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !523, file: !522, line: 54, baseType: !327, size: 32, align: 32, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !523, file: !522, line: 54, baseType: !327, size: 32, align: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !523, file: !522, line: 54, baseType: !327, size: 32, align: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !523, file: !522, line: 57, baseType: !327, size: 32, align: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !523, file: !522, line: 60, baseType: !327, size: 32, align: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !523, file: !522, line: 63, baseType: !125, size: 32, align: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !523, file: !522, line: 64, baseType: !125, size: 32, align: 32, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !523, file: !522, line: 65, baseType: !327, size: 32, align: 32, offset: 480)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !523, file: !522, line: 66, baseType: !125, size: 32, align: 32, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !523, file: !522, line: 67, baseType: !327, size: 32, align: 32, offset: 544)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !523, file: !522, line: 69, baseType: !544, size: 64, align: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !523, file: !522, line: 70, baseType: !544, size: 64, align: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !523, file: !522, line: 71, baseType: !544, size: 64, align: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !523, file: !522, line: 72, baseType: !544, size: 64, align: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !523, file: !522, line: 75, baseType: !327, size: 32, align: 32, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !523, file: !522, line: 75, baseType: !327, size: 32, align: 32, offset: 864)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !523, file: !522, line: 76, baseType: !544, size: 64, align: 64, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !523, file: !522, line: 79, baseType: !327, size: 32, align: 32, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !523, file: !522, line: 79, baseType: !327, size: 32, align: 32, offset: 992)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !523, file: !522, line: 80, baseType: !327, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !523, file: !522, line: 81, baseType: !327, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !523, file: !522, line: 84, baseType: !125, size: 32, align: 32, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !523, file: !522, line: 85, baseType: !327, size: 32, align: 32, offset: 1120)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !523, file: !522, line: 86, baseType: !327, size: 32, align: 32, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !523, file: !522, line: 87, baseType: !125, size: 32, align: 32, offset: 1184)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !523, file: !522, line: 90, baseType: !125, size: 32, align: 32, offset: 1216)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !523, file: !522, line: 91, baseType: !125, size: 32, align: 32, offset: 1248)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !523, file: !522, line: 92, baseType: !125, size: 32, align: 32, offset: 1280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !523, file: !522, line: 92, baseType: !125, size: 32, align: 32, offset: 1312)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !523, file: !522, line: 93, baseType: !125, size: 32, align: 32, offset: 1344)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !523, file: !522, line: 94, baseType: !125, size: 32, align: 32, offset: 1376)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !523, file: !522, line: 95, baseType: !125, size: 32, align: 32, offset: 1408)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !523, file: !522, line: 96, baseType: !456, size: 96, align: 32, offset: 1440)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !523, file: !522, line: 97, baseType: !125, size: 32, align: 32, offset: 1536)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !523, file: !522, line: 98, baseType: !125, size: 32, align: 32, offset: 1568)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !523, file: !522, line: 99, baseType: !125, size: 32, align: 32, offset: 1600)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !523, file: !522, line: 99, baseType: !125, size: 32, align: 32, offset: 1632)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !523, file: !522, line: 100, baseType: !572, size: 64, align: 64, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !523, file: !522, line: 101, baseType: !572, size: 64, align: 64, offset: 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !523, file: !522, line: 102, baseType: !575, size: 64, align: 64, offset: 1792)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !328, line: 101, baseType: !456)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !523, file: !522, line: 103, baseType: !575, size: 64, align: 64, offset: 1856)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !523, file: !522, line: 108, baseType: !579, size: 9984, align: 64, offset: 1920)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 9984, align: 64, elements: !601)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !581, line: 60, baseType: !582)
!581 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!582 = !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 36, size: 768, align: 64, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !594, !595, !596, !597, !598, !599, !600}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !582, file: !581, line: 37, baseType: !125, size: 32, align: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !582, file: !581, line: 39, baseType: !125, size: 32, align: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !582, file: !581, line: 39, baseType: !125, size: 32, align: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !582, file: !581, line: 40, baseType: !125, size: 32, align: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !582, file: !581, line: 40, baseType: !125, size: 32, align: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !582, file: !581, line: 41, baseType: !125, size: 32, align: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !582, file: !581, line: 42, baseType: !125, size: 32, align: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !582, file: !581, line: 43, baseType: !592, size: 64, align: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !328, line: 73, baseType: !125)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !582, file: !581, line: 44, baseType: !572, size: 64, align: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !582, file: !581, line: 45, baseType: !572, size: 64, align: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !582, file: !581, line: 46, baseType: !572, size: 64, align: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !582, file: !581, line: 47, baseType: !592, size: 64, align: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !582, file: !581, line: 48, baseType: !572, size: 64, align: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !582, file: !581, line: 58, baseType: !125, size: 32, align: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !582, file: !581, line: 58, baseType: !572, size: 64, align: 64, offset: 704)
!601 = !{!602}
!602 = !DISubrange(count: 13)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !523, file: !522, line: 109, baseType: !579, size: 9984, align: 64, offset: 11904)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !523, file: !522, line: 120, baseType: !125, size: 32, align: 32, offset: 21888)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !523, file: !522, line: 121, baseType: !125, size: 32, align: 32, offset: 21920)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !523, file: !522, line: 122, baseType: !575, size: 64, align: 64, offset: 21952)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !523, file: !522, line: 123, baseType: !575, size: 64, align: 64, offset: 22016)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !523, file: !522, line: 126, baseType: !575, size: 64, align: 64, offset: 22080)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !523, file: !522, line: 127, baseType: !125, size: 32, align: 32, offset: 22144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !523, file: !522, line: 128, baseType: !327, size: 32, align: 32, offset: 22176)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !523, file: !522, line: 131, baseType: !575, size: 64, align: 64, offset: 22208)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !523, file: !522, line: 134, baseType: !125, size: 32, align: 32, offset: 22272)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !523, file: !522, line: 135, baseType: !592, size: 64, align: 64, offset: 22336)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !523, file: !522, line: 136, baseType: !544, size: 64, align: 64, offset: 22400)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !523, file: !522, line: 137, baseType: !125, size: 32, align: 32, offset: 22464)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !523, file: !522, line: 140, baseType: !125, size: 32, align: 32, offset: 22496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !523, file: !522, line: 141, baseType: !125, size: 32, align: 32, offset: 22528)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !523, file: !522, line: 142, baseType: !544, size: 64, align: 64, offset: 22592)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !523, file: !522, line: 145, baseType: !572, size: 64, align: 64, offset: 22656)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !523, file: !522, line: 148, baseType: !327, size: 32, align: 32, offset: 22720)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !623, line: 51, baseType: !624)
!623 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!624 = !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 40, size: 1408, align: 64, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !624, file: !623, line: 41, baseType: !327, size: 32, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !624, file: !623, line: 42, baseType: !125, size: 32, align: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !624, file: !623, line: 43, baseType: !544, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !624, file: !623, line: 43, baseType: !544, size: 64, align: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !624, file: !623, line: 43, baseType: !544, size: 64, align: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !624, file: !623, line: 43, baseType: !544, size: 64, align: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !624, file: !623, line: 44, baseType: !544, size: 64, align: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !624, file: !623, line: 44, baseType: !544, size: 64, align: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !624, file: !623, line: 44, baseType: !544, size: 64, align: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !624, file: !623, line: 45, baseType: !572, size: 64, align: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !624, file: !623, line: 46, baseType: !572, size: 64, align: 64, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !624, file: !623, line: 47, baseType: !572, size: 64, align: 64, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !624, file: !623, line: 47, baseType: !572, size: 64, align: 64, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !624, file: !623, line: 48, baseType: !640, size: 64, align: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !624, file: !623, line: 49, baseType: !640, size: 64, align: 64, offset: 832)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !624, file: !623, line: 49, baseType: !640, size: 64, align: 64, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !624, file: !623, line: 49, baseType: !640, size: 64, align: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !624, file: !623, line: 49, baseType: !640, size: 64, align: 64, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !624, file: !623, line: 49, baseType: !640, size: 64, align: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !624, file: !623, line: 49, baseType: !640, size: 64, align: 64, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !624, file: !623, line: 50, baseType: !640, size: 64, align: 64, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !624, file: !623, line: 50, baseType: !640, size: 64, align: 64, offset: 1280)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !624, file: !623, line: 50, baseType: !640, size: 64, align: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !26, line: 188, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 179, size: 366336, align: 64, elements: !653)
!653 = !{!654, !655, !656, !657, !660, !662}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !652, file: !26, line: 181, baseType: !125, size: 32, align: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !652, file: !26, line: 182, baseType: !125, size: 32, align: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !652, file: !26, line: 183, baseType: !125, size: 32, align: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !652, file: !26, line: 184, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !26, line: 133, baseType: !125)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !652, file: !26, line: 185, baseType: !661, size: 64, align: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !652, file: !26, line: 187, baseType: !663, size: 366080, align: 64, offset: 256)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 366080, align: 64, elements: !675)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !26, line: 140, baseType: !665)
!665 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 135, size: 8320, align: 64, elements: !666)
!666 = !{!667, !668, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !665, file: !26, line: 137, baseType: !125, size: 32, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !665, file: !26, line: 138, baseType: !669, size: 8192, align: 32, offset: 32)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 8192, align: 32, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !665, file: !26, line: 139, baseType: !673, size: 64, align: 64, offset: 8256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !26, line: 45, baseType: !593)
!675 = !{!676}
!676 = !DISubrange(count: 44)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !318, file: !1, line: 53, type: !132)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 2, scope: !318, file: !1, line: 53, type: !125)
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 3, scope: !318, file: !1, line: 53, type: !500)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 4, scope: !318, file: !1, line: 54, type: !509)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 5, scope: !318, file: !1, line: 54, type: !520)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 6, scope: !318, file: !1, line: 55, type: !621)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 7, scope: !318, file: !1, line: 55, type: !650)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !318, file: !1, line: 57, type: !125)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nc", scope: !318, file: !1, line: 57, type: !125)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !318, file: !1, line: 57, type: !125)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !318, file: !1, line: 57, type: !125)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ati", scope: !318, file: !1, line: 58, type: !125)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atj", scope: !318, file: !1, line: 58, type: !125)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tcr", scope: !318, file: !1, line: 59, type: !321)
!692 = !DISubprogram(name: "gprod", scope: !1, file: !1, line: 280, type: !693, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_commrec*, i32, float*)* @gprod, variables: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !509, !125, !544}
!695 = !{!696, !697, !698, !699, !700, !701}
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 1, scope: !692, file: !1, line: 280, type: !509)
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !692, file: !1, line: 280, type: !125)
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !692, file: !1, line: 280, type: !544)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !692, file: !1, line: 287, type: !125)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !692, file: !1, line: 287, type: !125)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !692, file: !1, line: 287, type: !125)
!702 = !DISubprogram(name: "run_aver", scope: !1, file: !1, line: 388, type: !703, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float, i32, i32)* @run_aver, variables: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{!327, !327, !327, !125, !125}
!705 = !{!706, !707, !708, !709}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "old", arg: 1, scope: !702, file: !1, line: 388, type: !327)
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cur", arg: 2, scope: !702, file: !1, line: 388, type: !327)
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 3, scope: !702, file: !1, line: 388, type: !125)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmem", arg: 4, scope: !702, file: !1, line: 388, type: !125)
!710 = !DISubprogram(name: "do_coupling", scope: !1, file: !1, line: 425, type: !711, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_filenm*, %struct.t_coupl_rec*, float, i32, float*, %struct.t_forcerec*, %struct.t_inputrec*, i32, %struct.t_mdatoms*, %struct.t_idef*, float, i32, %struct.t_commrec*, [3 x float]*, [3 x float]*, [3 x float]*, float*, [3 x float]*, [3 x float]*, i32)* @do_coupling, variables: !828)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !132, !125, !500, !321, !327, !125, !544, !520, !713, !125, !621, !650, !327, !125, !509, !827, !827, !827, !544, !575, !575, !125}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !715, line: 143, baseType: !716)
!715 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!716 = !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 55, size: 4736, align: 64, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !818, !826}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !716, file: !715, line: 56, baseType: !125, size: 32, align: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !716, file: !715, line: 57, baseType: !125, size: 32, align: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !716, file: !715, line: 58, baseType: !125, size: 32, align: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !716, file: !715, line: 59, baseType: !125, size: 32, align: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !716, file: !715, line: 60, baseType: !125, size: 32, align: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !716, file: !715, line: 61, baseType: !125, size: 32, align: 32, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !716, file: !715, line: 62, baseType: !125, size: 32, align: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !716, file: !715, line: 63, baseType: !125, size: 32, align: 32, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !716, file: !715, line: 65, baseType: !125, size: 32, align: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !716, file: !715, line: 66, baseType: !125, size: 32, align: 32, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !716, file: !715, line: 67, baseType: !125, size: 32, align: 32, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !716, file: !715, line: 68, baseType: !125, size: 32, align: 32, offset: 352)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !716, file: !715, line: 69, baseType: !125, size: 32, align: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !716, file: !715, line: 70, baseType: !125, size: 32, align: 32, offset: 416)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !716, file: !715, line: 71, baseType: !327, size: 32, align: 32, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !716, file: !715, line: 72, baseType: !327, size: 32, align: 32, offset: 480)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !716, file: !715, line: 73, baseType: !327, size: 32, align: 32, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !716, file: !715, line: 74, baseType: !125, size: 32, align: 32, offset: 544)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !716, file: !715, line: 74, baseType: !125, size: 32, align: 32, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !716, file: !715, line: 74, baseType: !125, size: 32, align: 32, offset: 608)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !716, file: !715, line: 76, baseType: !125, size: 32, align: 32, offset: 640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !716, file: !715, line: 77, baseType: !327, size: 32, align: 32, offset: 672)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !716, file: !715, line: 79, baseType: !125, size: 32, align: 32, offset: 704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !716, file: !715, line: 80, baseType: !125, size: 32, align: 32, offset: 736)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !716, file: !715, line: 81, baseType: !125, size: 32, align: 32, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !716, file: !715, line: 82, baseType: !125, size: 32, align: 32, offset: 800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !716, file: !715, line: 83, baseType: !125, size: 32, align: 32, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !716, file: !715, line: 84, baseType: !125, size: 32, align: 32, offset: 864)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !716, file: !715, line: 85, baseType: !125, size: 32, align: 32, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !716, file: !715, line: 86, baseType: !125, size: 32, align: 32, offset: 928)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !716, file: !715, line: 87, baseType: !327, size: 32, align: 32, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !716, file: !715, line: 88, baseType: !750, size: 288, align: 32, offset: 992)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !328, line: 105, baseType: !751)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 288, align: 32, elements: !752)
!752 = !{!184, !184}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !716, file: !715, line: 89, baseType: !750, size: 288, align: 32, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !716, file: !715, line: 90, baseType: !125, size: 32, align: 32, offset: 1568)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !716, file: !715, line: 91, baseType: !327, size: 32, align: 32, offset: 1600)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !716, file: !715, line: 92, baseType: !327, size: 32, align: 32, offset: 1632)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !716, file: !715, line: 93, baseType: !125, size: 32, align: 32, offset: 1664)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !716, file: !715, line: 94, baseType: !327, size: 32, align: 32, offset: 1696)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !716, file: !715, line: 95, baseType: !327, size: 32, align: 32, offset: 1728)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !716, file: !715, line: 96, baseType: !125, size: 32, align: 32, offset: 1760)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !716, file: !715, line: 97, baseType: !327, size: 32, align: 32, offset: 1792)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !716, file: !715, line: 98, baseType: !327, size: 32, align: 32, offset: 1824)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !716, file: !715, line: 99, baseType: !327, size: 32, align: 32, offset: 1856)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !716, file: !715, line: 100, baseType: !125, size: 32, align: 32, offset: 1888)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !716, file: !715, line: 101, baseType: !327, size: 32, align: 32, offset: 1920)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !716, file: !715, line: 102, baseType: !327, size: 32, align: 32, offset: 1952)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !716, file: !715, line: 103, baseType: !125, size: 32, align: 32, offset: 1984)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !716, file: !715, line: 104, baseType: !327, size: 32, align: 32, offset: 2016)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !716, file: !715, line: 105, baseType: !327, size: 32, align: 32, offset: 2048)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !716, file: !715, line: 106, baseType: !327, size: 32, align: 32, offset: 2080)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !716, file: !715, line: 107, baseType: !327, size: 32, align: 32, offset: 2112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !716, file: !715, line: 108, baseType: !327, size: 32, align: 32, offset: 2144)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !716, file: !715, line: 109, baseType: !125, size: 32, align: 32, offset: 2176)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !716, file: !715, line: 110, baseType: !125, size: 32, align: 32, offset: 2208)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !716, file: !715, line: 111, baseType: !125, size: 32, align: 32, offset: 2240)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !716, file: !715, line: 112, baseType: !327, size: 32, align: 32, offset: 2272)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !716, file: !715, line: 113, baseType: !327, size: 32, align: 32, offset: 2304)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !716, file: !715, line: 114, baseType: !327, size: 32, align: 32, offset: 2336)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !716, file: !715, line: 115, baseType: !125, size: 32, align: 32, offset: 2368)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !716, file: !715, line: 116, baseType: !327, size: 32, align: 32, offset: 2400)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !716, file: !715, line: 117, baseType: !327, size: 32, align: 32, offset: 2432)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !716, file: !715, line: 118, baseType: !125, size: 32, align: 32, offset: 2464)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !716, file: !715, line: 120, baseType: !125, size: 32, align: 32, offset: 2496)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !716, file: !715, line: 122, baseType: !125, size: 32, align: 32, offset: 2528)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !716, file: !715, line: 124, baseType: !125, size: 32, align: 32, offset: 2560)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !716, file: !715, line: 125, baseType: !125, size: 32, align: 32, offset: 2592)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !716, file: !715, line: 126, baseType: !327, size: 32, align: 32, offset: 2624)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !716, file: !715, line: 127, baseType: !125, size: 32, align: 32, offset: 2656)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !716, file: !715, line: 128, baseType: !327, size: 32, align: 32, offset: 2688)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !716, file: !715, line: 129, baseType: !327, size: 32, align: 32, offset: 2720)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !716, file: !715, line: 130, baseType: !125, size: 32, align: 32, offset: 2752)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !716, file: !715, line: 131, baseType: !327, size: 32, align: 32, offset: 2784)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !716, file: !715, line: 132, baseType: !125, size: 32, align: 32, offset: 2816)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !716, file: !715, line: 133, baseType: !125, size: 32, align: 32, offset: 2848)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !716, file: !715, line: 134, baseType: !125, size: 32, align: 32, offset: 2880)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !716, file: !715, line: 135, baseType: !125, size: 32, align: 32, offset: 2912)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !716, file: !715, line: 136, baseType: !327, size: 32, align: 32, offset: 2944)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !716, file: !715, line: 137, baseType: !327, size: 32, align: 32, offset: 2976)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !716, file: !715, line: 138, baseType: !327, size: 32, align: 32, offset: 3008)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !716, file: !715, line: 139, baseType: !327, size: 32, align: 32, offset: 3040)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !716, file: !715, line: 140, baseType: !802, size: 512, align: 64, offset: 3072)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !715, line: 53, baseType: !803)
!803 = !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 42, size: 512, align: 64, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !817}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !803, file: !715, line: 43, baseType: !125, size: 32, align: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !803, file: !715, line: 44, baseType: !125, size: 32, align: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !803, file: !715, line: 45, baseType: !125, size: 32, align: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !803, file: !715, line: 46, baseType: !125, size: 32, align: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !803, file: !715, line: 47, baseType: !544, size: 64, align: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !803, file: !715, line: 48, baseType: !544, size: 64, align: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !803, file: !715, line: 49, baseType: !544, size: 64, align: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !803, file: !715, line: 50, baseType: !575, size: 64, align: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !803, file: !715, line: 51, baseType: !814, size: 64, align: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !328, line: 107, baseType: !816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 96, align: 32, elements: !183)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !803, file: !715, line: 52, baseType: !572, size: 64, align: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !716, file: !715, line: 141, baseType: !819, size: 576, align: 64, offset: 3584)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 576, align: 64, elements: !183)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !715, line: 40, baseType: !821)
!821 = !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 36, size: 192, align: 64, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !821, file: !715, line: 37, baseType: !125, size: 32, align: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !821, file: !715, line: 38, baseType: !544, size: 64, align: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !821, file: !715, line: 39, baseType: !544, size: 64, align: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !716, file: !715, line: 142, baseType: !819, size: 576, align: 64, offset: 4160)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !884, !885, !886, !887, !888, !889, !890, !895, !896}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !710, file: !1, line: 425, type: !132)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 2, scope: !710, file: !1, line: 425, type: !125)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 3, scope: !710, file: !1, line: 425, type: !500)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 4, scope: !710, file: !1, line: 426, type: !321)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 5, scope: !710, file: !1, line: 426, type: !327)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 6, scope: !710, file: !1, line: 426, type: !125)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ener", arg: 7, scope: !710, file: !1, line: 426, type: !544)
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 8, scope: !710, file: !1, line: 427, type: !520)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 9, scope: !710, file: !1, line: 427, type: !713)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bMaster", arg: 10, scope: !710, file: !1, line: 427, type: !125)
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 11, scope: !710, file: !1, line: 428, type: !621)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 12, scope: !710, file: !1, line: 428, type: !650)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mu_aver", arg: 13, scope: !710, file: !1, line: 428, type: !327)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmols", arg: 14, scope: !710, file: !1, line: 428, type: !125)
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 15, scope: !710, file: !1, line: 429, type: !509)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 16, scope: !710, file: !1, line: 429, type: !827)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "virial", arg: 17, scope: !710, file: !1, line: 429, type: !827)
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pres", arg: 18, scope: !710, file: !1, line: 430, type: !827)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mu_tot", arg: 19, scope: !710, file: !1, line: 430, type: !544)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 20, scope: !710, file: !1, line: 431, type: !575)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 21, scope: !710, file: !1, line: 431, type: !575)
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDoIt", arg: 22, scope: !710, file: !1, line: 431, type: !125)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !710, file: !1, line: 440, type: !125)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !710, file: !1, line: 440, type: !125)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ati", scope: !710, file: !1, line: 440, type: !125)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atj", scope: !710, file: !1, line: 440, type: !125)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atnr2", scope: !710, file: !1, line: 440, type: !125)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !710, file: !1, line: 440, type: !125)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftype", scope: !710, file: !1, line: 440, type: !125)
