; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/dummies.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }
%struct.t_nblist = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32* }
%struct.t_graph = type { i32, i32, i32, i32, i32, i32*, i32**, [3 x i32]* }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }

!208 = !DISubprogram(name: "__inline_isfinitel", scope: !196, file: !196, line: 210, type: !209, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !212)
!209 = !DISubroutineType(types: !210)
!210 = !{!186, !211}
!211 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!212 = !{!213}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !208, file: !196, line: 210, type: !211)
!214 = !DISubprogram(name: "__inline_isinff", scope: !196, file: !196, line: 213, type: !197, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !215)
!215 = !{!216}
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !214, file: !196, line: 213, type: !199)
!217 = !DISubprogram(name: "__inline_isinfd", scope: !196, file: !196, line: 216, type: !203, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !218)
!218 = !{!219}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !217, file: !196, line: 216, type: !205)
!220 = !DISubprogram(name: "__inline_isinfl", scope: !196, file: !196, line: 219, type: !209, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !221)
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !220, file: !196, line: 219, type: !211)
!223 = !DISubprogram(name: "__inline_isnanf", scope: !196, file: !196, line: 222, type: !197, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !224)
!224 = !{!225}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !223, file: !196, line: 222, type: !199)
!226 = !DISubprogram(name: "__inline_isnand", scope: !196, file: !196, line: 225, type: !203, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !227)
!227 = !{!228}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !226, file: !196, line: 225, type: !205)
!229 = !DISubprogram(name: "__inline_isnanl", scope: !196, file: !196, line: 228, type: !209, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !230)
!230 = !{!231}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !229, file: !196, line: 228, type: !211)
!232 = !DISubprogram(name: "__inline_signbitf", scope: !196, file: !196, line: 231, type: !197, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !233)
!233 = !{!234, !235}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !232, file: !196, line: 231, type: !199)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !232, file: !196, line: 232, type: !236)
!236 = !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !196, line: 232, size: 32, align: 32, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !236, file: !196, line: 232, baseType: !199, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !236, file: !196, line: 232, baseType: !240, size: 32, align: 32)
!240 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!241 = !DISubprogram(name: "__inline_signbitd", scope: !196, file: !196, line: 236, type: !203, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !242)
!242 = !{!243, !244}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !241, file: !196, line: 236, type: !205)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !241, file: !196, line: 237, type: !245)
!245 = !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !196, line: 237, size: 64, align: 64, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !245, file: !196, line: 237, baseType: !205, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !245, file: !196, line: 237, baseType: !249, size: 64, align: 64)
!249 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!250 = !DISubprogram(name: "__inline_signbitl", scope: !196, file: !196, line: 242, type: !209, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !251)
!251 = !{!252, !253}
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !250, file: !196, line: 242, type: !211)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !250, file: !196, line: 246, type: !254)
!254 = !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !196, line: 243, size: 128, align: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !254, file: !196, line: 244, baseType: !211, size: 128, align: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !254, file: !196, line: 245, baseType: !258, size: 128, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !196, line: 245, size: 128, align: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !258, file: !196, line: 245, baseType: !249, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !258, file: !196, line: 245, baseType: !262, size: 16, align: 16, offset: 64)
!262 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!263 = !DISubprogram(name: "__inline_isnormalf", scope: !196, file: !196, line: 257, type: !197, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !264)
!264 = !{!265}
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !263, file: !196, line: 257, type: !199)
!266 = !DISubprogram(name: "__inline_isnormald", scope: !196, file: !196, line: 260, type: !203, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !267)
!267 = !{!268}
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !266, file: !196, line: 260, type: !205)
!269 = !DISubprogram(name: "__inline_isnormall", scope: !196, file: !196, line: 263, type: !209, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !270)
!270 = !{!271}
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !269, file: !196, line: 263, type: !211)
!272 = !DISubprogram(name: "__sincosf", scope: !196, file: !196, line: 642, type: !273, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !276)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !199, !275, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!276 = !{!277, !278, !279, !280}
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !272, file: !196, line: 642, type: !199)
!278 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !272, file: !196, line: 642, type: !275)
!279 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !272, file: !196, line: 642, type: !275)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !272, file: !196, line: 643, type: !281)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !196, line: 634, size: 64, align: 32, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !282, file: !196, line: 634, baseType: !199, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !282, file: !196, line: 634, baseType: !199, size: 32, align: 32, offset: 32)
!286 = !DISubprogram(name: "__sincos", scope: !196, file: !196, line: 647, type: !287, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !290)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !205, !289, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!290 = !{!291, !292, !293, !294}
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !286, file: !196, line: 647, type: !205)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !286, file: !196, line: 647, type: !289)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !286, file: !196, line: 647, type: !289)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !286, file: !196, line: 648, type: !295)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !196, line: 635, size: 128, align: 64, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !296, file: !196, line: 635, baseType: !205, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !296, file: !196, line: 635, baseType: !205, size: 64, align: 64, offset: 64)
!300 = !DISubprogram(name: "__sincospif", scope: !196, file: !196, line: 652, type: !273, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !300, file: !196, line: 652, type: !199)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !300, file: !196, line: 652, type: !275)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !300, file: !196, line: 652, type: !275)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !300, file: !196, line: 653, type: !281)
!306 = !DISubprogram(name: "__sincospi", scope: !196, file: !196, line: 657, type: !287, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !306, file: !196, line: 657, type: !205)
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !306, file: !196, line: 657, type: !289)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !306, file: !196, line: 657, type: !289)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !306, file: !196, line: 658, type: !295)
!312 = !DISubprogram(name: "construct_dummies", scope: !1, file: !1, line: 354, type: !313, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, [3 x float]*, %struct.t_nrnb*, float, [3 x float]*, %struct.t_idef*, %struct.t_graph*, %struct.t_commrec*, [3 x float]*, %struct.t_comm_dummies*)* @construct_dummies, variables: !571)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !376, !381, !380, !376, !389, !527, !546, !557, !558}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !317, line: 153, baseType: !318)
!317 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !317, line: 122, size: 1216, align: 64, elements: !319)
!319 = !{!320, !323, !324, !325, !327, !328, !333, !334, !335, !338, !344, !354, !360, !361, !364, !365, !369, !373, !374, !375}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !318, file: !317, line: 123, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !318, file: !317, line: 124, baseType: !186, size: 32, align: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !318, file: !317, line: 125, baseType: !186, size: 32, align: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !318, file: !317, line: 126, baseType: !326, size: 16, align: 16, offset: 128)
!326 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !318, file: !317, line: 127, baseType: !326, size: 16, align: 16, offset: 144)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !318, file: !317, line: 128, baseType: !329, size: 128, align: 64, offset: 192)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !317, line: 88, size: 128, align: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !329, file: !317, line: 89, baseType: !321, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !329, file: !317, line: 90, baseType: !186, size: 32, align: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !318, file: !317, line: 129, baseType: !186, size: 32, align: 32, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !318, file: !317, line: 132, baseType: !187, size: 64, align: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !318, file: !317, line: 133, baseType: !336, size: 64, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !185)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !318, file: !317, line: 134, baseType: !339, size: 64, align: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!186, !187, !342, !186}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !318, file: !317, line: 135, baseType: !345, size: 64, align: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !187, !348, !186}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !317, line: 77, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !350, line: 71, baseType: !351)
!350 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !352, line: 46, baseType: !353)
!352 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!353 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !318, file: !317, line: 136, baseType: !355, size: 64, align: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!186, !187, !358, !186}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !318, file: !317, line: 139, baseType: !329, size: 128, align: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !318, file: !317, line: 140, baseType: !362, size: 64, align: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !317, line: 94, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !318, file: !317, line: 141, baseType: !186, size: 32, align: 32, offset: 896)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !318, file: !317, line: 144, baseType: !366, size: 24, align: 8, offset: 928)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 24, align: 8, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 3)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !318, file: !317, line: 145, baseType: !370, size: 8, align: 8, offset: 952)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 8, align: 8, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 1)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !318, file: !317, line: 148, baseType: !329, size: 128, align: 64, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !318, file: !317, line: 151, baseType: !186, size: 32, align: 32, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !318, file: !317, line: 152, baseType: !348, size: 64, align: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !378, line: 101, baseType: !379)
!378 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 96, align: 32, elements: !367)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !378, line: 87, baseType: !199)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !52, line: 95, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 93, size: 8256, align: 64, elements: !384)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !383, file: !52, line: 94, baseType: !386, size: 8256, align: 64)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 8256, align: 64, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 129)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !4, line: 188, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 179, size: 366336, align: 64, elements: !392)
!392 = !{!393, !394, !395, !396, !399, !511}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !391, file: !4, line: 181, baseType: !186, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !391, file: !4, line: 182, baseType: !186, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !391, file: !4, line: 183, baseType: !186, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !391, file: !4, line: 184, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !4, line: 133, baseType: !186)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !391, file: !4, line: 185, baseType: !400, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !4, line: 131, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_union_type, file: !4, line: 97, size: 192, align: 32, elements: !403)
!403 = !{!404, !410, !417, !423, !432, !437, !444, !452, !457, !462, !468, !473, !480, !489, !498, !507}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !402, file: !4, line: 105, baseType: !405, size: 96, align: 32)
!405 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 105, size: 96, align: 32, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !405, file: !4, line: 105, baseType: !380, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !405, file: !4, line: 105, baseType: !380, size: 32, align: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !405, file: !4, line: 105, baseType: !380, size: 32, align: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !402, file: !4, line: 106, baseType: !411, size: 128, align: 32)
!411 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 106, size: 128, align: 32, elements: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !411, file: !4, line: 106, baseType: !380, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !411, file: !4, line: 106, baseType: !380, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !411, file: !4, line: 106, baseType: !380, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !411, file: !4, line: 106, baseType: !380, size: 32, align: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !402, file: !4, line: 108, baseType: !418, size: 96, align: 32)
!418 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 108, size: 96, align: 32, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !418, file: !4, line: 108, baseType: !380, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !418, file: !4, line: 108, baseType: !380, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !418, file: !4, line: 108, baseType: !380, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !402, file: !4, line: 110, baseType: !424, size: 192, align: 32)
!424 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 110, size: 192, align: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !424, file: !4, line: 110, baseType: !380, size: 32, align: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !424, file: !4, line: 110, baseType: !380, size: 32, align: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !424, file: !4, line: 110, baseType: !380, size: 32, align: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !424, file: !4, line: 110, baseType: !380, size: 32, align: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !424, file: !4, line: 110, baseType: !380, size: 32, align: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !424, file: !4, line: 110, baseType: !380, size: 32, align: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !402, file: !4, line: 111, baseType: !433, size: 64, align: 32)
!433 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 111, size: 64, align: 32, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !433, file: !4, line: 111, baseType: !380, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !433, file: !4, line: 111, baseType: !380, size: 32, align: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !402, file: !4, line: 112, baseType: !438, size: 128, align: 32)
!438 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 112, size: 128, align: 32, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !438, file: !4, line: 112, baseType: !380, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !438, file: !4, line: 112, baseType: !380, size: 32, align: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !438, file: !4, line: 112, baseType: !380, size: 32, align: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !438, file: !4, line: 112, baseType: !380, size: 32, align: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !402, file: !4, line: 117, baseType: !445, size: 160, align: 32)
!445 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 117, size: 160, align: 32, elements: !446)
!446 = !{!447, !448, !449, !450, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !445, file: !4, line: 117, baseType: !380, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !445, file: !4, line: 117, baseType: !380, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !445, file: !4, line: 117, baseType: !186, size: 32, align: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !445, file: !4, line: 117, baseType: !380, size: 32, align: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !445, file: !4, line: 117, baseType: !380, size: 32, align: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !402, file: !4, line: 118, baseType: !453, size: 64, align: 32)
!453 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 118, size: 64, align: 32, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !453, file: !4, line: 118, baseType: !380, size: 32, align: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !453, file: !4, line: 118, baseType: !380, size: 32, align: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !402, file: !4, line: 123, baseType: !458, size: 64, align: 32)
!458 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 123, size: 64, align: 32, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !458, file: !4, line: 123, baseType: !380, size: 32, align: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !458, file: !4, line: 123, baseType: !380, size: 32, align: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !402, file: !4, line: 124, baseType: !463, size: 96, align: 32)
!463 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 124, size: 96, align: 32, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !463, file: !4, line: 124, baseType: !380, size: 32, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !463, file: !4, line: 124, baseType: !380, size: 32, align: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !463, file: !4, line: 124, baseType: !380, size: 32, align: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !402, file: !4, line: 125, baseType: !469, size: 192, align: 32)
!469 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 125, size: 192, align: 32, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !469, file: !4, line: 125, baseType: !379, size: 96, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !469, file: !4, line: 125, baseType: !379, size: 96, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !402, file: !4, line: 126, baseType: !474, size: 192, align: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 126, size: 192, align: 32, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !474, file: !4, line: 126, baseType: !477, size: 192, align: 32)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 192, align: 32, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 6)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !402, file: !4, line: 127, baseType: !481, size: 192, align: 32)
!481 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 127, size: 192, align: 32, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !481, file: !4, line: 127, baseType: !380, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !481, file: !4, line: 127, baseType: !380, size: 32, align: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !481, file: !4, line: 127, baseType: !380, size: 32, align: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !481, file: !4, line: 127, baseType: !380, size: 32, align: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !481, file: !4, line: 127, baseType: !380, size: 32, align: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !481, file: !4, line: 127, baseType: !380, size: 32, align: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !402, file: !4, line: 128, baseType: !490, size: 192, align: 32)
!490 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 128, size: 192, align: 32, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !490, file: !4, line: 128, baseType: !380, size: 32, align: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !490, file: !4, line: 128, baseType: !380, size: 32, align: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !490, file: !4, line: 128, baseType: !380, size: 32, align: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !490, file: !4, line: 128, baseType: !380, size: 32, align: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !4, line: 128, baseType: !186, size: 32, align: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !490, file: !4, line: 128, baseType: !186, size: 32, align: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !402, file: !4, line: 129, baseType: !499, size: 192, align: 32)
!499 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 129, size: 192, align: 32, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !499, file: !4, line: 129, baseType: !186, size: 32, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !499, file: !4, line: 129, baseType: !186, size: 32, align: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !499, file: !4, line: 129, baseType: !186, size: 32, align: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !499, file: !4, line: 129, baseType: !380, size: 32, align: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !499, file: !4, line: 129, baseType: !380, size: 32, align: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !499, file: !4, line: 129, baseType: !380, size: 32, align: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !402, file: !4, line: 130, baseType: !508, size: 192, align: 32)
!508 = !DICompositeType(tag: DW_TAG_structure_type, scope: !402, file: !4, line: 130, size: 192, align: 32, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !508, file: !4, line: 130, baseType: !477, size: 192, align: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !391, file: !4, line: 187, baseType: !512, size: 366080, align: 64, offset: 256)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 366080, align: 64, elements: !525)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !4, line: 140, baseType: !514)
!514 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 135, size: 8320, align: 64, elements: !515)
!515 = !{!516, !517, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !514, file: !4, line: 137, baseType: !186, size: 32, align: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !514, file: !4, line: 138, baseType: !518, size: 8192, align: 32, offset: 32)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 8192, align: 32, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !514, file: !4, line: 139, baseType: !522, size: 64, align: 64, offset: 8256)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !4, line: 45, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !378, line: 73, baseType: !186)
!525 = !{!526}
!526 = !DISubrange(count: 44)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_graph", file: !529, line: 47, baseType: !530)
!529 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!530 = !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 38, size: 384, align: 64, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !539, !542}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "maxbond", scope: !530, file: !529, line: 39, baseType: !186, size: 32, align: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !530, file: !529, line: 40, baseType: !186, size: 32, align: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nbound", scope: !530, file: !529, line: 41, baseType: !186, size: 32, align: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !530, file: !529, line: 42, baseType: !186, size: 32, align: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !530, file: !529, line: 43, baseType: !186, size: 32, align: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nedge", scope: !530, file: !529, line: 44, baseType: !538, size: 64, align: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "edge", scope: !530, file: !529, line: 45, baseType: !540, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ishift", scope: !530, file: !529, line: 46, baseType: !543, size: 64, align: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !378, line: 107, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 96, align: 32, elements: !367)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !548, line: 40, baseType: !549)
!548 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!549 = !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 36, size: 192, align: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !549, file: !548, line: 37, baseType: !186, size: 32, align: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !549, file: !548, line: 37, baseType: !186, size: 32, align: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !549, file: !548, line: 38, baseType: !186, size: 32, align: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !549, file: !548, line: 38, baseType: !186, size: 32, align: 32, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !549, file: !548, line: 39, baseType: !186, size: 32, align: 32, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !549, file: !548, line: 39, baseType: !186, size: 32, align: 32, offset: 160)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_comm_dummies", file: !560, line: 53, baseType: !561)
!560 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/dummies.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!561 = !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 44, size: 384, align: 64, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nprevdum", scope: !561, file: !560, line: 45, baseType: !186, size: 32, align: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nnextdum", scope: !561, file: !560, line: 46, baseType: !186, size: 32, align: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "idxprevdum", scope: !561, file: !560, line: 47, baseType: !538, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "idxnextdum", scope: !561, file: !560, line: 48, baseType: !538, size: 64, align: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nprevconstr", scope: !561, file: !560, line: 49, baseType: !186, size: 32, align: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nnextconstr", scope: !561, file: !560, line: 50, baseType: !186, size: 32, align: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "idxprevconstr", scope: !561, file: !560, line: 51, baseType: !538, size: 64, align: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "idxnextconstr", scope: !561, file: !560, line: 52, baseType: !538, size: 64, align: 64, offset: 320)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !312, file: !1, line: 354, type: !315)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !312, file: !1, line: 354, type: !376)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 3, scope: !312, file: !1, line: 354, type: !381)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dt", arg: 4, scope: !312, file: !1, line: 354, type: !380)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 5, scope: !312, file: !1, line: 355, type: !376)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 6, scope: !312, file: !1, line: 355, type: !389)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "graph", arg: 7, scope: !312, file: !1, line: 355, type: !527)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 8, scope: !312, file: !1, line: 355, type: !546)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 9, scope: !312, file: !1, line: 356, type: !557)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummycomm", arg: 10, scope: !312, file: !1, line: 356, type: !558)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xd", scope: !312, file: !1, line: 358, type: !377)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vv", scope: !312, file: !1, line: 358, type: !377)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !312, file: !1, line: 359, type: !380)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b1", scope: !312, file: !1, line: 359, type: !380)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !312, file: !1, line: 359, type: !380)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inv_dt", scope: !312, file: !1, line: 359, type: !380)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !312, file: !1, line: 360, type: !186)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ii", scope: !312, file: !1, line: 360, type: !186)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !312, file: !1, line: 360, type: !186)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrd", scope: !312, file: !1, line: 360, type: !186)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !312, file: !1, line: 360, type: !186)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftype", scope: !312, file: !1, line: 360, type: !186)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adum", scope: !312, file: !1, line: 361, type: !523)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !312, file: !1, line: 361, type: !523)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aj", scope: !312, file: !1, line: 361, type: !523)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ak", scope: !312, file: !1, line: 361, type: !523)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "al", scope: !312, file: !1, line: 361, type: !523)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !312, file: !1, line: 362, type: !522)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ip", scope: !312, file: !1, line: 363, type: !400)
!601 = !DISubprogram(name: "spread_dummy_f", scope: !1, file: !1, line: 698, type: !602, isLocal: false, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, [3 x float]*, [3 x float]*, %struct.t_nrnb*, %struct.t_idef*, %struct.t_comm_dummies*, %struct.t_commrec*)* @spread_dummy_f, variables: !604)
!602 = !DISubroutineType(types: !603)
