; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ebin.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_ebin = type { i32, i8**, %struct.t_energy* }
%struct.t_energy = type { float, double, double, float }

@.str = private unnamed_addr constant [3 x i8] c"eb\00", align 1
@.str1 = private unnamed_addr constant [64 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ebin.c\00", align 1
@.str2 = private unnamed_addr constant [6 x i8] c"eb->e\00", align 1
@.str3 = private unnamed_addr constant [8 x i8] c"eb->enm\00", align 1
@.str4 = private unnamed_addr constant [59 x i8] c"%s-%d: Energies out of range: index=%d nener=%d maxener=%d\00", align 1
@.str5 = private unnamed_addr constant [29 x i8] c"Invalid index in pr_ebin: %d\00", align 1
@.str6 = private unnamed_addr constant [5 x i8] c"%15s\00", align 1
@.str8 = private unnamed_addr constant [33 x i8] c"Invalid print mode %d in pr_ebin\00", align 1
@.str9 = private unnamed_addr constant [10 x i8] c"   %12.5e\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !13, globals: !170, imports: !170)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ebin.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 50, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ebin.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "eprNORMAL", value: 0)
!7 = !DIEnumerator(name: "eprAVER", value: 1)
!8 = !DIEnumerator(name: "eprRMS", value: 2)
!9 = !DIEnumerator(name: "eprNR", value: 3)
!10 = !{!11, !12}
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!13 = !{!14, !83, !89, !114, !123, !140, !156, !162}
!14 = !DISubprogram(name: "__sputc", scope: !15, file: !15, line: 348, type: !16, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !80)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !18, !19}
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !15, line: 153, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !15, line: 122, size: 1216, align: 64, elements: !22)
!22 = !{!23, !26, !27, !28, !30, !31, !36, !37, !39, !43, !48, !58, !64, !65, !68, !69, !73, !77, !78, !79}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !21, file: !15, line: 123, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !21, file: !15, line: 124, baseType: !18, size: 32, align: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !21, file: !15, line: 125, baseType: !18, size: 32, align: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !21, file: !15, line: 126, baseType: !29, size: 16, align: 16, offset: 128)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !21, file: !15, line: 127, baseType: !29, size: 16, align: 16, offset: 144)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !21, file: !15, line: 128, baseType: !32, size: 128, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !15, line: 88, size: 128, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !32, file: !15, line: 89, baseType: !24, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !32, file: !15, line: 90, baseType: !18, size: 32, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !21, file: !15, line: 129, baseType: !18, size: 32, align: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !21, file: !15, line: 132, baseType: !38, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !21, file: !15, line: 133, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!18, !38}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !21, file: !15, line: 134, baseType: !44, size: 64, align: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!18, !38, !47, !18}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !21, file: !15, line: 135, baseType: !49, size: 64, align: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !38, !52, !18}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !15, line: 77, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !54, line: 71, baseType: !55)
!54 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !21, file: !15, line: 136, baseType: !59, size: 64, align: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!18, !38, !62, !18}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !21, file: !15, line: 139, baseType: !32, size: 128, align: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !21, file: !15, line: 140, baseType: !66, size: 64, align: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !15, line: 94, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !21, file: !15, line: 141, baseType: !18, size: 32, align: 32, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !21, file: !15, line: 144, baseType: !70, size: 24, align: 8, offset: 928)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 24, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 3)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !21, file: !15, line: 145, baseType: !74, size: 8, align: 8, offset: 952)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 1)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !21, file: !15, line: 148, baseType: !32, size: 128, align: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !21, file: !15, line: 151, baseType: !18, size: 32, align: 32, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !21, file: !15, line: 152, baseType: !52, size: 64, align: 64, offset: 1152)
!80 = !{!81, !82}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !14, file: !15, line: 348, type: !18)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !14, file: !15, line: 348, type: !19)
!83 = !DISubprogram(name: "__sigbits", scope: !84, file: !84, line: 114, type: !85, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !87)
!84 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!85 = !DISubroutineType(types: !86)
!86 = !{!18, !18}
!87 = !{!88}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !83, file: !84, line: 114, type: !18)
!89 = !DISubprogram(name: "mk_ebin", scope: !1, file: !1, line: 59, type: !90, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_ebin* ()* @mk_ebin, variables: !112)
!90 = !DISubroutineType(types: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ebin", file: !4, line: 48, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 44, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nener", scope: !94, file: !4, line: 45, baseType: !18, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "enm", scope: !94, file: !4, line: 46, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !94, file: !4, line: 47, baseType: !100, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_energy", file: !102, line: 41, baseType: !103)
!102 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/energy.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 36, size: 256, align: 64, elements: !104)
!104 = !{!105, !109, !110, !111}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !103, file: !102, line: 37, baseType: !106, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !107, line: 87, baseType: !108)
!107 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "eav", scope: !103, file: !102, line: 38, baseType: !12, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "esum", scope: !103, file: !102, line: 39, baseType: !12, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "e2sum", scope: !103, file: !102, line: 40, baseType: !106, size: 32, align: 32, offset: 192)
!112 = !{!113}
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eb", scope: !89, file: !1, line: 61, type: !92)
!114 = !DISubprogram(name: "get_ebin_space", scope: !1, file: !1, line: 68, type: !115, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_ebin*, i32, i8**)* @get_ebin_space, variables: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!18, !92, !18, !98}
!117 = !{!118, !119, !120, !121, !122}
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eb", arg: 1, scope: !114, file: !1, line: 68, type: !92)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nener", arg: 2, scope: !114, file: !1, line: 68, type: !18)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enm", arg: 3, scope: !114, file: !1, line: 68, type: !98)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !114, file: !1, line: 70, type: !18)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !114, file: !1, line: 71, type: !18)
!123 = !DISubprogram(name: "add_ebin", scope: !1, file: !1, line: 87, type: !124, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_ebin*, i32, i32, float*, i32)* @add_ebin, variables: !127)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !92, !18, !18, !126, !18}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eb", arg: 1, scope: !123, file: !1, line: 87, type: !92)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !123, file: !1, line: 87, type: !18)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nener", arg: 3, scope: !123, file: !1, line: 87, type: !18)
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ener", arg: 4, scope: !123, file: !1, line: 87, type: !126)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 5, scope: !123, file: !1, line: 87, type: !18)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !123, file: !1, line: 89, type: !18)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !123, file: !1, line: 89, type: !18)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !123, file: !1, line: 90, type: !12)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !123, file: !1, line: 90, type: !12)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sigma", scope: !123, file: !1, line: 90, type: !12)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invmm", scope: !123, file: !1, line: 90, type: !12)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eg", scope: !123, file: !1, line: 91, type: !100)
!140 = !DISubprogram(name: "pr_ebin", scope: !1, file: !1, line: 116, type: !141, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_ebin*, i32, i32, i32, i32, i32, i32)* @pr_ebin, variables: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !19, !92, !18, !18, !18, !18, !18, !18}
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !140, file: !1, line: 116, type: !19)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eb", arg: 2, scope: !140, file: !1, line: 116, type: !92)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !140, file: !1, line: 116, type: !18)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nener", arg: 4, scope: !140, file: !1, line: 116, type: !18)
