; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/edsam.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_filenm = type { i32, i8*, i8*, i64 }
%struct.t_edsamyn = type { i32, i8*, i8* }
%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_ilist = type { i32, [256 x i32], i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }

!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !72, file: !67, line: 207, type: !75)
!78 = !DISubprogram(name: "__inline_isfinitel", scope: !67, file: !67, line: 210, type: !79, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !82)
!79 = !DISubroutineType(types: !80)
!80 = !{!54, !81}
!81 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!82 = !{!83}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !78, file: !67, line: 210, type: !81)
!84 = !DISubprogram(name: "__inline_isinff", scope: !67, file: !67, line: 213, type: !68, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !85)
!85 = !{!86}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !84, file: !67, line: 213, type: !57)
!87 = !DISubprogram(name: "__inline_isinfd", scope: !67, file: !67, line: 216, type: !73, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !88)
!88 = !{!89}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !87, file: !67, line: 216, type: !75)
!90 = !DISubprogram(name: "__inline_isinfl", scope: !67, file: !67, line: 219, type: !79, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !91)
!91 = !{!92}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !90, file: !67, line: 219, type: !81)
!93 = !DISubprogram(name: "__inline_isnanf", scope: !67, file: !67, line: 222, type: !68, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !94)
!94 = !{!95}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !93, file: !67, line: 222, type: !57)
!96 = !DISubprogram(name: "__inline_isnand", scope: !67, file: !67, line: 225, type: !73, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !97)
!97 = !{!98}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !96, file: !67, line: 225, type: !75)
!99 = !DISubprogram(name: "__inline_isnanl", scope: !67, file: !67, line: 228, type: !79, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !100)
!100 = !{!101}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !99, file: !67, line: 228, type: !81)
!102 = !DISubprogram(name: "__inline_signbitf", scope: !67, file: !67, line: 231, type: !68, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !103)
!103 = !{!104, !105}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !102, file: !67, line: 231, type: !57)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !102, file: !67, line: 232, type: !106)
!106 = !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !67, line: 232, size: 32, align: 32, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !106, file: !67, line: 232, baseType: !57, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !106, file: !67, line: 232, baseType: !110, size: 32, align: 32)
!110 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!111 = !DISubprogram(name: "__inline_signbitd", scope: !67, file: !67, line: 236, type: !73, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !112)
!112 = !{!113, !114}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !111, file: !67, line: 236, type: !75)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !111, file: !67, line: 237, type: !115)
!115 = !DICompositeType(tag: DW_TAG_union_type, scope: !111, file: !67, line: 237, size: 64, align: 64, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !115, file: !67, line: 237, baseType: !75, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !115, file: !67, line: 237, baseType: !119, size: 64, align: 64)
!119 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!120 = !DISubprogram(name: "__inline_signbitl", scope: !67, file: !67, line: 242, type: !79, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !121)
!121 = !{!122, !123}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !120, file: !67, line: 242, type: !81)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !120, file: !67, line: 246, type: !124)
!124 = !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !67, line: 243, size: 128, align: 128, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !124, file: !67, line: 244, baseType: !81, size: 128, align: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !124, file: !67, line: 245, baseType: !128, size: 128, align: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !67, line: 245, size: 128, align: 64, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !128, file: !67, line: 245, baseType: !119, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !128, file: !67, line: 245, baseType: !132, size: 16, align: 16, offset: 64)
!132 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!133 = !DISubprogram(name: "__inline_isnormalf", scope: !67, file: !67, line: 257, type: !68, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !134)
!134 = !{!135}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !133, file: !67, line: 257, type: !57)
!136 = !DISubprogram(name: "__inline_isnormald", scope: !67, file: !67, line: 260, type: !73, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !137)
!137 = !{!138}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !136, file: !67, line: 260, type: !75)
!139 = !DISubprogram(name: "__inline_isnormall", scope: !67, file: !67, line: 263, type: !79, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !140)
!140 = !{!141}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !139, file: !67, line: 263, type: !81)
!142 = !DISubprogram(name: "__sincosf", scope: !67, file: !67, line: 642, type: !143, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !146)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !57, !145, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!146 = !{!147, !148, !149, !150}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !142, file: !67, line: 642, type: !57)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !142, file: !67, line: 642, type: !145)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !142, file: !67, line: 642, type: !145)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !142, file: !67, line: 643, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !67, line: 634, size: 64, align: 32, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !152, file: !67, line: 634, baseType: !57, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !152, file: !67, line: 634, baseType: !57, size: 32, align: 32, offset: 32)
!156 = !DISubprogram(name: "__sincos", scope: !67, file: !67, line: 647, type: !157, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !160)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !75, !159, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!160 = !{!161, !162, !163, !164}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !156, file: !67, line: 647, type: !75)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !156, file: !67, line: 647, type: !159)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !156, file: !67, line: 647, type: !159)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !156, file: !67, line: 648, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !67, line: 635, size: 128, align: 64, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !166, file: !67, line: 635, baseType: !75, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !166, file: !67, line: 635, baseType: !75, size: 64, align: 64, offset: 64)
!170 = !DISubprogram(name: "__sincospif", scope: !67, file: !67, line: 652, type: !143, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !170, file: !67, line: 652, type: !57)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !170, file: !67, line: 652, type: !145)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !170, file: !67, line: 652, type: !145)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !170, file: !67, line: 653, type: !151)
!176 = !DISubprogram(name: "__sincospi", scope: !67, file: !67, line: 657, type: !157, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !176, file: !67, line: 657, type: !75)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !176, file: !67, line: 657, type: !159)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !176, file: !67, line: 657, type: !159)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !176, file: !67, line: 658, type: !165)
!182 = !DISubprogram(name: "ed_open", scope: !1, file: !1, line: 55, type: !183, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.t_filenm*, %struct.t_edsamyn*)* @ed_open, variables: !204)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !54, !185, !196}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !4, line: 62, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 57, size: 256, align: 64, elements: !188)
!188 = !{!189, !190, !193, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !187, file: !4, line: 58, baseType: !54, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !187, file: !4, line: 59, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !187, file: !4, line: 60, baseType: !191, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !4, line: 61, baseType: !195, size: 64, align: 64, offset: 192)
!195 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_edsamyn", file: !198, line: 40, baseType: !199)
!198 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/edsams.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!199 = !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 36, size: 192, align: 64, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "bEdsam", scope: !199, file: !198, line: 37, baseType: !54, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "edinam", scope: !199, file: !198, line: 38, baseType: !191, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "edonam", scope: !199, file: !198, line: 39, baseType: !191, size: 64, align: 64, offset: 128)
!204 = !{!205, !206, !207}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 1, scope: !182, file: !1, line: 55, type: !54)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 2, scope: !182, file: !1, line: 55, type: !185)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edyn", arg: 3, scope: !182, file: !1, line: 55, type: !196)
!208 = !DISubprogram(name: "init_edsam", scope: !1, file: !1, line: 63, type: !209, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_topology*, %struct.t_mdatoms*, i32, i32, [3 x float]*, [3 x float]*, %struct.t_edsamyn*, %struct.t_edpar*)* @init_edsam, variables: !590)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211, !271, !501, !54, !54, !531, !533, !196, !534}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !213, line: 153, baseType: !214)
!213 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !213, line: 122, size: 1216, align: 64, elements: !215)
!215 = !{!216, !219, !220, !221, !223, !224, !229, !230, !231, !235, !239, !249, !255, !256, !259, !260, !264, !268, !269, !270}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !214, file: !213, line: 123, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !214, file: !213, line: 124, baseType: !54, size: 32, align: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !214, file: !213, line: 125, baseType: !54, size: 32, align: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !214, file: !213, line: 126, baseType: !222, size: 16, align: 16, offset: 128)
!222 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !214, file: !213, line: 127, baseType: !222, size: 16, align: 16, offset: 144)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !214, file: !213, line: 128, baseType: !225, size: 128, align: 64, offset: 192)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !213, line: 88, size: 128, align: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !225, file: !213, line: 89, baseType: !217, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !225, file: !213, line: 90, baseType: !54, size: 32, align: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !214, file: !213, line: 129, baseType: !54, size: 32, align: 32, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !214, file: !213, line: 132, baseType: !58, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !214, file: !213, line: 133, baseType: !232, size: 64, align: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!54, !58}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !214, file: !213, line: 134, baseType: !236, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!54, !58, !191, !54}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !214, file: !213, line: 135, baseType: !240, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !58, !243, !54}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !213, line: 77, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !245, line: 71, baseType: !246)
!245 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!248 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !214, file: !213, line: 136, baseType: !250, size: 64, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!54, !58, !253, !54}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !214, file: !213, line: 139, baseType: !225, size: 128, align: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !214, file: !213, line: 140, baseType: !257, size: 64, align: 64, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !213, line: 94, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !214, file: !213, line: 141, baseType: !54, size: 32, align: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !214, file: !213, line: 144, baseType: !261, size: 24, align: 8, offset: 928)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 24, align: 8, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 3)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !214, file: !213, line: 145, baseType: !265, size: 8, align: 8, offset: 952)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 8, align: 8, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 1)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !214, file: !213, line: 148, baseType: !225, size: 128, align: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !214, file: !213, line: 151, baseType: !54, size: 32, align: 32, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !214, file: !213, line: 152, baseType: !243, size: 64, align: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !273, line: 42, baseType: !274)
!273 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!274 = !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 36, size: 402112, align: 64, elements: !275)
!275 = !{!276, !278, !418, !484, !486}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !273, line: 37, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !274, file: !273, line: 38, baseType: !279, size: 366336, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !280, line: 188, baseType: !281)
!280 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!281 = !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 179, size: 366336, align: 64, elements: !282)
!282 = !{!283, !284, !285, !286, !289, !402}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !281, file: !280, line: 181, baseType: !54, size: 32, align: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !281, file: !280, line: 182, baseType: !54, size: 32, align: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !281, file: !280, line: 183, baseType: !54, size: 32, align: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !281, file: !280, line: 184, baseType: !287, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !280, line: 133, baseType: !54)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !281, file: !280, line: 185, baseType: !290, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !280, line: 131, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_union_type, file: !280, line: 97, size: 192, align: 32, elements: !293)
!293 = !{!294, !300, !307, !313, !322, !327, !334, !342, !347, !352, !358, !364, !371, !380, !389, !398}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !292, file: !280, line: 105, baseType: !295, size: 96, align: 32)
!295 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 105, size: 96, align: 32, elements: !296)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !295, file: !280, line: 105, baseType: !55, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !295, file: !280, line: 105, baseType: !55, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !295, file: !280, line: 105, baseType: !55, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !292, file: !280, line: 106, baseType: !301, size: 128, align: 32)
!301 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 106, size: 128, align: 32, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !301, file: !280, line: 106, baseType: !55, size: 32, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !301, file: !280, line: 106, baseType: !55, size: 32, align: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !301, file: !280, line: 106, baseType: !55, size: 32, align: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !301, file: !280, line: 106, baseType: !55, size: 32, align: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !292, file: !280, line: 108, baseType: !308, size: 96, align: 32)
!308 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 108, size: 96, align: 32, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !308, file: !280, line: 108, baseType: !55, size: 32, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !308, file: !280, line: 108, baseType: !55, size: 32, align: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !308, file: !280, line: 108, baseType: !55, size: 32, align: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !292, file: !280, line: 110, baseType: !314, size: 192, align: 32)
!314 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 110, size: 192, align: 32, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !314, file: !280, line: 110, baseType: !55, size: 32, align: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !314, file: !280, line: 110, baseType: !55, size: 32, align: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !314, file: !280, line: 110, baseType: !55, size: 32, align: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !314, file: !280, line: 110, baseType: !55, size: 32, align: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !314, file: !280, line: 110, baseType: !55, size: 32, align: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !314, file: !280, line: 110, baseType: !55, size: 32, align: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !292, file: !280, line: 111, baseType: !323, size: 64, align: 32)
!323 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 111, size: 64, align: 32, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !323, file: !280, line: 111, baseType: !55, size: 32, align: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !323, file: !280, line: 111, baseType: !55, size: 32, align: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !292, file: !280, line: 112, baseType: !328, size: 128, align: 32)
!328 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 112, size: 128, align: 32, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !328, file: !280, line: 112, baseType: !55, size: 32, align: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !328, file: !280, line: 112, baseType: !55, size: 32, align: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !328, file: !280, line: 112, baseType: !55, size: 32, align: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !328, file: !280, line: 112, baseType: !55, size: 32, align: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !292, file: !280, line: 117, baseType: !335, size: 160, align: 32)
!335 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 117, size: 160, align: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !335, file: !280, line: 117, baseType: !55, size: 32, align: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !335, file: !280, line: 117, baseType: !55, size: 32, align: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !335, file: !280, line: 117, baseType: !54, size: 32, align: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !335, file: !280, line: 117, baseType: !55, size: 32, align: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !335, file: !280, line: 117, baseType: !55, size: 32, align: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !292, file: !280, line: 118, baseType: !343, size: 64, align: 32)
!343 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 118, size: 64, align: 32, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !343, file: !280, line: 118, baseType: !55, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !343, file: !280, line: 118, baseType: !55, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !292, file: !280, line: 123, baseType: !348, size: 64, align: 32)
!348 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 123, size: 64, align: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !348, file: !280, line: 123, baseType: !55, size: 32, align: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !348, file: !280, line: 123, baseType: !55, size: 32, align: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !292, file: !280, line: 124, baseType: !353, size: 96, align: 32)
!353 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 124, size: 96, align: 32, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !353, file: !280, line: 124, baseType: !55, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !353, file: !280, line: 124, baseType: !55, size: 32, align: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !353, file: !280, line: 124, baseType: !55, size: 32, align: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !292, file: !280, line: 125, baseType: !359, size: 192, align: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 125, size: 192, align: 32, elements: !360)
!360 = !{!361, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !359, file: !280, line: 125, baseType: !362, size: 96, align: 32)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 96, align: 32, elements: !262)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !359, file: !280, line: 125, baseType: !362, size: 96, align: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !292, file: !280, line: 126, baseType: !365, size: 192, align: 32)
!365 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 126, size: 192, align: 32, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !365, file: !280, line: 126, baseType: !368, size: 192, align: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 192, align: 32, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 6)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !292, file: !280, line: 127, baseType: !372, size: 192, align: 32)
!372 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 127, size: 192, align: 32, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !372, file: !280, line: 127, baseType: !55, size: 32, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !372, file: !280, line: 127, baseType: !55, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !372, file: !280, line: 127, baseType: !55, size: 32, align: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !372, file: !280, line: 127, baseType: !55, size: 32, align: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !372, file: !280, line: 127, baseType: !55, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !372, file: !280, line: 127, baseType: !55, size: 32, align: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !292, file: !280, line: 128, baseType: !381, size: 192, align: 32)
!381 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 128, size: 192, align: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !381, file: !280, line: 128, baseType: !55, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !381, file: !280, line: 128, baseType: !55, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !381, file: !280, line: 128, baseType: !55, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !381, file: !280, line: 128, baseType: !55, size: 32, align: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !280, line: 128, baseType: !54, size: 32, align: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !381, file: !280, line: 128, baseType: !54, size: 32, align: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !292, file: !280, line: 129, baseType: !390, size: 192, align: 32)
!390 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 129, size: 192, align: 32, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !390, file: !280, line: 129, baseType: !54, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !390, file: !280, line: 129, baseType: !54, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !390, file: !280, line: 129, baseType: !54, size: 32, align: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !390, file: !280, line: 129, baseType: !55, size: 32, align: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !390, file: !280, line: 129, baseType: !55, size: 32, align: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !390, file: !280, line: 129, baseType: !55, size: 32, align: 32, offset: 160)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !292, file: !280, line: 130, baseType: !399, size: 192, align: 32)
!399 = !DICompositeType(tag: DW_TAG_structure_type, scope: !292, file: !280, line: 130, size: 192, align: 32, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !399, file: !280, line: 130, baseType: !368, size: 192, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !281, file: !280, line: 187, baseType: !403, size: 366080, align: 64, offset: 256)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 366080, align: 64, elements: !416)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !280, line: 140, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 135, size: 8320, align: 64, elements: !406)
!406 = !{!407, !408, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !405, file: !280, line: 137, baseType: !54, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !405, file: !280, line: 138, baseType: !409, size: 8192, align: 32, offset: 32)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8192, align: 32, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !405, file: !280, line: 139, baseType: !413, size: 64, align: 64, offset: 8256)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !280, line: 45, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !56, line: 73, baseType: !54)
!416 = !{!417}
!417 = !DISubrange(count: 44)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !274, file: !273, line: 39, baseType: !419, size: 10240, align: 64, offset: 366400)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !420, line: 94, baseType: !421)
!420 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 75, size: 10240, align: 64, elements: !422)
!422 = !{!423, !424, !442, !444, !445, !446, !447, !448, !449, !450, !461, !469}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !421, file: !420, line: 76, baseType: !54, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !421, file: !420, line: 77, baseType: !425, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !420, line: 57, baseType: !427)
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 48, size: 320, align: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !441}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !427, file: !420, line: 49, baseType: !55, size: 32, align: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !427, file: !420, line: 49, baseType: !55, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !427, file: !420, line: 50, baseType: !55, size: 32, align: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !427, file: !420, line: 50, baseType: !55, size: 32, align: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !420, line: 51, baseType: !132, size: 16, align: 16, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !427, file: !420, line: 52, baseType: !132, size: 16, align: 16, offset: 144)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !427, file: !420, line: 53, baseType: !54, size: 32, align: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !427, file: !420, line: 54, baseType: !54, size: 32, align: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !427, file: !420, line: 55, baseType: !438, size: 72, align: 8, offset: 224)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 72, align: 8, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 9)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !427, file: !420, line: 56, baseType: !218, size: 8, align: 8, offset: 296)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !421, file: !420, line: 80, baseType: !443, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !421, file: !420, line: 82, baseType: !443, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !421, file: !420, line: 84, baseType: !443, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !421, file: !420, line: 86, baseType: !54, size: 32, align: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !421, file: !420, line: 87, baseType: !443, size: 64, align: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !421, file: !420, line: 89, baseType: !54, size: 32, align: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !421, file: !420, line: 90, baseType: !443, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !421, file: !420, line: 91, baseType: !451, size: 8448, align: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !452, line: 52, baseType: !453)
!452 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!453 = !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 36, size: 8448, align: 64, elements: !454)
!454 = !{!455, !456, !457, !459, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !453, file: !452, line: 37, baseType: !409, size: 8192, align: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !453, file: !452, line: 43, baseType: !54, size: 32, align: 32, offset: 8192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !453, file: !452, line: 44, baseType: !458, size: 64, align: 64, offset: 8256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !453, file: !452, line: 45, baseType: !54, size: 32, align: 32, offset: 8320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !453, file: !452, line: 46, baseType: !458, size: 64, align: 64, offset: 8384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !421, file: !420, line: 92, baseType: !462, size: 1152, align: 64, offset: 9024)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1152, align: 64, elements: !439)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !420, line: 73, baseType: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 70, size: 128, align: 64, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !464, file: !420, line: 71, baseType: !54, size: 32, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !464, file: !420, line: 72, baseType: !468, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !421, file: !420, line: 93, baseType: !470, size: 64, align: 64, offset: 10176)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !420, line: 68, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 59, size: 416, align: 32, elements: !473)
!473 = !{!474, !475, !476, !477, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !420, line: 60, baseType: !54, size: 32, align: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !472, file: !420, line: 61, baseType: !54, size: 32, align: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !472, file: !420, line: 62, baseType: !192, size: 8, align: 8, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !472, file: !420, line: 63, baseType: !478, size: 48, align: 8, offset: 72)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 48, align: 8, elements: !369)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !472, file: !420, line: 64, baseType: !55, size: 32, align: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !472, file: !420, line: 65, baseType: !55, size: 32, align: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !472, file: !420, line: 66, baseType: !54, size: 32, align: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !472, file: !420, line: 67, baseType: !483, size: 192, align: 32, offset: 224)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 192, align: 32, elements: !369)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !274, file: !273, line: 40, baseType: !485, size: 25344, align: 64, offset: 376640)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 25344, align: 64, elements: !262)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !274, file: !273, line: 41, baseType: !487, size: 128, align: 64, offset: 401984)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !488, line: 46, baseType: !489)
!488 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 42, size: 128, align: 64, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !489, file: !488, line: 44, baseType: !54, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !489, file: !488, line: 45, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !488, line: 40, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !488, line: 36, size: 192, align: 64, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !495, file: !488, line: 37, baseType: !54, size: 32, align: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !495, file: !488, line: 38, baseType: !277, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !488, line: 39, baseType: !500, size: 64, align: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !503, line: 51, baseType: !504)
!503 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!504 = !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 40, size: 1408, align: 64, elements: !505)
!505 = !{!506, !507, !508, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !504, file: !503, line: 41, baseType: !55, size: 32, align: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !504, file: !503, line: 42, baseType: !54, size: 32, align: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !504, file: !503, line: 43, baseType: !509, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !504, file: !503, line: 43, baseType: !509, size: 64, align: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !504, file: !503, line: 43, baseType: !509, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !504, file: !503, line: 43, baseType: !509, size: 64, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !504, file: !503, line: 44, baseType: !509, size: 64, align: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !504, file: !503, line: 44, baseType: !509, size: 64, align: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !504, file: !503, line: 44, baseType: !509, size: 64, align: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !504, file: !503, line: 45, baseType: !468, size: 64, align: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !504, file: !503, line: 46, baseType: !468, size: 64, align: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !504, file: !503, line: 47, baseType: !468, size: 64, align: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !504, file: !503, line: 47, baseType: !468, size: 64, align: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !504, file: !503, line: 48, baseType: !521, size: 64, align: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !504, file: !503, line: 49, baseType: !521, size: 64, align: 64, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !504, file: !503, line: 49, baseType: !521, size: 64, align: 64, offset: 896)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !504, file: !503, line: 49, baseType: !521, size: 64, align: 64, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !504, file: !503, line: 49, baseType: !521, size: 64, align: 64, offset: 1024)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !504, file: !503, line: 49, baseType: !521, size: 64, align: 64, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !504, file: !503, line: 49, baseType: !521, size: 64, align: 64, offset: 1152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !504, file: !503, line: 50, baseType: !521, size: 64, align: 64, offset: 1216)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !504, file: !503, line: 50, baseType: !521, size: 64, align: 64, offset: 1280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !504, file: !503, line: 50, baseType: !521, size: 64, align: 64, offset: 1344)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !56, line: 101, baseType: !362)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_edpar", file: !198, line: 92, baseType: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 71, size: 6208, align: 64, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !556, !557, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nini", scope: !536, file: !198, line: 72, baseType: !54, size: 32, align: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "npro", scope: !536, file: !198, line: 73, baseType: !54, size: 32, align: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ned", scope: !536, file: !198, line: 74, baseType: !54, size: 32, align: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "selmas", scope: !536, file: !198, line: 75, baseType: !54, size: 32, align: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "outfrq", scope: !536, file: !198, line: 76, baseType: !54, size: 32, align: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "logfrq", scope: !536, file: !198, line: 77, baseType: !54, size: 32, align: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "maxedsteps", scope: !536, file: !198, line: 78, baseType: !54, size: 32, align: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sref", scope: !536, file: !198, line: 79, baseType: !546, size: 512, align: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_edx", file: !198, line: 68, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 63, size: 512, align: 64, elements: !548)
!548 = !{!549, !550, !551, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !547, file: !198, line: 64, baseType: !54, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "anrs", scope: !547, file: !198, line: 65, baseType: !468, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !547, file: !198, line: 66, baseType: !531, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !547, file: !198, line: 67, baseType: !553, size: 288, align: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !56, line: 103, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 288, align: 32, elements: !555)
!555 = !{!263, !263}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !536, file: !198, line: 80, baseType: !546, size: 512, align: 64, offset: 768)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !536, file: !198, line: 81, baseType: !558, size: 3456, align: 64, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_edvecs", file: !198, line: 61, baseType: !559)
!559 = !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 54, size: 3456, align: 64, elements: !560)
!560 = !{!561, !575, !576, !577, !578, !579}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mon", scope: !559, file: !198, line: 55, baseType: !562, size: 576, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_eigvec", file: !198, line: 52, baseType: !563)
!563 = !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 42, size: 576, align: 64, elements: !564)
!564 = !{!565, !566, !567, !568, !570, !571, !572, !573, !574}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "neig", scope: !563, file: !198, line: 43, baseType: !54, size: 32, align: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ieig", scope: !563, file: !198, line: 44, baseType: !468, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "stpsz", scope: !563, file: !198, line: 45, baseType: !509, size: 64, align: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !563, file: !198, line: 46, baseType: !569, size: 64, align: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "xproj", scope: !563, file: !198, line: 47, baseType: !509, size: 64, align: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vproj", scope: !563, file: !198, line: 48, baseType: !509, size: 64, align: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fproj", scope: !563, file: !198, line: 49, baseType: !509, size: 64, align: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "refproj", scope: !563, file: !198, line: 50, baseType: !509, size: 64, align: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !563, file: !198, line: 51, baseType: !55, size: 32, align: 32, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "linfix", scope: !559, file: !198, line: 56, baseType: !562, size: 576, align: 64, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "linacc", scope: !559, file: !198, line: 57, baseType: !562, size: 576, align: 64, offset: 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "radfix", scope: !559, file: !198, line: 58, baseType: !562, size: 576, align: 64, offset: 1728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "radacc", scope: !559, file: !198, line: 59, baseType: !562, size: 576, align: 64, offset: 2304)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "radcon", scope: !559, file: !198, line: 60, baseType: !562, size: 576, align: 64, offset: 2880)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "slope", scope: !536, file: !198, line: 82, baseType: !55, size: 32, align: 32, offset: 4736)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "star", scope: !536, file: !198, line: 83, baseType: !546, size: 512, align: 64, offset: 4800)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sori", scope: !536, file: !198, line: 84, baseType: !546, size: 512, align: 64, offset: 5312)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nmass", scope: !536, file: !198, line: 85, baseType: !54, size: 32, align: 32, offset: 5824)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "masnrs", scope: !536, file: !198, line: 86, baseType: !468, size: 64, align: 64, offset: 5888)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !536, file: !198, line: 87, baseType: !509, size: 64, align: 64, offset: 5952)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !536, file: !198, line: 88, baseType: !55, size: 32, align: 32, offset: 6016)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nfit", scope: !536, file: !198, line: 89, baseType: !54, size: 32, align: 32, offset: 6048)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fitnrs", scope: !536, file: !198, line: 90, baseType: !468, size: 64, align: 64, offset: 6080)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "edo", scope: !536, file: !198, line: 91, baseType: !211, size: 64, align: 64, offset: 6144)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !208, file: !1, line: 63, type: !211)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !208, file: !1, line: 63, type: !271)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 3, scope: !208, file: !1, line: 64, type: !501)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !208, file: !1, line: 64, type: !54)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 5, scope: !208, file: !1, line: 64, type: !54)
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !208, file: !1, line: 65, type: !531)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !208, file: !1, line: 65, type: !533)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edyn", arg: 8, scope: !208, file: !1, line: 66, type: !196)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 9, scope: !208, file: !1, line: 66, type: !534)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !208, file: !1, line: 68, type: !54)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !208, file: !1, line: 68, type: !54)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ned", scope: !208, file: !1, line: 68, type: !54)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refmasnrs", scope: !208, file: !1, line: 68, type: !468)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdum", scope: !208, file: !1, line: 69, type: !531)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "transvec", scope: !208, file: !1, line: 69, type: !531)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rmsd", scope: !208, file: !1, line: 70, type: !55)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rotmat", scope: !208, file: !1, line: 71, type: !553)
!608 = !DISubprogram(name: "read_edi", scope: !1, file: !1, line: 209, type: !609, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_edsamyn*, %struct.t_edpar*, i32)* @read_edi, variables: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !196, !534, !54}
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edyn", arg: 1, scope: !608, file: !1, line: 209, type: !196)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 2, scope: !608, file: !1, line: 209, type: !534)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr_mdatoms", arg: 3, scope: !608, file: !1, line: 209, type: !54)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !608, file: !1, line: 211, type: !211)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !608, file: !1, line: 212, type: !54)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !608, file: !1, line: 212, type: !54)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idum", scope: !608, file: !1, line: 212, type: !54)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "magic", scope: !608, file: !1, line: 212, type: !54)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readmagic", scope: !608, file: !1, line: 212, type: !54)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdum", scope: !608, file: !1, line: 213, type: !531)
!622 = !DISubprogram(name: "read_edint", scope: !1, file: !1, line: 296, type: !623, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*)* @read_edint, variables: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{!54, !211}
!625 = !{!626, !627, !631}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !622, file: !1, line: 296, type: !211)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !622, file: !1, line: 298, type: !628)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 32776, align: 8, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 4097)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idum", scope: !622, file: !1, line: 299, type: !54)
!632 = !DISubprogram(name: "read_edreal", scope: !1, file: !1, line: 307, type: !633, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*)* @read_edreal, variables: !635)
!633 = !DISubroutineType(types: !634)
!634 = !{!55, !211}
!635 = !{!636, !637, !638}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !632, file: !1, line: 307, type: !211)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !632, file: !1, line: 309, type: !628)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdum", scope: !632, file: !1, line: 310, type: !75)
!639 = !DISubprogram(name: "read_edint2", scope: !1, file: !1, line: 318, type: !623, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*)* @read_edint2, variables: !640)
!640 = !{!641, !642, !643}
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !639, file: !1, line: 318, type: !211)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !639, file: !1, line: 320, type: !628)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idum", scope: !639, file: !1, line: 321, type: !54)
!644 = !DISubprogram(name: "read_edx", scope: !1, file: !1, line: 328, type: !645, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32*, [3 x float]*)* @read_edx, variables: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !211, !54, !468, !531}
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !644, file: !1, line: 328, type: !211)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 2, scope: !644, file: !1, line: 328, type: !54)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "anrs", arg: 3, scope: !644, file: !1, line: 328, type: !468)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !644, file: !1, line: 328, type: !531)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !644, file: !1, line: 330, type: !54)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !644, file: !1, line: 330, type: !54)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !644, file: !1, line: 331, type: !628)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !644, file: !1, line: 332, type: !656)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 192, align: 64, elements: !262)
!657 = !DISubprogram(name: "read_edvecs", scope: !1, file: !1, line: 343, type: !658, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_edvecs*)* @read_edvecs, variables: !661)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !211, !54, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!661 = !{!662, !663, !664}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !657, file: !1, line: 343, type: !211)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 2, scope: !657, file: !1, line: 343, type: !54)
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vecs", arg: 3, scope: !657, file: !1, line: 343, type: !660)
!665 = !DISubprogram(name: "read_edvec", scope: !1, file: !1, line: 353, type: !666, isLocal: false, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_eigvec*)* @read_edvec, variables: !669)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !211, !54, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!669 = !{!670, !671, !672, !673, !674, !675, !676}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !665, file: !1, line: 353, type: !211)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 2, scope: !665, file: !1, line: 353, type: !54)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tvec", arg: 3, scope: !665, file: !1, line: 353, type: !668)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !665, file: !1, line: 355, type: !54)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idum", scope: !665, file: !1, line: 355, type: !54)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rdum", scope: !665, file: !1, line: 356, type: !75)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !665, file: !1, line: 357, type: !628)
!677 = !DISubprogram(name: "scan_edvec", scope: !1, file: !1, line: 379, type: !678, isLocal: false, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, [3 x float]*)* @scan_edvec, variables: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !211, !54, !531}
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !677, file: !1, line: 379, type: !211)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 2, scope: !677, file: !1, line: 379, type: !54)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 3, scope: !677, file: !1, line: 379, type: !531)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !677, file: !1, line: 381, type: !628)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !677, file: !1, line: 382, type: !54)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !677, file: !1, line: 383, type: !75)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !677, file: !1, line: 383, type: !75)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !677, file: !1, line: 383, type: !75)
!689 = !DISubprogram(name: "fitit", scope: !1, file: !1, line: 394, type: !690, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: float (i32, [3 x float]*, %struct.t_edpar*, [3 x float]*, [3 x float]*)* @fitit, variables: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!55, !54, !531, !534, !531, !533}
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 1, scope: !689, file: !1, line: 394, type: !54)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !689, file: !1, line: 394, type: !531)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 3, scope: !689, file: !1, line: 394, type: !534)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "transvec", arg: 4, scope: !689, file: !1, line: 394, type: !531)
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rmat", arg: 5, scope: !689, file: !1, line: 394, type: !533)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdum", scope: !689, file: !1, line: 396, type: !531)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_old", scope: !689, file: !1, line: 396, type: !532)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !689, file: !1, line: 397, type: !54)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !689, file: !1, line: 397, type: !54)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !689, file: !1, line: 397, type: !54)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rmsd", scope: !689, file: !1, line: 398, type: !55)
!704 = !DISubprogram(name: "do_edfit", scope: !1, file: !1, line: 440, type: !705, isLocal: false, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, [3 x float]*, [3 x float]*, [3 x float]*)* @do_edfit, variables: !707)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !54, !531, !531, !533}
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !720, !721, !723, !724, !725, !726, !727, !728, !729}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 1, scope: !704, file: !1, line: 440, type: !54)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xp", arg: 2, scope: !704, file: !1, line: 440, type: !531)
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !704, file: !1, line: 440, type: !531)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "R", arg: 4, scope: !704, file: !1, line: 440, type: !533)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !704, file: !1, line: 443, type: !54)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !704, file: !1, line: 443, type: !54)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !704, file: !1, line: 443, type: !54)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !704, file: !1, line: 443, type: !54)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !704, file: !1, line: 443, type: !54)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "irot", scope: !704, file: !1, line: 443, type: !54)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "omega", scope: !704, file: !1, line: 444, type: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "om", scope: !704, file: !1, line: 444, type: !719)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !704, file: !1, line: 444, type: !722)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 384, align: 64, elements: !369)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xnr", scope: !704, file: !1, line: 444, type: !75)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xpc", scope: !704, file: !1, line: 444, type: !75)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vh", scope: !704, file: !1, line: 445, type: !553)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vk", scope: !704, file: !1, line: 445, type: !553)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !704, file: !1, line: 445, type: !553)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !704, file: !1, line: 449, type: !54)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_d", scope: !704, file: !1, line: 450, type: !55)
!730 = !DISubprogram(name: "put_in_origin", scope: !1, file: !1, line: 531, type: !731, isLocal: false, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, [3 x float]*, i32, i32*, float*, float)* @put_in_origin, variables: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !54, !531, !54, !468, !509, !55}
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 1, scope: !730, file: !1, line: 531, type: !54)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !730, file: !1, line: 531, type: !531)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmass", arg: 3, scope: !730, file: !1, line: 531, type: !54)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "masnrs", arg: 4, scope: !730, file: !1, line: 531, type: !468)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mass", arg: 5, scope: !730, file: !1, line: 531, type: !509)
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tmass", arg: 6, scope: !730, file: !1, line: 531, type: !55)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !730, file: !1, line: 533, type: !54)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !730, file: !1, line: 533, type: !54)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cm", scope: !730, file: !1, line: 534, type: !532)
!743 = !DISubprogram(name: "project", scope: !1, file: !1, line: 552, type: !744, isLocal: false, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, %struct.t_edpar*, i8*)* @project, variables: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !531, !534, !191}
!746 = !{!747, !748, !749, !750}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !743, file: !1, line: 552, type: !531)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 2, scope: !743, file: !1, line: 552, type: !534)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !743, file: !1, line: 552, type: !191)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !743, file: !1, line: 554, type: !54)
!751 = !DISubprogram(name: "do_project", scope: !1, file: !1, line: 577, type: !752, isLocal: false, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, %struct.t_eigvec*, %struct.t_edpar*, i8*)* @do_project, variables: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !531, !668, !534, !191}
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !751, file: !1, line: 577, type: !531)
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 2, scope: !751, file: !1, line: 577, type: !668)
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 3, scope: !751, file: !1, line: 577, type: !534)
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 4, scope: !751, file: !1, line: 577, type: !191)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !751, file: !1, line: 579, type: !54)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !751, file: !1, line: 579, type: !54)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !751, file: !1, line: 579, type: !54)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proj", scope: !751, file: !1, line: 580, type: !55)
!763 = !DISubprogram(name: "projectx", scope: !1, file: !1, line: 595, type: !764, isLocal: false, isDefinition: true, scopeLine: 596, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_edpar*, [3 x float]*, %struct.t_eigvec*)* @projectx, variables: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !534, !531, !668}
!766 = !{!767, !768, !769, !770, !771, !772, !773}
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 1, scope: !763, file: !1, line: 595, type: !534)
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !763, file: !1, line: 595, type: !531)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 3, scope: !763, file: !1, line: 595, type: !668)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !763, file: !1, line: 597, type: !54)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !763, file: !1, line: 597, type: !54)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !763, file: !1, line: 597, type: !54)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rad", scope: !763, file: !1, line: 598, type: !55)
!774 = !DISubprogram(name: "do_projectx", scope: !1, file: !1, line: 620, type: !775, isLocal: false, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.t_edpar*, [3 x float]*, [3 x float]*)* @do_projectx, variables: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!55, !534, !531, !531}
!777 = !{!778, !779, !780, !781, !782, !783}
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 1, scope: !774, file: !1, line: 620, type: !534)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !774, file: !1, line: 620, type: !531)
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 3, scope: !774, file: !1, line: 620, type: !531)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !774, file: !1, line: 622, type: !54)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !774, file: !1, line: 622, type: !54)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proj", scope: !774, file: !1, line: 623, type: !55)
!784 = !DISubprogram(name: "calc_radius", scope: !1, file: !1, line: 632, type: !785, isLocal: false, isDefinition: true, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.t_eigvec*)* @calc_radius, variables: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!55, !668}
!787 = !{!788, !789}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vec", arg: 1, scope: !784, file: !1, line: 632, type: !668)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !784, file: !1, line: 634, type: !54)
!790 = !DISubprogram(name: "do_edsam", scope: !1, file: !1, line: 643, type: !791, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_topology*, %struct.t_inputrec*, i32, %struct.t_mdatoms*, i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, [3 x float]*, %struct.t_edsamyn*, %struct.t_edpar*, i32)* @do_edsam, variables: !905)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !211, !271, !793, !54, !501, !54, !54, !531, !531, !531, !531, !533, !196, !534, !54}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !795, line: 143, baseType: !796)
!795 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!796 = !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 55, size: 4736, align: 64, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !896, !904}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !796, file: !795, line: 56, baseType: !54, size: 32, align: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !796, file: !795, line: 57, baseType: !54, size: 32, align: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !796, file: !795, line: 58, baseType: !54, size: 32, align: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !796, file: !795, line: 59, baseType: !54, size: 32, align: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !796, file: !795, line: 60, baseType: !54, size: 32, align: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !796, file: !795, line: 61, baseType: !54, size: 32, align: 32, offset: 160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !796, file: !795, line: 62, baseType: !54, size: 32, align: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !796, file: !795, line: 63, baseType: !54, size: 32, align: 32, offset: 224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !796, file: !795, line: 65, baseType: !54, size: 32, align: 32, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !796, file: !795, line: 66, baseType: !54, size: 32, align: 32, offset: 288)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !796, file: !795, line: 67, baseType: !54, size: 32, align: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !796, file: !795, line: 68, baseType: !54, size: 32, align: 32, offset: 352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !796, file: !795, line: 69, baseType: !54, size: 32, align: 32, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !796, file: !795, line: 70, baseType: !54, size: 32, align: 32, offset: 416)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !796, file: !795, line: 71, baseType: !55, size: 32, align: 32, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !796, file: !795, line: 72, baseType: !55, size: 32, align: 32, offset: 480)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !796, file: !795, line: 73, baseType: !55, size: 32, align: 32, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !796, file: !795, line: 74, baseType: !54, size: 32, align: 32, offset: 544)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !796, file: !795, line: 74, baseType: !54, size: 32, align: 32, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !796, file: !795, line: 74, baseType: !54, size: 32, align: 32, offset: 608)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !796, file: !795, line: 76, baseType: !54, size: 32, align: 32, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !796, file: !795, line: 77, baseType: !55, size: 32, align: 32, offset: 672)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !796, file: !795, line: 79, baseType: !54, size: 32, align: 32, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !796, file: !795, line: 80, baseType: !54, size: 32, align: 32, offset: 736)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !796, file: !795, line: 81, baseType: !54, size: 32, align: 32, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !796, file: !795, line: 82, baseType: !54, size: 32, align: 32, offset: 800)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !796, file: !795, line: 83, baseType: !54, size: 32, align: 32, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !796, file: !795, line: 84, baseType: !54, size: 32, align: 32, offset: 864)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !796, file: !795, line: 85, baseType: !54, size: 32, align: 32, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !796, file: !795, line: 86, baseType: !54, size: 32, align: 32, offset: 928)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !796, file: !795, line: 87, baseType: !55, size: 32, align: 32, offset: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !796, file: !795, line: 88, baseType: !830, size: 288, align: 32, offset: 992)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !56, line: 105, baseType: !554)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !796, file: !795, line: 89, baseType: !830, size: 288, align: 32, offset: 1280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !796, file: !795, line: 90, baseType: !54, size: 32, align: 32, offset: 1568)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !796, file: !795, line: 91, baseType: !55, size: 32, align: 32, offset: 1600)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !796, file: !795, line: 92, baseType: !55, size: 32, align: 32, offset: 1632)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !796, file: !795, line: 93, baseType: !54, size: 32, align: 32, offset: 1664)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !796, file: !795, line: 94, baseType: !55, size: 32, align: 32, offset: 1696)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !796, file: !795, line: 95, baseType: !55, size: 32, align: 32, offset: 1728)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !796, file: !795, line: 96, baseType: !54, size: 32, align: 32, offset: 1760)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !796, file: !795, line: 97, baseType: !55, size: 32, align: 32, offset: 1792)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !796, file: !795, line: 98, baseType: !55, size: 32, align: 32, offset: 1824)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !796, file: !795, line: 99, baseType: !55, size: 32, align: 32, offset: 1856)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !796, file: !795, line: 100, baseType: !54, size: 32, align: 32, offset: 1888)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !796, file: !795, line: 101, baseType: !55, size: 32, align: 32, offset: 1920)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !796, file: !795, line: 102, baseType: !55, size: 32, align: 32, offset: 1952)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !796, file: !795, line: 103, baseType: !54, size: 32, align: 32, offset: 1984)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !796, file: !795, line: 104, baseType: !55, size: 32, align: 32, offset: 2016)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !796, file: !795, line: 105, baseType: !55, size: 32, align: 32, offset: 2048)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !796, file: !795, line: 106, baseType: !55, size: 32, align: 32, offset: 2080)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !796, file: !795, line: 107, baseType: !55, size: 32, align: 32, offset: 2112)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !796, file: !795, line: 108, baseType: !55, size: 32, align: 32, offset: 2144)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !796, file: !795, line: 109, baseType: !54, size: 32, align: 32, offset: 2176)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !796, file: !795, line: 110, baseType: !54, size: 32, align: 32, offset: 2208)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !796, file: !795, line: 111, baseType: !54, size: 32, align: 32, offset: 2240)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !796, file: !795, line: 112, baseType: !55, size: 32, align: 32, offset: 2272)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !796, file: !795, line: 113, baseType: !55, size: 32, align: 32, offset: 2304)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !796, file: !795, line: 114, baseType: !55, size: 32, align: 32, offset: 2336)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !796, file: !795, line: 115, baseType: !54, size: 32, align: 32, offset: 2368)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !796, file: !795, line: 116, baseType: !55, size: 32, align: 32, offset: 2400)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !796, file: !795, line: 117, baseType: !55, size: 32, align: 32, offset: 2432)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !796, file: !795, line: 118, baseType: !54, size: 32, align: 32, offset: 2464)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !796, file: !795, line: 120, baseType: !54, size: 32, align: 32, offset: 2496)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !796, file: !795, line: 122, baseType: !54, size: 32, align: 32, offset: 2528)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !796, file: !795, line: 124, baseType: !54, size: 32, align: 32, offset: 2560)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !796, file: !795, line: 125, baseType: !54, size: 32, align: 32, offset: 2592)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !796, file: !795, line: 126, baseType: !55, size: 32, align: 32, offset: 2624)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !796, file: !795, line: 127, baseType: !54, size: 32, align: 32, offset: 2656)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !796, file: !795, line: 128, baseType: !55, size: 32, align: 32, offset: 2688)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !796, file: !795, line: 129, baseType: !55, size: 32, align: 32, offset: 2720)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !796, file: !795, line: 130, baseType: !54, size: 32, align: 32, offset: 2752)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !796, file: !795, line: 131, baseType: !55, size: 32, align: 32, offset: 2784)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !796, file: !795, line: 132, baseType: !54, size: 32, align: 32, offset: 2816)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !796, file: !795, line: 133, baseType: !54, size: 32, align: 32, offset: 2848)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !796, file: !795, line: 134, baseType: !54, size: 32, align: 32, offset: 2880)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !796, file: !795, line: 135, baseType: !54, size: 32, align: 32, offset: 2912)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !796, file: !795, line: 136, baseType: !55, size: 32, align: 32, offset: 2944)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !796, file: !795, line: 137, baseType: !55, size: 32, align: 32, offset: 2976)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !796, file: !795, line: 138, baseType: !55, size: 32, align: 32, offset: 3008)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !796, file: !795, line: 139, baseType: !55, size: 32, align: 32, offset: 3040)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !796, file: !795, line: 140, baseType: !880, size: 512, align: 64, offset: 3072)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !795, line: 53, baseType: !881)
!881 = !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 42, size: 512, align: 64, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !895}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !881, file: !795, line: 43, baseType: !54, size: 32, align: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !881, file: !795, line: 44, baseType: !54, size: 32, align: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !881, file: !795, line: 45, baseType: !54, size: 32, align: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !881, file: !795, line: 46, baseType: !54, size: 32, align: 32, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !881, file: !795, line: 47, baseType: !509, size: 64, align: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !881, file: !795, line: 48, baseType: !509, size: 64, align: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !881, file: !795, line: 49, baseType: !509, size: 64, align: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !881, file: !795, line: 50, baseType: !531, size: 64, align: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !881, file: !795, line: 51, baseType: !892, size: 64, align: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !56, line: 107, baseType: !894)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 96, align: 32, elements: !262)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !881, file: !795, line: 52, baseType: !468, size: 64, align: 64, offset: 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !796, file: !795, line: 141, baseType: !897, size: 576, align: 64, offset: 3584)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 576, align: 64, elements: !262)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !795, line: 40, baseType: !899)
!899 = !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 36, size: 192, align: 64, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !899, file: !795, line: 37, baseType: !54, size: 32, align: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !899, file: !795, line: 38, baseType: !509, size: 64, align: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !899, file: !795, line: 39, baseType: !509, size: 64, align: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !796, file: !795, line: 142, baseType: !897, size: 576, align: 64, offset: 4160)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935}
!906 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !790, file: !1, line: 643, type: !211)
!907 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 2, scope: !790, file: !1, line: 643, type: !271)
!908 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 3, scope: !790, file: !1, line: 643, type: !793)
!909 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "step", arg: 4, scope: !790, file: !1, line: 643, type: !54)
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 5, scope: !790, file: !1, line: 644, type: !501)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 6, scope: !790, file: !1, line: 644, type: !54)
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 7, scope: !790, file: !1, line: 644, type: !54)
!913 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 8, scope: !790, file: !1, line: 645, type: !531)
!914 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xold", arg: 9, scope: !790, file: !1, line: 645, type: !531)
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x_unc", arg: 10, scope: !790, file: !1, line: 645, type: !531)
!916 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "force", arg: 11, scope: !790, file: !1, line: 645, type: !531)
!917 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 12, scope: !790, file: !1, line: 645, type: !533)
!918 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edyn", arg: 13, scope: !790, file: !1, line: 646, type: !196)
!919 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "edi", arg: 14, scope: !790, file: !1, line: 646, type: !534)
!920 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bHave_force", arg: 15, scope: !790, file: !1, line: 646, type: !54)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !790, file: !1, line: 648, type: !54)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !790, file: !1, line: 648, type: !54)
