; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/enxio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_enxframe = type { float, i32, i32, i32, i32, i32*, i32, i32, i32, i32, i32, i32*, %struct.t_energy*, float*, float*, float** }
%struct.t_energy = type { float, double, double, float }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }

@.str = private unnamed_addr constant [9 x i8] c"fr->ener\00", align 1
@.str1 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/enxio.c\00", align 1
@.str2 = private unnamed_addr constant [8 x i8] c"fr->rav\00", align 1
@.str3 = private unnamed_addr constant [7 x i8] c"fr->rt\00", align 1
@.str4 = private unnamed_addr constant [13 x i8] c"fr->block[b]\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !71, subprograms: !74, globals: !355, imports: !357)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/enxio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !53, !65}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!6 = !DIEnumerator(name: "efMDP", value: 0)
!7 = !DIEnumerator(name: "efGCT", value: 1)
!8 = !DIEnumerator(name: "efTRX", value: 2)
!9 = !DIEnumerator(name: "efTRN", value: 3)
!10 = !DIEnumerator(name: "efTRR", value: 4)
!11 = !DIEnumerator(name: "efTRJ", value: 5)
!12 = !DIEnumerator(name: "efXTC", value: 6)
!13 = !DIEnumerator(name: "efG87", value: 7)
!14 = !DIEnumerator(name: "efENX", value: 8)
!15 = !DIEnumerator(name: "efEDR", value: 9)
!16 = !DIEnumerator(name: "efENE", value: 10)
!17 = !DIEnumerator(name: "efSTX", value: 11)
!18 = !DIEnumerator(name: "efSTO", value: 12)
!19 = !DIEnumerator(name: "efGRO", value: 13)
!20 = !DIEnumerator(name: "efG96", value: 14)
!21 = !DIEnumerator(name: "efPDB", value: 15)
!22 = !DIEnumerator(name: "efBRK", value: 16)
!23 = !DIEnumerator(name: "efENT", value: 17)
!24 = !DIEnumerator(name: "efLOG", value: 18)
!25 = !DIEnumerator(name: "efXVG", value: 19)
!26 = !DIEnumerator(name: "efOUT", value: 20)
!27 = !DIEnumerator(name: "efNDX", value: 21)
!28 = !DIEnumerator(name: "efTOP", value: 22)
!29 = !DIEnumerator(name: "efITP", value: 23)
!30 = !DIEnumerator(name: "efTPX", value: 24)
!31 = !DIEnumerator(name: "efTPS", value: 25)
!32 = !DIEnumerator(name: "efTPR", value: 26)
!33 = !DIEnumerator(name: "efTPA", value: 27)
!34 = !DIEnumerator(name: "efTPB", value: 28)
!35 = !DIEnumerator(name: "efTEX", value: 29)
!36 = !DIEnumerator(name: "efRTP", value: 30)
!37 = !DIEnumerator(name: "efATP", value: 31)
!38 = !DIEnumerator(name: "efHDB", value: 32)
!39 = !DIEnumerator(name: "efDAT", value: 33)
!40 = !DIEnumerator(name: "efDLG", value: 34)
!41 = !DIEnumerator(name: "efMAP", value: 35)
!42 = !DIEnumerator(name: "efEPS", value: 36)
!43 = !DIEnumerator(name: "efMAT", value: 37)
!44 = !DIEnumerator(name: "efM2P", value: 38)
!45 = !DIEnumerator(name: "efMTX", value: 39)
!46 = !DIEnumerator(name: "efEDI", value: 40)
!47 = !DIEnumerator(name: "efEDO", value: 41)
!48 = !DIEnumerator(name: "efPPA", value: 42)
!49 = !DIEnumerator(name: "efPDO", value: 43)
!50 = !DIEnumerator(name: "efHAT", value: 44)
!51 = !DIEnumerator(name: "efXPM", value: 45)
!52 = !DIEnumerator(name: "efNR", value: 46)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 52, size: 32, align: 32, elements: !55)
!54 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmxfio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "eioREAL", value: 0)
!57 = !DIEnumerator(name: "eioINT", value: 1)
!58 = !DIEnumerator(name: "eioNUCHAR", value: 2)
!59 = !DIEnumerator(name: "eioUSHORT", value: 3)
!60 = !DIEnumerator(name: "eioRVEC", value: 4)
!61 = !DIEnumerator(name: "eioNRVEC", value: 5)
!62 = !DIEnumerator(name: "eioIVEC", value: 6)
!63 = !DIEnumerator(name: "eioSTRING", value: 7)
!64 = !DIEnumerator(name: "eioNR", value: 8)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !66, line: 119, size: 32, align: 32, elements: !67)
!66 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!67 = !{!68, !69, !70}
!68 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!69 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!70 = !DIEnumerator(name: "XDR_FREE", value: 2)
!71 = !{!72, !73}
!72 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!74 = !{!75, !143, !149, !192, !202, !207, !219, !256, !315, !327, !335, !347}
!75 = !DISubprogram(name: "__sputc", scope: !76, file: !76, line: 348, type: !77, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !140)
!76 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !79, !80}
!79 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 153, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !76, line: 122, size: 1216, align: 64, elements: !83)
!83 = !{!84, !87, !88, !89, !91, !92, !97, !98, !99, !103, !108, !118, !124, !125, !128, !129, !133, !137, !138, !139}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !82, file: !76, line: 123, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !82, file: !76, line: 124, baseType: !79, size: 32, align: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !82, file: !76, line: 125, baseType: !79, size: 32, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !82, file: !76, line: 126, baseType: !90, size: 16, align: 16, offset: 128)
!90 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !82, file: !76, line: 127, baseType: !90, size: 16, align: 16, offset: 144)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !82, file: !76, line: 128, baseType: !93, size: 128, align: 64, offset: 192)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !76, line: 88, size: 128, align: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !93, file: !76, line: 89, baseType: !85, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !93, file: !76, line: 90, baseType: !79, size: 32, align: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !82, file: !76, line: 129, baseType: !79, size: 32, align: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !82, file: !76, line: 132, baseType: !73, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !82, file: !76, line: 133, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!79, !73}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !82, file: !76, line: 134, baseType: !104, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!79, !73, !107, !79}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !82, file: !76, line: 135, baseType: !109, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !73, !112, !79}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !76, line: 77, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !114, line: 71, baseType: !115)
!114 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !82, file: !76, line: 136, baseType: !119, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!79, !73, !122, !79}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !82, file: !76, line: 139, baseType: !93, size: 128, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !82, file: !76, line: 140, baseType: !126, size: 64, align: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !76, line: 94, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !82, file: !76, line: 141, baseType: !79, size: 32, align: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !82, file: !76, line: 144, baseType: !130, size: 24, align: 8, offset: 928)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 24, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !82, file: !76, line: 145, baseType: !134, size: 8, align: 8, offset: 952)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !82, file: !76, line: 148, baseType: !93, size: 128, align: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !82, file: !76, line: 151, baseType: !79, size: 32, align: 32, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !82, file: !76, line: 152, baseType: !112, size: 64, align: 64, offset: 1152)
!140 = !{!141, !142}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !75, file: !76, line: 348, type: !79)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !75, file: !76, line: 348, type: !80)
!143 = !DISubprogram(name: "__sigbits", scope: !144, file: !144, line: 114, type: !145, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !147)
!144 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DISubroutineType(types: !146)
!146 = !{!79, !79}
!147 = !{!148}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !143, file: !144, line: 114, type: !79)
!149 = !DISubprogram(name: "free_enxframe", scope: !1, file: !1, line: 40, type: !150, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_enxframe*)* @free_enxframe, variables: !189)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_enxframe", file: !154, line: 89, baseType: !155)
!154 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/enxio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!155 = !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 72, size: 768, align: 64, elements: !156)
!156 = !{!157, !161, !162, !163, !164, !165, !167, !168, !169, !170, !171, !172, !173, !184, !186, !187}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !155, file: !154, line: 73, baseType: !158, size: 32, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !159, line: 87, baseType: !160)
!159 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!160 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !155, file: !154, line: 74, baseType: !79, size: 32, align: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nre", scope: !155, file: !154, line: 75, baseType: !79, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ndisre", scope: !155, file: !154, line: 76, baseType: !79, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !155, file: !154, line: 77, baseType: !79, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !155, file: !154, line: 78, baseType: !166, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "e_size", scope: !155, file: !154, line: 79, baseType: !79, size: 32, align: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "d_size", scope: !155, file: !154, line: 80, baseType: !79, size: 32, align: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nr_alloc", scope: !155, file: !154, line: 81, baseType: !79, size: 32, align: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "e_alloc", scope: !155, file: !154, line: 82, baseType: !79, size: 32, align: 32, offset: 352)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "d_alloc", scope: !155, file: !154, line: 83, baseType: !79, size: 32, align: 32, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_alloc", scope: !155, file: !154, line: 84, baseType: !166, size: 64, align: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ener", scope: !155, file: !154, line: 85, baseType: !174, size: 64, align: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_energy", file: !176, line: 41, baseType: !177)
!176 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/energy.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!177 = !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 36, size: 256, align: 64, elements: !178)
!178 = !{!179, !180, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !177, file: !176, line: 37, baseType: !158, size: 32, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "eav", scope: !177, file: !176, line: 38, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "esum", scope: !177, file: !176, line: 39, baseType: !181, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "e2sum", scope: !177, file: !176, line: 40, baseType: !158, size: 32, align: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rav", scope: !155, file: !154, line: 86, baseType: !185, size: 64, align: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !155, file: !154, line: 87, baseType: !185, size: 64, align: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !155, file: !154, line: 88, baseType: !188, size: 64, align: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!189 = !{!190, !191}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 1, scope: !149, file: !1, line: 40, type: !152)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !149, file: !1, line: 42, type: !79)
!192 = !DISubprogram(name: "do_enxnms", scope: !1, file: !1, line: 154, type: !193, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i8***)* @do_enxnms, variables: !197)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !79, !166, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!197 = !{!198, !199, !200, !201}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !192, file: !1, line: 154, type: !79)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nre", arg: 2, scope: !192, file: !1, line: 154, type: !166)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nms", arg: 3, scope: !192, file: !1, line: 154, type: !195)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRead", scope: !192, file: !1, line: 156, type: !79)
!202 = !DISubprogram(name: "close_enx", scope: !1, file: !1, line: 169, type: !203, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @close_enx, variables: !205)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !79}
!205 = !{!206}
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !202, file: !1, line: 169, type: !79)
!207 = !DISubprogram(name: "open_enx", scope: !1, file: !1, line: 190, type: !208, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @open_enx, variables: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!79, !107, !107}
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !207, file: !1, line: 190, type: !107)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !207, file: !1, line: 190, type: !107)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !207, file: !1, line: 192, type: !79)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nre", scope: !207, file: !1, line: 192, type: !79)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !207, file: !1, line: 192, type: !79)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nm", scope: !207, file: !1, line: 193, type: !196)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fr", scope: !207, file: !1, line: 194, type: !152)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bDum", scope: !207, file: !1, line: 195, type: !79)
!219 = !DISubprogram(name: "do_enx", scope: !1, file: !1, line: 253, type: !220, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_enxframe*)* @do_enx, variables: !222)
!220 = !DISubroutineType(types: !221)
!221 = !{!79, !79, !152}
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !243, !248}
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !219, file: !1, line: 253, type: !79)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !219, file: !1, line: 253, type: !152)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !219, file: !1, line: 255, type: !79)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !219, file: !1, line: 255, type: !79)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRead", scope: !219, file: !1, line: 256, type: !79)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOK", scope: !219, file: !1, line: 256, type: !79)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bOK1", scope: !219, file: !1, line: 256, type: !79)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bSane", scope: !219, file: !1, line: 256, type: !79)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp1", scope: !219, file: !1, line: 257, type: !158)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp2", scope: !219, file: !1, line: 257, type: !158)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !234, file: !1, line: 319, type: !240)
!234 = distinct !DILexicalBlock(scope: !235, file: !1, line: 319, column: 5)
!235 = distinct !DILexicalBlock(scope: !236, file: !1, line: 319, column: 5)
!236 = distinct !DILexicalBlock(scope: !237, file: !1, line: 319, column: 5)
!237 = distinct !DILexicalBlock(scope: !238, file: !1, line: 319, column: 5)
!238 = distinct !DILexicalBlock(scope: !239, file: !1, line: 313, column: 19)
!239 = distinct !DILexicalBlock(scope: !219, file: !1, line: 313, column: 7)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 1024, align: 8, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 128)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !244, file: !1, line: 321, type: !240)
!244 = distinct !DILexicalBlock(scope: !245, file: !1, line: 321, column: 5)
!245 = distinct !DILexicalBlock(scope: !246, file: !1, line: 321, column: 5)
!246 = distinct !DILexicalBlock(scope: !247, file: !1, line: 321, column: 5)
!247 = distinct !DILexicalBlock(scope: !238, file: !1, line: 321, column: 5)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !249, file: !1, line: 329, type: !240)
!249 = distinct !DILexicalBlock(scope: !250, file: !1, line: 329, column: 5)
!250 = distinct !DILexicalBlock(scope: !251, file: !1, line: 329, column: 5)
!251 = distinct !DILexicalBlock(scope: !252, file: !1, line: 329, column: 5)
!252 = distinct !DILexicalBlock(scope: !253, file: !1, line: 329, column: 5)
!253 = distinct !DILexicalBlock(scope: !254, file: !1, line: 324, column: 43)
!254 = distinct !DILexicalBlock(scope: !255, file: !1, line: 324, column: 3)
!255 = distinct !DILexicalBlock(scope: !219, file: !1, line: 324, column: 3)
!256 = !DISubprogram(name: "edr_nms", scope: !1, file: !1, line: 84, type: !193, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, variables: !257)
!257 = !{!258, !259, !260, !261, !312, !313, !314}
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !256, file: !1, line: 84, type: !79)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nre", arg: 2, scope: !256, file: !1, line: 84, type: !166)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nms", arg: 3, scope: !256, file: !1, line: 84, type: !195)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdr", scope: !256, file: !1, line: 86, type: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !66, line: 144, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !66, line: 145, size: 384, align: 64, elements: !265)
!265 = !{!266, !267, !308, !309, !310, !311}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !264, file: !66, line: 147, baseType: !65, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !264, file: !66, line: 171, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !66, line: 148, size: 640, align: 64, elements: !270)
!270 = !{!271, !278, !279, !284, !285, !289, !293, !299, !303, !307}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !269, file: !66, line: 150, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !262, !276}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !66, line: 99, baseType: !79)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !269, file: !66, line: 152, baseType: !272, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !269, file: !66, line: 154, baseType: !280, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!275, !262, !107, !283}
!283 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !269, file: !66, line: 156, baseType: !280, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !269, file: !66, line: 158, baseType: !286, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!283, !262}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !269, file: !66, line: 160, baseType: !290, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!275, !262, !283}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !269, file: !66, line: 162, baseType: !294, size: 64, align: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !262, !79}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdr_int32_t", file: !66, line: 106, baseType: !79)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !269, file: !66, line: 164, baseType: !300, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !262}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !269, file: !66, line: 166, baseType: !304, size: 64, align: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!275, !262, !297}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !269, file: !66, line: 168, baseType: !304, size: 64, align: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !264, file: !66, line: 172, baseType: !107, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !264, file: !66, line: 173, baseType: !107, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !264, file: !66, line: 174, baseType: !107, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !264, file: !66, line: 175, baseType: !79, size: 32, align: 32, offset: 320)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRead", scope: !256, file: !1, line: 87, type: !79)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !256, file: !1, line: 88, type: !79)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NM", scope: !256, file: !1, line: 89, type: !196)
!315 = !DISubprogram(name: "rd_ener_nms", scope: !1, file: !1, line: 66, type: !316, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, variables: !318)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !80, !166, !195}
!318 = !{!319, !320, !321, !322, !326}
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !315, file: !1, line: 66, type: !80)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nre", arg: 2, scope: !315, file: !1, line: 66, type: !166)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nm", arg: 3, scope: !315, file: !1, line: 66, type: !195)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !315, file: !1, line: 68, type: !323)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2048, align: 8, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 256)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !315, file: !1, line: 69, type: !79)
!327 = !DISubprogram(name: "wr_ener_nms", scope: !1, file: !1, line: 57, type: !328, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, variables: !330)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !80, !79, !196}
!330 = !{!331, !332, !333, !334}
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !327, file: !1, line: 57, type: !80)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nre", arg: 2, scope: !327, file: !1, line: 57, type: !79)
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nms", arg: 3, scope: !327, file: !1, line: 57, type: !196)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !327, file: !1, line: 59, type: !79)
!335 = !DISubprogram(name: "do_eheader", scope: !1, file: !1, line: 112, type: !336, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.t_enxframe*, i32*)* @do_eheader, variables: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{!79, !79, !152, !166}
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346}
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !335, file: !1, line: 112, type: !79)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !335, file: !1, line: 112, type: !152)
!341 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOK", arg: 3, scope: !335, file: !1, line: 112, type: !166)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !335, file: !1, line: 114, type: !79)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !335, file: !1, line: 114, type: !79)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dum", scope: !335, file: !1, line: 114, type: !79)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRead", scope: !335, file: !1, line: 115, type: !79)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tempfix_nr", scope: !335, file: !1, line: 116, type: !79)
!347 = !DISubprogram(name: "empty_file", scope: !1, file: !1, line: 174, type: !348, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, variables: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!79, !107}
!350 = !{!351, !352, !353, !354}
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !347, file: !1, line: 174, type: !107)
