; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ewald.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_complex = type { float, float }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }
%struct.t_grpopts = type { i32, i32, i32, i32, float*, float*, float*, [3 x float]*, [3 x i32]*, i32* }
%struct.t_cosines = type { i32, float*, float* }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !317, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ewald.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !13, !261, !269, !276, !298, !305, !310}
!6 = !DISubprogram(name: "__sigbits", scope: !7, file: !7, line: 114, type: !8, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !11)
!7 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !{!12}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !6, file: !7, line: 114, type: !10)
!13 = !DISubprogram(name: "do_ewald", scope: !1, file: !1, line: 94, type: !14, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i32, %struct.t_inputrec*, [3 x float]*, [3 x float]*, float*, float*, %struct.t_commrec*, %struct.t_nsborder*, [3 x float]*, float)* @do_ewald, variables: !231)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !19, !10, !81, !182, !182, !178, !178, !200, !211, !230, !16}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !17, line: 87, baseType: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 153, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !21, line: 122, size: 1216, align: 64, elements: !23)
!23 = !{!24, !27, !28, !29, !31, !32, !37, !38, !39, !43, !49, !59, !65, !66, !69, !70, !74, !78, !79, !80}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !22, file: !21, line: 123, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !22, file: !21, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !22, file: !21, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !22, file: !21, line: 126, baseType: !30, size: 16, align: 16, offset: 128)
!30 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !22, file: !21, line: 127, baseType: !30, size: 16, align: 16, offset: 144)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !22, file: !21, line: 128, baseType: !33, size: 128, align: 64, offset: 192)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !21, line: 88, size: 128, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !33, file: !21, line: 89, baseType: !25, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !33, file: !21, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !22, file: !21, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !22, file: !21, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !22, file: !21, line: 133, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!10, !4}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !22, file: !21, line: 134, baseType: !44, size: 64, align: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!10, !4, !47, !10}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !22, file: !21, line: 135, baseType: !50, size: 64, align: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !4, !53, !10}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !21, line: 77, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !55, line: 71, baseType: !56)
!55 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 46, baseType: !58)
!57 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !22, file: !21, line: 136, baseType: !60, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!10, !4, !63, !10}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !22, file: !21, line: 139, baseType: !33, size: 128, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !22, file: !21, line: 140, baseType: !67, size: 64, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !21, line: 94, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !22, file: !21, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !22, file: !21, line: 144, baseType: !71, size: 24, align: 8, offset: 928)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !22, file: !21, line: 145, baseType: !75, size: 8, align: 8, offset: 952)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !22, file: !21, line: 148, baseType: !33, size: 128, align: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !22, file: !21, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !22, file: !21, line: 152, baseType: !53, size: 64, align: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !83, line: 143, baseType: !84)
!83 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 55, size: 4736, align: 64, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !191, !199}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !84, file: !83, line: 56, baseType: !10, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !84, file: !83, line: 57, baseType: !10, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !84, file: !83, line: 58, baseType: !10, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !84, file: !83, line: 59, baseType: !10, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !84, file: !83, line: 60, baseType: !10, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !84, file: !83, line: 61, baseType: !10, size: 32, align: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !84, file: !83, line: 62, baseType: !10, size: 32, align: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !84, file: !83, line: 63, baseType: !10, size: 32, align: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !84, file: !83, line: 65, baseType: !10, size: 32, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !84, file: !83, line: 66, baseType: !10, size: 32, align: 32, offset: 288)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !84, file: !83, line: 67, baseType: !10, size: 32, align: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !84, file: !83, line: 68, baseType: !10, size: 32, align: 32, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !84, file: !83, line: 69, baseType: !10, size: 32, align: 32, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !84, file: !83, line: 70, baseType: !10, size: 32, align: 32, offset: 416)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !84, file: !83, line: 71, baseType: !16, size: 32, align: 32, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !84, file: !83, line: 72, baseType: !16, size: 32, align: 32, offset: 480)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !84, file: !83, line: 73, baseType: !16, size: 32, align: 32, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !84, file: !83, line: 74, baseType: !10, size: 32, align: 32, offset: 544)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !84, file: !83, line: 74, baseType: !10, size: 32, align: 32, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !84, file: !83, line: 74, baseType: !10, size: 32, align: 32, offset: 608)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !84, file: !83, line: 76, baseType: !10, size: 32, align: 32, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !84, file: !83, line: 77, baseType: !16, size: 32, align: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !84, file: !83, line: 79, baseType: !10, size: 32, align: 32, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !84, file: !83, line: 80, baseType: !10, size: 32, align: 32, offset: 736)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !84, file: !83, line: 81, baseType: !10, size: 32, align: 32, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !84, file: !83, line: 82, baseType: !10, size: 32, align: 32, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !84, file: !83, line: 83, baseType: !10, size: 32, align: 32, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !84, file: !83, line: 84, baseType: !10, size: 32, align: 32, offset: 864)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !84, file: !83, line: 85, baseType: !10, size: 32, align: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !84, file: !83, line: 86, baseType: !10, size: 32, align: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !84, file: !83, line: 87, baseType: !16, size: 32, align: 32, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !84, file: !83, line: 88, baseType: !118, size: 288, align: 32, offset: 992)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !17, line: 105, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 288, align: 32, elements: !120)
!120 = !{!73, !73}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !84, file: !83, line: 89, baseType: !118, size: 288, align: 32, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !84, file: !83, line: 90, baseType: !10, size: 32, align: 32, offset: 1568)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !84, file: !83, line: 91, baseType: !16, size: 32, align: 32, offset: 1600)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !84, file: !83, line: 92, baseType: !16, size: 32, align: 32, offset: 1632)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !84, file: !83, line: 93, baseType: !10, size: 32, align: 32, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !84, file: !83, line: 94, baseType: !16, size: 32, align: 32, offset: 1696)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !84, file: !83, line: 95, baseType: !16, size: 32, align: 32, offset: 1728)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !84, file: !83, line: 96, baseType: !10, size: 32, align: 32, offset: 1760)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !84, file: !83, line: 97, baseType: !16, size: 32, align: 32, offset: 1792)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !84, file: !83, line: 98, baseType: !16, size: 32, align: 32, offset: 1824)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !84, file: !83, line: 99, baseType: !16, size: 32, align: 32, offset: 1856)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !84, file: !83, line: 100, baseType: !10, size: 32, align: 32, offset: 1888)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !84, file: !83, line: 101, baseType: !16, size: 32, align: 32, offset: 1920)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !84, file: !83, line: 102, baseType: !16, size: 32, align: 32, offset: 1952)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !84, file: !83, line: 103, baseType: !10, size: 32, align: 32, offset: 1984)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !84, file: !83, line: 104, baseType: !16, size: 32, align: 32, offset: 2016)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !84, file: !83, line: 105, baseType: !16, size: 32, align: 32, offset: 2048)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !84, file: !83, line: 106, baseType: !16, size: 32, align: 32, offset: 2080)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !84, file: !83, line: 107, baseType: !16, size: 32, align: 32, offset: 2112)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !84, file: !83, line: 108, baseType: !16, size: 32, align: 32, offset: 2144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !84, file: !83, line: 109, baseType: !10, size: 32, align: 32, offset: 2176)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !84, file: !83, line: 110, baseType: !10, size: 32, align: 32, offset: 2208)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !84, file: !83, line: 111, baseType: !10, size: 32, align: 32, offset: 2240)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !84, file: !83, line: 112, baseType: !16, size: 32, align: 32, offset: 2272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !84, file: !83, line: 113, baseType: !16, size: 32, align: 32, offset: 2304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !84, file: !83, line: 114, baseType: !16, size: 32, align: 32, offset: 2336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !84, file: !83, line: 115, baseType: !10, size: 32, align: 32, offset: 2368)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !84, file: !83, line: 116, baseType: !16, size: 32, align: 32, offset: 2400)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !84, file: !83, line: 117, baseType: !16, size: 32, align: 32, offset: 2432)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !84, file: !83, line: 118, baseType: !10, size: 32, align: 32, offset: 2464)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !84, file: !83, line: 120, baseType: !10, size: 32, align: 32, offset: 2496)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !84, file: !83, line: 122, baseType: !10, size: 32, align: 32, offset: 2528)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !84, file: !83, line: 124, baseType: !10, size: 32, align: 32, offset: 2560)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !84, file: !83, line: 125, baseType: !10, size: 32, align: 32, offset: 2592)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !84, file: !83, line: 126, baseType: !16, size: 32, align: 32, offset: 2624)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !84, file: !83, line: 127, baseType: !10, size: 32, align: 32, offset: 2656)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !84, file: !83, line: 128, baseType: !16, size: 32, align: 32, offset: 2688)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !84, file: !83, line: 129, baseType: !16, size: 32, align: 32, offset: 2720)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !84, file: !83, line: 130, baseType: !10, size: 32, align: 32, offset: 2752)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !84, file: !83, line: 131, baseType: !16, size: 32, align: 32, offset: 2784)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !84, file: !83, line: 132, baseType: !10, size: 32, align: 32, offset: 2816)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !84, file: !83, line: 133, baseType: !10, size: 32, align: 32, offset: 2848)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !84, file: !83, line: 134, baseType: !10, size: 32, align: 32, offset: 2880)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !84, file: !83, line: 135, baseType: !10, size: 32, align: 32, offset: 2912)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !84, file: !83, line: 136, baseType: !16, size: 32, align: 32, offset: 2944)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !84, file: !83, line: 137, baseType: !16, size: 32, align: 32, offset: 2976)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !84, file: !83, line: 138, baseType: !16, size: 32, align: 32, offset: 3008)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !84, file: !83, line: 139, baseType: !16, size: 32, align: 32, offset: 3040)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !84, file: !83, line: 140, baseType: !170, size: 512, align: 64, offset: 3072)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !83, line: 53, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 42, size: 512, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !179, !180, !181, !185, !189}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !171, file: !83, line: 43, baseType: !10, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !171, file: !83, line: 44, baseType: !10, size: 32, align: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !171, file: !83, line: 45, baseType: !10, size: 32, align: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !171, file: !83, line: 46, baseType: !10, size: 32, align: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !171, file: !83, line: 47, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !171, file: !83, line: 48, baseType: !178, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !171, file: !83, line: 49, baseType: !178, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !171, file: !83, line: 50, baseType: !182, size: 64, align: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !17, line: 101, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 96, align: 32, elements: !72)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !171, file: !83, line: 51, baseType: !186, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !17, line: 107, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, align: 32, elements: !72)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !171, file: !83, line: 52, baseType: !190, size: 64, align: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !84, file: !83, line: 141, baseType: !192, size: 576, align: 64, offset: 3584)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 576, align: 64, elements: !72)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !83, line: 40, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 36, size: 192, align: 64, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !194, file: !83, line: 37, baseType: !10, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !194, file: !83, line: 38, baseType: !178, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !194, file: !83, line: 39, baseType: !178, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !84, file: !83, line: 142, baseType: !192, size: 576, align: 64, offset: 4160)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !202, line: 40, baseType: !203)
!202 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!203 = !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 36, size: 192, align: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !203, file: !202, line: 37, baseType: !10, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !203, file: !202, line: 37, baseType: !10, size: 32, align: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !203, file: !202, line: 38, baseType: !10, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !203, file: !202, line: 38, baseType: !10, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !203, file: !202, line: 39, baseType: !10, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !203, file: !202, line: 39, baseType: !10, size: 32, align: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !213, line: 59, baseType: !214)
!213 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 36, size: 32992, align: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !227, !228, !229}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !214, file: !213, line: 37, baseType: !10, size: 32, align: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !214, file: !213, line: 38, baseType: !10, size: 32, align: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !214, file: !213, line: 39, baseType: !10, size: 32, align: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !214, file: !213, line: 40, baseType: !10, size: 32, align: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !214, file: !213, line: 41, baseType: !10, size: 32, align: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !214, file: !213, line: 43, baseType: !10, size: 32, align: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !214, file: !213, line: 43, baseType: !10, size: 32, align: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !214, file: !213, line: 50, baseType: !224, size: 8192, align: 32, offset: 224)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !214, file: !213, line: 51, baseType: !224, size: 8192, align: 32, offset: 8416)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !214, file: !213, line: 52, baseType: !224, size: 8192, align: 32, offset: 16608)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !214, file: !213, line: 55, baseType: !224, size: 8192, align: 32, offset: 24800)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !13, file: !1, line: 94, type: !19)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerbose", arg: 2, scope: !13, file: !1, line: 94, type: !10)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ir", arg: 3, scope: !13, file: !1, line: 95, type: !81)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !13, file: !1, line: 96, type: !182)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !13, file: !1, line: 96, type: !182)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 6, scope: !13, file: !1, line: 97, type: !178)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 7, scope: !13, file: !1, line: 97, type: !178)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 8, scope: !13, file: !1, line: 98, type: !200)
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 9, scope: !13, file: !1, line: 98, type: !211)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lrvir", arg: 10, scope: !13, file: !1, line: 99, type: !230)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewaldcoeff", arg: 11, scope: !13, file: !1, line: 99, type: !16)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factor", scope: !13, file: !1, line: 105, type: !16)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "energy", scope: !13, file: !1, line: 106, type: !16)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lll", scope: !13, file: !1, line: 107, type: !183)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lowiy", scope: !13, file: !1, line: 108, type: !10)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lowiz", scope: !13, file: !1, line: 108, type: !10)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !13, file: !1, line: 108, type: !10)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !13, file: !1, line: 108, type: !10)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !13, file: !1, line: 108, type: !10)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !13, file: !1, line: 108, type: !10)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !13, file: !1, line: 109, type: !16)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cs", scope: !13, file: !1, line: 109, type: !16)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ss", scope: !13, file: !1, line: 109, type: !16)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ak", scope: !13, file: !1, line: 109, type: !16)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "akv", scope: !13, file: !1, line: 109, type: !16)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mx", scope: !13, file: !1, line: 109, type: !16)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "my", scope: !13, file: !1, line: 109, type: !16)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mz", scope: !13, file: !1, line: 109, type: !16)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m2", scope: !13, file: !1, line: 109, type: !16)
!261 = !DISubprogram(name: "clear_mat", scope: !262, file: !262, line: 334, type: !263, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, variables: !265)
!262 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!263 = !DISubroutineType(types: !264)
!264 = !{null, !230}
!265 = !{!266, !267}
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !261, file: !262, line: 334, type: !230)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nul", scope: !261, file: !262, line: 336, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!269 = !DISubprogram(name: "calc_lll", scope: !270, file: !270, line: 90, type: !271, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, variables: !273)
!270 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/shift_util.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!271 = !DISubroutineType(types: !272)
!272 = !{null, !178, !178}
!273 = !{!274, !275}
!274 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !269, file: !270, line: 90, type: !178)
!275 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lll", arg: 2, scope: !269, file: !270, line: 90, type: !178)
!276 = !DISubprogram(name: "tabulate_eir", scope: !1, file: !1, line: 66, type: !277, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, variables: !289)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !10, !182, !10, !279, !178}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "cvec", file: !282, line: 48, baseType: !283)
!282 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmxcomplex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 192, align: 32, elements: !72)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_complex", file: !282, line: 46, baseType: !285)
!285 = !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 44, size: 64, align: 32, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !285, file: !282, line: 45, baseType: !16, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !285, file: !282, line: 45, baseType: !16, size: 32, align: 32, offset: 32)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297}
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natom", arg: 1, scope: !276, file: !1, line: 66, type: !10)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !276, file: !1, line: 66, type: !182)
!292 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kmax", arg: 3, scope: !276, file: !1, line: 66, type: !10)
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eir", arg: 4, scope: !276, file: !1, line: 66, type: !279)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lll", arg: 5, scope: !276, file: !1, line: 66, type: !178)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !276, file: !1, line: 68, type: !10)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !276, file: !1, line: 68, type: !10)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !276, file: !1, line: 68, type: !10)
!298 = !DISubprogram(name: "cmul", scope: !282, file: !282, line: 93, type: !299, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, variables: !301)
!299 = !DISubroutineType(types: !300)
!300 = !{!284, !284, !284}
!301 = !{!302, !303, !304}
!302 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !298, file: !282, line: 93, type: !284)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !298, file: !282, line: 93, type: !284)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !298, file: !282, line: 95, type: !284)
!305 = !DISubprogram(name: "conjmul", scope: !1, file: !1, line: 53, type: !299, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, variables: !306)
!306 = !{!307, !308, !309}
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !305, file: !1, line: 53, type: !284)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !305, file: !1, line: 53, type: !284)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !305, file: !1, line: 55, type: !284)
!310 = !DISubprogram(name: "rcmul", scope: !282, file: !282, line: 52, type: !311, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, variables: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{!284, !16, !284}
!313 = !{!314, !315, !316}
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 1, scope: !310, file: !282, line: 52, type: !16)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !310, file: !282, line: 52, type: !284)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !310, file: !282, line: 54, type: !284)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !326}
!318 = !DIGlobalVariable(name: "bFirst", scope: !13, file: !1, line: 101, type: !10, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariable(name: "nx", scope: !13, file: !1, line: 102, type: !10, isLocal: true, isDefinition: true, variable: i32* @do_ewald.nx)
!320 = !DIGlobalVariable(name: "ny", scope: !13, file: !1, line: 102, type: !10, isLocal: true, isDefinition: true, variable: i32* @do_ewald.ny)
!321 = !DIGlobalVariable(name: "nz", scope: !13, file: !1, line: 102, type: !10, isLocal: true, isDefinition: true, variable: i32* @do_ewald.nz)
!322 = !DIGlobalVariable(name: "kmax", scope: !13, file: !1, line: 102, type: !10, isLocal: true, isDefinition: true, variable: i32* @do_ewald.kmax)
!323 = !DIGlobalVariable(name: "eir", scope: !13, file: !1, line: 103, type: !279, isLocal: true, isDefinition: true, variable: [3 x %struct.t_complex]*** @do_ewald.eir)
!324 = !DIGlobalVariable(name: "tab_xy", scope: !13, file: !1, line: 104, type: !325, isLocal: true, isDefinition: true, variable: %struct.t_complex** @do_ewald.tab_xy)
