; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ewald_util.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }
%struct.t_nblist = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32* }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }

@ewald_LRcorrection.Vself = internal unnamed_addr global float 0.000000e+00, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !10, globals: !322, imports: !9)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ewald_util.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 65, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/enums.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "eewg3D", value: 0)
!7 = !DIEnumerator(name: "eewg3DC", value: 1)
!8 = !DIEnumerator(name: "eewgNR", value: 2)
!9 = !{}
!10 = !{!11, !18, !32, !286, !299, !308, !315}
!11 = !DISubprogram(name: "__sigbits", scope: !12, file: !12, line: 114, type: !13, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !16)
!12 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15}
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !11, file: !12, line: 114, type: !15)
!18 = !DISubprogram(name: "calc_ewaldcoeff", scope: !1, file: !1, line: 49, type: !19, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float)* @calc_ewaldcoeff, variables: !24)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !21, !21}
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !22, line: 87, baseType: !23)
!22 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!23 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!24 = !{!25, !26, !27, !28, !29, !30, !31}
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 1, scope: !18, file: !1, line: 49, type: !21)
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dtol", arg: 2, scope: !18, file: !1, line: 49, type: !21)
!27 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !18, file: !1, line: 51, type: !21)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "low", scope: !18, file: !1, line: 51, type: !21)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "high", scope: !18, file: !1, line: 51, type: !21)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !18, file: !1, line: 52, type: !15)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !18, file: !1, line: 52, type: !15)
!32 = !DISubprogram(name: "ewald_LRcorrection", scope: !1, file: !1, line: 75, type: !33, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, %struct.t_nsborder*, %struct.t_commrec*, %struct.t_forcerec*, float*, %struct.t_block*, [3 x float]*, [3 x float]*, float*, float, i32, float, [3 x float]*)* @ewald_LRcorrection, variables: !241)
!33 = !DISubroutineType(types: !34)
!34 = !{!21, !35, !98, !117, !128, !152, !230, !184, !240, !152, !21, !15, !21, !240}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 153, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !37, line: 122, size: 1216, align: 64, elements: !39)
!39 = !{!40, !43, !44, !45, !47, !48, !53, !54, !56, !60, !66, !76, !82, !83, !86, !87, !91, !95, !96, !97}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !38, file: !37, line: 123, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !38, file: !37, line: 124, baseType: !15, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !38, file: !37, line: 125, baseType: !15, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !37, line: 126, baseType: !46, size: 16, align: 16, offset: 128)
!46 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !38, file: !37, line: 127, baseType: !46, size: 16, align: 16, offset: 144)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !38, file: !37, line: 128, baseType: !49, size: 128, align: 64, offset: 192)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !37, line: 88, size: 128, align: 64, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !49, file: !37, line: 89, baseType: !41, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !49, file: !37, line: 90, baseType: !15, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !38, file: !37, line: 129, baseType: !15, size: 32, align: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !38, file: !37, line: 132, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !38, file: !37, line: 133, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!15, !55}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !38, file: !37, line: 134, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!15, !55, !64, !15}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !38, file: !37, line: 135, baseType: !67, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !55, !70, !15}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !37, line: 77, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !72, line: 71, baseType: !73)
!72 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!75 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !38, file: !37, line: 136, baseType: !77, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!15, !55, !80, !15}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !38, file: !37, line: 139, baseType: !49, size: 128, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !38, file: !37, line: 140, baseType: !84, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !37, line: 94, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !38, file: !37, line: 141, baseType: !15, size: 32, align: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !38, file: !37, line: 144, baseType: !88, size: 24, align: 8, offset: 928)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 24, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !38, file: !37, line: 145, baseType: !92, size: 8, align: 8, offset: 952)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !38, file: !37, line: 148, baseType: !49, size: 128, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !38, file: !37, line: 151, baseType: !15, size: 32, align: 32, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !37, line: 152, baseType: !70, size: 64, align: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !100, line: 59, baseType: !101)
!100 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!101 = !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 36, size: 32992, align: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !114, !115, !116}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !101, file: !100, line: 37, baseType: !15, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !101, file: !100, line: 38, baseType: !15, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !101, file: !100, line: 39, baseType: !15, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !101, file: !100, line: 40, baseType: !15, size: 32, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !101, file: !100, line: 41, baseType: !15, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !101, file: !100, line: 43, baseType: !15, size: 32, align: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !101, file: !100, line: 43, baseType: !15, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !101, file: !100, line: 50, baseType: !111, size: 8192, align: 32, offset: 224)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, align: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !101, file: !100, line: 51, baseType: !111, size: 8192, align: 32, offset: 8416)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !101, file: !100, line: 52, baseType: !111, size: 8192, align: 32, offset: 16608)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !101, file: !100, line: 55, baseType: !111, size: 8192, align: 32, offset: 24800)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !119, line: 40, baseType: !120)
!119 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!120 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 36, size: 192, align: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !120, file: !119, line: 37, baseType: !15, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !120, file: !119, line: 37, baseType: !15, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !120, file: !119, line: 38, baseType: !15, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !120, file: !119, line: 38, baseType: !15, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !120, file: !119, line: 39, baseType: !15, size: 32, align: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !120, file: !119, line: 39, baseType: !15, size: 32, align: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !130, line: 149, baseType: !131)
!130 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/forcerec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 43, size: 22784, align: 64, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !179, !180, !182, !183, !186, !187, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !131, file: !130, line: 45, baseType: !15, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !131, file: !130, line: 46, baseType: !21, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !131, file: !130, line: 46, baseType: !21, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !131, file: !130, line: 49, baseType: !21, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !131, file: !130, line: 49, baseType: !21, size: 32, align: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !131, file: !130, line: 50, baseType: !21, size: 32, align: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !131, file: !130, line: 50, baseType: !21, size: 32, align: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !131, file: !130, line: 53, baseType: !15, size: 32, align: 32, offset: 224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !131, file: !130, line: 54, baseType: !21, size: 32, align: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !131, file: !130, line: 54, baseType: !21, size: 32, align: 32, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !131, file: !130, line: 54, baseType: !21, size: 32, align: 32, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !131, file: !130, line: 57, baseType: !21, size: 32, align: 32, offset: 352)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !131, file: !130, line: 60, baseType: !21, size: 32, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !131, file: !130, line: 63, baseType: !15, size: 32, align: 32, offset: 416)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !131, file: !130, line: 64, baseType: !15, size: 32, align: 32, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !131, file: !130, line: 65, baseType: !21, size: 32, align: 32, offset: 480)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !131, file: !130, line: 66, baseType: !15, size: 32, align: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !131, file: !130, line: 67, baseType: !21, size: 32, align: 32, offset: 544)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !131, file: !130, line: 69, baseType: !152, size: 64, align: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !131, file: !130, line: 70, baseType: !152, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !131, file: !130, line: 71, baseType: !152, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !131, file: !130, line: 72, baseType: !152, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !131, file: !130, line: 75, baseType: !21, size: 32, align: 32, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !131, file: !130, line: 75, baseType: !21, size: 32, align: 32, offset: 864)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !131, file: !130, line: 76, baseType: !152, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !131, file: !130, line: 79, baseType: !21, size: 32, align: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !131, file: !130, line: 79, baseType: !21, size: 32, align: 32, offset: 992)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !131, file: !130, line: 80, baseType: !21, size: 32, align: 32, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !131, file: !130, line: 81, baseType: !21, size: 32, align: 32, offset: 1056)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !131, file: !130, line: 84, baseType: !15, size: 32, align: 32, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !131, file: !130, line: 85, baseType: !21, size: 32, align: 32, offset: 1120)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !131, file: !130, line: 86, baseType: !21, size: 32, align: 32, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !131, file: !130, line: 87, baseType: !15, size: 32, align: 32, offset: 1184)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !131, file: !130, line: 90, baseType: !15, size: 32, align: 32, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !131, file: !130, line: 91, baseType: !15, size: 32, align: 32, offset: 1248)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !131, file: !130, line: 92, baseType: !15, size: 32, align: 32, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !131, file: !130, line: 92, baseType: !15, size: 32, align: 32, offset: 1312)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !131, file: !130, line: 93, baseType: !15, size: 32, align: 32, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !131, file: !130, line: 94, baseType: !15, size: 32, align: 32, offset: 1376)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !131, file: !130, line: 95, baseType: !15, size: 32, align: 32, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !131, file: !130, line: 96, baseType: !175, size: 96, align: 32, offset: 1440)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 96, align: 32, elements: !89)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !131, file: !130, line: 97, baseType: !15, size: 32, align: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !131, file: !130, line: 98, baseType: !15, size: 32, align: 32, offset: 1568)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !131, file: !130, line: 99, baseType: !15, size: 32, align: 32, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !131, file: !130, line: 99, baseType: !15, size: 32, align: 32, offset: 1632)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !131, file: !130, line: 100, baseType: !181, size: 64, align: 64, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !131, file: !130, line: 101, baseType: !181, size: 64, align: 64, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !131, file: !130, line: 102, baseType: !184, size: 64, align: 64, offset: 1792)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !22, line: 101, baseType: !175)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !131, file: !130, line: 103, baseType: !184, size: 64, align: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !131, file: !130, line: 108, baseType: !188, size: 9984, align: 64, offset: 1920)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 9984, align: 64, elements: !210)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !190, line: 60, baseType: !191)
!190 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!191 = !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 36, size: 768, align: 64, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !203, !204, !205, !206, !207, !208, !209}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !191, file: !190, line: 37, baseType: !15, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !191, file: !190, line: 39, baseType: !15, size: 32, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !191, file: !190, line: 39, baseType: !15, size: 32, align: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !191, file: !190, line: 40, baseType: !15, size: 32, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !191, file: !190, line: 40, baseType: !15, size: 32, align: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !191, file: !190, line: 41, baseType: !15, size: 32, align: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !191, file: !190, line: 42, baseType: !15, size: 32, align: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !191, file: !190, line: 43, baseType: !201, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !22, line: 73, baseType: !15)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !191, file: !190, line: 44, baseType: !181, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !191, file: !190, line: 45, baseType: !181, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !191, file: !190, line: 46, baseType: !181, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !191, file: !190, line: 47, baseType: !201, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !191, file: !190, line: 48, baseType: !181, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !191, file: !190, line: 58, baseType: !15, size: 32, align: 32, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !191, file: !190, line: 58, baseType: !181, size: 64, align: 64, offset: 704)
!210 = !{!211}
!211 = !DISubrange(count: 13)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !131, file: !130, line: 109, baseType: !188, size: 9984, align: 64, offset: 11904)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !131, file: !130, line: 120, baseType: !15, size: 32, align: 32, offset: 21888)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !131, file: !130, line: 121, baseType: !15, size: 32, align: 32, offset: 21920)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !131, file: !130, line: 122, baseType: !184, size: 64, align: 64, offset: 21952)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !131, file: !130, line: 123, baseType: !184, size: 64, align: 64, offset: 22016)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !131, file: !130, line: 126, baseType: !184, size: 64, align: 64, offset: 22080)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !131, file: !130, line: 127, baseType: !15, size: 32, align: 32, offset: 22144)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !131, file: !130, line: 128, baseType: !21, size: 32, align: 32, offset: 22176)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !131, file: !130, line: 131, baseType: !184, size: 64, align: 64, offset: 22208)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !131, file: !130, line: 134, baseType: !15, size: 32, align: 32, offset: 22272)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !131, file: !130, line: 135, baseType: !201, size: 64, align: 64, offset: 22336)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !131, file: !130, line: 136, baseType: !152, size: 64, align: 64, offset: 22400)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !131, file: !130, line: 137, baseType: !15, size: 32, align: 32, offset: 22464)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !131, file: !130, line: 140, baseType: !15, size: 32, align: 32, offset: 22496)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !131, file: !130, line: 141, baseType: !15, size: 32, align: 32, offset: 22528)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !131, file: !130, line: 142, baseType: !152, size: 64, align: 64, offset: 22592)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !131, file: !130, line: 145, baseType: !181, size: 64, align: 64, offset: 22656)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !131, file: !130, line: 148, baseType: !21, size: 32, align: 32, offset: 22720)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !232, line: 52, baseType: !233)
!232 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!233 = !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 36, size: 8448, align: 64, elements: !234)
!234 = !{!235, !236, !237, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !233, file: !232, line: 37, baseType: !111, size: 8192, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !233, file: !232, line: 43, baseType: !15, size: 32, align: 32, offset: 8192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !233, file: !232, line: 44, baseType: !201, size: 64, align: 64, offset: 8256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !233, file: !232, line: 45, baseType: !15, size: 32, align: 32, offset: 8320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !233, file: !232, line: 46, baseType: !201, size: 64, align: 64, offset: 8384)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !32, file: !1, line: 75, type: !35)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 2, scope: !32, file: !1, line: 75, type: !98)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !32, file: !1, line: 75, type: !117)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 4, scope: !32, file: !1, line: 75, type: !128)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charge", arg: 5, scope: !32, file: !1, line: 76, type: !152)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "excl", arg: 6, scope: !32, file: !1, line: 76, type: !230)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 7, scope: !32, file: !1, line: 76, type: !184)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 8, scope: !32, file: !1, line: 77, type: !240)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mu_tot", arg: 9, scope: !32, file: !1, line: 77, type: !152)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qsum", arg: 10, scope: !32, file: !1, line: 77, type: !21)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ewald_geometry", arg: 11, scope: !32, file: !1, line: 77, type: !15)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "epsilon_surface", arg: 12, scope: !32, file: !1, line: 78, type: !21)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lr_vir", arg: 13, scope: !32, file: !1, line: 78, type: !240)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !32, file: !1, line: 83, type: !15)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !32, file: !1, line: 83, type: !15)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i2", scope: !32, file: !1, line: 83, type: !15)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !32, file: !1, line: 83, type: !15)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !32, file: !1, line: 83, type: !15)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !32, file: !1, line: 83, type: !15)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !32, file: !1, line: 83, type: !15)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jv", scope: !32, file: !1, line: 83, type: !15)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "AA", scope: !32, file: !1, line: 84, type: !201)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q2sum", scope: !32, file: !1, line: 85, type: !265)
!265 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vc", scope: !32, file: !1, line: 86, type: !21)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qi", scope: !32, file: !1, line: 86, type: !21)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr", scope: !32, file: !1, line: 86, type: !21)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dr2", scope: !32, file: !1, line: 86, type: !21)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rinv", scope: !32, file: !1, line: 86, type: !21)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fscal", scope: !32, file: !1, line: 86, type: !21)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vexcl", scope: !32, file: !1, line: 86, type: !21)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Vcharge", scope: !32, file: !1, line: 86, type: !21)
