; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/f77_wrappers.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

; Function Attrs: alwaysinline nounwind optsize readnone ssp uwtable
define i32 @__inline_isfinitef(float %__x) #0 {
  tail call void @llvm.dbg.value(metadata float %__x, i64 0, metadata !13, metadata !216), !dbg !217
  %1 = fcmp ord float %__x, 0.000000e+00, !dbg !218
  br i1 %1, label %2, label %5, !dbg !219

; <label>:2                                       ; preds = %0
  %3 = tail call float @llvm.fabs.f32(float %__x) #6, !dbg !220
  %4 = fcmp une float %3, 0x7FF0000000000000, !dbg !221
  br label %5

; <label>:5                                       ; preds = %2, %0
  %6 = phi i1 [ false, %0 ], [ %4, %2 ]
  %7 = zext i1 %6 to i32, !dbg !219
  ret i32 %7, !dbg !222
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind readnone

!17 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!18 = !{!19}
!19 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !14, file: !8, line: 207, type: !17)
!20 = !DISubprogram(name: "__inline_isfinitel", scope: !8, file: !8, line: 210, type: !21, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !24)
!21 = !DISubroutineType(types: !22)
!22 = !{!4, !23}
!23 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!24 = !{!25}
!25 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !20, file: !8, line: 210, type: !23)
!26 = !DISubprogram(name: "__inline_isinff", scope: !8, file: !8, line: 213, type: !9, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !27)
!27 = !{!28}
!28 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !26, file: !8, line: 213, type: !11)
!29 = !DISubprogram(name: "__inline_isinfd", scope: !8, file: !8, line: 216, type: !15, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !30)
!30 = !{!31}
!31 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !29, file: !8, line: 216, type: !17)
!32 = !DISubprogram(name: "__inline_isinfl", scope: !8, file: !8, line: 219, type: !21, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !33)
!33 = !{!34}
!34 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !32, file: !8, line: 219, type: !23)
!35 = !DISubprogram(name: "__inline_isnanf", scope: !8, file: !8, line: 222, type: !9, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !36)
!36 = !{!37}
!37 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !35, file: !8, line: 222, type: !11)
!38 = !DISubprogram(name: "__inline_isnand", scope: !8, file: !8, line: 225, type: !15, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !39)
!39 = !{!40}
!40 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !38, file: !8, line: 225, type: !17)
!41 = !DISubprogram(name: "__inline_isnanl", scope: !8, file: !8, line: 228, type: !21, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !42)
!42 = !{!43}
!43 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !41, file: !8, line: 228, type: !23)
!44 = !DISubprogram(name: "__inline_signbitf", scope: !8, file: !8, line: 231, type: !9, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !45)
!45 = !{!46, !47}
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !44, file: !8, line: 231, type: !11)
!47 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !44, file: !8, line: 232, type: !48)
!48 = !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !8, line: 232, size: 32, align: 32, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !48, file: !8, line: 232, baseType: !11, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !48, file: !8, line: 232, baseType: !52, size: 32, align: 32)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DISubprogram(name: "__inline_signbitd", scope: !8, file: !8, line: 236, type: !15, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !54)
!54 = !{!55, !56}
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !53, file: !8, line: 236, type: !17)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !53, file: !8, line: 237, type: !57)
!57 = !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !8, line: 237, size: 64, align: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !57, file: !8, line: 237, baseType: !17, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !57, file: !8, line: 237, baseType: !61, size: 64, align: 64)
!61 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!62 = !DISubprogram(name: "__inline_signbitl", scope: !8, file: !8, line: 242, type: !21, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !63)
!63 = !{!64, !65}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !62, file: !8, line: 242, type: !23)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !62, file: !8, line: 246, type: !66)
!66 = !DICompositeType(tag: DW_TAG_union_type, scope: !62, file: !8, line: 243, size: 128, align: 128, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !66, file: !8, line: 244, baseType: !23, size: 128, align: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !66, file: !8, line: 245, baseType: !70, size: 128, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, scope: !66, file: !8, line: 245, size: 128, align: 64, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !70, file: !8, line: 245, baseType: !61, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !70, file: !8, line: 245, baseType: !74, size: 16, align: 16, offset: 64)
!74 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!75 = !DISubprogram(name: "__inline_isnormalf", scope: !8, file: !8, line: 257, type: !9, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !76)
!76 = !{!77}
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !75, file: !8, line: 257, type: !11)
!78 = !DISubprogram(name: "__inline_isnormald", scope: !8, file: !8, line: 260, type: !15, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !79)
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !78, file: !8, line: 260, type: !17)
!81 = !DISubprogram(name: "__inline_isnormall", scope: !8, file: !8, line: 263, type: !21, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !82)
!82 = !{!83}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !81, file: !8, line: 263, type: !23)
!84 = !DISubprogram(name: "__sincosf", scope: !8, file: !8, line: 642, type: !85, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !88)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !11, !87, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!88 = !{!89, !90, !91, !92}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !84, file: !8, line: 642, type: !11)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !84, file: !8, line: 642, type: !87)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !84, file: !8, line: 642, type: !87)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !84, file: !8, line: 643, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !8, line: 634, size: 64, align: 32, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !94, file: !8, line: 634, baseType: !11, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !94, file: !8, line: 634, baseType: !11, size: 32, align: 32, offset: 32)
!98 = !DISubprogram(name: "__sincos", scope: !8, file: !8, line: 647, type: !99, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !102)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !17, !101, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!102 = !{!103, !104, !105, !106}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !98, file: !8, line: 647, type: !17)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !98, file: !8, line: 647, type: !101)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !98, file: !8, line: 647, type: !101)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !98, file: !8, line: 648, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !8, line: 635, size: 128, align: 64, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !108, file: !8, line: 635, baseType: !17, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !108, file: !8, line: 635, baseType: !17, size: 64, align: 64, offset: 64)
!112 = !DISubprogram(name: "__sincospif", scope: !8, file: !8, line: 652, type: !85, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !113)
!113 = !{!114, !115, !116, !117}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !8, line: 652, type: !11)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !112, file: !8, line: 652, type: !87)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !112, file: !8, line: 652, type: !87)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !112, file: !8, line: 653, type: !93)
!118 = !DISubprogram(name: "__sincospi", scope: !8, file: !8, line: 657, type: !99, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !118, file: !8, line: 657, type: !17)
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !118, file: !8, line: 657, type: !101)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !118, file: !8, line: 657, type: !101)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !118, file: !8, line: 658, type: !107)
!124 = !DISubprogram(name: "__sputc", scope: !125, file: !125, line: 348, type: !126, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !189)
!125 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !125, line: 153, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !125, line: 122, size: 1216, align: 64, elements: !131)
!131 = !{!132, !135, !136, !137, !139, !140, !145, !146, !148, !152, !157, !167, !173, !174, !177, !178, !182, !186, !187, !188}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !130, file: !125, line: 123, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !130, file: !125, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !130, file: !125, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !130, file: !125, line: 126, baseType: !138, size: 16, align: 16, offset: 128)
!138 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !130, file: !125, line: 127, baseType: !138, size: 16, align: 16, offset: 144)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !130, file: !125, line: 128, baseType: !141, size: 128, align: 64, offset: 192)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !125, line: 88, size: 128, align: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !141, file: !125, line: 89, baseType: !133, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !141, file: !125, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !130, file: !125, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !130, file: !125, line: 132, baseType: !147, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !130, file: !125, line: 133, baseType: !149, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!4, !147}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !130, file: !125, line: 134, baseType: !153, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!4, !147, !156, !4}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !130, file: !125, line: 135, baseType: !158, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !147, !161, !4}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !125, line: 77, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !163, line: 71, baseType: !164)
!163 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !165, line: 46, baseType: !166)
!165 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!166 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !130, file: !125, line: 136, baseType: !168, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!4, !147, !171, !4}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !130, file: !125, line: 139, baseType: !141, size: 128, align: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !130, file: !125, line: 140, baseType: !175, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !125, line: 94, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !130, file: !125, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !130, file: !125, line: 144, baseType: !179, size: 24, align: 8, offset: 928)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 3)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !130, file: !125, line: 145, baseType: !183, size: 8, align: 8, offset: 952)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 1)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !130, file: !125, line: 148, baseType: !141, size: 128, align: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !130, file: !125, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !130, file: !125, line: 152, baseType: !161, size: 64, align: 64, offset: 1152)
!189 = !{!190, !191}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !124, file: !125, line: 348, type: !4)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !124, file: !125, line: 348, type: !128)
!192 = !DISubprogram(name: "__sigbits", scope: !193, file: !193, line: 114, type: !194, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !196)
!193 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!194 = !DISubroutineType(types: !195)
!195 = !{!4, !4}
!196 = !{!197}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !192, file: !193, line: 114, type: !4)
!198 = !DISubprogram(name: "cerfc_", scope: !1, file: !1, line: 46, type: !199, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: float (float*)* @cerfc_, variables: !204)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !203}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !202, line: 87, baseType: !11)
!202 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!204 = !{!205}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !198, file: !1, line: 46, type: !203)
!206 = !DISubprogram(name: "cpow_", scope: !1, file: !1, line: 51, type: !207, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: float (float*, float*)* @cpow_, variables: !209)
!207 = !DISubroutineType(types: !208)
!208 = !{!201, !203, !203}
!209 = !{!210, !211}
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !206, file: !1, line: 51, type: !203)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !206, file: !1, line: 51, type: !203)
!212 = !{i32 2, !"Dwarf Version", i32 2}
!213 = !{i32 2, !"Debug Info Version", i32 700000003}
!214 = !{i32 1, !"PIC Level", i32 2}
!215 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!216 = !DIExpression()
!217 = !DILocation(line: 204, column: 53, scope: !7)
!218 = !DILocation(line: 205, column: 16, scope: !7)
!219 = !DILocation(line: 205, column: 23, scope: !7)
!220 = !DILocation(line: 205, column: 26, scope: !7)
!221 = !DILocation(line: 205, column: 47, scope: !7)
!222 = !DILocation(line: 205, column: 5, scope: !7)
!223 = !DILocation(line: 207, column: 54, scope: !14)
!224 = !DILocation(line: 208, column: 16, scope: !14)
!225 = !DILocation(line: 208, column: 23, scope: !14)
!226 = !DILocation(line: 208, column: 26, scope: !14)
!227 = !DILocation(line: 208, column: 46, scope: !14)
!228 = !DILocation(line: 208, column: 5, scope: !14)
!229 = !DILocation(line: 210, column: 59, scope: !20)
!230 = !DILocation(line: 211, column: 16, scope: !20)
!231 = !DILocation(line: 211, column: 23, scope: !20)
!232 = !DILocation(line: 211, column: 26, scope: !20)
!233 = !DILocation(line: 211, column: 47, scope: !20)
!234 = !DILocation(line: 211, column: 5, scope: !20)
!235 = !DILocation(line: 213, column: 50, scope: !26)
!236 = !DILocation(line: 214, column: 12, scope: !26)
!237 = !DILocation(line: 214, column: 33, scope: !26)
!238 = !DILocation(line: 214, column: 5, scope: !26)
!239 = !DILocation(line: 216, column: 51, scope: !29)
!240 = !DILocation(line: 217, column: 12, scope: !29)
!241 = !DILocation(line: 217, column: 32, scope: !29)
!242 = !DILocation(line: 217, column: 5, scope: !29)
!243 = !DILocation(line: 219, column: 56, scope: !32)
!244 = !DILocation(line: 220, column: 12, scope: !32)
