; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/fatal.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@_DefaultRuneLocale = external global %struct._RuneLocale
@bDebug = internal unnamed_addr global i1 false
@_where.bFirst = internal unnamed_addr global i1 false
@stdlog = external global %struct.__sFILE*
@__stderrp = external global %struct.__sFILE*
@.str1 = private unnamed_addr constant [39 x i8] c"\0AHALT in file %s line %d because:\0A\09%s\0A\00", align 1
@.str2 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@debug = global %struct.__sFILE* null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !314, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/fatal.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !{!9, !76, !82, !86, !94, !100, !106, !109, !112, !115, !118, !121, !124, !127, !130, !133, !136, !139, !142, !145, !148, !151, !154, !157, !160, !163, !166, !169, !172, !175, !183, !190, !196, !203, !208, !244, !249, !253, !254, !257, !269, !272, !276, !280, !288, !291, !300, !307}
!9 = !DISubprogram(name: "__sputc", scope: !10, file: !10, line: 348, type: !11, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !73)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DISubroutineType(types: !12)
!12 = !{!7, !7, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !10, line: 153, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !10, line: 122, size: 1216, align: 64, elements: !16)
!16 = !{!17, !20, !21, !22, !24, !25, !30, !31, !32, !36, !41, !51, !57, !58, !61, !62, !66, !70, !71, !72}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !15, file: !10, line: 123, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !15, file: !10, line: 124, baseType: !7, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !15, file: !10, line: 125, baseType: !7, size: 32, align: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !10, line: 126, baseType: !23, size: 16, align: 16, offset: 128)
!23 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !15, file: !10, line: 127, baseType: !23, size: 16, align: 16, offset: 144)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !15, file: !10, line: 128, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !10, line: 88, size: 128, align: 64, elements: !27)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !26, file: !10, line: 89, baseType: !18, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !26, file: !10, line: 90, baseType: !7, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !15, file: !10, line: 129, baseType: !7, size: 32, align: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !15, file: !10, line: 132, baseType: !6, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !15, file: !10, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!7, !6}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !15, file: !10, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!7, !6, !40, !7}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !15, file: !10, line: 135, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !6, !45, !7}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !10, line: 77, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !15, file: !10, line: 136, baseType: !52, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!7, !6, !55, !7}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !15, file: !10, line: 139, baseType: !26, size: 128, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !15, file: !10, line: 140, baseType: !59, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !10, line: 94, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !15, file: !10, line: 141, baseType: !7, size: 32, align: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !15, file: !10, line: 144, baseType: !63, size: 24, align: 8, offset: 928)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !15, file: !10, line: 145, baseType: !67, size: 8, align: 8, offset: 952)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !15, file: !10, line: 148, baseType: !26, size: 128, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !15, file: !10, line: 151, baseType: !7, size: 32, align: 32, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !10, line: 152, baseType: !45, size: 64, align: 64, offset: 1152)
!73 = !{!74, !75}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !9, file: !10, line: 348, type: !7)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !9, file: !10, line: 348, type: !13)
!76 = !DISubprogram(name: "__sigbits", scope: !77, file: !77, line: 114, type: !78, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !80)
!77 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DISubroutineType(types: !79)
!79 = !{!7, !7}
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !76, file: !77, line: 114, type: !7)
!82 = !DISubprogram(name: "isascii", scope: !83, file: !83, line: 135, type: !78, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isascii, variables: !84)
!83 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!84 = !{!85}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !82, file: !83, line: 135, type: !7)
!86 = !DISubprogram(name: "__istype", scope: !83, file: !83, line: 153, type: !87, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i64)* @__istype, variables: !91)
!87 = !DISubroutineType(types: !88)
!88 = !{!7, !89, !90}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !49, line: 70, baseType: !7)
!90 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!91 = !{!92, !93}
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !86, file: !83, line: 153, type: !89)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !86, file: !83, line: 153, type: !90)
!94 = !DISubprogram(name: "__isctype", scope: !83, file: !83, line: 164, type: !95, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i64)* @__isctype, variables: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{!89, !89, !90}
!97 = !{!98, !99}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !94, file: !83, line: 164, type: !89)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !94, file: !83, line: 164, type: !90)
!100 = !DISubprogram(name: "__wcwidth", scope: !83, file: !83, line: 194, type: !101, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__wcwidth, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!7, !89}
!103 = !{!104, !105}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !100, file: !83, line: 194, type: !89)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_x", scope: !100, file: !83, line: 196, type: !5)
!106 = !DISubprogram(name: "isalnum", scope: !83, file: !83, line: 212, type: !78, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isalnum, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !106, file: !83, line: 212, type: !7)
!109 = !DISubprogram(name: "isalpha", scope: !83, file: !83, line: 218, type: !78, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isalpha, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !109, file: !83, line: 218, type: !7)
!112 = !DISubprogram(name: "isblank", scope: !83, file: !83, line: 224, type: !78, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isblank, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !112, file: !83, line: 224, type: !7)
!115 = !DISubprogram(name: "iscntrl", scope: !83, file: !83, line: 230, type: !78, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @iscntrl, variables: !116)
!116 = !{!117}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !115, file: !83, line: 230, type: !7)
!118 = !DISubprogram(name: "isdigit", scope: !83, file: !83, line: 237, type: !78, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isdigit, variables: !119)
!119 = !{!120}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !118, file: !83, line: 237, type: !7)
!121 = !DISubprogram(name: "isgraph", scope: !83, file: !83, line: 243, type: !78, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isgraph, variables: !122)
!122 = !{!123}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !121, file: !83, line: 243, type: !7)
!124 = !DISubprogram(name: "islower", scope: !83, file: !83, line: 249, type: !78, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @islower, variables: !125)
!125 = !{!126}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !124, file: !83, line: 249, type: !7)
!127 = !DISubprogram(name: "isprint", scope: !83, file: !83, line: 255, type: !78, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isprint, variables: !128)
!128 = !{!129}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !127, file: !83, line: 255, type: !7)
!130 = !DISubprogram(name: "ispunct", scope: !83, file: !83, line: 261, type: !78, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @ispunct, variables: !131)
!131 = !{!132}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !130, file: !83, line: 261, type: !7)
!133 = !DISubprogram(name: "isspace", scope: !83, file: !83, line: 267, type: !78, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isspace, variables: !134)
!134 = !{!135}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !133, file: !83, line: 267, type: !7)
!136 = !DISubprogram(name: "isupper", scope: !83, file: !83, line: 273, type: !78, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isupper, variables: !137)
!137 = !{!138}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !136, file: !83, line: 273, type: !7)
!139 = !DISubprogram(name: "isxdigit", scope: !83, file: !83, line: 280, type: !78, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isxdigit, variables: !140)
!140 = !{!141}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !139, file: !83, line: 280, type: !7)
!142 = !DISubprogram(name: "toascii", scope: !83, file: !83, line: 286, type: !78, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @toascii, variables: !143)
!143 = !{!144}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !142, file: !83, line: 286, type: !7)
!145 = !DISubprogram(name: "tolower", scope: !83, file: !83, line: 292, type: !78, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tolower, variables: !146)
!146 = !{!147}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !145, file: !83, line: 292, type: !7)
!148 = !DISubprogram(name: "toupper", scope: !83, file: !83, line: 298, type: !78, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @toupper, variables: !149)
!149 = !{!150}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !148, file: !83, line: 298, type: !7)
!151 = !DISubprogram(name: "digittoint", scope: !83, file: !83, line: 305, type: !78, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @digittoint, variables: !152)
!152 = !{!153}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !151, file: !83, line: 305, type: !7)
!154 = !DISubprogram(name: "ishexnumber", scope: !83, file: !83, line: 311, type: !78, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @ishexnumber, variables: !155)
!155 = !{!156}
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !154, file: !83, line: 311, type: !7)
!157 = !DISubprogram(name: "isideogram", scope: !83, file: !83, line: 317, type: !78, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isideogram, variables: !158)
!158 = !{!159}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !157, file: !83, line: 317, type: !7)
!160 = !DISubprogram(name: "isnumber", scope: !83, file: !83, line: 323, type: !78, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isnumber, variables: !161)
!161 = !{!162}
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !160, file: !83, line: 323, type: !7)
!163 = !DISubprogram(name: "isphonogram", scope: !83, file: !83, line: 329, type: !78, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isphonogram, variables: !164)
!164 = !{!165}
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !163, file: !83, line: 329, type: !7)
!166 = !DISubprogram(name: "isrune", scope: !83, file: !83, line: 335, type: !78, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isrune, variables: !167)
!167 = !{!168}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !166, file: !83, line: 335, type: !7)
!169 = !DISubprogram(name: "isspecial", scope: !83, file: !83, line: 341, type: !78, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isspecial, variables: !170)
!170 = !{!171}
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !169, file: !83, line: 341, type: !7)
!172 = !DISubprogram(name: "bDebugMode", scope: !1, file: !1, line: 50, type: !173, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @bDebugMode, variables: !2)
!173 = !DISubroutineType(types: !174)
!174 = !{!7}
!175 = !DISubprogram(name: "_where", scope: !1, file: !1, line: 55, type: !176, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_where, variables: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !40, !7}
!178 = !{!179, !180, !181, !182}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !175, file: !1, line: 55, type: !40)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !175, file: !1, line: 55, type: !7)
!181 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !175, file: !1, line: 60, type: !13)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !175, file: !1, line: 61, type: !40)
!183 = !DISubprogram(name: "_halt", scope: !1, file: !1, line: 136, type: !184, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i8*)* @_halt, variables: !186)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !40, !7, !40}
!186 = !{!187, !188, !189}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !183, file: !1, line: 136, type: !40)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !183, file: !1, line: 136, type: !7)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 3, scope: !183, file: !1, line: 136, type: !40)
!190 = !DISubprogram(name: "quit_gmx", scope: !1, file: !1, line: 143, type: !191, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @quit_gmx, variables: !193)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !7, !40}
!193 = !{!194, !195}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fatal_errno", arg: 1, scope: !190, file: !1, line: 143, type: !7)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 2, scope: !190, file: !1, line: 143, type: !40)
!196 = !DISubprogram(name: "_set_fatal_tmp_file", scope: !1, file: !1, line: 181, type: !197, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, i32)* @_set_fatal_tmp_file, variables: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !40, !40, !7}
!199 = !{!200, !201, !202}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !196, file: !1, line: 181, type: !40)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 2, scope: !196, file: !1, line: 181, type: !40)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 3, scope: !196, file: !1, line: 181, type: !7)
!203 = !DISubprogram(name: "_unset_fatal_tmp_file", scope: !1, file: !1, line: 190, type: !197, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, i32)* @_unset_fatal_tmp_file, variables: !204)
!204 = !{!205, !206, !207}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !203, file: !1, line: 190, type: !40)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 2, scope: !203, file: !1, line: 190, type: !40)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 3, scope: !203, file: !1, line: 190, type: !7)
!208 = !DISubprogram(name: "fatal_error", scope: !1, file: !1, line: 200, type: !209, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*, ...)* @fatal_error, variables: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !7, !40, null}
!211 = !{!212, !213, !214, !226, !227, !228, !229, !233, !237, !238, !239, !240, !241, !242}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fatal_errno", arg: 1, scope: !208, file: !1, line: 200, type: !7)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !208, file: !1, line: 200, type: !40)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !208, file: !1, line: 202, type: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !216, line: 30, baseType: !217)
!216 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/../lib/clang/7.0.0/include/stdarg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 202, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 192, align: 64, elements: !68)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 202, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 202, size: 192, align: 64, elements: !221)
!221 = !{!222, !223, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !220, file: !1, line: 202, baseType: !5, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !220, file: !1, line: 202, baseType: !5, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !220, file: !1, line: 202, baseType: !6, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !220, file: !1, line: 202, baseType: !6, size: 64, align: 64, offset: 128)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !208, file: !1, line: 203, type: !40)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cval", scope: !208, file: !1, line: 203, type: !4)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sval", scope: !208, file: !1, line: 203, type: !40)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !208, file: !1, line: 203, type: !230)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, align: 8, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 4096)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuf", scope: !208, file: !1, line: 204, type: !234)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, align: 8, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 64)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ifmt", scope: !208, file: !1, line: 204, type: !234)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !208, file: !1, line: 205, type: !7)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !208, file: !1, line: 205, type: !7)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fld", scope: !208, file: !1, line: 205, type: !7)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !208, file: !1, line: 205, type: !7)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dval", scope: !208, file: !1, line: 206, type: !243)
!243 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!244 = !DISubprogram(name: "init_warning", scope: !1, file: !1, line: 280, type: !245, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @init_warning, variables: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !7}
!247 = !{!248}
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxwarning", arg: 1, scope: !244, file: !1, line: 280, type: !7)
!249 = !DISubprogram(name: "set_warning_line", scope: !1, file: !1, line: 286, type: !176, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @set_warning_line, variables: !250)
!250 = !{!251, !252}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !249, file: !1, line: 286, type: !40)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 2, scope: !249, file: !1, line: 286, type: !7)
!253 = !DISubprogram(name: "get_warning_line", scope: !1, file: !1, line: 292, type: !173, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @get_warning_line, variables: !2)
!254 = !DISubprogram(name: "get_warning_file", scope: !1, file: !1, line: 297, type: !255, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @get_warning_file, variables: !2)
!255 = !DISubroutineType(types: !256)
!256 = !{!40}
!257 = !DISubprogram(name: "warning", scope: !1, file: !1, line: 302, type: !258, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @warning, variables: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !40}
!260 = !{!261, !262, !266, !267, !268}
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !257, file: !1, line: 302, type: !40)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "linenobuf", scope: !257, file: !1, line: 305, type: !263)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 8, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 32)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !257, file: !1, line: 305, type: !40)
