; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/fftgrid.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_fftgrid = type { float*, float*, float*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_complex = type { float, float }

@.str = private unnamed_addr constant [5 x i8] c"grid\00", align 1
@.str1 = private unnamed_addr constant [67 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/fftgrid.c\00", align 1
@.str2 = private unnamed_addr constant [10 x i8] c"grid->ptr\00", align 1
@.str3 = private unnamed_addr constant [16 x i8] c"grid->workspace\00", align 1
@.str4 = private unnamed_addr constant [57 x i8] c"gmxfft3D called, but GROMACS was compiled without FFTW!\0A\00", align 1
@.str5 = private unnamed_addr constant [5 x i8] c"ptr1\00", align 1
@.str6 = private unnamed_addr constant [5 x i8] c"ptr2\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !426, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/fftgrid.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !75, !81, !88, !94, !100, !103, !106, !109, !112, !115, !118, !127, !136, !149, !152, !155, !158, !172, !186, !192, !198, !231, !236, !254, !260, !274, !291, !299, !314, !333, !344, !364, !378, !386, !401, !419}
!7 = !DISubprogram(name: "__sputc", scope: !8, file: !8, line: 348, type: !9, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!9 = !DISubroutineType(types: !10)
!10 = !{!5, !5, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !8, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !8, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !8, line: 124, baseType: !5, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !8, line: 125, baseType: !5, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !8, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !8, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !8, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !8, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !8, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !8, line: 90, baseType: !5, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !8, line: 129, baseType: !5, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !8, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !8, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!5, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !8, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !30, !39, !5}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !8, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !5}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !8, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !8, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !30, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !8, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !8, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !8, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !8, line: 141, baseType: !5, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !8, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !8, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !8, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !8, line: 151, baseType: !5, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !8, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !7, file: !8, line: 348, type: !5)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !7, file: !8, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!5, !5}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !5)
!81 = !DISubprogram(name: "__inline_isfinitef", scope: !82, file: !82, line: 204, type: !83, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !86)
!82 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DISubroutineType(types: !84)
!84 = !{!5, !85}
!85 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !81, file: !82, line: 204, type: !85)
!88 = !DISubprogram(name: "__inline_isfinited", scope: !82, file: !82, line: 207, type: !89, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !92)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !91}
!91 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !88, file: !82, line: 207, type: !91)
!94 = !DISubprogram(name: "__inline_isfinitel", scope: !82, file: !82, line: 210, type: !95, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{!5, !97}
!97 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !94, file: !82, line: 210, type: !97)
!100 = !DISubprogram(name: "__inline_isinff", scope: !82, file: !82, line: 213, type: !83, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !101)
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !100, file: !82, line: 213, type: !85)
!103 = !DISubprogram(name: "__inline_isinfd", scope: !82, file: !82, line: 216, type: !89, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !104)
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !103, file: !82, line: 216, type: !91)
!106 = !DISubprogram(name: "__inline_isinfl", scope: !82, file: !82, line: 219, type: !95, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !106, file: !82, line: 219, type: !97)
!109 = !DISubprogram(name: "__inline_isnanf", scope: !82, file: !82, line: 222, type: !83, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !109, file: !82, line: 222, type: !85)
!112 = !DISubprogram(name: "__inline_isnand", scope: !82, file: !82, line: 225, type: !89, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !82, line: 225, type: !91)
!115 = !DISubprogram(name: "__inline_isnanl", scope: !82, file: !82, line: 228, type: !95, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !116)
!116 = !{!117}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !82, line: 228, type: !97)
!118 = !DISubprogram(name: "__inline_signbitf", scope: !82, file: !82, line: 231, type: !83, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !119)
!119 = !{!120, !121}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !118, file: !82, line: 231, type: !85)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !118, file: !82, line: 232, type: !122)
!122 = !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !82, line: 232, size: 32, align: 32, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !122, file: !82, line: 232, baseType: !85, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !122, file: !82, line: 232, baseType: !126, size: 32, align: 32)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DISubprogram(name: "__inline_signbitd", scope: !82, file: !82, line: 236, type: !89, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !128)
!128 = !{!129, !130}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !127, file: !82, line: 236, type: !91)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !127, file: !82, line: 237, type: !131)
!131 = !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !82, line: 237, size: 64, align: 64, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !131, file: !82, line: 237, baseType: !91, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !131, file: !82, line: 237, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DISubprogram(name: "__inline_signbitl", scope: !82, file: !82, line: 242, type: !95, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !137)
!137 = !{!138, !139}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !136, file: !82, line: 242, type: !97)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !136, file: !82, line: 246, type: !140)
!140 = !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !82, line: 243, size: 128, align: 128, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !140, file: !82, line: 244, baseType: !97, size: 128, align: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !140, file: !82, line: 245, baseType: !144, size: 128, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !82, line: 245, size: 128, align: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !144, file: !82, line: 245, baseType: !135, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !144, file: !82, line: 245, baseType: !148, size: 16, align: 16, offset: 64)
!148 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!149 = !DISubprogram(name: "__inline_isnormalf", scope: !82, file: !82, line: 257, type: !83, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !150)
!150 = !{!151}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !149, file: !82, line: 257, type: !85)
!152 = !DISubprogram(name: "__inline_isnormald", scope: !82, file: !82, line: 260, type: !89, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !153)
!153 = !{!154}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !152, file: !82, line: 260, type: !91)
!155 = !DISubprogram(name: "__inline_isnormall", scope: !82, file: !82, line: 263, type: !95, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !156)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !155, file: !82, line: 263, type: !97)
!158 = !DISubprogram(name: "__sincosf", scope: !82, file: !82, line: 642, type: !159, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !162)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !85, !161, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !82, line: 642, type: !85)
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !158, file: !82, line: 642, type: !161)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !158, file: !82, line: 642, type: !161)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !158, file: !82, line: 643, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !82, line: 634, size: 64, align: 32, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !168, file: !82, line: 634, baseType: !85, size: 32, align: 32, offset: 32)
!172 = !DISubprogram(name: "__sincos", scope: !82, file: !82, line: 647, type: !173, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !91, !175, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !172, file: !82, line: 647, type: !91)
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !172, file: !82, line: 647, type: !175)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !172, file: !82, line: 647, type: !175)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !172, file: !82, line: 648, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !82, line: 635, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !182, file: !82, line: 635, baseType: !91, size: 64, align: 64, offset: 64)
!186 = !DISubprogram(name: "__sincospif", scope: !82, file: !82, line: 652, type: !159, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !82, line: 652, type: !85)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !186, file: !82, line: 652, type: !161)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !186, file: !82, line: 652, type: !161)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !186, file: !82, line: 653, type: !167)
!192 = !DISubprogram(name: "__sincospi", scope: !82, file: !82, line: 657, type: !173, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !193)
!193 = !{!194, !195, !196, !197}
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !192, file: !82, line: 657, type: !91)
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !192, file: !82, line: 657, type: !175)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !192, file: !82, line: 657, type: !175)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !192, file: !82, line: 658, type: !181)
!198 = !DISubprogram(name: "mk_fftgrid", scope: !1, file: !1, line: 56, type: !199, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_fftgrid* (%struct.__sFILE*, i32, i32, i32, i32, i32)* @mk_fftgrid, variables: !222)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !11, !5, !5, !5, !5, !5}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fftgrid", file: !203, line: 86, baseType: !204)
!203 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/fftgrid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 71, size: 512, align: 64, elements: !205)
!205 = !{!206, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !204, file: !203, line: 72, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fft_r", file: !203, line: 58, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !210, line: 87, baseType: !85)
!210 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "localptr", scope: !204, file: !203, line: 73, baseType: !207, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "workspace", scope: !204, file: !203, line: 74, baseType: !207, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "la2r", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "la2c", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "la12r", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 352)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "la12c", scope: !204, file: !203, line: 75, baseType: !5, size: 32, align: 32, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nptr", scope: !204, file: !203, line: 76, baseType: !5, size: 32, align: 32, offset: 416)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nxyz", scope: !204, file: !203, line: 76, baseType: !5, size: 32, align: 32, offset: 448)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230}
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !198, file: !1, line: 56, type: !11)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bParallel", arg: 2, scope: !198, file: !1, line: 56, type: !5)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 3, scope: !198, file: !1, line: 56, type: !5)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 4, scope: !198, file: !1, line: 56, type: !5)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 5, scope: !198, file: !1, line: 56, type: !5)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOptFFT", arg: 6, scope: !198, file: !1, line: 57, type: !5)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !198, file: !1, line: 60, type: !5)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grid", scope: !198, file: !1, line: 61, type: !201)
!231 = !DISubprogram(name: "done_fftgrid", scope: !1, file: !1, line: 149, type: !232, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_fftgrid*)* @done_fftgrid, variables: !234)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !201}
!234 = !{!235}
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !231, file: !1, line: 149, type: !201)
!236 = !DISubprogram(name: "gmxfft3D", scope: !1, file: !1, line: 164, type: !237, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_fftgrid*, i32, %struct.t_commrec*)* @gmxfft3D, variables: !250)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !201, !5, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !241, line: 40, baseType: !242)
!241 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 36, size: 192, align: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !242, file: !241, line: 37, baseType: !5, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !242, file: !241, line: 37, baseType: !5, size: 32, align: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !242, file: !241, line: 38, baseType: !5, size: 32, align: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !242, file: !241, line: 38, baseType: !5, size: 32, align: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !242, file: !241, line: 39, baseType: !5, size: 32, align: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !242, file: !241, line: 39, baseType: !5, size: 32, align: 32, offset: 160)
!250 = !{!251, !252, !253}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !236, file: !1, line: 164, type: !201)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 2, scope: !236, file: !1, line: 164, type: !5)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !236, file: !1, line: 164, type: !239)
!254 = !DISubprogram(name: "clear_fftgrid", scope: !1, file: !1, line: 206, type: !232, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_fftgrid*)* @clear_fftgrid, variables: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !254, file: !1, line: 206, type: !201)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !254, file: !1, line: 209, type: !5)
!258 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngrid", scope: !254, file: !1, line: 209, type: !5)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !254, file: !1, line: 210, type: !207)
!260 = !DISubprogram(name: "unpack_fftgrid", scope: !1, file: !1, line: 220, type: !261, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_fftgrid*, i32*, i32*, i32*, i32*, i32*, i32, float**)* @unpack_fftgrid, variables: !265)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !201, !263, !263, !263, !263, !263, !5, !264}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273}
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !260, file: !1, line: 220, type: !201)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !260, file: !1, line: 220, type: !263)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !260, file: !1, line: 220, type: !263)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !260, file: !1, line: 220, type: !263)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "la2", arg: 5, scope: !260, file: !1, line: 221, type: !263)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "la12", arg: 6, scope: !260, file: !1, line: 221, type: !263)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bReal", arg: 7, scope: !260, file: !1, line: 221, type: !5)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 8, scope: !260, file: !1, line: 221, type: !264)
!274 = !DISubprogram(name: "mk_rgrid", scope: !1, file: !1, line: 245, type: !275, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: float*** (i32, i32, i32)* @mk_rgrid, variables: !280)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !5, !5, !5}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !274, file: !1, line: 245, type: !5)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !274, file: !1, line: 245, type: !5)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !274, file: !1, line: 245, type: !5)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr1", scope: !274, file: !1, line: 247, type: !279)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr2", scope: !274, file: !1, line: 248, type: !278)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr3", scope: !274, file: !1, line: 249, type: !277)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !274, file: !1, line: 250, type: !5)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !274, file: !1, line: 250, type: !5)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !274, file: !1, line: 250, type: !5)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n3", scope: !274, file: !1, line: 250, type: !5)
!291 = !DISubprogram(name: "free_rgrid", scope: !1, file: !1, line: 267, type: !292, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: void (float***, i32, i32)* @free_rgrid, variables: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !277, !5, !5}
!294 = !{!295, !296, !297, !298}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !291, file: !1, line: 267, type: !277)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !291, file: !1, line: 267, type: !5)
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !291, file: !1, line: 267, type: !5)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !291, file: !1, line: 269, type: !5)
!299 = !DISubprogram(name: "print_rgrid", scope: !1, file: !1, line: 278, type: !300, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, function: float (%struct.__sFILE*, i8*, i32, i32, i32, float***)* @print_rgrid, variables: !302)
!300 = !DISubroutineType(types: !301)
!301 = !{!209, !11, !39, !5, !5, !5, !277}
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !299, file: !1, line: 278, type: !11)
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !299, file: !1, line: 278, type: !39)
!305 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 3, scope: !299, file: !1, line: 278, type: !5)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 4, scope: !299, file: !1, line: 278, type: !5)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 5, scope: !299, file: !1, line: 278, type: !5)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 6, scope: !299, file: !1, line: 278, type: !277)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !299, file: !1, line: 280, type: !5)
!310 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !299, file: !1, line: 280, type: !5)
!311 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !299, file: !1, line: 280, type: !5)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !299, file: !1, line: 281, type: !209)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gtot", scope: !299, file: !1, line: 281, type: !209)
!314 = !DISubprogram(name: "print_rgrid_pdb", scope: !1, file: !1, line: 297, type: !315, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32, i32, float***)* @print_rgrid_pdb, variables: !317)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !39, !5, !5, !5, !277}
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !314, file: !1, line: 297, type: !39)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !314, file: !1, line: 297, type: !5)
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !314, file: !1, line: 297, type: !5)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !314, file: !1, line: 297, type: !5)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 5, scope: !314, file: !1, line: 297, type: !277)
!323 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !314, file: !1, line: 299, type: !11)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !314, file: !1, line: 300, type: !5)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !314, file: !1, line: 300, type: !5)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !314, file: !1, line: 300, type: !5)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !314, file: !1, line: 300, type: !5)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ig", scope: !314, file: !1, line: 300, type: !5)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !314, file: !1, line: 301, type: !209)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !314, file: !1, line: 301, type: !209)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !314, file: !1, line: 301, type: !209)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !314, file: !1, line: 301, type: !209)
!333 = !DISubprogram(name: "clear_rgrid", scope: !1, file: !1, line: 323, type: !334, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, float***)* @clear_rgrid, variables: !336)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !5, !5, !5, !277}
!336 = !{!337, !338, !339, !340, !341, !342, !343}
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !333, file: !1, line: 323, type: !5)
!338 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !333, file: !1, line: 323, type: !5)
!339 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !333, file: !1, line: 323, type: !5)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 4, scope: !333, file: !1, line: 323, type: !277)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !333, file: !1, line: 325, type: !5)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !333, file: !1, line: 325, type: !5)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !333, file: !1, line: 325, type: !5)
!344 = !DISubprogram(name: "clear_cgrid", scope: !1, file: !1, line: 333, type: !345, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, %struct.t_complex***)* @clear_cgrid, variables: !356)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !5, !5, !5, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_complex", file: !351, line: 46, baseType: !352)
!351 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmxcomplex.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 44, size: 64, align: 32, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !352, file: !351, line: 45, baseType: !209, size: 32, align: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !352, file: !351, line: 45, baseType: !209, size: 32, align: 32, offset: 32)
!356 = !{!357, !358, !359, !360, !361, !362, !363}
!357 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !344, file: !1, line: 333, type: !5)
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !344, file: !1, line: 333, type: !5)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !344, file: !1, line: 333, type: !5)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 4, scope: !344, file: !1, line: 333, type: !347)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !344, file: !1, line: 335, type: !5)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !344, file: !1, line: 335, type: !5)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !344, file: !1, line: 335, type: !5)
!364 = !DISubprogram(name: "mk_cgrid", scope: !1, file: !1, line: 343, type: !365, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_complex*** (i32, i32, i32)* @mk_cgrid, variables: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{!347, !5, !5, !5}
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !364, file: !1, line: 343, type: !5)
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !364, file: !1, line: 343, type: !5)
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !364, file: !1, line: 343, type: !5)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr1", scope: !364, file: !1, line: 345, type: !349)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr2", scope: !364, file: !1, line: 346, type: !348)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr3", scope: !364, file: !1, line: 347, type: !347)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !364, file: !1, line: 348, type: !5)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !364, file: !1, line: 348, type: !5)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !364, file: !1, line: 348, type: !5)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n3", scope: !364, file: !1, line: 348, type: !5)
!378 = !DISubprogram(name: "free_cgrid", scope: !1, file: !1, line: 365, type: !379, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_complex***, i32, i32)* @free_cgrid, variables: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !347, !5, !5}
!381 = !{!382, !383, !384, !385}
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 1, scope: !378, file: !1, line: 365, type: !347)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !378, file: !1, line: 365, type: !5)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !378, file: !1, line: 365, type: !5)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !378, file: !1, line: 367, type: !5)
!386 = !DISubprogram(name: "print_cgrid", scope: !1, file: !1, line: 375, type: !387, isLocal: false, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: true, function: <2 x float> (%struct.__sFILE*, i8*, i32, i32, i32, %struct.t_complex***)* @print_cgrid, variables: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!350, !11, !39, !5, !5, !5, !347}
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !386, file: !1, line: 375, type: !11)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !386, file: !1, line: 375, type: !39)
