; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/filenm.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_deffile = type { i32, i8*, i8*, i8*, i8*, i32, i32* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_filenm = type { i32, i8*, i8*, i64 }

@.str = private unnamed_addr constant [4 x i8] c".gz\00", align 1
@.str1 = private unnamed_addr constant [3 x i8] c".Z\00", align 1
@z_ext = global [2 x i8*] [i8* getelementptr inbounds ([4 x i8]* @.str, i32 0, i32 0), i8* getelementptr inbounds ([3 x i8]* @.str1, i32 0, i32 0)], align 16
@default_file_name = internal unnamed_addr global i8* null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !53, subprograms: !57, globals: !346, imports: !377)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/filenm.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!6 = !DIEnumerator(name: "efMDP", value: 0)
!7 = !DIEnumerator(name: "efGCT", value: 1)
!8 = !DIEnumerator(name: "efTRX", value: 2)
!9 = !DIEnumerator(name: "efTRN", value: 3)
!10 = !DIEnumerator(name: "efTRR", value: 4)
!11 = !DIEnumerator(name: "efTRJ", value: 5)
!12 = !DIEnumerator(name: "efXTC", value: 6)
!13 = !DIEnumerator(name: "efG87", value: 7)
!14 = !DIEnumerator(name: "efENX", value: 8)
!15 = !DIEnumerator(name: "efEDR", value: 9)
!16 = !DIEnumerator(name: "efENE", value: 10)
!17 = !DIEnumerator(name: "efSTX", value: 11)
!18 = !DIEnumerator(name: "efSTO", value: 12)
!19 = !DIEnumerator(name: "efGRO", value: 13)
!20 = !DIEnumerator(name: "efG96", value: 14)
!21 = !DIEnumerator(name: "efPDB", value: 15)
!22 = !DIEnumerator(name: "efBRK", value: 16)
!23 = !DIEnumerator(name: "efENT", value: 17)
!24 = !DIEnumerator(name: "efLOG", value: 18)
!25 = !DIEnumerator(name: "efXVG", value: 19)
!26 = !DIEnumerator(name: "efOUT", value: 20)
!27 = !DIEnumerator(name: "efNDX", value: 21)
!28 = !DIEnumerator(name: "efTOP", value: 22)
!29 = !DIEnumerator(name: "efITP", value: 23)
!30 = !DIEnumerator(name: "efTPX", value: 24)
!31 = !DIEnumerator(name: "efTPS", value: 25)
!32 = !DIEnumerator(name: "efTPR", value: 26)
!33 = !DIEnumerator(name: "efTPA", value: 27)
!34 = !DIEnumerator(name: "efTPB", value: 28)
!35 = !DIEnumerator(name: "efTEX", value: 29)
!36 = !DIEnumerator(name: "efRTP", value: 30)
!37 = !DIEnumerator(name: "efATP", value: 31)
!38 = !DIEnumerator(name: "efHDB", value: 32)
!39 = !DIEnumerator(name: "efDAT", value: 33)
!40 = !DIEnumerator(name: "efDLG", value: 34)
!41 = !DIEnumerator(name: "efMAP", value: 35)
!42 = !DIEnumerator(name: "efEPS", value: 36)
!43 = !DIEnumerator(name: "efMAT", value: 37)
!44 = !DIEnumerator(name: "efM2P", value: 38)
!45 = !DIEnumerator(name: "efMTX", value: 39)
!46 = !DIEnumerator(name: "efEDI", value: 40)
!47 = !DIEnumerator(name: "efEDO", value: 41)
!48 = !DIEnumerator(name: "efPPA", value: 42)
!49 = !DIEnumerator(name: "efPDO", value: 43)
!50 = !DIEnumerator(name: "efHAT", value: 44)
!51 = !DIEnumerator(name: "efXPM", value: 45)
!52 = !DIEnumerator(name: "efNR", value: 46)
!53 = !{!54, !55, !56}
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !{!58, !125, !131, !137, !142, !145, !148, !151, !174, !197, !207, !216, !229, !237, !245, !253, !261, !267, !273, !277, !282, !285, !288, !296, !307, !319, !328, !333}
!58 = !DISubprogram(name: "__sputc", scope: !59, file: !59, line: 348, type: !60, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !122)
!59 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DISubroutineType(types: !61)
!61 = !{!56, !56, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 153, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !59, line: 122, size: 1216, align: 64, elements: !65)
!65 = !{!66, !69, !70, !71, !73, !74, !79, !80, !81, !85, !90, !100, !106, !107, !110, !111, !115, !119, !120, !121}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !64, file: !59, line: 123, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !64, file: !59, line: 124, baseType: !56, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !64, file: !59, line: 125, baseType: !56, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !59, line: 126, baseType: !72, size: 16, align: 16, offset: 128)
!72 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !64, file: !59, line: 127, baseType: !72, size: 16, align: 16, offset: 144)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !64, file: !59, line: 128, baseType: !75, size: 128, align: 64, offset: 192)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !59, line: 88, size: 128, align: 64, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !75, file: !59, line: 89, baseType: !67, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !75, file: !59, line: 90, baseType: !56, size: 32, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !64, file: !59, line: 129, baseType: !56, size: 32, align: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !64, file: !59, line: 132, baseType: !55, size: 64, align: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !64, file: !59, line: 133, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!56, !55}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !64, file: !59, line: 134, baseType: !86, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!56, !55, !89, !56}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !64, file: !59, line: 135, baseType: !91, size: 64, align: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !55, !94, !56}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !59, line: 77, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !96, line: 71, baseType: !97)
!96 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !98, line: 46, baseType: !99)
!98 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !64, file: !59, line: 136, baseType: !101, size: 64, align: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!56, !55, !104, !56}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !64, file: !59, line: 139, baseType: !75, size: 128, align: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !64, file: !59, line: 140, baseType: !108, size: 64, align: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !59, line: 94, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !64, file: !59, line: 141, baseType: !56, size: 32, align: 32, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !64, file: !59, line: 144, baseType: !112, size: 24, align: 8, offset: 928)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 24, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 3)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !64, file: !59, line: 145, baseType: !116, size: 8, align: 8, offset: 952)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !64, file: !59, line: 148, baseType: !75, size: 128, align: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !64, file: !59, line: 151, baseType: !56, size: 32, align: 32, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !59, line: 152, baseType: !94, size: 64, align: 64, offset: 1152)
!122 = !{!123, !124}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !58, file: !59, line: 348, type: !56)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !58, file: !59, line: 348, type: !62)
!125 = !DISubprogram(name: "__sigbits", scope: !126, file: !126, line: 114, type: !127, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !129)
!126 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !DISubroutineType(types: !128)
!128 = !{!56, !56}
!129 = !{!130}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !125, file: !126, line: 114, type: !56)
!131 = !DISubprogram(name: "set_default_file_name", scope: !1, file: !1, line: 170, type: !132, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @set_default_file_name, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !89}
!134 = !{!135, !136}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !131, file: !1, line: 170, type: !89)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !131, file: !1, line: 172, type: !56)
!137 = !DISubprogram(name: "ftp2ext", scope: !1, file: !1, line: 180, type: !138, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @ftp2ext, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{!89, !56}
!140 = !{!141}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 1, scope: !137, file: !1, line: 180, type: !56)
!142 = !DISubprogram(name: "ftp2desc", scope: !1, file: !1, line: 188, type: !138, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @ftp2desc, variables: !143)
!143 = !{!144}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 1, scope: !142, file: !1, line: 188, type: !56)
!145 = !DISubprogram(name: "ftp2ftype", scope: !1, file: !1, line: 196, type: !138, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @ftp2ftype, variables: !146)
!146 = !{!147}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 1, scope: !145, file: !1, line: 196, type: !56)
!148 = !DISubprogram(name: "ftp2defnm", scope: !1, file: !1, line: 213, type: !138, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @ftp2defnm, variables: !149)
!149 = !{!150}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 1, scope: !148, file: !1, line: 213, type: !56)
!151 = !DISubprogram(name: "pr_def", scope: !1, file: !1, line: 224, type: !152, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32)* @pr_def, variables: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !62, !56}
!154 = !{!155, !156, !157, !170, !171, !172, !173}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !151, file: !1, line: 224, type: !62)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 2, scope: !151, file: !1, line: 224, type: !56)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "df", scope: !151, file: !1, line: 226, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_deffile", file: !1, line: 113, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 105, size: 448, align: 64, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !160, file: !1, line: 106, baseType: !56, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !160, file: !1, line: 107, baseType: !89, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "defnm", scope: !160, file: !1, line: 108, baseType: !89, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "defopt", scope: !160, file: !1, line: 109, baseType: !89, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "descr", scope: !160, file: !1, line: 110, baseType: !89, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ntps", scope: !160, file: !1, line: 111, baseType: !56, size: 32, align: 32, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tps", scope: !160, file: !1, line: 112, baseType: !169, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !151, file: !1, line: 227, type: !89)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ext", scope: !151, file: !1, line: 227, type: !89)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "desc", scope: !151, file: !1, line: 227, type: !89)
!173 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flst", scope: !151, file: !1, line: 227, type: !89)
!174 = !DISubprogram(name: "pr_fns", scope: !1, file: !1, line: 270, type: !175, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_filenm*)* @pr_fns, variables: !186)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !62, !56, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !4, line: 62, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 57, size: 256, align: 64, elements: !180)
!180 = !{!181, !182, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !179, file: !4, line: 58, baseType: !56, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !179, file: !4, line: 59, baseType: !89, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !179, file: !4, line: 60, baseType: !89, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !4, line: 61, baseType: !185, size: 64, align: 64, offset: 192)
!185 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!186 = !{!187, !188, !189, !190, !191, !192, !196}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !174, file: !1, line: 270, type: !62)
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nf", arg: 2, scope: !174, file: !1, line: 270, type: !56)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tfn", arg: 3, scope: !174, file: !1, line: 270, type: !177)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !174, file: !1, line: 272, type: !56)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !174, file: !1, line: 272, type: !56)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !174, file: !1, line: 273, type: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, align: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 256)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wbuf", scope: !174, file: !1, line: 273, type: !89)
!197 = !DISubprogram(name: "pr_fopts", scope: !1, file: !1, line: 296, type: !198, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_filenm*, i32)* @pr_fopts, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !62, !56, !177, !56}
!200 = !{!201, !202, !203, !204, !205, !206}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !197, file: !1, line: 296, type: !62)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nf", arg: 2, scope: !197, file: !1, line: 296, type: !56)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tfn", arg: 3, scope: !197, file: !1, line: 296, type: !177)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shell", arg: 4, scope: !197, file: !1, line: 296, type: !56)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !197, file: !1, line: 298, type: !56)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !197, file: !1, line: 298, type: !56)
!207 = !DISubprogram(name: "fn2ftp", scope: !1, file: !1, line: 381, type: !208, isLocal: false, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @fn2ftp, variables: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!56, !89}
!210 = !{!211, !212, !213, !214, !215}
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !207, file: !1, line: 381, type: !89)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !207, file: !1, line: 383, type: !56)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !207, file: !1, line: 383, type: !56)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "feptr", scope: !207, file: !1, line: 384, type: !89)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eptr", scope: !207, file: !1, line: 384, type: !89)
!216 = !DISubprogram(name: "parse_file_args", scope: !1, file: !1, line: 508, type: !217, isLocal: false, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i8**, i32, %struct.t_filenm*, i32)* @parse_file_args, variables: !220)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !169, !219, !56, !177, !56}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228}
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !216, file: !1, line: 508, type: !169)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !216, file: !1, line: 508, type: !219)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nf", arg: 3, scope: !216, file: !1, line: 508, type: !56)
