; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/futil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_pstack = type { %struct.__sFILE*, %struct.t_pstack* }

@bUnbuffered = internal unnamed_addr global i1 false
@.str = private unnamed_addr constant [3 x i8] c"ps\00", align 1
@.str1 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/futil.c\00", align 1
@__stderrp = external global %struct.__sFILE*
@.str4 = private unnamed_addr constant [19 x i8] c"uncompress -c < %s\00", align 1
@.str5 = private unnamed_addr constant [23 x i8] c"Going to execute '%s'\0A\00", align 1
@.str6 = private unnamed_addr constant [18 x i8] c"Could not open %s\00", align 1
@.str7 = private unnamed_addr constant [15 x i8] c"gunzip -c < %s\00", align 1
@.str8 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@backup_fn.buf = internal global [256 x i8] zeroinitializer, align 16
@.str9 = private unnamed_addr constant [2 x i8] c".\00", align 1
@.str10 = private unnamed_addr constant [11 x i8] c"%s/#%s.%d#\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !220, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/futil.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !13, !16, !91, !96, !100, !106, !117, !123, !129, !137, !146, !157, !165, !181, !196, !204, !207, !212}
!6 = !DISubprogram(name: "__sigbits", scope: !7, file: !7, line: 114, type: !8, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !11)
!7 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !{!12}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !6, file: !7, line: 114, type: !10)
!13 = !DISubprogram(name: "no_buffers", scope: !1, file: !1, line: 75, type: !14, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @no_buffers, variables: !2)
!14 = !DISubroutineType(types: !15)
!15 = !{null}
!16 = !DISubprogram(name: "push_ps", scope: !1, file: !1, line: 80, type: !17, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*)* @push_ps, variables: !81)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 153, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !21, line: 122, size: 1216, align: 64, elements: !23)
!23 = !{!24, !27, !28, !29, !31, !32, !37, !38, !39, !43, !49, !59, !65, !66, !69, !70, !74, !78, !79, !80}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !22, file: !21, line: 123, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !22, file: !21, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !22, file: !21, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !22, file: !21, line: 126, baseType: !30, size: 16, align: 16, offset: 128)
!30 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !22, file: !21, line: 127, baseType: !30, size: 16, align: 16, offset: 144)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !22, file: !21, line: 128, baseType: !33, size: 128, align: 64, offset: 192)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !21, line: 88, size: 128, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !33, file: !21, line: 89, baseType: !25, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !33, file: !21, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !22, file: !21, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !22, file: !21, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !22, file: !21, line: 133, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!10, !4}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !22, file: !21, line: 134, baseType: !44, size: 64, align: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!10, !4, !47, !10}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !22, file: !21, line: 135, baseType: !50, size: 64, align: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !4, !53, !10}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !21, line: 77, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !55, line: 71, baseType: !56)
!55 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !57, line: 46, baseType: !58)
!57 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !22, file: !21, line: 136, baseType: !60, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!10, !4, !63, !10}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !22, file: !21, line: 139, baseType: !33, size: 128, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !22, file: !21, line: 140, baseType: !67, size: 64, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !21, line: 94, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !22, file: !21, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !22, file: !21, line: 144, baseType: !71, size: 24, align: 8, offset: 928)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !22, file: !21, line: 145, baseType: !75, size: 8, align: 8, offset: 952)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !22, file: !21, line: 148, baseType: !33, size: 128, align: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !22, file: !21, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !22, file: !21, line: 152, baseType: !53, size: 64, align: 64, offset: 1152)
!81 = !{!82, !83}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !16, file: !1, line: 80, type: !19)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !16, file: !1, line: 82, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pstack", file: !1, line: 70, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "t_pstack", file: !1, line: 67, size: 128, align: 64, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !86, file: !1, line: 68, baseType: !19, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !1, line: 69, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!91 = !DISubprogram(name: "ffclose", scope: !1, file: !1, line: 93, type: !17, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*)* @ffclose, variables: !92)
!92 = !{!93, !94, !95}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !91, file: !1, line: 93, type: !19)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !91, file: !1, line: 95, type: !84)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !91, file: !1, line: 95, type: !84)
!96 = !DISubprogram(name: "frewind", scope: !1, file: !1, line: 127, type: !17, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*)* @frewind, variables: !97)
!97 = !{!98, !99}
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !96, file: !1, line: 127, type: !19)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !96, file: !1, line: 129, type: !84)
!100 = !DISubprogram(name: "is_pipe", scope: !1, file: !1, line: 142, type: !101, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*)* @is_pipe, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!10, !19}
!103 = !{!104, !105}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !100, file: !1, line: 142, type: !19)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !100, file: !1, line: 144, type: !84)
!106 = !DISubprogram(name: "uncompress", scope: !1, file: !1, line: 173, type: !107, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: %struct.__sFILE* (i8*, i8*)* @uncompress, variables: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{!19, !47, !47}
!109 = !{!110, !111, !112, !113}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !106, file: !1, line: 173, type: !47)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !106, file: !1, line: 173, type: !47)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !106, file: !1, line: 175, type: !19)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !106, file: !1, line: 176, type: !114)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 256)
!117 = !DISubprogram(name: "gunzip", scope: !1, file: !1, line: 187, type: !107, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: %struct.__sFILE* (i8*, i8*)* @gunzip, variables: !118)
!118 = !{!119, !120, !121, !122}
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !117, file: !1, line: 187, type: !47)
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !117, file: !1, line: 187, type: !47)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !117, file: !1, line: 189, type: !19)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !117, file: !1, line: 190, type: !114)
!123 = !DISubprogram(name: "fexist", scope: !1, file: !1, line: 201, type: !124, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @fexist, variables: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!10, !47}
!126 = !{!127, !128}
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 1, scope: !123, file: !1, line: 201, type: !47)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "test", scope: !123, file: !1, line: 203, type: !19)
