; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gbutil.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@__stderrp = external global %struct.__sFILE*
@.str = private unnamed_addr constant [26 x i8] c"Generating configuration\0A\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable
define i32 @__sputc(i32 %_c, %struct.__sFILE* %_p) #0 {
  tail call void @llvm.dbg.value(metadata i32 %_c, i64 0, metadata !73, metadata !280), !dbg !281
  tail call void @llvm.dbg.value(metadata %struct.__sFILE* %_p, i64 0, metadata !74, metadata !280), !dbg !282
  %1 = getelementptr inbounds %struct.__sFILE* %_p, i64 0, i32 2, !dbg !283

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !2, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gbutil.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !{!6, !75, !81, !90, !103, !126, !225, !240, !246, !257, !265, !273}
!6 = !DISubprogram(name: "__sputc", scope: !7, file: !7, line: 348, type: !8, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !72)
!7 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !7, line: 153, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !7, line: 122, size: 1216, align: 64, elements: !14)
!14 = !{!15, !18, !19, !20, !22, !23, !28, !29, !31, !35, !40, !50, !56, !57, !60, !61, !65, !69, !70, !71}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !13, file: !7, line: 123, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !13, file: !7, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !13, file: !7, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !13, file: !7, line: 126, baseType: !21, size: 16, align: 16, offset: 128)
!21 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !13, file: !7, line: 127, baseType: !21, size: 16, align: 16, offset: 144)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !13, file: !7, line: 128, baseType: !24, size: 128, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !7, line: 88, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !24, file: !7, line: 89, baseType: !16, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !24, file: !7, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !13, file: !7, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !13, file: !7, line: 132, baseType: !30, size: 64, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !13, file: !7, line: 133, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!10, !30}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !13, file: !7, line: 134, baseType: !36, size: 64, align: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!10, !30, !39, !10}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !13, file: !7, line: 135, baseType: !41, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !30, !44, !10}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !7, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !46, line: 71, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!49 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !13, file: !7, line: 136, baseType: !51, size: 64, align: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!10, !30, !54, !10}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !13, file: !7, line: 139, baseType: !24, size: 128, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !13, file: !7, line: 140, baseType: !58, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !7, line: 94, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !13, file: !7, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !13, file: !7, line: 144, baseType: !62, size: 24, align: 8, offset: 928)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !13, file: !7, line: 145, baseType: !66, size: 8, align: 8, offset: 952)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !13, file: !7, line: 148, baseType: !24, size: 128, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !13, file: !7, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !13, file: !7, line: 152, baseType: !44, size: 64, align: 64, offset: 1152)
!72 = !{!73, !74}
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !6, file: !7, line: 348, type: !10)
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !6, file: !7, line: 348, type: !11)
!75 = !DISubprogram(name: "__sigbits", scope: !76, file: !76, line: 114, type: !77, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !79)
!76 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!77 = !DISubroutineType(types: !78)
!78 = !{!10, !10}
!79 = !{!80}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !75, file: !76, line: 114, type: !10)
!81 = !DISubprogram(name: "distance_to_z", scope: !1, file: !1, line: 49, type: !82, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: float (float*)* @distance_to_z, variables: !88)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !87}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !85, line: 87, baseType: !86)
!85 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!86 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!88 = !{!89}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !81, file: !1, line: 49, type: !87)
!90 = !DISubprogram(name: "rotate_conf", scope: !1, file: !1, line: 78, type: !91, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, [3 x float]*, [3 x float]*, float, float, float)* @rotate_conf, variables: !96)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !10, !93, !93, !84, !84, !84}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !85, line: 101, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 96, align: 32, elements: !63)
!96 = !{!97, !98, !99, !100, !101, !102}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natom", arg: 1, scope: !90, file: !1, line: 78, type: !10)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !90, file: !1, line: 78, type: !93)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !90, file: !1, line: 78, type: !93)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alfa", arg: 4, scope: !90, file: !1, line: 78, type: !84)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "beta", arg: 5, scope: !90, file: !1, line: 78, type: !84)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gamma", arg: 6, scope: !90, file: !1, line: 78, type: !84)
!103 = !DISubprogram(name: "orient", scope: !1, file: !1, line: 87, type: !104, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, [3 x float]*, [3 x float]*, float*, [3 x float]*)* @orient, variables: !107)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !10, !93, !93, !87, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natom", arg: 1, scope: !103, file: !1, line: 87, type: !10)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !103, file: !1, line: 87, type: !93)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !103, file: !1, line: 87, type: !93)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "angle", arg: 4, scope: !103, file: !1, line: 87, type: !87)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !103, file: !1, line: 87, type: !106)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "longest", scope: !103, file: !1, line: 89, type: !84)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rij", scope: !103, file: !1, line: 89, type: !84)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rzi", scope: !103, file: !1, line: 89, type: !84)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !103, file: !1, line: 90, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !103, file: !1, line: 90, type: !10)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !103, file: !1, line: 90, type: !10)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_i", scope: !103, file: !1, line: 90, type: !10)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_j", scope: !103, file: !1, line: 90, type: !10)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !103, file: !1, line: 91, type: !94)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !103, file: !1, line: 92, type: !10)
!123 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alfa", scope: !103, file: !1, line: 93, type: !84)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "beta", scope: !103, file: !1, line: 93, type: !84)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gamma", scope: !103, file: !1, line: 93, type: !84)
!126 = !DISubprogram(name: "genconf", scope: !1, file: !1, line: 150, type: !127, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*, [3 x float]*, [3 x float]*, float*, [3 x float]*, i32*)* @genconf, variables: !203)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129, !93, !93, !87, !106, !185}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !131, line: 94, baseType: !132)
!131 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!132 = !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 75, size: 10240, align: 64, elements: !133)
!133 = !{!134, !135, !154, !157, !158, !159, !160, !161, !162, !163, !178, !186}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !132, file: !131, line: 76, baseType: !10, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !132, file: !131, line: 77, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !131, line: 57, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 48, size: 320, align: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !146, !147, !148, !149, !153}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !138, file: !131, line: 49, baseType: !84, size: 32, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !138, file: !131, line: 49, baseType: !84, size: 32, align: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !138, file: !131, line: 50, baseType: !84, size: 32, align: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !138, file: !131, line: 50, baseType: !84, size: 32, align: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !131, line: 51, baseType: !145, size: 16, align: 16, offset: 128)
!145 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !138, file: !131, line: 52, baseType: !145, size: 16, align: 16, offset: 144)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !138, file: !131, line: 53, baseType: !10, size: 32, align: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !138, file: !131, line: 54, baseType: !10, size: 32, align: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !138, file: !131, line: 55, baseType: !150, size: 72, align: 8, offset: 224)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 72, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 9)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !138, file: !131, line: 56, baseType: !17, size: 8, align: 8, offset: 296)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !132, file: !131, line: 80, baseType: !155, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !132, file: !131, line: 82, baseType: !155, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !132, file: !131, line: 84, baseType: !155, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !132, file: !131, line: 86, baseType: !10, size: 32, align: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !132, file: !131, line: 87, baseType: !155, size: 64, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !132, file: !131, line: 89, baseType: !10, size: 32, align: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !132, file: !131, line: 90, baseType: !155, size: 64, align: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !132, file: !131, line: 91, baseType: !164, size: 8448, align: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !165, line: 52, baseType: !166)
!165 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!166 = !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 36, size: 8448, align: 64, elements: !167)
!167 = !{!168, !172, !173, !176, !177}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !166, file: !165, line: 37, baseType: !169, size: 8192, align: 32)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 32, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !166, file: !165, line: 43, baseType: !10, size: 32, align: 32, offset: 8192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !166, file: !165, line: 44, baseType: !174, size: 64, align: 64, offset: 8256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !85, line: 73, baseType: !10)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !166, file: !165, line: 45, baseType: !10, size: 32, align: 32, offset: 8320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !166, file: !165, line: 46, baseType: !174, size: 64, align: 64, offset: 8384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !132, file: !131, line: 92, baseType: !179, size: 1152, align: 64, offset: 9024)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1152, align: 64, elements: !151)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !131, line: 73, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 70, size: 128, align: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !181, file: !131, line: 71, baseType: !10, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !181, file: !131, line: 72, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !132, file: !131, line: 93, baseType: !187, size: 64, align: 64, offset: 10176)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !131, line: 68, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 59, size: 416, align: 32, elements: !190)
!190 = !{!191, !192, !193, !194, !198, !199, !200, !201}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !131, line: 60, baseType: !10, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !189, file: !131, line: 61, baseType: !10, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !189, file: !131, line: 62, baseType: !4, size: 8, align: 8, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !189, file: !131, line: 63, baseType: !195, size: 48, align: 8, offset: 72)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 6)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !189, file: !131, line: 64, baseType: !84, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !189, file: !131, line: 65, baseType: !84, size: 32, align: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !189, file: !131, line: 66, baseType: !10, size: 32, align: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !189, file: !131, line: 67, baseType: !202, size: 192, align: 32, offset: 224)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 192, align: 32, elements: !196)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !224}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !126, file: !1, line: 150, type: !129)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !126, file: !1, line: 150, type: !93)
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !126, file: !1, line: 150, type: !93)
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 4, scope: !126, file: !1, line: 150, type: !87)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !126, file: !1, line: 150, type: !106)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_box", arg: 6, scope: !126, file: !1, line: 150, type: !185)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !126, file: !1, line: 152, type: !10)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !126, file: !1, line: 152, type: !10)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !126, file: !1, line: 152, type: !10)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !126, file: !1, line: 152, type: !10)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !126, file: !1, line: 152, type: !10)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !126, file: !1, line: 152, type: !10)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imol", scope: !126, file: !1, line: 152, type: !10)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !126, file: !1, line: 152, type: !10)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !126, file: !1, line: 153, type: !94)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmol", scope: !126, file: !1, line: 154, type: !10)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offs", scope: !221, file: !1, line: 181, type: !10)
!221 = distinct !DILexicalBlock(scope: !222, file: !1, line: 180, column: 26)
!222 = distinct !DILexicalBlock(scope: !223, file: !1, line: 180, column: 3)
!223 = distinct !DILexicalBlock(scope: !126, file: !1, line: 180, column: 3)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsres", scope: !221, file: !1, line: 182, type: !10)
!225 = !DISubprogram(name: "gen_box", scope: !1, file: !1, line: 198, type: !226, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, [3 x float]*, [3 x float]*, float*, i32)* @gen_box, variables: !228)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !10, !10, !93, !106, !87, !10}
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "NTB", arg: 1, scope: !225, file: !1, line: 198, type: !10)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !225, file: !1, line: 198, type: !10)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !225, file: !1, line: 198, type: !93)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !225, file: !1, line: 198, type: !106)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box_space", arg: 5, scope: !225, file: !1, line: 198, type: !87)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bCenter", arg: 6, scope: !225, file: !1, line: 199, type: !10)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !225, file: !1, line: 201, type: !10)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !225, file: !1, line: 201, type: !10)
