; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gctio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !73, subprograms: !76, globals: !770, imports: !775)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gctio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 85, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/xmdrun.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "eoPres", value: 0)
!7 = !DIEnumerator(name: "eoEpot", value: 1)
!8 = !DIEnumerator(name: "eoVir", value: 2)
!9 = !DIEnumerator(name: "eoDist", value: 3)
!10 = !DIEnumerator(name: "eoMu", value: 4)
!11 = !DIEnumerator(name: "eoForce", value: 5)
!12 = !DIEnumerator(name: "eoFx", value: 6)
!13 = !DIEnumerator(name: "eoFy", value: 7)
!14 = !DIEnumerator(name: "eoFz", value: 8)
!15 = !DIEnumerator(name: "eoPx", value: 9)
!16 = !DIEnumerator(name: "eoPy", value: 10)
!17 = !DIEnumerator(name: "eoPz", value: 11)
!18 = !DIEnumerator(name: "eoPolarizability", value: 12)
!19 = !DIEnumerator(name: "eoDipole", value: 13)
!20 = !DIEnumerator(name: "eoObsNR", value: 14)
!21 = !DIEnumerator(name: "eoMemory", value: 14)
!22 = !DIEnumerator(name: "eoInter", value: 15)
!23 = !DIEnumerator(name: "eoUseVirial", value: 16)
!24 = !DIEnumerator(name: "eoNR", value: 17)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 49, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!28 = !DIEnumerator(name: "F_BONDS", value: 0)
!29 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!30 = !DIEnumerator(name: "F_MORSE", value: 2)
!31 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!32 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!33 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!34 = !DIEnumerator(name: "F_ANGLES", value: 6)
!35 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!36 = !DIEnumerator(name: "F_PDIHS", value: 8)
!37 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!38 = !DIEnumerator(name: "F_IDIHS", value: 10)
!39 = !DIEnumerator(name: "F_LJ14", value: 11)
!40 = !DIEnumerator(name: "F_COUL14", value: 12)
!41 = !DIEnumerator(name: "F_LJ", value: 13)
!42 = !DIEnumerator(name: "F_BHAM", value: 14)
!43 = !DIEnumerator(name: "F_LJLR", value: 15)
!44 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!45 = !DIEnumerator(name: "F_SR", value: 17)
!46 = !DIEnumerator(name: "F_LR", value: 18)
!47 = !DIEnumerator(name: "F_WPOL", value: 19)
!48 = !DIEnumerator(name: "F_POSRES", value: 20)
!49 = !DIEnumerator(name: "F_DISRES", value: 21)
!50 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!51 = !DIEnumerator(name: "F_ORIRES", value: 23)
!52 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!53 = !DIEnumerator(name: "F_ANGRES", value: 25)
!54 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!55 = !DIEnumerator(name: "F_SHAKE", value: 27)
!56 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!57 = !DIEnumerator(name: "F_SETTLE", value: 29)
!58 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!59 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!60 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!61 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!62 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!63 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!64 = !DIEnumerator(name: "F_EQM", value: 36)
!65 = !DIEnumerator(name: "F_EPOT", value: 37)
!66 = !DIEnumerator(name: "F_EKIN", value: 38)
!67 = !DIEnumerator(name: "F_ETOT", value: 39)
!68 = !DIEnumerator(name: "F_TEMP", value: 40)
!69 = !DIEnumerator(name: "F_PRES", value: 41)
!70 = !DIEnumerator(name: "F_DVDL", value: 42)
!71 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!72 = !DIEnumerator(name: "F_NRE", value: 44)
!73 = !{!74, !75}
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!76 = !{!77, !145, !151, !158, !164, !170, !173, !176, !179, !182, !185, !188, !197, !206, !219, !222, !225, !228, !242, !256, !262, !268, !467, !640, !650, !674, !680, !684, !701, !708, !713, !730, !735, !749, !754}
!77 = !DISubprogram(name: "__sputc", scope: !78, file: !78, line: 348, type: !79, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !142)
!78 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DISubroutineType(types: !80)
!80 = !{!75, !75, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 153, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !78, line: 122, size: 1216, align: 64, elements: !84)
!84 = !{!85, !88, !89, !90, !92, !93, !98, !99, !101, !105, !110, !120, !126, !127, !130, !131, !135, !139, !140, !141}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !83, file: !78, line: 123, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !83, file: !78, line: 124, baseType: !75, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !83, file: !78, line: 125, baseType: !75, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !78, line: 126, baseType: !91, size: 16, align: 16, offset: 128)
!91 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !83, file: !78, line: 127, baseType: !91, size: 16, align: 16, offset: 144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !83, file: !78, line: 128, baseType: !94, size: 128, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !78, line: 88, size: 128, align: 64, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !94, file: !78, line: 89, baseType: !86, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !94, file: !78, line: 90, baseType: !75, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !83, file: !78, line: 129, baseType: !75, size: 32, align: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !83, file: !78, line: 132, baseType: !100, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !83, file: !78, line: 133, baseType: !102, size: 64, align: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!75, !100}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !83, file: !78, line: 134, baseType: !106, size: 64, align: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!75, !100, !109, !75}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !83, file: !78, line: 135, baseType: !111, size: 64, align: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !100, !114, !75}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !78, line: 77, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !116, line: 71, baseType: !117)
!116 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !118, line: 46, baseType: !119)
!118 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!119 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !83, file: !78, line: 136, baseType: !121, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!75, !100, !124, !75}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !83, file: !78, line: 139, baseType: !94, size: 128, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !83, file: !78, line: 140, baseType: !128, size: 64, align: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !78, line: 94, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !83, file: !78, line: 141, baseType: !75, size: 32, align: 32, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !83, file: !78, line: 144, baseType: !132, size: 24, align: 8, offset: 928)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 24, align: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 3)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !83, file: !78, line: 145, baseType: !136, size: 8, align: 8, offset: 952)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, align: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !83, file: !78, line: 148, baseType: !94, size: 128, align: 64, offset: 960)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !83, file: !78, line: 151, baseType: !75, size: 32, align: 32, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !78, line: 152, baseType: !114, size: 64, align: 64, offset: 1152)
!142 = !{!143, !144}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !77, file: !78, line: 348, type: !75)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !77, file: !78, line: 348, type: !81)
!145 = !DISubprogram(name: "__sigbits", scope: !146, file: !146, line: 114, type: !147, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !149)
!146 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!147 = !DISubroutineType(types: !148)
!148 = !{!75, !75}
!149 = !{!150}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !145, file: !146, line: 114, type: !75)
!151 = !DISubprogram(name: "__inline_isfinitef", scope: !152, file: !152, line: 204, type: !153, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !156)
!152 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!153 = !DISubroutineType(types: !154)
!154 = !{!75, !155}
!155 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !151, file: !152, line: 204, type: !155)
!158 = !DISubprogram(name: "__inline_isfinited", scope: !152, file: !152, line: 207, type: !159, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !162)
!159 = !DISubroutineType(types: !160)
!160 = !{!75, !161}
!161 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!162 = !{!163}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !152, line: 207, type: !161)
!164 = !DISubprogram(name: "__inline_isfinitel", scope: !152, file: !152, line: 210, type: !165, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !168)
!165 = !DISubroutineType(types: !166)
!166 = !{!75, !167}
!167 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!168 = !{!169}
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !164, file: !152, line: 210, type: !167)
!170 = !DISubprogram(name: "__inline_isinff", scope: !152, file: !152, line: 213, type: !153, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !171)
!171 = !{!172}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !170, file: !152, line: 213, type: !155)
!173 = !DISubprogram(name: "__inline_isinfd", scope: !152, file: !152, line: 216, type: !159, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !174)
!174 = !{!175}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !173, file: !152, line: 216, type: !161)
!176 = !DISubprogram(name: "__inline_isinfl", scope: !152, file: !152, line: 219, type: !165, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !177)
!177 = !{!178}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !176, file: !152, line: 219, type: !167)
!179 = !DISubprogram(name: "__inline_isnanf", scope: !152, file: !152, line: 222, type: !153, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !180)
!180 = !{!181}
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !179, file: !152, line: 222, type: !155)
!182 = !DISubprogram(name: "__inline_isnand", scope: !152, file: !152, line: 225, type: !159, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !183)
!183 = !{!184}
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !182, file: !152, line: 225, type: !161)
!185 = !DISubprogram(name: "__inline_isnanl", scope: !152, file: !152, line: 228, type: !165, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !186)
!186 = !{!187}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !185, file: !152, line: 228, type: !167)
!188 = !DISubprogram(name: "__inline_signbitf", scope: !152, file: !152, line: 231, type: !153, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !189)
!189 = !{!190, !191}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !188, file: !152, line: 231, type: !155)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !188, file: !152, line: 232, type: !192)
!192 = !DICompositeType(tag: DW_TAG_union_type, scope: !188, file: !152, line: 232, size: 32, align: 32, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !192, file: !152, line: 232, baseType: !155, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !192, file: !152, line: 232, baseType: !196, size: 32, align: 32)
!196 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!197 = !DISubprogram(name: "__inline_signbitd", scope: !152, file: !152, line: 236, type: !159, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !198)
!198 = !{!199, !200}
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !197, file: !152, line: 236, type: !161)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !197, file: !152, line: 237, type: !201)
!201 = !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !152, line: 237, size: 64, align: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !201, file: !152, line: 237, baseType: !161, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !201, file: !152, line: 237, baseType: !205, size: 64, align: 64)
!205 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!206 = !DISubprogram(name: "__inline_signbitl", scope: !152, file: !152, line: 242, type: !165, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !207)
!207 = !{!208, !209}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !206, file: !152, line: 242, type: !167)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !206, file: !152, line: 246, type: !210)
!210 = !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !152, line: 243, size: 128, align: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !210, file: !152, line: 244, baseType: !167, size: 128, align: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !210, file: !152, line: 245, baseType: !214, size: 128, align: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !152, line: 245, size: 128, align: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !214, file: !152, line: 245, baseType: !205, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !214, file: !152, line: 245, baseType: !218, size: 16, align: 16, offset: 64)
!218 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!219 = !DISubprogram(name: "__inline_isnormalf", scope: !152, file: !152, line: 257, type: !153, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !220)
!220 = !{!221}
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !219, file: !152, line: 257, type: !155)
!222 = !DISubprogram(name: "__inline_isnormald", scope: !152, file: !152, line: 260, type: !159, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !223)
!223 = !{!224}
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !222, file: !152, line: 260, type: !161)
!225 = !DISubprogram(name: "__inline_isnormall", scope: !152, file: !152, line: 263, type: !165, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !226)
!226 = !{!227}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !225, file: !152, line: 263, type: !167)
!228 = !DISubprogram(name: "__sincosf", scope: !152, file: !152, line: 642, type: !229, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !232)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !155, !231, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!232 = !{!233, !234, !235, !236}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !228, file: !152, line: 642, type: !155)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !228, file: !152, line: 642, type: !231)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !228, file: !152, line: 642, type: !231)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !228, file: !152, line: 643, type: !237)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !152, line: 634, size: 64, align: 32, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !238, file: !152, line: 634, baseType: !155, size: 32, align: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !238, file: !152, line: 634, baseType: !155, size: 32, align: 32, offset: 32)
!242 = !DISubprogram(name: "__sincos", scope: !152, file: !152, line: 647, type: !243, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !246)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !161, !245, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!246 = !{!247, !248, !249, !250}
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !242, file: !152, line: 647, type: !161)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !242, file: !152, line: 647, type: !245)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !242, file: !152, line: 647, type: !245)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !242, file: !152, line: 648, type: !251)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !152, line: 635, size: 128, align: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !252, file: !152, line: 635, baseType: !161, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !252, file: !152, line: 635, baseType: !161, size: 64, align: 64, offset: 64)
!256 = !DISubprogram(name: "__sincospif", scope: !152, file: !152, line: 652, type: !229, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !257)
!257 = !{!258, !259, !260, !261}
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !256, file: !152, line: 652, type: !155)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !256, file: !152, line: 652, type: !231)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !256, file: !152, line: 652, type: !231)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !256, file: !152, line: 653, type: !237)
!262 = !DISubprogram(name: "__sincospi", scope: !152, file: !152, line: 657, type: !243, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !262, file: !152, line: 657, type: !161)
!265 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !262, file: !152, line: 657, type: !245)
!266 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !262, file: !152, line: 657, type: !245)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !262, file: !152, line: 658, type: !251)
!268 = !DISubprogram(name: "comm_tcr", scope: !1, file: !1, line: 99, type: !269, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, %struct.t_coupl_rec**)* @comm_tcr, variables: !462)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !81, !271, !282}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !273, line: 40, baseType: !274)
!273 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!274 = !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 36, size: 192, align: 32, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !274, file: !273, line: 37, baseType: !75, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !274, file: !273, line: 37, baseType: !75, size: 32, align: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !274, file: !273, line: 38, baseType: !75, size: 32, align: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !274, file: !273, line: 38, baseType: !75, size: 32, align: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !274, file: !273, line: 39, baseType: !75, size: 32, align: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !274, file: !273, line: 39, baseType: !75, size: 32, align: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_rec", file: !4, line: 135, baseType: !285)
!285 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 122, size: 2304, align: 64, elements: !286)
!286 = !{!287, !293, !294, !295, !297, !298, !299, !300, !301, !314, !329, !339, !459, !460, !461}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "act_value", scope: !285, file: !4, line: 123, baseType: !288, size: 448, align: 32)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 448, align: 32, elements: !291)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !290, line: 87, baseType: !155)
!290 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!291 = !{!292}
!292 = !DISubrange(count: 14)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "av_value", scope: !285, file: !4, line: 124, baseType: !288, size: 448, align: 32, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ref_value", scope: !285, file: !4, line: 125, baseType: !288, size: 448, align: 32, offset: 896)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "bObsUsed", scope: !285, file: !4, line: 126, baseType: !296, size: 448, align: 32, offset: 1344)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 448, align: 32, elements: !291)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nLJ", scope: !285, file: !4, line: 127, baseType: !75, size: 32, align: 32, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nBU", scope: !285, file: !4, line: 127, baseType: !75, size: 32, align: 32, offset: 1824)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nQ", scope: !285, file: !4, line: 127, baseType: !75, size: 32, align: 32, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nIP", scope: !285, file: !4, line: 127, baseType: !75, size: 32, align: 32, offset: 1888)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tcLJ", scope: !285, file: !4, line: 128, baseType: !302, size: 64, align: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_LJ", file: !4, line: 97, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 91, size: 256, align: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "at_i", scope: !304, file: !4, line: 92, baseType: !75, size: 32, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "at_j", scope: !304, file: !4, line: 92, baseType: !75, size: 32, align: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !304, file: !4, line: 93, baseType: !75, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bPrint", scope: !304, file: !4, line: 94, baseType: !75, size: 32, align: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !304, file: !4, line: 95, baseType: !289, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !304, file: !4, line: 95, baseType: !289, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "xi_6", scope: !304, file: !4, line: 96, baseType: !289, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "xi_12", scope: !304, file: !4, line: 96, baseType: !289, size: 32, align: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tcBU", scope: !285, file: !4, line: 129, baseType: !315, size: 64, align: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_BU", file: !4, line: 105, baseType: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 99, size: 320, align: 32, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "at_i", scope: !317, file: !4, line: 100, baseType: !75, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "at_j", scope: !317, file: !4, line: 100, baseType: !75, size: 32, align: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !317, file: !4, line: 101, baseType: !75, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bPrint", scope: !317, file: !4, line: 102, baseType: !75, size: 32, align: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !317, file: !4, line: 103, baseType: !289, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !317, file: !4, line: 103, baseType: !289, size: 32, align: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !317, file: !4, line: 103, baseType: !289, size: 32, align: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "xi_a", scope: !317, file: !4, line: 104, baseType: !289, size: 32, align: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "xi_b", scope: !317, file: !4, line: 104, baseType: !289, size: 32, align: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "xi_c", scope: !317, file: !4, line: 104, baseType: !289, size: 32, align: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tcQ", scope: !285, file: !4, line: 130, baseType: !330, size: 64, align: 64, offset: 2048)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_Q", file: !4, line: 113, baseType: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 107, size: 160, align: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "at_i", scope: !332, file: !4, line: 108, baseType: !75, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !332, file: !4, line: 109, baseType: !75, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bPrint", scope: !332, file: !4, line: 110, baseType: !75, size: 32, align: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !332, file: !4, line: 111, baseType: !289, size: 32, align: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "xi_Q", scope: !332, file: !4, line: 112, baseType: !289, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tIP", scope: !285, file: !4, line: 131, baseType: !340, size: 64, align: 64, offset: 2112)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coupl_iparams", file: !4, line: 120, baseType: !342)
!342 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 115, size: 448, align: 32, elements: !343)
!343 = !{!344, !345, !346, !458}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !4, line: 116, baseType: !75, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "eObs", scope: !342, file: !4, line: 117, baseType: !75, size: 32, align: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !342, file: !4, line: 118, baseType: !347, size: 192, align: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !26, line: 131, baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 97, size: 192, align: 32, elements: !349)
!349 = !{!350, !356, !363, !369, !378, !383, !390, !398, !403, !408, !414, !420, !427, !436, !445, !454}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !348, file: !26, line: 105, baseType: !351, size: 96, align: 32)
!351 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 105, size: 96, align: 32, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !351, file: !26, line: 105, baseType: !289, size: 32, align: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !351, file: !26, line: 105, baseType: !289, size: 32, align: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !351, file: !26, line: 105, baseType: !289, size: 32, align: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !348, file: !26, line: 106, baseType: !357, size: 128, align: 32)
!357 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 106, size: 128, align: 32, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !357, file: !26, line: 106, baseType: !289, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !357, file: !26, line: 106, baseType: !289, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !357, file: !26, line: 106, baseType: !289, size: 32, align: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !357, file: !26, line: 106, baseType: !289, size: 32, align: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !348, file: !26, line: 108, baseType: !364, size: 96, align: 32)
!364 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 108, size: 96, align: 32, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !364, file: !26, line: 108, baseType: !289, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !364, file: !26, line: 108, baseType: !289, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !364, file: !26, line: 108, baseType: !289, size: 32, align: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !348, file: !26, line: 110, baseType: !370, size: 192, align: 32)
!370 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 110, size: 192, align: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !370, file: !26, line: 110, baseType: !289, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !370, file: !26, line: 110, baseType: !289, size: 32, align: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !370, file: !26, line: 110, baseType: !289, size: 32, align: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !370, file: !26, line: 110, baseType: !289, size: 32, align: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !370, file: !26, line: 110, baseType: !289, size: 32, align: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !370, file: !26, line: 110, baseType: !289, size: 32, align: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !348, file: !26, line: 111, baseType: !379, size: 64, align: 32)
!379 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 111, size: 64, align: 32, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !379, file: !26, line: 111, baseType: !289, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !379, file: !26, line: 111, baseType: !289, size: 32, align: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !348, file: !26, line: 112, baseType: !384, size: 128, align: 32)
!384 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 112, size: 128, align: 32, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !384, file: !26, line: 112, baseType: !289, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !384, file: !26, line: 112, baseType: !289, size: 32, align: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !384, file: !26, line: 112, baseType: !289, size: 32, align: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !384, file: !26, line: 112, baseType: !289, size: 32, align: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !348, file: !26, line: 117, baseType: !391, size: 160, align: 32)
!391 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 117, size: 160, align: 32, elements: !392)
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !391, file: !26, line: 117, baseType: !289, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !391, file: !26, line: 117, baseType: !289, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !391, file: !26, line: 117, baseType: !75, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !391, file: !26, line: 117, baseType: !289, size: 32, align: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !391, file: !26, line: 117, baseType: !289, size: 32, align: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !348, file: !26, line: 118, baseType: !399, size: 64, align: 32)
!399 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 118, size: 64, align: 32, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !399, file: !26, line: 118, baseType: !289, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !399, file: !26, line: 118, baseType: !289, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !348, file: !26, line: 123, baseType: !404, size: 64, align: 32)
!404 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 123, size: 64, align: 32, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !404, file: !26, line: 123, baseType: !289, size: 32, align: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !404, file: !26, line: 123, baseType: !289, size: 32, align: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !348, file: !26, line: 124, baseType: !409, size: 96, align: 32)
!409 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 124, size: 96, align: 32, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !409, file: !26, line: 124, baseType: !289, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !409, file: !26, line: 124, baseType: !289, size: 32, align: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !409, file: !26, line: 124, baseType: !289, size: 32, align: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !348, file: !26, line: 125, baseType: !415, size: 192, align: 32)
!415 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 125, size: 192, align: 32, elements: !416)
!416 = !{!417, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !415, file: !26, line: 125, baseType: !418, size: 96, align: 32)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 96, align: 32, elements: !133)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !415, file: !26, line: 125, baseType: !418, size: 96, align: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !348, file: !26, line: 126, baseType: !421, size: 192, align: 32)
!421 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 126, size: 192, align: 32, elements: !422)
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !421, file: !26, line: 126, baseType: !424, size: 192, align: 32)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 192, align: 32, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 6)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !348, file: !26, line: 127, baseType: !428, size: 192, align: 32)
!428 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 127, size: 192, align: 32, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !428, file: !26, line: 127, baseType: !289, size: 32, align: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !428, file: !26, line: 127, baseType: !289, size: 32, align: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !428, file: !26, line: 127, baseType: !289, size: 32, align: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !428, file: !26, line: 127, baseType: !289, size: 32, align: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !428, file: !26, line: 127, baseType: !289, size: 32, align: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !428, file: !26, line: 127, baseType: !289, size: 32, align: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !348, file: !26, line: 128, baseType: !437, size: 192, align: 32)
!437 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 128, size: 192, align: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !437, file: !26, line: 128, baseType: !289, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !437, file: !26, line: 128, baseType: !289, size: 32, align: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !437, file: !26, line: 128, baseType: !289, size: 32, align: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !437, file: !26, line: 128, baseType: !289, size: 32, align: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !26, line: 128, baseType: !75, size: 32, align: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !437, file: !26, line: 128, baseType: !75, size: 32, align: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !348, file: !26, line: 129, baseType: !446, size: 192, align: 32)
!446 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 129, size: 192, align: 32, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !446, file: !26, line: 129, baseType: !75, size: 32, align: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !446, file: !26, line: 129, baseType: !75, size: 32, align: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !446, file: !26, line: 129, baseType: !75, size: 32, align: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !446, file: !26, line: 129, baseType: !289, size: 32, align: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !446, file: !26, line: 129, baseType: !289, size: 32, align: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !446, file: !26, line: 129, baseType: !289, size: 32, align: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !348, file: !26, line: 130, baseType: !455, size: 192, align: 32)
!455 = !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !26, line: 130, size: 192, align: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !455, file: !26, line: 130, baseType: !424, size: 192, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "iprint", scope: !342, file: !4, line: 119, baseType: !347, size: 192, align: 32, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nmemory", scope: !285, file: !4, line: 132, baseType: !75, size: 32, align: 32, offset: 2176)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bInter", scope: !285, file: !4, line: 133, baseType: !75, size: 32, align: 32, offset: 2208)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bVirial", scope: !285, file: !4, line: 134, baseType: !75, size: 32, align: 32, offset: 2240)
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !268, file: !1, line: 99, type: !81)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !268, file: !1, line: 99, type: !271)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 3, scope: !268, file: !1, line: 99, type: !282)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shit", scope: !268, file: !1, line: 101, type: !284)
!467 = !DISubprogram(name: "copy_ff", scope: !1, file: !1, line: 149, type: !468, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_coupl_rec*, %struct.t_forcerec*, %struct.t_mdatoms*, %struct.t_idef*)* @copy_ff, variables: !627)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !283, !470, !571, !600}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !472, line: 149, baseType: !473)
!472 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/forcerec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!473 = !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 43, size: 22784, align: 64, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !523, !524, !527, !528, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !473, file: !472, line: 45, baseType: !75, size: 32, align: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !473, file: !472, line: 46, baseType: !289, size: 32, align: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !473, file: !472, line: 46, baseType: !289, size: 32, align: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !473, file: !472, line: 49, baseType: !289, size: 32, align: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !473, file: !472, line: 49, baseType: !289, size: 32, align: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !473, file: !472, line: 50, baseType: !289, size: 32, align: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !473, file: !472, line: 50, baseType: !289, size: 32, align: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !473, file: !472, line: 53, baseType: !75, size: 32, align: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !473, file: !472, line: 54, baseType: !289, size: 32, align: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !473, file: !472, line: 54, baseType: !289, size: 32, align: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !473, file: !472, line: 54, baseType: !289, size: 32, align: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !473, file: !472, line: 57, baseType: !289, size: 32, align: 32, offset: 352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !473, file: !472, line: 60, baseType: !289, size: 32, align: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !473, file: !472, line: 63, baseType: !75, size: 32, align: 32, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !473, file: !472, line: 64, baseType: !75, size: 32, align: 32, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !473, file: !472, line: 65, baseType: !289, size: 32, align: 32, offset: 480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !473, file: !472, line: 66, baseType: !75, size: 32, align: 32, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !473, file: !472, line: 67, baseType: !289, size: 32, align: 32, offset: 544)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !473, file: !472, line: 69, baseType: !494, size: 64, align: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !473, file: !472, line: 70, baseType: !494, size: 64, align: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !473, file: !472, line: 71, baseType: !494, size: 64, align: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !473, file: !472, line: 72, baseType: !494, size: 64, align: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !473, file: !472, line: 75, baseType: !289, size: 32, align: 32, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !473, file: !472, line: 75, baseType: !289, size: 32, align: 32, offset: 864)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !473, file: !472, line: 76, baseType: !494, size: 64, align: 64, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !473, file: !472, line: 79, baseType: !289, size: 32, align: 32, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !473, file: !472, line: 79, baseType: !289, size: 32, align: 32, offset: 992)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !473, file: !472, line: 80, baseType: !289, size: 32, align: 32, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !473, file: !472, line: 81, baseType: !289, size: 32, align: 32, offset: 1056)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !473, file: !472, line: 84, baseType: !75, size: 32, align: 32, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !473, file: !472, line: 85, baseType: !289, size: 32, align: 32, offset: 1120)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !473, file: !472, line: 86, baseType: !289, size: 32, align: 32, offset: 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !473, file: !472, line: 87, baseType: !75, size: 32, align: 32, offset: 1184)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !473, file: !472, line: 90, baseType: !75, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !473, file: !472, line: 91, baseType: !75, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !473, file: !472, line: 92, baseType: !75, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !473, file: !472, line: 92, baseType: !75, size: 32, align: 32, offset: 1312)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !473, file: !472, line: 93, baseType: !75, size: 32, align: 32, offset: 1344)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !473, file: !472, line: 94, baseType: !75, size: 32, align: 32, offset: 1376)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !473, file: !472, line: 95, baseType: !75, size: 32, align: 32, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !473, file: !472, line: 96, baseType: !418, size: 96, align: 32, offset: 1440)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !473, file: !472, line: 97, baseType: !75, size: 32, align: 32, offset: 1536)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !473, file: !472, line: 98, baseType: !75, size: 32, align: 32, offset: 1568)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !473, file: !472, line: 99, baseType: !75, size: 32, align: 32, offset: 1600)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !473, file: !472, line: 99, baseType: !75, size: 32, align: 32, offset: 1632)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !473, file: !472, line: 100, baseType: !522, size: 64, align: 64, offset: 1664)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !473, file: !472, line: 101, baseType: !522, size: 64, align: 64, offset: 1728)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !473, file: !472, line: 102, baseType: !525, size: 64, align: 64, offset: 1792)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !290, line: 101, baseType: !418)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !473, file: !472, line: 103, baseType: !525, size: 64, align: 64, offset: 1856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !473, file: !472, line: 108, baseType: !529, size: 9984, align: 64, offset: 1920)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 9984, align: 64, elements: !551)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !531, line: 60, baseType: !532)
!531 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!532 = !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 36, size: 768, align: 64, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !544, !545, !546, !547, !548, !549, !550}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !532, file: !531, line: 37, baseType: !75, size: 32, align: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !532, file: !531, line: 39, baseType: !75, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !532, file: !531, line: 39, baseType: !75, size: 32, align: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !532, file: !531, line: 40, baseType: !75, size: 32, align: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !532, file: !531, line: 40, baseType: !75, size: 32, align: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !532, file: !531, line: 41, baseType: !75, size: 32, align: 32, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !532, file: !531, line: 42, baseType: !75, size: 32, align: 32, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !532, file: !531, line: 43, baseType: !542, size: 64, align: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !290, line: 73, baseType: !75)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !532, file: !531, line: 44, baseType: !522, size: 64, align: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !532, file: !531, line: 45, baseType: !522, size: 64, align: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !532, file: !531, line: 46, baseType: !522, size: 64, align: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !532, file: !531, line: 47, baseType: !542, size: 64, align: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !532, file: !531, line: 48, baseType: !522, size: 64, align: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !532, file: !531, line: 58, baseType: !75, size: 32, align: 32, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !532, file: !531, line: 58, baseType: !522, size: 64, align: 64, offset: 704)
!551 = !{!552}
!552 = !DISubrange(count: 13)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !473, file: !472, line: 109, baseType: !529, size: 9984, align: 64, offset: 11904)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !473, file: !472, line: 120, baseType: !75, size: 32, align: 32, offset: 21888)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !473, file: !472, line: 121, baseType: !75, size: 32, align: 32, offset: 21920)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !473, file: !472, line: 122, baseType: !525, size: 64, align: 64, offset: 21952)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !473, file: !472, line: 123, baseType: !525, size: 64, align: 64, offset: 22016)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !473, file: !472, line: 126, baseType: !525, size: 64, align: 64, offset: 22080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !473, file: !472, line: 127, baseType: !75, size: 32, align: 32, offset: 22144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !473, file: !472, line: 128, baseType: !289, size: 32, align: 32, offset: 22176)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !473, file: !472, line: 131, baseType: !525, size: 64, align: 64, offset: 22208)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !473, file: !472, line: 134, baseType: !75, size: 32, align: 32, offset: 22272)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !473, file: !472, line: 135, baseType: !542, size: 64, align: 64, offset: 22336)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !473, file: !472, line: 136, baseType: !494, size: 64, align: 64, offset: 22400)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !473, file: !472, line: 137, baseType: !75, size: 32, align: 32, offset: 22464)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !473, file: !472, line: 140, baseType: !75, size: 32, align: 32, offset: 22496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !473, file: !472, line: 141, baseType: !75, size: 32, align: 32, offset: 22528)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !473, file: !472, line: 142, baseType: !494, size: 64, align: 64, offset: 22592)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !473, file: !472, line: 145, baseType: !522, size: 64, align: 64, offset: 22656)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !473, file: !472, line: 148, baseType: !289, size: 32, align: 32, offset: 22720)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !573, line: 51, baseType: !574)
!573 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!574 = !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 40, size: 1408, align: 64, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !574, file: !573, line: 41, baseType: !289, size: 32, align: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !574, file: !573, line: 42, baseType: !75, size: 32, align: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !574, file: !573, line: 43, baseType: !494, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !574, file: !573, line: 43, baseType: !494, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !574, file: !573, line: 43, baseType: !494, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !574, file: !573, line: 43, baseType: !494, size: 64, align: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !574, file: !573, line: 44, baseType: !494, size: 64, align: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !574, file: !573, line: 44, baseType: !494, size: 64, align: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !574, file: !573, line: 44, baseType: !494, size: 64, align: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !574, file: !573, line: 45, baseType: !522, size: 64, align: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !574, file: !573, line: 46, baseType: !522, size: 64, align: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !574, file: !573, line: 47, baseType: !522, size: 64, align: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !574, file: !573, line: 47, baseType: !522, size: 64, align: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !574, file: !573, line: 48, baseType: !590, size: 64, align: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !574, file: !573, line: 49, baseType: !590, size: 64, align: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !574, file: !573, line: 49, baseType: !590, size: 64, align: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !574, file: !573, line: 49, baseType: !590, size: 64, align: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !574, file: !573, line: 49, baseType: !590, size: 64, align: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !574, file: !573, line: 49, baseType: !590, size: 64, align: 64, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !574, file: !573, line: 49, baseType: !590, size: 64, align: 64, offset: 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !574, file: !573, line: 50, baseType: !590, size: 64, align: 64, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !574, file: !573, line: 50, baseType: !590, size: 64, align: 64, offset: 1280)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !574, file: !573, line: 50, baseType: !590, size: 64, align: 64, offset: 1344)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !26, line: 188, baseType: !602)
!602 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 179, size: 366336, align: 64, elements: !603)
!603 = !{!604, !605, !606, !607, !610, !612}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !602, file: !26, line: 181, baseType: !75, size: 32, align: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !602, file: !26, line: 182, baseType: !75, size: 32, align: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !602, file: !26, line: 183, baseType: !75, size: 32, align: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !602, file: !26, line: 184, baseType: !608, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !26, line: 133, baseType: !75)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !602, file: !26, line: 185, baseType: !611, size: 64, align: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !602, file: !26, line: 187, baseType: !613, size: 366080, align: 64, offset: 256)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 366080, align: 64, elements: !625)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !26, line: 140, baseType: !615)
!615 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 135, size: 8320, align: 64, elements: !616)
!616 = !{!617, !618, !622}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !615, file: !26, line: 137, baseType: !75, size: 32, align: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !615, file: !26, line: 138, baseType: !619, size: 8192, align: 32, offset: 32)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, align: 32, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !615, file: !26, line: 139, baseType: !623, size: 64, align: 64, offset: 8256)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !26, line: 45, baseType: !543)
!625 = !{!626}
!626 = !DISubrange(count: 44)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 1, scope: !467, file: !1, line: 149, type: !283)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !467, file: !1, line: 149, type: !470)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 3, scope: !467, file: !1, line: 149, type: !571)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 4, scope: !467, file: !1, line: 149, type: !600)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !467, file: !1, line: 151, type: !75)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !467, file: !1, line: 151, type: !75)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ati", scope: !467, file: !1, line: 151, type: !75)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atj", scope: !467, file: !1, line: 151, type: !75)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !467, file: !1, line: 151, type: !75)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tclj", scope: !467, file: !1, line: 152, type: !302)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tcbu", scope: !467, file: !1, line: 153, type: !315)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tcq", scope: !467, file: !1, line: 154, type: !330)
!640 = !DISubprogram(name: "write_gct", scope: !1, file: !1, line: 196, type: !641, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_coupl_rec*, %struct.t_idef*)* @write_gct, variables: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !109, !283, !600}
!643 = !{!644, !645, !646, !647, !648, !649}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !640, file: !1, line: 196, type: !109)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 2, scope: !640, file: !1, line: 196, type: !283)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 3, scope: !640, file: !1, line: 196, type: !600)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !640, file: !1, line: 198, type: !81)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !640, file: !1, line: 199, type: !75)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftype", scope: !640, file: !1, line: 199, type: !75)
!650 = !DISubprogram(name: "read_gct", scope: !1, file: !1, line: 430, type: !651, isLocal: false, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_coupl_rec*)* @read_gct, variables: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !109, !283}
!653 = !{!654, !655, !656, !666, !667, !668, !669, !670, !671, !672, !673}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !650, file: !1, line: 430, type: !109)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 2, scope: !650, file: !1, line: 430, type: !283)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inp", scope: !650, file: !1, line: 432, type: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inpfile", file: !659, line: 48, baseType: !660)
!659 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!660 = !DICompositeType(tag: DW_TAG_structure_type, file: !659, line: 43, size: 192, align: 64, elements: !661)
!661 = !{!662, !663, !664, !665}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !660, file: !659, line: 44, baseType: !75, size: 32, align: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bSet", scope: !660, file: !659, line: 45, baseType: !75, size: 32, align: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !659, line: 46, baseType: !109, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !660, file: !659, line: 47, baseType: !109, size: 64, align: 64, offset: 128)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !650, file: !1, line: 433, type: !75)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !650, file: !1, line: 433, type: !75)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ninp", scope: !650, file: !1, line: 433, type: !75)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nQ", scope: !650, file: !1, line: 433, type: !75)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nLJ", scope: !650, file: !1, line: 433, type: !75)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nBU", scope: !650, file: !1, line: 433, type: !75)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nIP", scope: !650, file: !1, line: 433, type: !75)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bWrong", scope: !650, file: !1, line: 434, type: !75)
!674 = !DISubprogram(name: "send_tcr", scope: !1, file: !1, line: 71, type: !675, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.t_coupl_rec*)* @send_tcr, variables: !677)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !75, !283}
!677 = !{!678, !679}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !674, file: !1, line: 71, type: !75)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 2, scope: !674, file: !1, line: 71, type: !283)
!680 = !DISubprogram(name: "rec_tcr", scope: !1, file: !1, line: 82, type: !675, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.t_coupl_rec*)* @rec_tcr, variables: !681)
!681 = !{!682, !683}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !680, file: !1, line: 82, type: !75)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcr", arg: 2, scope: !680, file: !1, line: 82, type: !283)
!684 = !DISubprogram(name: "add_lj", scope: !1, file: !1, line: 280, type: !685, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, variables: !688)
!685 = !DISubroutineType(types: !686)
!686 = !{!75, !522, !687, !109, !522}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !699, !700}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nLJ", arg: 1, scope: !684, file: !1, line: 280, type: !522)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tcLJ", arg: 2, scope: !684, file: !1, line: 280, type: !687)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 3, scope: !684, file: !1, line: 280, type: !109)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bObsUsed", arg: 4, scope: !684, file: !1, line: 280, type: !522)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !684, file: !1, line: 282, type: !75)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ati", scope: !684, file: !1, line: 282, type: !75)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atj", scope: !684, file: !1, line: 282, type: !75)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eo", scope: !684, file: !1, line: 282, type: !75)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !684, file: !1, line: 283, type: !698)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !620)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi6", scope: !684, file: !1, line: 284, type: !161)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi12", scope: !684, file: !1, line: 284, type: !161)
