; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/genalg.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_genalg = type { i32, i32, i32, i32, i32, i32, i32, float, float, float**, float**, float*, float*, float*, float*, float*, float* }
%struct.t_range = type { i32, i32, i32, float, float, float, float }

@.str = private unnamed_addr constant [3 x i8] c"ga\00", align 1
@.str1 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/genalg.c\00", align 1
@.str2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str4 = private unnamed_addr constant [4 x i8] c"%lf\00", align 1
@.str5 = private unnamed_addr constant [8 x i8] c"ga->tmp\00", align 1
@.str6 = private unnamed_addr constant [9 x i8] c"ga->best\00", align 1
@.str7 = private unnamed_addr constant [11 x i8] c"ga->bestit\00", align 1
@.str8 = private unnamed_addr constant [9 x i8] c"ga->cost\00", align 1
@.str9 = private unnamed_addr constant [9 x i8] c"ga->rmsf\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !181, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/genalg.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !{!6, !12, !127, !143, !159, !167, !175}
!6 = !DISubprogram(name: "__sigbits", scope: !7, file: !7, line: 114, type: !8, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !10)
!7 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!8 = !DISubroutineType(types: !9)
!9 = !{!4, !4}
!10 = !{!11}
!11 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !6, file: !7, line: 114, type: !4)
!12 = !DISubprogram(name: "init_ga", scope: !1, file: !1, line: 113, type: !13, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_genalg* (i8*, i32, %struct.t_range*)* @init_ga, variables: !55)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !42, !4, !44}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_genalg", file: !17, line: 54, baseType: !18)
!17 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/genalg.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 45, size: 832, align: 64, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !31, !32, !35, !36, !37, !38, !39, !40, !41}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "NP", scope: !18, file: !17, line: 46, baseType: !4, size: 32, align: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !18, file: !17, line: 46, baseType: !4, size: 32, align: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !18, file: !17, line: 47, baseType: !4, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !18, file: !17, line: 48, baseType: !4, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ipop", scope: !18, file: !17, line: 49, baseType: !4, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "gen", scope: !18, file: !17, line: 49, baseType: !4, size: 32, align: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "imin", scope: !18, file: !17, line: 50, baseType: !4, size: 32, align: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !18, file: !17, line: 51, baseType: !28, size: 32, align: 32, offset: 224)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !29, line: 87, baseType: !30)
!29 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!30 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "FF", scope: !18, file: !17, line: 51, baseType: !28, size: 32, align: 32, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pold", scope: !18, file: !17, line: 52, baseType: !33, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pnew", scope: !18, file: !17, line: 52, baseType: !33, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "best", scope: !18, file: !17, line: 53, baseType: !34, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "bestit", scope: !18, file: !17, line: 53, baseType: !34, size: 64, align: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !18, file: !17, line: 53, baseType: !34, size: 64, align: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !18, file: !17, line: 53, baseType: !34, size: 64, align: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rmsf", scope: !18, file: !17, line: 53, baseType: !34, size: 64, align: 64, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !18, file: !17, line: 53, baseType: !34, size: 64, align: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_range", file: !17, line: 43, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 36, size: 224, align: 32, elements: !47)
!47 = !{!48, !49, !50, !51, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "np", scope: !46, file: !17, line: 37, baseType: !4, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "atype", scope: !46, file: !17, line: 38, baseType: !4, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !46, file: !17, line: 39, baseType: !4, size: 32, align: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rmin", scope: !46, file: !17, line: 40, baseType: !28, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !46, file: !17, line: 40, baseType: !28, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dr", scope: !46, file: !17, line: 41, baseType: !28, size: 32, align: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rval", scope: !46, file: !17, line: 42, baseType: !28, size: 32, align: 32, offset: 192)
!55 = !{!56, !57, !58, !59, !121, !122, !124, !125, !126}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 1, scope: !12, file: !1, line: 113, type: !42)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "D", arg: 2, scope: !12, file: !1, line: 113, type: !4)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range", arg: 3, scope: !12, file: !1, line: 113, type: !44)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fpin_ptr", scope: !12, file: !1, line: 115, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 153, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !62, line: 122, size: 1216, align: 64, elements: !64)
!64 = !{!65, !68, !69, !70, !72, !73, !78, !79, !81, !85, !89, !99, !105, !106, !109, !110, !114, !118, !119, !120}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !63, file: !62, line: 123, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !63, file: !62, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !63, file: !62, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !62, line: 126, baseType: !71, size: 16, align: 16, offset: 128)
!71 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !63, file: !62, line: 127, baseType: !71, size: 16, align: 16, offset: 144)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !63, file: !62, line: 128, baseType: !74, size: 128, align: 64, offset: 192)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !62, line: 88, size: 128, align: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !74, file: !62, line: 89, baseType: !66, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !74, file: !62, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !63, file: !62, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !63, file: !62, line: 132, baseType: !80, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !63, file: !62, line: 133, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!4, !80}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !63, file: !62, line: 134, baseType: !86, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!4, !80, !42, !4}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !63, file: !62, line: 135, baseType: !90, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !80, !93, !4}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !62, line: 77, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !95, line: 71, baseType: !96)
!95 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!98 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !63, file: !62, line: 136, baseType: !100, size: 64, align: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!4, !80, !103, !4}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !63, file: !62, line: 139, baseType: !74, size: 128, align: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !63, file: !62, line: 140, baseType: !107, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !62, line: 94, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !63, file: !62, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !63, file: !62, line: 144, baseType: !111, size: 24, align: 8, offset: 928)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 24, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 3)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !63, file: !62, line: 145, baseType: !115, size: 8, align: 8, offset: 952)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !63, file: !62, line: 148, baseType: !74, size: 128, align: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !63, file: !62, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !62, line: 152, baseType: !93, size: 64, align: 64, offset: 1152)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ga", scope: !12, file: !1, line: 116, type: !15)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ff", scope: !12, file: !1, line: 117, type: !123)
!123 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr", scope: !12, file: !1, line: 117, type: !123)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !12, file: !1, line: 118, type: !4)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !12, file: !1, line: 118, type: !4)
!127 = !DISubprogram(name: "update_ga", scope: !1, file: !1, line: 175, type: !128, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_range*, %struct.t_genalg*)* @update_ga, variables: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !60, !44, !15}
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fpout_ptr", arg: 1, scope: !127, file: !1, line: 175, type: !60)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range", arg: 2, scope: !127, file: !1, line: 175, type: !44)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ga", arg: 3, scope: !127, file: !1, line: 175, type: !15)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !127, file: !1, line: 178, type: !4)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !127, file: !1, line: 178, type: !4)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !127, file: !1, line: 178, type: !4)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !127, file: !1, line: 178, type: !4)
!138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r1", scope: !127, file: !1, line: 179, type: !4)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !127, file: !1, line: 179, type: !4)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r3", scope: !127, file: !1, line: 179, type: !4)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r4", scope: !127, file: !1, line: 179, type: !4)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r5", scope: !127, file: !1, line: 179, type: !4)
!143 = !DISubprogram(name: "print_ga", scope: !1, file: !1, line: 383, type: !144, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_genalg*, float, float, %struct.t_range*, float)* @print_ga, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{!4, !60, !15, !28, !28, !44, !28}
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !143, file: !1, line: 383, type: !60)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ga", arg: 2, scope: !143, file: !1, line: 383, type: !15)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rmsf", arg: 3, scope: !143, file: !1, line: 383, type: !28)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "energy", arg: 4, scope: !143, file: !1, line: 383, type: !28)
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "range", arg: 5, scope: !143, file: !1, line: 383, type: !44)
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tol", arg: 6, scope: !143, file: !1, line: 384, type: !28)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trial_cost", scope: !143, file: !1, line: 388, type: !28)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cvar", scope: !143, file: !1, line: 389, type: !28)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmean", scope: !143, file: !1, line: 390, type: !28)
