; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ghat.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str1 = private unnamed_addr constant [41 x i8] c"%8d  %8d  %8d  %15.10e  %15.10e %15.10e\0A\00", align 1
@.str2 = private unnamed_addr constant [47 x i8] c"%8d  %8d  %8d  %8d  %15.10e  %15.10e  %15.10e\0A\00", align 1
@.str3 = private unnamed_addr constant [36 x i8] c"%10g  %10g  %10g  %10g  %10g  %10g\0A\00", align 1
@.str4 = private unnamed_addr constant [9 x i8] c"  %12.5e\00", align 1
@.str6 = private unnamed_addr constant [9 x i8] c"ghat.xvg\00", align 1
@.str7 = private unnamed_addr constant [6 x i8] c"G-Hat\00", align 1
@.str8 = private unnamed_addr constant [2 x i8] c"k\00", align 1
@.str9 = private unnamed_addr constant [3 x i8] c"gk\00", align 1
@.str10 = private unnamed_addr constant [12 x i8] c"%10g  %10g\0A\00", align 1

!24 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!25 = !{!26}
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !21, file: !16, line: 207, type: !24)
!27 = !DISubprogram(name: "__inline_isfinitel", scope: !16, file: !16, line: 210, type: !28, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !31)
!28 = !DISubroutineType(types: !29)
!29 = !{!4, !30}
!30 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!31 = !{!32}
!32 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !27, file: !16, line: 210, type: !30)
!33 = !DISubprogram(name: "__inline_isinff", scope: !16, file: !16, line: 213, type: !17, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !34)
!34 = !{!35}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !33, file: !16, line: 213, type: !7)
!36 = !DISubprogram(name: "__inline_isinfd", scope: !16, file: !16, line: 216, type: !22, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !37)
!37 = !{!38}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !36, file: !16, line: 216, type: !24)
!39 = !DISubprogram(name: "__inline_isinfl", scope: !16, file: !16, line: 219, type: !28, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !40)
!40 = !{!41}
!41 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !39, file: !16, line: 219, type: !30)
!42 = !DISubprogram(name: "__inline_isnanf", scope: !16, file: !16, line: 222, type: !17, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !43)
!43 = !{!44}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !42, file: !16, line: 222, type: !7)
!45 = !DISubprogram(name: "__inline_isnand", scope: !16, file: !16, line: 225, type: !22, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !46)
!46 = !{!47}
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !45, file: !16, line: 225, type: !24)
!48 = !DISubprogram(name: "__inline_isnanl", scope: !16, file: !16, line: 228, type: !28, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !49)
!49 = !{!50}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !48, file: !16, line: 228, type: !30)
!51 = !DISubprogram(name: "__inline_signbitf", scope: !16, file: !16, line: 231, type: !17, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !52)
!52 = !{!53, !54}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !51, file: !16, line: 231, type: !7)
!54 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !51, file: !16, line: 232, type: !55)
!55 = !DICompositeType(tag: DW_TAG_union_type, scope: !51, file: !16, line: 232, size: 32, align: 32, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !55, file: !16, line: 232, baseType: !7, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !55, file: !16, line: 232, baseType: !59, size: 32, align: 32)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DISubprogram(name: "__inline_signbitd", scope: !16, file: !16, line: 236, type: !22, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !61)
!61 = !{!62, !63}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !60, file: !16, line: 236, type: !24)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !60, file: !16, line: 237, type: !64)
!64 = !DICompositeType(tag: DW_TAG_union_type, scope: !60, file: !16, line: 237, size: 64, align: 64, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !64, file: !16, line: 237, baseType: !24, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !64, file: !16, line: 237, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!69 = !DISubprogram(name: "__inline_signbitl", scope: !16, file: !16, line: 242, type: !28, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !70)
!70 = !{!71, !72}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !69, file: !16, line: 242, type: !30)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !69, file: !16, line: 246, type: !73)
!73 = !DICompositeType(tag: DW_TAG_union_type, scope: !69, file: !16, line: 243, size: 128, align: 128, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !73, file: !16, line: 244, baseType: !30, size: 128, align: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !73, file: !16, line: 245, baseType: !77, size: 128, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, scope: !73, file: !16, line: 245, size: 128, align: 64, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !77, file: !16, line: 245, baseType: !68, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !77, file: !16, line: 245, baseType: !81, size: 16, align: 16, offset: 64)
!81 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!82 = !DISubprogram(name: "__inline_isnormalf", scope: !16, file: !16, line: 257, type: !17, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !83)
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !82, file: !16, line: 257, type: !7)
!85 = !DISubprogram(name: "__inline_isnormald", scope: !16, file: !16, line: 260, type: !22, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !86)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !85, file: !16, line: 260, type: !24)
!88 = !DISubprogram(name: "__inline_isnormall", scope: !16, file: !16, line: 263, type: !28, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !89)
!89 = !{!90}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !88, file: !16, line: 263, type: !30)
!91 = !DISubprogram(name: "__sincosf", scope: !16, file: !16, line: 642, type: !92, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !95)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !7, !94, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!95 = !{!96, !97, !98, !99}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !91, file: !16, line: 642, type: !7)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !91, file: !16, line: 642, type: !94)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !91, file: !16, line: 642, type: !94)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !91, file: !16, line: 643, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !16, line: 634, size: 64, align: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !101, file: !16, line: 634, baseType: !7, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !101, file: !16, line: 634, baseType: !7, size: 32, align: 32, offset: 32)
!105 = !DISubprogram(name: "__sincos", scope: !16, file: !16, line: 647, type: !106, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !109)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !24, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!109 = !{!110, !111, !112, !113}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !105, file: !16, line: 647, type: !24)
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !105, file: !16, line: 647, type: !108)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !105, file: !16, line: 647, type: !108)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !105, file: !16, line: 648, type: !114)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !16, line: 635, size: 128, align: 64, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !115, file: !16, line: 635, baseType: !24, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !115, file: !16, line: 635, baseType: !24, size: 64, align: 64, offset: 64)
!119 = !DISubprogram(name: "__sincospif", scope: !16, file: !16, line: 652, type: !92, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !119, file: !16, line: 652, type: !7)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !119, file: !16, line: 652, type: !94)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !119, file: !16, line: 652, type: !94)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !119, file: !16, line: 653, type: !100)
!125 = !DISubprogram(name: "__sincospi", scope: !16, file: !16, line: 657, type: !106, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !125, file: !16, line: 657, type: !24)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !125, file: !16, line: 657, type: !108)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !125, file: !16, line: 657, type: !108)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !125, file: !16, line: 658, type: !114)
!131 = !DISubprogram(name: "symmetrize_ghat", scope: !1, file: !1, line: 42, type: !132, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32, float***)* @symmetrize_ghat, variables: !137)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !4, !4, !4, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !131, file: !1, line: 42, type: !4)
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !131, file: !1, line: 42, type: !4)
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 3, scope: !131, file: !1, line: 42, type: !4)
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghat", arg: 4, scope: !131, file: !1, line: 42, type: !134)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !131, file: !1, line: 44, type: !4)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !131, file: !1, line: 44, type: !4)
!144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !131, file: !1, line: 44, type: !4)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iip", scope: !131, file: !1, line: 45, type: !4)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jjp", scope: !131, file: !1, line: 45, type: !4)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kkp", scope: !131, file: !1, line: 45, type: !4)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ggg", scope: !131, file: !1, line: 46, type: !5)
!149 = !DISubprogram(name: "mk_ghat", scope: !1, file: !1, line: 71, type: !150, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, i32, float***, float*, float, float, i32, i32)* @mk_ghat, variables: !215)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152, !4, !4, !4, !134, !136, !5, !5, !4, !4}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !154, line: 153, baseType: !155)
!154 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !154, line: 122, size: 1216, align: 64, elements: !156)
!156 = !{!157, !160, !161, !162, !164, !165, !170, !171, !173, !177, !183, !193, !199, !200, !203, !204, !208, !212, !213, !214}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !155, file: !154, line: 123, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !155, file: !154, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !155, file: !154, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !155, file: !154, line: 126, baseType: !163, size: 16, align: 16, offset: 128)
!163 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !155, file: !154, line: 127, baseType: !163, size: 16, align: 16, offset: 144)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !155, file: !154, line: 128, baseType: !166, size: 128, align: 64, offset: 192)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !154, line: 88, size: 128, align: 64, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !166, file: !154, line: 89, baseType: !158, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !166, file: !154, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !155, file: !154, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !155, file: !154, line: 132, baseType: !172, size: 64, align: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !155, file: !154, line: 133, baseType: !174, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!4, !172}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !155, file: !154, line: 134, baseType: !178, size: 64, align: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!4, !172, !181, !4}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !155, file: !154, line: 135, baseType: !184, size: 64, align: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !172, !187, !4}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !154, line: 77, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !189, line: 71, baseType: !190)
!189 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !191, line: 46, baseType: !192)
!191 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!192 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !155, file: !154, line: 136, baseType: !194, size: 64, align: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!4, !172, !197, !4}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !155, file: !154, line: 139, baseType: !166, size: 128, align: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !155, file: !154, line: 140, baseType: !201, size: 64, align: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !154, line: 94, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !155, file: !154, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !155, file: !154, line: 144, baseType: !205, size: 24, align: 8, offset: 928)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 24, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !155, file: !154, line: 145, baseType: !209, size: 8, align: 8, offset: 952)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 8, align: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !155, file: !154, line: 148, baseType: !166, size: 128, align: 64, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !155, file: !154, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !155, file: !154, line: 152, baseType: !187, size: 64, align: 64, offset: 1152)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !237}
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !149, file: !1, line: 71, type: !152)
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 2, scope: !149, file: !1, line: 71, type: !4)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 3, scope: !149, file: !1, line: 71, type: !4)
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nz", arg: 4, scope: !149, file: !1, line: 71, type: !4)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ghat", arg: 5, scope: !149, file: !1, line: 71, type: !134)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 6, scope: !149, file: !1, line: 72, type: !136)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r1", arg: 7, scope: !149, file: !1, line: 72, type: !5)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rc", arg: 8, scope: !149, file: !1, line: 72, type: !5)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bSym", arg: 9, scope: !149, file: !1, line: 72, type: !4)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bOld", arg: 10, scope: !149, file: !1, line: 72, type: !4)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !149, file: !1, line: 74, type: !4)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iy", scope: !149, file: !1, line: 74, type: !4)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iz", scope: !149, file: !1, line: 74, type: !4)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ixmax", scope: !149, file: !1, line: 75, type: !4)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iymax", scope: !149, file: !1, line: 75, type: !4)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "izmax", scope: !149, file: !1, line: 75, type: !4)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k2", scope: !149, file: !1, line: 76, type: !5)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ggg", scope: !149, file: !1, line: 76, type: !5)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !149, file: !1, line: 77, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !6, line: 101, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, align: 32, elements: !206)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lll", scope: !149, file: !1, line: 77, type: !235)
!238 = !DISubprogram(name: "wr_ghat", scope: !1, file: !1, line: 113, type: !239, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32, i32, float, float, float, float***, i32, i32, i32, i32, float*, float, float, float, float, float, float)* @wr_ghat, variables: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !181, !4, !4, !4, !5, !5, !5, !134, !4, !4, !4, !4, !136, !5, !5, !5, !5, !5, !5}
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !238, file: !1, line: 113, type: !181)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n1max", arg: 2, scope: !238, file: !1, line: 113, type: !4)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n2max", arg: 3, scope: !238, file: !1, line: 113, type: !4)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n3max", arg: 4, scope: !238, file: !1, line: 113, type: !4)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h1", arg: 5, scope: !238, file: !1, line: 113, type: !5)
