; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }

@xdr_opaque.crud = internal global [4 x i8] zeroinitializer, align 1
@xdr_zero = internal global [4 x i8] zeroinitializer, align 1
@.str = private unnamed_addr constant [27 x i8] c"xdr_string: out of memory\0A\00", align 1
@__stderrp = external global %struct.__sFILE*
@xdr_double.LSW = internal unnamed_addr global i1 false

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !128, globals: !347, imports: !143)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !4, line: 119, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !{!10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !21, !22, !23, !69, !20}
!10 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdr_int32_t", file: !4, line: 106, baseType: !11)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdr_uint32_t", file: !4, line: 107, baseType: !14)
!17 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!18 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 148, size: 640, align: 64, elements: !25)
!25 = !{!26, !41, !42, !46, !47, !51, !55, !60, !64, !68}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !24, file: !4, line: 150, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !31, !13}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !4, line: 99, baseType: !11)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 144, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 145, size: 384, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !33, file: !4, line: 147, baseType: !3, size: 32, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !33, file: !4, line: 171, baseType: !23, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !33, file: !4, line: 172, baseType: !19, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !33, file: !4, line: 173, baseType: !19, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !33, file: !4, line: 174, baseType: !19, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !33, file: !4, line: 175, baseType: !11, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !24, file: !4, line: 152, baseType: !27, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !24, file: !4, line: 154, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!30, !31, !19, !14}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !24, file: !4, line: 156, baseType: !43, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !24, file: !4, line: 158, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!14, !31}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !24, file: !4, line: 160, baseType: !52, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!30, !31, !14}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !24, file: !4, line: 162, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !31, !11}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !24, file: !4, line: 164, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !31}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !24, file: !4, line: 166, baseType: !65, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!30, !31, !59}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !24, file: !4, line: 168, baseType: !65, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 153, baseType: !72)
!71 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !71, line: 122, size: 1216, align: 64, elements: !73)
!73 = !{!74, !77, !78, !79, !80, !81, !86, !87, !88, !92, !96, !106, !112, !113, !116, !117, !121, !125, !126, !127}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !72, file: !71, line: 123, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !72, file: !71, line: 124, baseType: !11, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !72, file: !71, line: 125, baseType: !11, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !71, line: 126, baseType: !17, size: 16, align: 16, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !72, file: !71, line: 127, baseType: !17, size: 16, align: 16, offset: 144)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !72, file: !71, line: 128, baseType: !82, size: 128, align: 64, offset: 192)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !71, line: 88, size: 128, align: 64, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !82, file: !71, line: 89, baseType: !75, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !82, file: !71, line: 90, baseType: !11, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !72, file: !71, line: 129, baseType: !11, size: 32, align: 32, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !72, file: !71, line: 132, baseType: !21, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !72, file: !71, line: 133, baseType: !89, size: 64, align: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!11, !21}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !72, file: !71, line: 134, baseType: !93, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!11, !21, !19, !11}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !72, file: !71, line: 135, baseType: !97, size: 64, align: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !21, !100, !11}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !71, line: 77, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !102, line: 71, baseType: !103)
!102 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !72, file: !71, line: 136, baseType: !107, size: 64, align: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!11, !21, !110, !11}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !72, file: !71, line: 139, baseType: !82, size: 128, align: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !72, file: !71, line: 140, baseType: !114, size: 64, align: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !71, line: 94, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !72, file: !71, line: 141, baseType: !11, size: 32, align: 32, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !72, file: !71, line: 144, baseType: !118, size: 24, align: 8, offset: 928)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !72, file: !71, line: 145, baseType: !122, size: 8, align: 8, offset: 952)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, align: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !72, file: !71, line: 148, baseType: !82, size: 128, align: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !72, file: !71, line: 151, baseType: !11, size: 32, align: 32, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !71, line: 152, baseType: !100, size: 64, align: 64, offset: 1152)
!128 = !{!129, !140, !144, !151, !159, !163, !173, !181, !189, !196, !203, !208, !214, !225, !242, !268, !279, !286, !291, !297, !304, !309, !313, !318, !323, !326, !330, !334, !337, !342}
!129 = !DISubprogram(name: "xdr_free", scope: !1, file: !1, line: 104, type: !130, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: void (i32 (%struct.XDR*, i8*, ...)*, i8*)* @xdr_free, variables: !136)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !132, !19}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !4, line: 187, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!30, !31, !21, null}
!136 = !{!137, !138, !139}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proc", arg: 1, scope: !129, file: !1, line: 104, type: !132)
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objp", arg: 2, scope: !129, file: !1, line: 104, type: !19)
!139 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !129, file: !1, line: 106, type: !32)
!140 = !DISubprogram(name: "xdr_void", scope: !1, file: !1, line: 116, type: !141, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @xdr_void, variables: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{!30}
!143 = !{}
!144 = !DISubprogram(name: "xdr_int", scope: !1, file: !1, line: 125, type: !145, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i32*)* @xdr_int, variables: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{!30, !31, !22}
!147 = !{!148, !149, !150}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !144, file: !1, line: 125, type: !31)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ip", arg: 2, scope: !144, file: !1, line: 125, type: !22)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !144, file: !1, line: 127, type: !10)
!151 = !DISubprogram(name: "xdr_u_int", scope: !1, file: !1, line: 152, type: !152, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i32*)* @xdr_u_int, variables: !155)
!152 = !DISubroutineType(types: !153)
!153 = !{!30, !31, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!155 = !{!156, !157, !158}
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !151, file: !1, line: 152, type: !31)
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "up", arg: 2, scope: !151, file: !1, line: 152, type: !154)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !151, file: !1, line: 154, type: !12)
!159 = !DISubprogram(name: "xdr_long", scope: !1, file: !1, line: 180, type: !28, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i64*)* @xdr_long, variables: !160)
!160 = !{!161, !162}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !159, file: !1, line: 180, type: !31)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lp", arg: 2, scope: !159, file: !1, line: 180, type: !13)
!163 = !DISubprogram(name: "xdr_u_long", scope: !1, file: !1, line: 204, type: !164, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i64*)* @xdr_u_long, variables: !167)
!164 = !DISubroutineType(types: !165)
!165 = !{!30, !31, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!167 = !{!168, !169, !170}
!168 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !163, file: !1, line: 204, type: !31)
