; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmxfio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.t_fileio = type { i32, i32, i32, i32, i32, i32, i8*, %struct.__sFILE*, %struct.XDR* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }

@_DefaultRuneLocale = external global %struct._RuneLocale
@do_read = global i32 (i8*, i32, i32, i8*, i8*, i32)* @do_dummy, align 8

!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 37, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!12 = !DIEnumerator(name: "efMDP", value: 0)
!13 = !DIEnumerator(name: "efGCT", value: 1)
!14 = !DIEnumerator(name: "efTRX", value: 2)
!15 = !DIEnumerator(name: "efTRN", value: 3)
!16 = !DIEnumerator(name: "efTRR", value: 4)
!17 = !DIEnumerator(name: "efTRJ", value: 5)
!18 = !DIEnumerator(name: "efXTC", value: 6)
!19 = !DIEnumerator(name: "efG87", value: 7)
!20 = !DIEnumerator(name: "efENX", value: 8)
!21 = !DIEnumerator(name: "efEDR", value: 9)
!22 = !DIEnumerator(name: "efENE", value: 10)
!23 = !DIEnumerator(name: "efSTX", value: 11)
!24 = !DIEnumerator(name: "efSTO", value: 12)
!25 = !DIEnumerator(name: "efGRO", value: 13)
!26 = !DIEnumerator(name: "efG96", value: 14)
!27 = !DIEnumerator(name: "efPDB", value: 15)
!28 = !DIEnumerator(name: "efBRK", value: 16)
!29 = !DIEnumerator(name: "efENT", value: 17)
!30 = !DIEnumerator(name: "efLOG", value: 18)
!31 = !DIEnumerator(name: "efXVG", value: 19)
!32 = !DIEnumerator(name: "efOUT", value: 20)
!33 = !DIEnumerator(name: "efNDX", value: 21)
!34 = !DIEnumerator(name: "efTOP", value: 22)
!35 = !DIEnumerator(name: "efITP", value: 23)
!36 = !DIEnumerator(name: "efTPX", value: 24)
!37 = !DIEnumerator(name: "efTPS", value: 25)
!38 = !DIEnumerator(name: "efTPR", value: 26)
!39 = !DIEnumerator(name: "efTPA", value: 27)
!40 = !DIEnumerator(name: "efTPB", value: 28)
!41 = !DIEnumerator(name: "efTEX", value: 29)
!42 = !DIEnumerator(name: "efRTP", value: 30)
!43 = !DIEnumerator(name: "efATP", value: 31)
!44 = !DIEnumerator(name: "efHDB", value: 32)
!45 = !DIEnumerator(name: "efDAT", value: 33)
!46 = !DIEnumerator(name: "efDLG", value: 34)
!47 = !DIEnumerator(name: "efMAP", value: 35)
!48 = !DIEnumerator(name: "efEPS", value: 36)
!49 = !DIEnumerator(name: "efMAT", value: 37)
!50 = !DIEnumerator(name: "efM2P", value: 38)
!51 = !DIEnumerator(name: "efMTX", value: 39)
!52 = !DIEnumerator(name: "efEDI", value: 40)
!53 = !DIEnumerator(name: "efEDO", value: 41)
!54 = !DIEnumerator(name: "efPPA", value: 42)
!55 = !DIEnumerator(name: "efPDO", value: 43)
!56 = !DIEnumerator(name: "efHAT", value: 44)
!57 = !DIEnumerator(name: "efXPM", value: 45)
!58 = !DIEnumerator(name: "efNR", value: 46)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 52, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmxfio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70}
!62 = !DIEnumerator(name: "eioREAL", value: 0)
!63 = !DIEnumerator(name: "eioINT", value: 1)
!64 = !DIEnumerator(name: "eioNUCHAR", value: 2)
!65 = !DIEnumerator(name: "eioUSHORT", value: 3)
!66 = !DIEnumerator(name: "eioRVEC", value: 4)
!67 = !DIEnumerator(name: "eioNRVEC", value: 5)
!68 = !DIEnumerator(name: "eioIVEC", value: 6)
!69 = !DIEnumerator(name: "eioSTRING", value: 7)
!70 = !DIEnumerator(name: "eioNR", value: 8)
!71 = !{!72, !73, !74, !75, !79, !81, !83, !85, !86, !139, !80, !144}
!72 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!73 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !77, line: 87, baseType: !78)
!77 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !4, line: 187, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !91, !74, null}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !4, line: 99, baseType: !80)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 144, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 145, size: 384, align: 64, elements: !94)
!94 = !{!95, !96, !135, !136, !137, !138}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !93, file: !4, line: 147, baseType: !3, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !93, file: !4, line: 171, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 148, size: 640, align: 64, elements: !99)
!99 = !{!100, !106, !107, !111, !112, !116, !120, !126, !130, !134}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !98, file: !4, line: 150, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!90, !91, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !98, file: !4, line: 152, baseType: !101, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !98, file: !4, line: 154, baseType: !108, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!90, !91, !85, !72}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !98, file: !4, line: 156, baseType: !108, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !98, file: !4, line: 158, baseType: !113, size: 64, align: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!72, !91}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !98, file: !4, line: 160, baseType: !117, size: 64, align: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!90, !91, !72}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !98, file: !4, line: 162, baseType: !121, size: 64, align: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !91, !80}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdr_int32_t", file: !4, line: 106, baseType: !80)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !98, file: !4, line: 164, baseType: !127, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !91}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !98, file: !4, line: 166, baseType: !131, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!90, !91, !124}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !98, file: !4, line: 168, baseType: !131, size: 64, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !93, file: !4, line: 172, baseType: !85, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !93, file: !4, line: 173, baseType: !85, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !93, file: !4, line: 174, baseType: !85, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !93, file: !4, line: 175, baseType: !80, size: 32, align: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !77, line: 101, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 96, align: 32, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 3)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !145, line: 30, baseType: !146)
!145 = !DIFile(filename: "/usr/include/sys/_types/_off_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !147, line: 71, baseType: !148)
!147 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !149, line: 46, baseType: !150)
!149 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!150 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!151 = !{!152, !158, !166, !172, !178, !181, !184, !187, !190, !193, !196, !199, !202, !205, !208, !211, !214, !217, !220, !223, !226, !229, !232, !235, !238, !241, !244, !301, !305, !314, !319, !323, !351, !356, !359, !365, !368, !372, !377, !381, !384, !387, !390, !395, !401, !406, !411, !414, !424, !431, !458, !466, !474, !493, !501, !509, !526, !531, !537, !551}
!152 = !DISubprogram(name: "isascii", scope: !153, file: !153, line: 135, type: !154, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isascii, variables: !156)
!153 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!154 = !DISubroutineType(types: !155)
!155 = !{!80, !80}
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !152, file: !153, line: 135, type: !80)
!158 = !DISubprogram(name: "__istype", scope: !153, file: !153, line: 153, type: !159, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i64)* @__istype, variables: !163)
!159 = !DISubroutineType(types: !160)
!160 = !{!80, !161, !162}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ct_rune_t", file: !149, line: 70, baseType: !80)
!162 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!163 = !{!164, !165}
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !158, file: !153, line: 153, type: !161)
!165 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !158, file: !153, line: 153, type: !162)
!166 = !DISubprogram(name: "__isctype", scope: !153, file: !153, line: 164, type: !167, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i64)* @__isctype, variables: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!161, !161, !162}
!169 = !{!170, !171}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !166, file: !153, line: 164, type: !161)
!171 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_f", arg: 2, scope: !166, file: !153, line: 164, type: !162)
!172 = !DISubprogram(name: "__wcwidth", scope: !153, file: !153, line: 194, type: !173, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__wcwidth, variables: !175)
!173 = !DISubroutineType(types: !174)
!174 = !{!80, !161}
!175 = !{!176, !177}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !172, file: !153, line: 194, type: !161)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_x", scope: !172, file: !153, line: 196, type: !72)
!178 = !DISubprogram(name: "isalnum", scope: !153, file: !153, line: 212, type: !154, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isalnum, variables: !179)
!179 = !{!180}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !178, file: !153, line: 212, type: !80)
!181 = !DISubprogram(name: "isalpha", scope: !153, file: !153, line: 218, type: !154, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isalpha, variables: !182)
!182 = !{!183}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !181, file: !153, line: 218, type: !80)
!184 = !DISubprogram(name: "isblank", scope: !153, file: !153, line: 224, type: !154, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isblank, variables: !185)
!185 = !{!186}
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !184, file: !153, line: 224, type: !80)
!187 = !DISubprogram(name: "iscntrl", scope: !153, file: !153, line: 230, type: !154, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @iscntrl, variables: !188)
!188 = !{!189}
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !187, file: !153, line: 230, type: !80)
!190 = !DISubprogram(name: "isdigit", scope: !153, file: !153, line: 237, type: !154, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isdigit, variables: !191)
!191 = !{!192}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !190, file: !153, line: 237, type: !80)
!193 = !DISubprogram(name: "isgraph", scope: !153, file: !153, line: 243, type: !154, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isgraph, variables: !194)
!194 = !{!195}
!195 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !193, file: !153, line: 243, type: !80)
!196 = !DISubprogram(name: "islower", scope: !153, file: !153, line: 249, type: !154, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @islower, variables: !197)
!197 = !{!198}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !196, file: !153, line: 249, type: !80)
!199 = !DISubprogram(name: "isprint", scope: !153, file: !153, line: 255, type: !154, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isprint, variables: !200)
!200 = !{!201}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !199, file: !153, line: 255, type: !80)
!202 = !DISubprogram(name: "ispunct", scope: !153, file: !153, line: 261, type: !154, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @ispunct, variables: !203)
!203 = !{!204}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !202, file: !153, line: 261, type: !80)
!205 = !DISubprogram(name: "isspace", scope: !153, file: !153, line: 267, type: !154, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isspace, variables: !206)
!206 = !{!207}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !205, file: !153, line: 267, type: !80)
!208 = !DISubprogram(name: "isupper", scope: !153, file: !153, line: 273, type: !154, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isupper, variables: !209)
!209 = !{!210}
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !208, file: !153, line: 273, type: !80)
!211 = !DISubprogram(name: "isxdigit", scope: !153, file: !153, line: 280, type: !154, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isxdigit, variables: !212)
!212 = !{!213}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !211, file: !153, line: 280, type: !80)
!214 = !DISubprogram(name: "toascii", scope: !153, file: !153, line: 286, type: !154, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @toascii, variables: !215)
!215 = !{!216}
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !214, file: !153, line: 286, type: !80)
!217 = !DISubprogram(name: "tolower", scope: !153, file: !153, line: 292, type: !154, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tolower, variables: !218)
!218 = !{!219}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !217, file: !153, line: 292, type: !80)
!220 = !DISubprogram(name: "toupper", scope: !153, file: !153, line: 298, type: !154, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @toupper, variables: !221)
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !220, file: !153, line: 298, type: !80)
!223 = !DISubprogram(name: "digittoint", scope: !153, file: !153, line: 305, type: !154, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @digittoint, variables: !224)
!224 = !{!225}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !223, file: !153, line: 305, type: !80)
!226 = !DISubprogram(name: "ishexnumber", scope: !153, file: !153, line: 311, type: !154, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @ishexnumber, variables: !227)
!227 = !{!228}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !226, file: !153, line: 311, type: !80)
!229 = !DISubprogram(name: "isideogram", scope: !153, file: !153, line: 317, type: !154, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isideogram, variables: !230)
!230 = !{!231}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !229, file: !153, line: 317, type: !80)
!232 = !DISubprogram(name: "isnumber", scope: !153, file: !153, line: 323, type: !154, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isnumber, variables: !233)
!233 = !{!234}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !232, file: !153, line: 323, type: !80)
!235 = !DISubprogram(name: "isphonogram", scope: !153, file: !153, line: 329, type: !154, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isphonogram, variables: !236)
!236 = !{!237}
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !235, file: !153, line: 329, type: !80)
!238 = !DISubprogram(name: "isrune", scope: !153, file: !153, line: 335, type: !154, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isrune, variables: !239)
!239 = !{!240}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !238, file: !153, line: 335, type: !80)
!241 = !DISubprogram(name: "isspecial", scope: !153, file: !153, line: 341, type: !154, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @isspecial, variables: !242)
!242 = !{!243}
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !241, file: !153, line: 341, type: !80)
!244 = !DISubprogram(name: "__sputc", scope: !245, file: !245, line: 348, type: !246, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !298)
!245 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!246 = !DISubroutineType(types: !247)
!247 = !{!80, !80, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !245, line: 153, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !245, line: 122, size: 1216, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !257, !258, !263, !264, !265, !269, !273, !278, !284, !285, !288, !289, !291, !295, !296, !297}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !250, file: !245, line: 123, baseType: !81, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !250, file: !245, line: 124, baseType: !80, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !250, file: !245, line: 125, baseType: !80, size: 32, align: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !250, file: !245, line: 126, baseType: !256, size: 16, align: 16, offset: 128)
!256 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !250, file: !245, line: 127, baseType: !256, size: 16, align: 16, offset: 144)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !250, file: !245, line: 128, baseType: !259, size: 128, align: 64, offset: 192)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !245, line: 88, size: 128, align: 64, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !259, file: !245, line: 89, baseType: !81, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !259, file: !245, line: 90, baseType: !80, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !250, file: !245, line: 129, baseType: !80, size: 32, align: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !250, file: !245, line: 132, baseType: !74, size: 64, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !250, file: !245, line: 133, baseType: !266, size: 64, align: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!80, !74}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !250, file: !245, line: 134, baseType: !270, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!80, !74, !85, !80}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !250, file: !245, line: 135, baseType: !274, size: 64, align: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !74, !277, !80}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !245, line: 77, baseType: !146)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !250, file: !245, line: 136, baseType: !279, size: 64, align: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!80, !74, !282, !80}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !250, file: !245, line: 139, baseType: !259, size: 128, align: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !250, file: !245, line: 140, baseType: !286, size: 64, align: 64, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !245, line: 94, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !250, file: !245, line: 141, baseType: !80, size: 32, align: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !250, file: !245, line: 144, baseType: !290, size: 24, align: 8, offset: 928)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, align: 8, elements: !142)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !250, file: !245, line: 145, baseType: !292, size: 8, align: 8, offset: 952)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, align: 8, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 1)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !250, file: !245, line: 148, baseType: !259, size: 128, align: 64, offset: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !250, file: !245, line: 151, baseType: !80, size: 32, align: 32, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !250, file: !245, line: 152, baseType: !277, size: 64, align: 64, offset: 1152)
!298 = !{!299, !300}
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !244, file: !245, line: 348, type: !80)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !244, file: !245, line: 348, type: !248)
!301 = !DISubprogram(name: "__sigbits", scope: !302, file: !302, line: 114, type: !154, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !303)
!302 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!303 = !{!304}
!304 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !301, file: !302, line: 114, type: !80)
!305 = !DISubprogram(name: "in_ftpset", scope: !1, file: !1, line: 67, type: !306, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*)* @in_ftpset, variables: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!80, !80, !80, !79}
!308 = !{!309, !310, !311, !312, !313}
!309 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 1, scope: !305, file: !1, line: 67, type: !80)
!310 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nset", arg: 2, scope: !305, file: !1, line: 67, type: !80)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 3, scope: !305, file: !1, line: 67, type: !79)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !305, file: !1, line: 69, type: !80)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bResult", scope: !305, file: !1, line: 70, type: !80)
!314 = !DISubprogram(name: "set_comment", scope: !1, file: !1, line: 138, type: !315, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @set_comment, variables: !317)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !85}
!317 = !{!318}
!318 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "comment", arg: 1, scope: !314, file: !1, line: 138, type: !85)
!319 = !DISubprogram(name: "unset_comment", scope: !1, file: !1, line: 144, type: !320, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @unset_comment, variables: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{null}
!322 = !{}
!323 = !DISubprogram(name: "gmx_fio_open", scope: !1, file: !1, line: 639, type: !324, isLocal: false, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @gmx_fio_open, variables: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!80, !85, !85}
!326 = !{!327, !328, !329, !343, !344, !345, !346, !350}
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !323, file: !1, line: 639, type: !85)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !323, file: !1, line: 639, type: !85)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fio", scope: !323, file: !1, line: 641, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_fileio", file: !1, line: 60, baseType: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 54, size: 384, align: 64, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "iFTP", scope: !332, file: !1, line: 55, baseType: !80, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bOpen", scope: !332, file: !1, line: 56, baseType: !80, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bRead", scope: !332, file: !1, line: 56, baseType: !80, size: 32, align: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bDouble", scope: !332, file: !1, line: 56, baseType: !80, size: 32, align: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bDebug", scope: !332, file: !1, line: 56, baseType: !80, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bStdio", scope: !332, file: !1, line: 56, baseType: !80, size: 32, align: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !332, file: !1, line: 57, baseType: !85, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !332, file: !1, line: 58, baseType: !248, size: 64, align: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xdr", scope: !332, file: !1, line: 59, baseType: !91, size: 64, align: 64, offset: 320)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !323, file: !1, line: 642, type: !80)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfio", scope: !323, file: !1, line: 642, type: !80)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bf", scope: !323, file: !1, line: 643, type: !85)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newmode", scope: !323, file: !1, line: 643, type: !347)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 40, align: 8, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 5)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bRead", scope: !323, file: !1, line: 644, type: !80)
!351 = !DISubprogram(name: "gmx_fio_close", scope: !1, file: !1, line: 735, type: !352, isLocal: false, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @gmx_fio_close, variables: !354)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !80}
!354 = !{!355}
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !351, file: !1, line: 735, type: !80)
!356 = !DISubprogram(name: "gmx_fio_select", scope: !1, file: !1, line: 755, type: !352, isLocal: false, isDefinition: true, scopeLine: 756, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @gmx_fio_select, variables: !357)
!357 = !{!358}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !356, file: !1, line: 755, type: !80)
!359 = !DISubprogram(name: "gmx_fio_setprecision", scope: !1, file: !1, line: 786, type: !360, isLocal: false, isDefinition: true, scopeLine: 787, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @gmx_fio_setprecision, variables: !362)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !80, !80}
!362 = !{!363, !364}
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !359, file: !1, line: 786, type: !80)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDouble", arg: 2, scope: !359, file: !1, line: 786, type: !80)
!365 = !DISubprogram(name: "gmx_fio_getdebug", scope: !1, file: !1, line: 792, type: !154, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @gmx_fio_getdebug, variables: !366)
!366 = !{!367}
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !365, file: !1, line: 792, type: !80)
!368 = !DISubprogram(name: "gmx_fio_setdebug", scope: !1, file: !1, line: 798, type: !360, isLocal: false, isDefinition: true, scopeLine: 799, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @gmx_fio_setdebug, variables: !369)
!369 = !{!370, !371}
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !368, file: !1, line: 798, type: !80)
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bDebug", arg: 2, scope: !368, file: !1, line: 798, type: !80)
!372 = !DISubprogram(name: "gmx_fio_getname", scope: !1, file: !1, line: 804, type: !373, isLocal: false, isDefinition: true, scopeLine: 805, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @gmx_fio_getname, variables: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{!85, !80}
!375 = !{!376}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !372, file: !1, line: 804, type: !80)
!377 = !DISubprogram(name: "gmx_fio_setftp", scope: !1, file: !1, line: 810, type: !360, isLocal: false, isDefinition: true, scopeLine: 811, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @gmx_fio_setftp, variables: !378)
!378 = !{!379, !380}
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fio", arg: 1, scope: !377, file: !1, line: 810, type: !80)
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 2, scope: !377, file: !1, line: 810, type: !80)
