; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/index.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@.str = private unnamed_addr constant [6 x i8] c"block\00", align 1
@.str1 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/index.c\00", align 1
@.str2 = private unnamed_addr constant [13 x i8] c"block->index\00", align 1
@.str3 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str4 = private unnamed_addr constant [8 x i8] c"[ %s ]\0A\00", align 1
@.str5 = private unnamed_addr constant [5 x i8] c"%4d \00", align 1
@.str7 = private unnamed_addr constant [9 x i8] c"b->index\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !12, globals: !331, imports: !367)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/index.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 48, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7, !8}
!5 = !DIEnumerator(name: "etOther", value: 0)
!6 = !DIEnumerator(name: "etProt", value: 1)
!7 = !DIEnumerator(name: "etDNA", value: 2)
!8 = !DIEnumerator(name: "erestNR", value: 3)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !{!13, !81, !87, !108, !120, !131, !204, !210, !225, !236, !271, !275, !283, !292, !296, !299, !307}
!13 = !DISubprogram(name: "__sputc", scope: !14, file: !14, line: 348, type: !15, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !78)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !17, !18}
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 153, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !14, line: 122, size: 1216, align: 64, elements: !21)
!21 = !{!22, !25, !26, !27, !29, !30, !35, !36, !37, !41, !46, !56, !62, !63, !66, !67, !71, !75, !76, !77}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !20, file: !14, line: 123, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !20, file: !14, line: 124, baseType: !17, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !20, file: !14, line: 125, baseType: !17, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !14, line: 126, baseType: !28, size: 16, align: 16, offset: 128)
!28 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !20, file: !14, line: 127, baseType: !28, size: 16, align: 16, offset: 144)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !20, file: !14, line: 128, baseType: !31, size: 128, align: 64, offset: 192)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !14, line: 88, size: 128, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !31, file: !14, line: 89, baseType: !23, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !31, file: !14, line: 90, baseType: !17, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !20, file: !14, line: 129, baseType: !17, size: 32, align: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !20, file: !14, line: 132, baseType: !11, size: 64, align: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !20, file: !14, line: 133, baseType: !38, size: 64, align: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!17, !11}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !20, file: !14, line: 134, baseType: !42, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!17, !11, !45, !17}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !20, file: !14, line: 135, baseType: !47, size: 64, align: 64, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !50, !17}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !14, line: 77, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !52, line: 71, baseType: !53)
!52 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !20, file: !14, line: 136, baseType: !57, size: 64, align: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!17, !11, !60, !17}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !20, file: !14, line: 139, baseType: !31, size: 128, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !20, file: !14, line: 140, baseType: !64, size: 64, align: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !14, line: 94, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !20, file: !14, line: 141, baseType: !17, size: 32, align: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !20, file: !14, line: 144, baseType: !68, size: 24, align: 8, offset: 928)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !20, file: !14, line: 145, baseType: !72, size: 8, align: 8, offset: 952)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !20, file: !14, line: 148, baseType: !31, size: 128, align: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !20, file: !14, line: 151, baseType: !17, size: 32, align: 32, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !14, line: 152, baseType: !50, size: 64, align: 64, offset: 1152)
!78 = !{!79, !80}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !13, file: !14, line: 348, type: !17)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !13, file: !14, line: 348, type: !18)
!81 = !DISubprogram(name: "__sigbits", scope: !82, file: !82, line: 114, type: !83, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !85)
!82 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!83 = !DISubroutineType(types: !84)
!84 = !{!17, !17}
!85 = !{!86}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !81, file: !82, line: 114, type: !17)
!87 = !DISubprogram(name: "new_block", scope: !1, file: !1, line: 69, type: !88, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_block* ()* @new_block, variables: !106)
!88 = !DISubroutineType(types: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !92, line: 52, baseType: !93)
!92 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!93 = !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 36, size: 8448, align: 64, elements: !94)
!94 = !{!95, !99, !100, !104, !105}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !93, file: !92, line: 37, baseType: !96, size: 8192, align: 32)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8192, align: 32, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !93, file: !92, line: 43, baseType: !17, size: 32, align: 32, offset: 8192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !93, file: !92, line: 44, baseType: !101, size: 64, align: 64, offset: 8256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !103, line: 73, baseType: !17)
!103 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !93, file: !92, line: 45, baseType: !17, size: 32, align: 32, offset: 8320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !93, file: !92, line: 46, baseType: !101, size: 64, align: 64, offset: 8384)
!106 = !{!107}
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "block", scope: !87, file: !1, line: 71, type: !90)
!108 = !DISubprogram(name: "write_index", scope: !1, file: !1, line: 79, type: !109, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_block*, i8**)* @write_index, variables: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !45, !90, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!112 = !{!113, !114, !115, !116, !117, !118, !119}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outf", arg: 1, scope: !108, file: !1, line: 79, type: !45)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !108, file: !1, line: 79, type: !90)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnames", arg: 3, scope: !108, file: !1, line: 79, type: !111)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !108, file: !1, line: 81, type: !18)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !108, file: !1, line: 82, type: !17)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !108, file: !1, line: 82, type: !17)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !108, file: !1, line: 82, type: !17)
!120 = !DISubprogram(name: "add_grp", scope: !1, file: !1, line: 98, type: !121, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_block*, i8***, i32, i32*, i8*)* @add_grp, variables: !124)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !90, !123, !17, !101, !45}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !120, file: !1, line: 98, type: !90)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gnames", arg: 2, scope: !120, file: !1, line: 98, type: !123)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nra", arg: 3, scope: !120, file: !1, line: 98, type: !17)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 4, scope: !120, file: !1, line: 98, type: !101)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 5, scope: !120, file: !1, line: 98, type: !45)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !120, file: !1, line: 100, type: !17)
!131 = !DISubprogram(name: "mk_aid", scope: !1, file: !1, line: 146, type: !132, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i32* (%struct.t_atoms*, i32*, i32, i32*, i32)* @mk_aid, variables: !196)
!132 = !DISubroutineType(types: !133)
!133 = !{!101, !134, !194, !195, !176, !17}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !136, line: 94, baseType: !137)
!136 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!137 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 75, size: 10240, align: 64, elements: !138)
!138 = !{!139, !140, !161, !162, !163, !164, !165, !166, !167, !168, !169, !177}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !137, file: !136, line: 76, baseType: !17, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !137, file: !136, line: 77, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !136, line: 57, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 48, size: 320, align: 32, elements: !144)
!144 = !{!145, !148, !149, !150, !151, !153, !154, !155, !156, !160}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !143, file: !136, line: 49, baseType: !146, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !103, line: 87, baseType: !147)
!147 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !143, file: !136, line: 49, baseType: !146, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !143, file: !136, line: 50, baseType: !146, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !143, file: !136, line: 50, baseType: !146, size: 32, align: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !136, line: 51, baseType: !152, size: 16, align: 16, offset: 128)
!152 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !143, file: !136, line: 52, baseType: !152, size: 16, align: 16, offset: 144)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !143, file: !136, line: 53, baseType: !17, size: 32, align: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !143, file: !136, line: 54, baseType: !17, size: 32, align: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !143, file: !136, line: 55, baseType: !157, size: 72, align: 8, offset: 224)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 72, align: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 9)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !143, file: !136, line: 56, baseType: !24, size: 8, align: 8, offset: 296)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !137, file: !136, line: 80, baseType: !123, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !137, file: !136, line: 82, baseType: !123, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !137, file: !136, line: 84, baseType: !123, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !137, file: !136, line: 86, baseType: !17, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !137, file: !136, line: 87, baseType: !123, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !137, file: !136, line: 89, baseType: !17, size: 32, align: 32, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !137, file: !136, line: 90, baseType: !123, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !137, file: !136, line: 91, baseType: !91, size: 8448, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !137, file: !136, line: 92, baseType: !170, size: 1152, align: 64, offset: 9024)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 1152, align: 64, elements: !158)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !136, line: 73, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 70, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !172, file: !136, line: 71, baseType: !17, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !172, file: !136, line: 72, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !137, file: !136, line: 93, baseType: !178, size: 64, align: 64, offset: 10176)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !136, line: 68, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 59, size: 416, align: 32, elements: !181)
!181 = !{!182, !183, !184, !185, !189, !190, !191, !192}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !136, line: 60, baseType: !17, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !180, file: !136, line: 61, baseType: !17, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !180, file: !136, line: 62, baseType: !10, size: 8, align: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !180, file: !136, line: 63, baseType: !186, size: 48, align: 8, offset: 72)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 48, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 6)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !180, file: !136, line: 64, baseType: !146, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !180, file: !136, line: 65, baseType: !146, size: 32, align: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !180, file: !136, line: 66, baseType: !17, size: 32, align: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !180, file: !136, line: 67, baseType: !193, size: 192, align: 32, offset: 224)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 192, align: 32, elements: !187)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "eRestp", file: !1, line: 48, baseType: !3)
!196 = !{!197, !198, !199, !200, !201, !202, !203}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !131, file: !1, line: 146, type: !134)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restp", arg: 2, scope: !131, file: !1, line: 146, type: !194)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "res", arg: 3, scope: !131, file: !1, line: 146, type: !195)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nra", arg: 4, scope: !131, file: !1, line: 146, type: !176)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bTrue", arg: 5, scope: !131, file: !1, line: 147, type: !17)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !131, file: !1, line: 152, type: !101)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !131, file: !1, line: 153, type: !17)
!204 = !DISubprogram(name: "is_protein", scope: !1, file: !1, line: 401, type: !205, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @is_protein, variables: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{!17, !45}
!207 = !{!208, !209}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resnm", arg: 1, scope: !204, file: !1, line: 401, type: !45)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !204, file: !1, line: 406, type: !17)
!210 = !DISubprogram(name: "analyse", scope: !1, file: !1, line: 420, type: !211, isLocal: false, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_atoms*, %struct.t_block*, i8***, i32, i32)* @analyse, variables: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !134, !90, !123, !17, !17}
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 1, scope: !210, file: !1, line: 420, type: !134)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gb", arg: 2, scope: !210, file: !1, line: 420, type: !90)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gn", arg: 3, scope: !210, file: !1, line: 420, type: !123)
!217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bASK", arg: 4, scope: !210, file: !1, line: 420, type: !17)
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bVerb", arg: 5, scope: !210, file: !1, line: 420, type: !17)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restp", scope: !210, file: !1, line: 422, type: !194)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resnm", scope: !210, file: !1, line: 423, type: !45)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aid", scope: !210, file: !1, line: 424, type: !101)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !210, file: !1, line: 425, type: !17)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !210, file: !1, line: 426, type: !17)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !210, file: !1, line: 426, type: !17)
!225 = !DISubprogram(name: "p_status", scope: !1, file: !1, line: 132, type: !226, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, variables: !228)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !17, !194, !17}
!228 = !{!229, !230, !231, !232, !233, !234}
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nres", arg: 1, scope: !225, file: !1, line: 132, type: !17)
!230 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restp", arg: 2, scope: !225, file: !1, line: 132, type: !194)
