; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/init_sh.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }
%struct.t_nblist = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32, i32* }
%struct.t_graph = type { i32, i32, i32, i32, i32, i32*, i32**, [3 x i32]* }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !60, subprograms: !65, globals: !477, imports: !477)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/init_sh.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !12}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "eptAtom", value: 0)
!7 = !DIEnumerator(name: "eptNucleus", value: 1)
!8 = !DIEnumerator(name: "eptShell", value: 2)
!9 = !DIEnumerator(name: "eptBond", value: 3)
!10 = !DIEnumerator(name: "eptDummy", value: 4)
!11 = !DIEnumerator(name: "eptNR", value: 5)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 49, size: 32, align: 32, elements: !14)
!13 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!15 = !DIEnumerator(name: "F_BONDS", value: 0)
!16 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!17 = !DIEnumerator(name: "F_MORSE", value: 2)
!18 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!19 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!20 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!21 = !DIEnumerator(name: "F_ANGLES", value: 6)
!22 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!23 = !DIEnumerator(name: "F_PDIHS", value: 8)
!24 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!25 = !DIEnumerator(name: "F_IDIHS", value: 10)
!26 = !DIEnumerator(name: "F_LJ14", value: 11)
!27 = !DIEnumerator(name: "F_COUL14", value: 12)
!28 = !DIEnumerator(name: "F_LJ", value: 13)
!29 = !DIEnumerator(name: "F_BHAM", value: 14)
!30 = !DIEnumerator(name: "F_LJLR", value: 15)
!31 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!32 = !DIEnumerator(name: "F_SR", value: 17)
!33 = !DIEnumerator(name: "F_LR", value: 18)
!34 = !DIEnumerator(name: "F_WPOL", value: 19)
!35 = !DIEnumerator(name: "F_POSRES", value: 20)
!36 = !DIEnumerator(name: "F_DISRES", value: 21)
!37 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!38 = !DIEnumerator(name: "F_ORIRES", value: 23)
!39 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!40 = !DIEnumerator(name: "F_ANGRES", value: 25)
!41 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!42 = !DIEnumerator(name: "F_SHAKE", value: 27)
!43 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!44 = !DIEnumerator(name: "F_SETTLE", value: 29)
!45 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!46 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!47 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!48 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!49 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!50 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!51 = !DIEnumerator(name: "F_EQM", value: 36)
!52 = !DIEnumerator(name: "F_EPOT", value: 37)
!53 = !DIEnumerator(name: "F_EKIN", value: 38)
!54 = !DIEnumerator(name: "F_ETOT", value: 39)
!55 = !DIEnumerator(name: "F_TEMP", value: 40)
!56 = !DIEnumerator(name: "F_PRES", value: 41)
!57 = !DIEnumerator(name: "F_DVDL", value: 42)
!58 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!59 = !DIEnumerator(name: "F_NRE", value: 44)
!60 = !{!61, !62, !63}
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !64, line: 73, baseType: !62)
!64 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!65 = !{!66, !134, !140, !147, !153, !159, !162, !165, !168, !171, !174, !177, !186, !195, !208, !211, !214, !217, !231, !245, !251, !257, !469}
!66 = !DISubprogram(name: "__sputc", scope: !67, file: !67, line: 348, type: !68, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !131)
!67 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DISubroutineType(types: !69)
!69 = !{!62, !62, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !67, line: 153, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !67, line: 122, size: 1216, align: 64, elements: !73)
!73 = !{!74, !77, !78, !79, !81, !82, !87, !88, !90, !94, !99, !109, !115, !116, !119, !120, !124, !128, !129, !130}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !72, file: !67, line: 123, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !72, file: !67, line: 124, baseType: !62, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !72, file: !67, line: 125, baseType: !62, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !67, line: 126, baseType: !80, size: 16, align: 16, offset: 128)
!80 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !72, file: !67, line: 127, baseType: !80, size: 16, align: 16, offset: 144)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !72, file: !67, line: 128, baseType: !83, size: 128, align: 64, offset: 192)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !67, line: 88, size: 128, align: 64, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !83, file: !67, line: 89, baseType: !75, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !83, file: !67, line: 90, baseType: !62, size: 32, align: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !72, file: !67, line: 129, baseType: !62, size: 32, align: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !72, file: !67, line: 132, baseType: !89, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !72, file: !67, line: 133, baseType: !91, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!62, !89}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !72, file: !67, line: 134, baseType: !95, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!62, !89, !98, !62}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !72, file: !67, line: 135, baseType: !100, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !89, !103, !62}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !67, line: 77, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 46, baseType: !108)
!107 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!108 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !72, file: !67, line: 136, baseType: !110, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!62, !89, !113, !62}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !72, file: !67, line: 139, baseType: !83, size: 128, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !72, file: !67, line: 140, baseType: !117, size: 64, align: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !67, line: 94, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !72, file: !67, line: 141, baseType: !62, size: 32, align: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !72, file: !67, line: 144, baseType: !121, size: 24, align: 8, offset: 928)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 3)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !72, file: !67, line: 145, baseType: !125, size: 8, align: 8, offset: 952)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !72, file: !67, line: 148, baseType: !83, size: 128, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !72, file: !67, line: 151, baseType: !62, size: 32, align: 32, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !67, line: 152, baseType: !103, size: 64, align: 64, offset: 1152)
!131 = !{!132, !133}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !66, file: !67, line: 348, type: !62)
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !66, file: !67, line: 348, type: !70)
!134 = !DISubprogram(name: "__sigbits", scope: !135, file: !135, line: 114, type: !136, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !138)
!135 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!136 = !DISubroutineType(types: !137)
!137 = !{!62, !62}
!138 = !{!139}
!139 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !134, file: !135, line: 114, type: !62)
!140 = !DISubprogram(name: "__inline_isfinitef", scope: !141, file: !141, line: 204, type: !142, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !145)
!141 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!142 = !DISubroutineType(types: !143)
!143 = !{!62, !144}
!144 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!145 = !{!146}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !140, file: !141, line: 204, type: !144)
!147 = !DISubprogram(name: "__inline_isfinited", scope: !141, file: !141, line: 207, type: !148, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !151)
!148 = !DISubroutineType(types: !149)
!149 = !{!62, !150}
!150 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!151 = !{!152}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !147, file: !141, line: 207, type: !150)
!153 = !DISubprogram(name: "__inline_isfinitel", scope: !141, file: !141, line: 210, type: !154, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !157)
!154 = !DISubroutineType(types: !155)
!155 = !{!62, !156}
!156 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!157 = !{!158}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !153, file: !141, line: 210, type: !156)
!159 = !DISubprogram(name: "__inline_isinff", scope: !141, file: !141, line: 213, type: !142, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !160)
!160 = !{!161}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !159, file: !141, line: 213, type: !144)
!162 = !DISubprogram(name: "__inline_isinfd", scope: !141, file: !141, line: 216, type: !148, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !163)
!163 = !{!164}
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !162, file: !141, line: 216, type: !150)
!165 = !DISubprogram(name: "__inline_isinfl", scope: !141, file: !141, line: 219, type: !154, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !166)
!166 = !{!167}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !165, file: !141, line: 219, type: !156)
!168 = !DISubprogram(name: "__inline_isnanf", scope: !141, file: !141, line: 222, type: !142, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !169)
!169 = !{!170}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !168, file: !141, line: 222, type: !144)
!171 = !DISubprogram(name: "__inline_isnand", scope: !141, file: !141, line: 225, type: !148, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !172)
!172 = !{!173}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !171, file: !141, line: 225, type: !150)
!174 = !DISubprogram(name: "__inline_isnanl", scope: !141, file: !141, line: 228, type: !154, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !175)
!175 = !{!176}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !174, file: !141, line: 228, type: !156)
!177 = !DISubprogram(name: "__inline_signbitf", scope: !141, file: !141, line: 231, type: !142, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !178)
!178 = !{!179, !180}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !177, file: !141, line: 231, type: !144)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !177, file: !141, line: 232, type: !181)
!181 = !DICompositeType(tag: DW_TAG_union_type, scope: !177, file: !141, line: 232, size: 32, align: 32, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !181, file: !141, line: 232, baseType: !144, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !181, file: !141, line: 232, baseType: !185, size: 32, align: 32)
!185 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!186 = !DISubprogram(name: "__inline_signbitd", scope: !141, file: !141, line: 236, type: !148, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !187)
!187 = !{!188, !189}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !141, line: 236, type: !150)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !186, file: !141, line: 237, type: !190)
!190 = !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !141, line: 237, size: 64, align: 64, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !190, file: !141, line: 237, baseType: !150, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !190, file: !141, line: 237, baseType: !194, size: 64, align: 64)
!194 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!195 = !DISubprogram(name: "__inline_signbitl", scope: !141, file: !141, line: 242, type: !154, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !196)
!196 = !{!197, !198}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !195, file: !141, line: 242, type: !156)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !195, file: !141, line: 246, type: !199)
!199 = !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !141, line: 243, size: 128, align: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !199, file: !141, line: 244, baseType: !156, size: 128, align: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !199, file: !141, line: 245, baseType: !203, size: 128, align: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !141, line: 245, size: 128, align: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !203, file: !141, line: 245, baseType: !194, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !203, file: !141, line: 245, baseType: !207, size: 16, align: 16, offset: 64)
!207 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!208 = !DISubprogram(name: "__inline_isnormalf", scope: !141, file: !141, line: 257, type: !142, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !209)
!209 = !{!210}
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !208, file: !141, line: 257, type: !144)
!211 = !DISubprogram(name: "__inline_isnormald", scope: !141, file: !141, line: 260, type: !148, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !212)
!212 = !{!213}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !211, file: !141, line: 260, type: !150)
!214 = !DISubprogram(name: "__inline_isnormall", scope: !141, file: !141, line: 263, type: !154, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !215)
!215 = !{!216}
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !214, file: !141, line: 263, type: !156)
!217 = !DISubprogram(name: "__sincosf", scope: !141, file: !141, line: 642, type: !218, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !221)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !144, !220, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!221 = !{!222, !223, !224, !225}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !217, file: !141, line: 642, type: !144)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !217, file: !141, line: 642, type: !220)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !217, file: !141, line: 642, type: !220)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !217, file: !141, line: 643, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !141, line: 634, size: 64, align: 32, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !227, file: !141, line: 634, baseType: !144, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !227, file: !141, line: 634, baseType: !144, size: 32, align: 32, offset: 32)
!231 = !DISubprogram(name: "__sincos", scope: !141, file: !141, line: 647, type: !232, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !235)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !150, !234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!235 = !{!236, !237, !238, !239}
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !231, file: !141, line: 647, type: !150)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !231, file: !141, line: 647, type: !234)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !231, file: !141, line: 647, type: !234)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !231, file: !141, line: 648, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !141, line: 635, size: 128, align: 64, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !241, file: !141, line: 635, baseType: !150, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !241, file: !141, line: 635, baseType: !150, size: 64, align: 64, offset: 64)
!245 = !DISubprogram(name: "__sincospif", scope: !141, file: !141, line: 652, type: !218, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !245, file: !141, line: 652, type: !144)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !245, file: !141, line: 652, type: !220)
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !245, file: !141, line: 652, type: !220)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !245, file: !141, line: 653, type: !226)
!251 = !DISubprogram(name: "__sincospi", scope: !141, file: !141, line: 657, type: !232, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !251, file: !141, line: 657, type: !150)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !251, file: !141, line: 657, type: !234)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !251, file: !141, line: 657, type: !234)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !251, file: !141, line: 658, type: !240)
!257 = !DISubprogram(name: "init_shells", scope: !1, file: !1, line: 59, type: !258, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_shell* (%struct.__sFILE*, i32, i32, %struct.t_idef*, %struct.t_mdatoms*, i32*)* @init_shells, variables: !442)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !70, !62, !62, !273, !411, !427}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_shell", file: !262, line: 66, baseType: !263)
!262 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/xmdrun.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!263 = !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 60, size: 224, align: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !272}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nnucl", scope: !263, file: !262, line: 61, baseType: !62, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !263, file: !262, line: 62, baseType: !63, size: 32, align: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nucl1", scope: !263, file: !262, line: 63, baseType: !63, size: 32, align: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nucl2", scope: !263, file: !262, line: 63, baseType: !63, size: 32, align: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nucl3", scope: !263, file: !262, line: 63, baseType: !63, size: 32, align: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !263, file: !262, line: 64, baseType: !271, size: 32, align: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !64, line: 87, baseType: !144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "k_1", scope: !263, file: !262, line: 65, baseType: !271, size: 32, align: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !13, line: 188, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 179, size: 366336, align: 64, elements: !276)
!276 = !{!277, !278, !279, !280, !283, !396}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !275, file: !13, line: 181, baseType: !62, size: 32, align: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !275, file: !13, line: 182, baseType: !62, size: 32, align: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !275, file: !13, line: 183, baseType: !62, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !275, file: !13, line: 184, baseType: !281, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !13, line: 133, baseType: !62)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !275, file: !13, line: 185, baseType: !284, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !13, line: 131, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 97, size: 192, align: 32, elements: !287)
!287 = !{!288, !294, !301, !307, !316, !321, !328, !336, !341, !346, !352, !358, !365, !374, !383, !392}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !286, file: !13, line: 105, baseType: !289, size: 96, align: 32)
!289 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 105, size: 96, align: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !289, file: !13, line: 105, baseType: !271, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !289, file: !13, line: 105, baseType: !271, size: 32, align: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !289, file: !13, line: 105, baseType: !271, size: 32, align: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !286, file: !13, line: 106, baseType: !295, size: 128, align: 32)
!295 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 106, size: 128, align: 32, elements: !296)
!296 = !{!297, !298, !299, !300}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !295, file: !13, line: 106, baseType: !271, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !295, file: !13, line: 106, baseType: !271, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !295, file: !13, line: 106, baseType: !271, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !295, file: !13, line: 106, baseType: !271, size: 32, align: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !286, file: !13, line: 108, baseType: !302, size: 96, align: 32)
!302 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 108, size: 96, align: 32, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !302, file: !13, line: 108, baseType: !271, size: 32, align: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !302, file: !13, line: 108, baseType: !271, size: 32, align: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !302, file: !13, line: 108, baseType: !271, size: 32, align: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !286, file: !13, line: 110, baseType: !308, size: 192, align: 32)
!308 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 110, size: 192, align: 32, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !308, file: !13, line: 110, baseType: !271, size: 32, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !308, file: !13, line: 110, baseType: !271, size: 32, align: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !308, file: !13, line: 110, baseType: !271, size: 32, align: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !308, file: !13, line: 110, baseType: !271, size: 32, align: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !308, file: !13, line: 110, baseType: !271, size: 32, align: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !308, file: !13, line: 110, baseType: !271, size: 32, align: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !286, file: !13, line: 111, baseType: !317, size: 64, align: 32)
!317 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 111, size: 64, align: 32, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !317, file: !13, line: 111, baseType: !271, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !317, file: !13, line: 111, baseType: !271, size: 32, align: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !286, file: !13, line: 112, baseType: !322, size: 128, align: 32)
!322 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 112, size: 128, align: 32, elements: !323)
!323 = !{!324, !325, !326, !327}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !322, file: !13, line: 112, baseType: !271, size: 32, align: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !322, file: !13, line: 112, baseType: !271, size: 32, align: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !322, file: !13, line: 112, baseType: !271, size: 32, align: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !322, file: !13, line: 112, baseType: !271, size: 32, align: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !286, file: !13, line: 117, baseType: !329, size: 160, align: 32)
!329 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 117, size: 160, align: 32, elements: !330)
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !329, file: !13, line: 117, baseType: !271, size: 32, align: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !329, file: !13, line: 117, baseType: !271, size: 32, align: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !329, file: !13, line: 117, baseType: !62, size: 32, align: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !329, file: !13, line: 117, baseType: !271, size: 32, align: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !329, file: !13, line: 117, baseType: !271, size: 32, align: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !286, file: !13, line: 118, baseType: !337, size: 64, align: 32)
!337 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 118, size: 64, align: 32, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !337, file: !13, line: 118, baseType: !271, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !337, file: !13, line: 118, baseType: !271, size: 32, align: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !286, file: !13, line: 123, baseType: !342, size: 64, align: 32)
!342 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 123, size: 64, align: 32, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !342, file: !13, line: 123, baseType: !271, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !342, file: !13, line: 123, baseType: !271, size: 32, align: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !286, file: !13, line: 124, baseType: !347, size: 96, align: 32)
!347 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 124, size: 96, align: 32, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !347, file: !13, line: 124, baseType: !271, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !347, file: !13, line: 124, baseType: !271, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !347, file: !13, line: 124, baseType: !271, size: 32, align: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !286, file: !13, line: 125, baseType: !353, size: 192, align: 32)
!353 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 125, size: 192, align: 32, elements: !354)
!354 = !{!355, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !353, file: !13, line: 125, baseType: !356, size: 96, align: 32)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 96, align: 32, elements: !122)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !353, file: !13, line: 125, baseType: !356, size: 96, align: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !286, file: !13, line: 126, baseType: !359, size: 192, align: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 126, size: 192, align: 32, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !359, file: !13, line: 126, baseType: !362, size: 192, align: 32)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 192, align: 32, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 6)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !286, file: !13, line: 127, baseType: !366, size: 192, align: 32)
!366 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 127, size: 192, align: 32, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !366, file: !13, line: 127, baseType: !271, size: 32, align: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !366, file: !13, line: 127, baseType: !271, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !366, file: !13, line: 127, baseType: !271, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !366, file: !13, line: 127, baseType: !271, size: 32, align: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !366, file: !13, line: 127, baseType: !271, size: 32, align: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !366, file: !13, line: 127, baseType: !271, size: 32, align: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !286, file: !13, line: 128, baseType: !375, size: 192, align: 32)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 128, size: 192, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !375, file: !13, line: 128, baseType: !271, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !375, file: !13, line: 128, baseType: !271, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !375, file: !13, line: 128, baseType: !271, size: 32, align: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !375, file: !13, line: 128, baseType: !271, size: 32, align: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !13, line: 128, baseType: !62, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !375, file: !13, line: 128, baseType: !62, size: 32, align: 32, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !286, file: !13, line: 129, baseType: !384, size: 192, align: 32)
!384 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 129, size: 192, align: 32, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !384, file: !13, line: 129, baseType: !62, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !384, file: !13, line: 129, baseType: !62, size: 32, align: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !384, file: !13, line: 129, baseType: !62, size: 32, align: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !384, file: !13, line: 129, baseType: !271, size: 32, align: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !384, file: !13, line: 129, baseType: !271, size: 32, align: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !384, file: !13, line: 129, baseType: !271, size: 32, align: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !286, file: !13, line: 130, baseType: !393, size: 192, align: 32)
!393 = !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !13, line: 130, size: 192, align: 32, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !393, file: !13, line: 130, baseType: !362, size: 192, align: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !275, file: !13, line: 187, baseType: !397, size: 366080, align: 64, offset: 256)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 366080, align: 64, elements: !409)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !13, line: 140, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 135, size: 8320, align: 64, elements: !400)
!400 = !{!401, !402, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !399, file: !13, line: 137, baseType: !62, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !399, file: !13, line: 138, baseType: !403, size: 8192, align: 32, offset: 32)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8192, align: 32, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !399, file: !13, line: 139, baseType: !407, size: 64, align: 64, offset: 8256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !13, line: 45, baseType: !63)
!409 = !{!410}
!410 = !DISubrange(count: 44)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !413, line: 51, baseType: !414)
!413 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 40, size: 1408, align: 64, elements: !415)
!415 = !{!416, !417, !418, !420, !421, !422, !423, !424, !425, !426, !428, !429, !430, !431, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !414, file: !413, line: 41, baseType: !271, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !414, file: !413, line: 42, baseType: !62, size: 32, align: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !414, file: !413, line: 43, baseType: !419, size: 64, align: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !414, file: !413, line: 43, baseType: !419, size: 64, align: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !414, file: !413, line: 43, baseType: !419, size: 64, align: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !414, file: !413, line: 43, baseType: !419, size: 64, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !414, file: !413, line: 44, baseType: !419, size: 64, align: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !414, file: !413, line: 44, baseType: !419, size: 64, align: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !414, file: !413, line: 44, baseType: !419, size: 64, align: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !414, file: !413, line: 45, baseType: !427, size: 64, align: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !414, file: !413, line: 46, baseType: !427, size: 64, align: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !414, file: !413, line: 47, baseType: !427, size: 64, align: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !414, file: !413, line: 47, baseType: !427, size: 64, align: 64, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !414, file: !413, line: 48, baseType: !432, size: 64, align: 64, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !414, file: !413, line: 49, baseType: !432, size: 64, align: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !414, file: !413, line: 49, baseType: !432, size: 64, align: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !414, file: !413, line: 49, baseType: !432, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !414, file: !413, line: 49, baseType: !432, size: 64, align: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !414, file: !413, line: 49, baseType: !432, size: 64, align: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !414, file: !413, line: 49, baseType: !432, size: 64, align: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !414, file: !413, line: 50, baseType: !432, size: 64, align: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !414, file: !413, line: 50, baseType: !432, size: 64, align: 64, offset: 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !414, file: !413, line: 50, baseType: !432, size: 64, align: 64, offset: 1344)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !257, file: !1, line: 59, type: !70)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !257, file: !1, line: 59, type: !62)
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 3, scope: !257, file: !1, line: 59, type: !62)
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 4, scope: !257, file: !1, line: 60, type: !273)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 5, scope: !257, file: !1, line: 60, type: !411)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nshell", arg: 6, scope: !257, file: !1, line: 60, type: !427)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shell", scope: !257, file: !1, line: 62, type: !260)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shell_index", scope: !257, file: !1, line: 63, type: !427)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !257, file: !1, line: 64, type: !452)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, align: 32, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns", scope: !257, file: !1, line: 64, type: !62)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsi", scope: !257, file: !1, line: 64, type: !62)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !257, file: !1, line: 65, type: !62)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !257, file: !1, line: 65, type: !62)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !257, file: !1, line: 65, type: !62)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftype", scope: !257, file: !1, line: 65, type: !62)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !257, file: !1, line: 65, type: !62)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt1", scope: !257, file: !1, line: 66, type: !62)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt2", scope: !257, file: !1, line: 66, type: !62)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !257, file: !1, line: 66, type: !62)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !257, file: !1, line: 66, type: !62)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bS1", scope: !257, file: !1, line: 67, type: !62)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bS2", scope: !257, file: !1, line: 67, type: !62)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !257, file: !1, line: 68, type: !407)
!469 = !DISubprogram(name: "pr_shell", scope: !1, file: !1, line: 38, type: !470, isLocal: true, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_shell*)* @pr_shell, variables: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !70, !62, !260}
!472 = !{!473, !474, !475, !476}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !469, file: !1, line: 38, type: !70)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ns", arg: 2, scope: !469, file: !1, line: 38, type: !62)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 3, scope: !469, file: !1, line: 38, type: !260)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !469, file: !1, line: 40, type: !62)
!477 = !{}
!478 = !{i32 2, !"Dwarf Version", i32 2}
!479 = !{i32 2, !"Debug Info Version", i32 700000003}
!480 = !{i32 1, !"PIC Level", i32 2}
!481 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!482 = !DIExpression()
