; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/libxdrf.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }

@xdropen.init_done = internal unnamed_addr global i1 false
@xdridptr = internal unnamed_addr global [20 x %struct.XDR*] zeroinitializer, align 16
@xdrfiles = internal unnamed_addr global [20 x %struct.__sFILE*] zeroinitializer, align 16
@xdrmodes = internal unnamed_addr global [20 x i8] zeroinitializer, align 16
@__stderrp = external global %struct.__sFILE*
@.str3 = private unnamed_addr constant [33 x i8] c"xdrclose: passed a NULL pointer\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !78, globals: !413, imports: !430)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/libxdrf.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !4, line: 119, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/gmx_system_xdr.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !{!10, !11, !12, !13, !64, !34, !35, !69, !73, !74, !75, !76}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 144, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 145, size: 384, align: 64, elements: !16)
!16 = !{!17, !18, !60, !61, !62, !63}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !15, file: !4, line: 147, baseType: !3, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !15, file: !4, line: 171, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 148, size: 640, align: 64, elements: !21)
!21 = !{!22, !29, !30, !36, !37, !41, !45, !51, !55, !59}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !20, file: !4, line: 150, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !13, !27}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !4, line: 99, baseType: !10)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !20, file: !4, line: 152, baseType: !23, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !20, file: !4, line: 154, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!26, !13, !34, !35}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !20, file: !4, line: 156, baseType: !31, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !20, file: !4, line: 158, baseType: !38, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!35, !13}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !20, file: !4, line: 160, baseType: !42, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!26, !13, !35}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !20, file: !4, line: 162, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !13, !10}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdr_int32_t", file: !4, line: 106, baseType: !10)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !20, file: !4, line: 164, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !13}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !20, file: !4, line: 166, baseType: !56, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!26, !13, !49}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !20, file: !4, line: 168, baseType: !56, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !15, file: !4, line: 172, baseType: !34, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !15, file: !4, line: 173, baseType: !34, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !15, file: !4, line: 174, baseType: !34, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !15, file: !4, line: 175, baseType: !10, size: 32, align: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 30, baseType: !66)
!65 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !67, line: 92, baseType: !68)
!67 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !4, line: 187, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!26, !13, !12, null}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!74 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!79, !85, !91, !97, !100, !103, !106, !109, !112, !115, !123, !132, !145, !148, !151, !154, !168, !182, !188, !194, !257, !263, !276, !282, !336, !344, !360, !371, !385, !397}
!79 = !DISubprogram(name: "__inline_isfinitef", scope: !80, file: !80, line: 204, type: !81, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !83)
!80 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!81 = !DISubroutineType(types: !82)
!82 = !{!10, !74}
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !79, file: !80, line: 204, type: !74)
!85 = !DISubprogram(name: "__inline_isfinited", scope: !80, file: !80, line: 207, type: !86, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !89)
!86 = !DISubroutineType(types: !87)
!87 = !{!10, !88}
!88 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!89 = !{!90}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !85, file: !80, line: 207, type: !88)
!91 = !DISubprogram(name: "__inline_isfinitel", scope: !80, file: !80, line: 210, type: !92, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !95)
!92 = !DISubroutineType(types: !93)
!93 = !{!10, !94}
!94 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!95 = !{!96}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !91, file: !80, line: 210, type: !94)
!97 = !DISubprogram(name: "__inline_isinff", scope: !80, file: !80, line: 213, type: !81, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !98)
!98 = !{!99}
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !97, file: !80, line: 213, type: !74)
!100 = !DISubprogram(name: "__inline_isinfd", scope: !80, file: !80, line: 216, type: !86, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !101)
!101 = !{!102}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !100, file: !80, line: 216, type: !88)
!103 = !DISubprogram(name: "__inline_isinfl", scope: !80, file: !80, line: 219, type: !92, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !104)
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !103, file: !80, line: 219, type: !94)
!106 = !DISubprogram(name: "__inline_isnanf", scope: !80, file: !80, line: 222, type: !81, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !106, file: !80, line: 222, type: !74)
!109 = !DISubprogram(name: "__inline_isnand", scope: !80, file: !80, line: 225, type: !86, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !110)
!110 = !{!111}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !109, file: !80, line: 225, type: !88)
!112 = !DISubprogram(name: "__inline_isnanl", scope: !80, file: !80, line: 228, type: !92, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !113)
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !112, file: !80, line: 228, type: !94)
!115 = !DISubprogram(name: "__inline_signbitf", scope: !80, file: !80, line: 231, type: !81, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !116)
!116 = !{!117, !118}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !115, file: !80, line: 231, type: !74)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !115, file: !80, line: 232, type: !119)
!119 = !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !80, line: 232, size: 32, align: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !119, file: !80, line: 232, baseType: !74, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !119, file: !80, line: 232, baseType: !35, size: 32, align: 32)
!123 = !DISubprogram(name: "__inline_signbitd", scope: !80, file: !80, line: 236, type: !86, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !124)
!124 = !{!125, !126}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !123, file: !80, line: 236, type: !88)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !123, file: !80, line: 237, type: !127)
!127 = !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !80, line: 237, size: 64, align: 64, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !127, file: !80, line: 237, baseType: !88, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !127, file: !80, line: 237, baseType: !131, size: 64, align: 64)
!131 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!132 = !DISubprogram(name: "__inline_signbitl", scope: !80, file: !80, line: 242, type: !92, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !133)
!133 = !{!134, !135}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !132, file: !80, line: 242, type: !94)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !132, file: !80, line: 246, type: !136)
!136 = !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !80, line: 243, size: 128, align: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !136, file: !80, line: 244, baseType: !94, size: 128, align: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !136, file: !80, line: 245, baseType: !140, size: 128, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !80, line: 245, size: 128, align: 64, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !140, file: !80, line: 245, baseType: !131, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !140, file: !80, line: 245, baseType: !144, size: 16, align: 16, offset: 64)
!144 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!145 = !DISubprogram(name: "__inline_isnormalf", scope: !80, file: !80, line: 257, type: !81, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !146)
!146 = !{!147}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !145, file: !80, line: 257, type: !74)
!148 = !DISubprogram(name: "__inline_isnormald", scope: !80, file: !80, line: 260, type: !86, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !149)
!149 = !{!150}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !148, file: !80, line: 260, type: !88)
!151 = !DISubprogram(name: "__inline_isnormall", scope: !80, file: !80, line: 263, type: !92, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !152)
!152 = !{!153}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !151, file: !80, line: 263, type: !94)
!154 = !DISubprogram(name: "__sincosf", scope: !80, file: !80, line: 642, type: !155, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !158)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !74, !157, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!158 = !{!159, !160, !161, !162}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !154, file: !80, line: 642, type: !74)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !154, file: !80, line: 642, type: !157)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !154, file: !80, line: 642, type: !157)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !154, file: !80, line: 643, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !80, line: 634, size: 64, align: 32, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !164, file: !80, line: 634, baseType: !74, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !164, file: !80, line: 634, baseType: !74, size: 32, align: 32, offset: 32)
!168 = !DISubprogram(name: "__sincos", scope: !80, file: !80, line: 647, type: !169, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !172)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !88, !171, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!172 = !{!173, !174, !175, !176}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !168, file: !80, line: 647, type: !88)
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !168, file: !80, line: 647, type: !171)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !168, file: !80, line: 647, type: !171)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !168, file: !80, line: 648, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !80, line: 635, size: 128, align: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !178, file: !80, line: 635, baseType: !88, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !178, file: !80, line: 635, baseType: !88, size: 64, align: 64, offset: 64)
!182 = !DISubprogram(name: "__sincospif", scope: !80, file: !80, line: 652, type: !155, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !182, file: !80, line: 652, type: !74)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !182, file: !80, line: 652, type: !157)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !182, file: !80, line: 652, type: !157)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !182, file: !80, line: 653, type: !163)
!188 = !DISubprogram(name: "__sincospi", scope: !80, file: !80, line: 657, type: !169, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !189)
!189 = !{!190, !191, !192, !193}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !188, file: !80, line: 657, type: !88)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !188, file: !80, line: 657, type: !171)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !188, file: !80, line: 657, type: !171)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !188, file: !80, line: 658, type: !177)
!194 = !DISubprogram(name: "__sputc", scope: !195, file: !195, line: 348, type: !196, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !254)
!195 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!196 = !DISubroutineType(types: !197)
!197 = !{!10, !10, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !195, line: 153, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !195, line: 122, size: 1216, align: 64, elements: !201)
!201 = !{!202, !203, !204, !205, !207, !208, !213, !214, !215, !219, !223, !232, !238, !239, !242, !243, !247, !251, !252, !253}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !200, file: !195, line: 123, baseType: !76, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !200, file: !195, line: 124, baseType: !10, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !200, file: !195, line: 125, baseType: !10, size: 32, align: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !200, file: !195, line: 126, baseType: !206, size: 16, align: 16, offset: 128)
!206 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !200, file: !195, line: 127, baseType: !206, size: 16, align: 16, offset: 144)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !200, file: !195, line: 128, baseType: !209, size: 128, align: 64, offset: 192)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !195, line: 88, size: 128, align: 64, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !209, file: !195, line: 89, baseType: !76, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !209, file: !195, line: 90, baseType: !10, size: 32, align: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !200, file: !195, line: 129, baseType: !10, size: 32, align: 32, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !200, file: !195, line: 132, baseType: !12, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !200, file: !195, line: 133, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!10, !12}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !200, file: !195, line: 134, baseType: !220, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!10, !12, !34, !10}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !200, file: !195, line: 135, baseType: !224, size: 64, align: 64, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !12, !227, !10}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !195, line: 77, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !229, line: 71, baseType: !230)
!229 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !67, line: 46, baseType: !231)
!231 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !200, file: !195, line: 136, baseType: !233, size: 64, align: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!10, !12, !236, !10}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !200, file: !195, line: 139, baseType: !209, size: 128, align: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !200, file: !195, line: 140, baseType: !240, size: 64, align: 64, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !195, line: 94, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !200, file: !195, line: 141, baseType: !10, size: 32, align: 32, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !200, file: !195, line: 144, baseType: !244, size: 24, align: 8, offset: 928)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 24, align: 8, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !200, file: !195, line: 145, baseType: !248, size: 8, align: 8, offset: 952)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8, align: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 1)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !200, file: !195, line: 148, baseType: !209, size: 128, align: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !200, file: !195, line: 151, baseType: !10, size: 32, align: 32, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !200, file: !195, line: 152, baseType: !227, size: 64, align: 64, offset: 1152)
!254 = !{!255, !256}
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !194, file: !195, line: 348, type: !10)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !194, file: !195, line: 348, type: !198)
!257 = !DISubprogram(name: "__sigbits", scope: !258, file: !258, line: 114, type: !259, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !261)
!258 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!259 = !DISubroutineType(types: !260)
!260 = !{!10, !10}
!261 = !{!262}
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !257, file: !258, line: 114, type: !10)
!263 = !DISubprogram(name: "xdropen", scope: !1, file: !1, line: 318, type: !264, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i8*, i8*)* @xdropen, variables: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!10, !13, !236, !236}
!266 = !{!267, !268, !269, !270, !271, !272}
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !263, file: !1, line: 318, type: !13)
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !263, file: !1, line: 318, type: !236)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !263, file: !1, line: 318, type: !236)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lmode", scope: !263, file: !1, line: 320, type: !3)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdrid", scope: !263, file: !1, line: 321, type: !10)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newtype", scope: !263, file: !1, line: 322, type: !273)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 40, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 5)
!276 = !DISubprogram(name: "xdrclose", scope: !1, file: !1, line: 378, type: !277, isLocal: false, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*)* @xdrclose, variables: !279)
!277 = !DISubroutineType(types: !278)
!278 = !{!10, !13}
!279 = !{!280, !281}
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !276, file: !1, line: 378, type: !13)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdrid", scope: !276, file: !1, line: 379, type: !10)
!282 = !DISubprogram(name: "xdr3dfcoord", scope: !1, file: !1, line: 671, type: !283, isLocal: false, isDefinition: true, scopeLine: 671, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, float*, i32*, float*)* @xdr3dfcoord, variables: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{!10, !13, !157, !73, !157}
!285 = !{!286, !287, !288, !289, !290, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !330, !331, !332, !333, !334, !335}
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !282, file: !1, line: 671, type: !13)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !282, file: !1, line: 671, type: !157)
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !282, file: !1, line: 671, type: !73)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "precision", arg: 4, scope: !282, file: !1, line: 671, type: !157)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minint", scope: !282, file: !1, line: 678, type: !291)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, align: 32, elements: !245)
