; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/main.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }
%struct.t_filenm = type { i32, i8*, i8*, i64 }

@stdlog = global %struct.__sFILE* null, align 8
@gmx_parallel = global i32 0, align 4
@par_fn.buf = internal global [256 x i8] zeroinitializer, align 16
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str1 = private unnamed_addr constant [2 x i8] c".\00", align 1
@.str2 = private unnamed_addr constant [4 x i8] c"tpr\00", align 1
@.str3 = private unnamed_addr constant [4 x i8] c"edr\00", align 1
@.str4 = private unnamed_addr constant [22 x i8] c"Multi-checking %s... \00", align 1
@.str5 = private unnamed_addr constant [5 x i8] c"ibuf\00", align 1
@.str6 = private unnamed_addr constant [64 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/main.c\00", align 1
@.str7 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1
@.str8 = private unnamed_addr constant [37 x i8] c"\0A%s is not equal for all subsystems\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !53, subprograms: !55, globals: !226, imports: !231)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/main.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!6 = !DIEnumerator(name: "efMDP", value: 0)
!7 = !DIEnumerator(name: "efGCT", value: 1)
!8 = !DIEnumerator(name: "efTRX", value: 2)
!9 = !DIEnumerator(name: "efTRN", value: 3)
!10 = !DIEnumerator(name: "efTRR", value: 4)
!11 = !DIEnumerator(name: "efTRJ", value: 5)
!12 = !DIEnumerator(name: "efXTC", value: 6)
!13 = !DIEnumerator(name: "efG87", value: 7)
!14 = !DIEnumerator(name: "efENX", value: 8)
!15 = !DIEnumerator(name: "efEDR", value: 9)
!16 = !DIEnumerator(name: "efENE", value: 10)
!17 = !DIEnumerator(name: "efSTX", value: 11)
!18 = !DIEnumerator(name: "efSTO", value: 12)
!19 = !DIEnumerator(name: "efGRO", value: 13)
!20 = !DIEnumerator(name: "efG96", value: 14)
!21 = !DIEnumerator(name: "efPDB", value: 15)
!22 = !DIEnumerator(name: "efBRK", value: 16)
!23 = !DIEnumerator(name: "efENT", value: 17)
!24 = !DIEnumerator(name: "efLOG", value: 18)
!25 = !DIEnumerator(name: "efXVG", value: 19)
!26 = !DIEnumerator(name: "efOUT", value: 20)
!27 = !DIEnumerator(name: "efNDX", value: 21)
!28 = !DIEnumerator(name: "efTOP", value: 22)
!29 = !DIEnumerator(name: "efITP", value: 23)
!30 = !DIEnumerator(name: "efTPX", value: 24)
!31 = !DIEnumerator(name: "efTPS", value: 25)
!32 = !DIEnumerator(name: "efTPR", value: 26)
!33 = !DIEnumerator(name: "efTPA", value: 27)
!34 = !DIEnumerator(name: "efTPB", value: 28)
!35 = !DIEnumerator(name: "efTEX", value: 29)
!36 = !DIEnumerator(name: "efRTP", value: 30)
!37 = !DIEnumerator(name: "efATP", value: 31)
!38 = !DIEnumerator(name: "efHDB", value: 32)
!39 = !DIEnumerator(name: "efDAT", value: 33)
!40 = !DIEnumerator(name: "efDLG", value: 34)
!41 = !DIEnumerator(name: "efMAP", value: 35)
!42 = !DIEnumerator(name: "efEPS", value: 36)
!43 = !DIEnumerator(name: "efMAT", value: 37)
!44 = !DIEnumerator(name: "efM2P", value: 38)
!45 = !DIEnumerator(name: "efMTX", value: 39)
!46 = !DIEnumerator(name: "efEDI", value: 40)
!47 = !DIEnumerator(name: "efEDO", value: 41)
!48 = !DIEnumerator(name: "efPPA", value: 42)
!49 = !DIEnumerator(name: "efPDO", value: 43)
!50 = !DIEnumerator(name: "efHAT", value: 44)
!51 = !DIEnumerator(name: "efXPM", value: 45)
!52 = !DIEnumerator(name: "efNR", value: 46)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!55 = !{!56, !63, !83, !155, !166, !186, !197, !215}
!56 = !DISubprogram(name: "__sigbits", scope: !57, file: !57, line: 114, type: !58, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !61)
!57 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !60}
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !{!62}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !56, file: !57, line: 114, type: !60)
!63 = !DISubprogram(name: "par_fn", scope: !1, file: !1, line: 117, type: !64, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct.t_commrec*)* @par_fn, variables: !79)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !66, !60, !68}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !70, line: 40, baseType: !71)
!70 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!71 = !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 36, size: 192, align: 32, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !71, file: !70, line: 37, baseType: !60, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !71, file: !70, line: 37, baseType: !60, size: 32, align: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !71, file: !70, line: 38, baseType: !60, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !71, file: !70, line: 38, baseType: !60, size: 32, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !71, file: !70, line: 39, baseType: !60, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !71, file: !70, line: 39, baseType: !60, size: 32, align: 32, offset: 160)
!79 = !{!80, !81, !82}
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !63, file: !1, line: 117, type: !66)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftp", arg: 2, scope: !63, file: !1, line: 117, type: !60)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 3, scope: !63, file: !1, line: 117, type: !68)
!83 = !DISubprogram(name: "check_multi_int", scope: !1, file: !1, line: 136, type: !84, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, i32, i8*)* @check_multi_int, variables: !146)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !68, !60, !66}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 153, baseType: !89)
!88 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !88, line: 122, size: 1216, align: 64, elements: !90)
!90 = !{!91, !94, !95, !96, !98, !99, !104, !105, !106, !110, !114, !124, !130, !131, !134, !135, !139, !143, !144, !145}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !89, file: !88, line: 123, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !89, file: !88, line: 124, baseType: !60, size: 32, align: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !89, file: !88, line: 125, baseType: !60, size: 32, align: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !89, file: !88, line: 126, baseType: !97, size: 16, align: 16, offset: 128)
!97 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !89, file: !88, line: 127, baseType: !97, size: 16, align: 16, offset: 144)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !89, file: !88, line: 128, baseType: !100, size: 128, align: 64, offset: 192)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !88, line: 88, size: 128, align: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !100, file: !88, line: 89, baseType: !92, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !100, file: !88, line: 90, baseType: !60, size: 32, align: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !89, file: !88, line: 129, baseType: !60, size: 32, align: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !89, file: !88, line: 132, baseType: !54, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !89, file: !88, line: 133, baseType: !107, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!60, !54}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !89, file: !88, line: 134, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!60, !54, !66, !60}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !89, file: !88, line: 135, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !54, !118, !60}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !88, line: 77, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !120, line: 71, baseType: !121)
!120 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !122, line: 46, baseType: !123)
!122 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!123 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !89, file: !88, line: 136, baseType: !125, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!60, !54, !128, !60}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !89, file: !88, line: 139, baseType: !100, size: 128, align: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !89, file: !88, line: 140, baseType: !132, size: 64, align: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !88, line: 94, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !89, file: !88, line: 141, baseType: !60, size: 32, align: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !89, file: !88, line: 144, baseType: !136, size: 24, align: 8, offset: 928)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 24, align: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !89, file: !88, line: 145, baseType: !140, size: 8, align: 8, offset: 952)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 1)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !89, file: !88, line: 148, baseType: !100, size: 128, align: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !89, file: !88, line: 151, baseType: !60, size: 32, align: 32, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !89, file: !88, line: 152, baseType: !118, size: 64, align: 64, offset: 1152)
!146 = !{!147, !148, !149, !150, !151, !153, !154}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !83, file: !1, line: 136, type: !86)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mcr", arg: 2, scope: !83, file: !1, line: 136, type: !68)
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val", arg: 3, scope: !83, file: !1, line: 136, type: !60)
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 4, scope: !83, file: !1, line: 136, type: !66)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ibuf", scope: !83, file: !1, line: 138, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !83, file: !1, line: 138, type: !60)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bCompatible", scope: !83, file: !1, line: 139, type: !60)
!155 = !DISubprogram(name: "open_log", scope: !1, file: !1, line: 168, type: !156, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.t_commrec*)* @open_log, variables: !158)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !66, !68}
!158 = !{!159, !160, !161, !162, !163, !164, !165}
!159 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lognm", arg: 1, scope: !155, file: !1, line: 168, type: !66)
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !155, file: !1, line: 168, type: !68)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !155, file: !1, line: 170, type: !60)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "testlen", scope: !155, file: !1, line: 170, type: !60)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pid", scope: !155, file: !1, line: 170, type: !60)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !155, file: !1, line: 171, type: !66)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "host", scope: !155, file: !1, line: 171, type: !66)
!166 = !DISubprogram(name: "init_multisystem", scope: !1, file: !1, line: 269, type: !167, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_commrec* (%struct.t_commrec*, i32, %struct.t_filenm*)* @init_multisystem, variables: !178)
!167 = !DISubroutineType(types: !168)
!168 = !{!68, !68, !60, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !4, line: 62, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 57, size: 256, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !171, file: !4, line: 58, baseType: !60, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !171, file: !4, line: 59, baseType: !66, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !171, file: !4, line: 60, baseType: !66, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !4, line: 61, baseType: !177, size: 64, align: 64, offset: 192)
!177 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!178 = !{!179, !180, !181, !182, !183, !184, !185}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 1, scope: !166, file: !1, line: 269, type: !68)
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfile", arg: 2, scope: !166, file: !1, line: 269, type: !60)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 3, scope: !166, file: !1, line: 269, type: !169)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcr", scope: !166, file: !1, line: 271, type: !68)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !166, file: !1, line: 272, type: !60)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftp", scope: !166, file: !1, line: 272, type: !60)
!185 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !166, file: !1, line: 273, type: !66)
!186 = !DISubprogram(name: "init_par", scope: !1, file: !1, line: 306, type: !187, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_commrec* (i32*, i8***)* @init_par, variables: !191)
!187 = !DISubroutineType(types: !188)
!188 = !{!68, !152, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !186, file: !1, line: 306, type: !152)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv_ptr", arg: 2, scope: !186, file: !1, line: 306, type: !189)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr", scope: !186, file: !1, line: 308, type: !68)
!195 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argv", scope: !186, file: !1, line: 309, type: !190)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !186, file: !1, line: 310, type: !60)
!197 = !DISubprogram(name: "get_nodeid", scope: !1, file: !1, line: 50, type: !198, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!60, !86, !60, !60, !152, !152}
!200 = !{!201, !202, !203, !204, !205, !206, !207, !211, !212, !213, !214}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !197, file: !1, line: 50, type: !86)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 2, scope: !197, file: !1, line: 50, type: !60)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 3, scope: !197, file: !1, line: 50, type: !60)
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nodeid", arg: 4, scope: !197, file: !1, line: 50, type: !152)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nnodes", arg: 5, scope: !197, file: !1, line: 50, type: !152)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !197, file: !1, line: 68, type: !60)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nodeids", scope: !197, file: !1, line: 68, type: !208)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, align: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 256)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_index", scope: !197, file: !1, line: 68, type: !60)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_nodeid", scope: !197, file: !1, line: 68, type: !60)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "send_nodeid", scope: !197, file: !1, line: 68, type: !60)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "receive_nodeid", scope: !197, file: !1, line: 68, type: !60)
