; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/maths.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon.2 = type { float }
%union.anon.3 = type { float }

; Function Attrs: alwaysinline nounwind optsize readnone ssp uwtable
define i32 @__inline_isfinitef(float %__x) #0 {
  tail call void @llvm.dbg.value(metadata float %__x, i64 0, metadata !15, metadata !333), !dbg !334
  %1 = fcmp ord float %__x, 0.000000e+00, !dbg !335
  br i1 %1, label %2, label %5, !dbg !336

; <label>:2                                       ; preds = %0
  %3 = tail call float @llvm.fabs.f32(float %__x) #6, !dbg !337
  %4 = fcmp une float %3, 0x7FF0000000000000, !dbg !338
  br label %5

; <label>:5                                       ; preds = %2, %0
  %6 = phi i1 [ false, %0 ], [ %4, %2 ]
  %7 = zext i1 %6 to i32, !dbg !336
  ret i32 %7, !dbg !339
}

; Function Attrs: nounwind readnone

!17 = !DISubroutineType(types: !18)
!18 = !{!4, !19}
!19 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!20 = !{!21}
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !16, file: !11, line: 207, type: !19)
!22 = !DISubprogram(name: "__inline_isfinitel", scope: !11, file: !11, line: 210, type: !23, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !26)
!23 = !DISubroutineType(types: !24)
!24 = !{!4, !25}
!25 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!26 = !{!27}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !22, file: !11, line: 210, type: !25)
!28 = !DISubprogram(name: "__inline_isinff", scope: !11, file: !11, line: 213, type: !12, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !29)
!29 = !{!30}
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !28, file: !11, line: 213, type: !8)
!31 = !DISubprogram(name: "__inline_isinfd", scope: !11, file: !11, line: 216, type: !17, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !32)
!32 = !{!33}
!33 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !31, file: !11, line: 216, type: !19)
!34 = !DISubprogram(name: "__inline_isinfl", scope: !11, file: !11, line: 219, type: !23, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !35)
!35 = !{!36}
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !34, file: !11, line: 219, type: !25)
!37 = !DISubprogram(name: "__inline_isnanf", scope: !11, file: !11, line: 222, type: !12, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !38)
!38 = !{!39}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !37, file: !11, line: 222, type: !8)
!40 = !DISubprogram(name: "__inline_isnand", scope: !11, file: !11, line: 225, type: !17, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !41)
!41 = !{!42}
!42 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !40, file: !11, line: 225, type: !19)
!43 = !DISubprogram(name: "__inline_isnanl", scope: !11, file: !11, line: 228, type: !23, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !44)
!44 = !{!45}
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !43, file: !11, line: 228, type: !25)
!46 = !DISubprogram(name: "__inline_signbitf", scope: !11, file: !11, line: 231, type: !12, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !47)
!47 = !{!48, !49}
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !46, file: !11, line: 231, type: !8)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !46, file: !11, line: 232, type: !50)
!50 = !DICompositeType(tag: DW_TAG_union_type, scope: !46, file: !11, line: 232, size: 32, align: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !50, file: !11, line: 232, baseType: !8, size: 32, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !50, file: !11, line: 232, baseType: !7, size: 32, align: 32)
!54 = !DISubprogram(name: "__inline_signbitd", scope: !11, file: !11, line: 236, type: !17, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !55)
!55 = !{!56, !57}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !54, file: !11, line: 236, type: !19)
!57 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !54, file: !11, line: 237, type: !58)
!58 = !DICompositeType(tag: DW_TAG_union_type, scope: !54, file: !11, line: 237, size: 64, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !58, file: !11, line: 237, baseType: !19, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !58, file: !11, line: 237, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "__inline_signbitl", scope: !11, file: !11, line: 242, type: !23, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !64)
!64 = !{!65, !66}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !63, file: !11, line: 242, type: !25)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !63, file: !11, line: 246, type: !67)
!67 = !DICompositeType(tag: DW_TAG_union_type, scope: !63, file: !11, line: 243, size: 128, align: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !67, file: !11, line: 244, baseType: !25, size: 128, align: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !67, file: !11, line: 245, baseType: !71, size: 128, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !11, line: 245, size: 128, align: 64, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !71, file: !11, line: 245, baseType: !62, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !71, file: !11, line: 245, baseType: !75, size: 16, align: 16, offset: 64)
!75 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!76 = !DISubprogram(name: "__inline_isnormalf", scope: !11, file: !11, line: 257, type: !12, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !77)
!77 = !{!78}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !76, file: !11, line: 257, type: !8)
!79 = !DISubprogram(name: "__inline_isnormald", scope: !11, file: !11, line: 260, type: !17, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !80)
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !79, file: !11, line: 260, type: !19)
!82 = !DISubprogram(name: "__inline_isnormall", scope: !11, file: !11, line: 263, type: !23, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !83)
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !82, file: !11, line: 263, type: !25)
!85 = !DISubprogram(name: "__sincosf", scope: !11, file: !11, line: 642, type: !86, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !89)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !8, !88, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!89 = !{!90, !91, !92, !93}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !85, file: !11, line: 642, type: !8)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !85, file: !11, line: 642, type: !88)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !85, file: !11, line: 642, type: !88)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !85, file: !11, line: 643, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !11, line: 634, size: 64, align: 32, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !95, file: !11, line: 634, baseType: !8, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !95, file: !11, line: 634, baseType: !8, size: 32, align: 32, offset: 32)
!99 = !DISubprogram(name: "__sincos", scope: !11, file: !11, line: 647, type: !100, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !103)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !19, !102, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!103 = !{!104, !105, !106, !107}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !99, file: !11, line: 647, type: !19)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !99, file: !11, line: 647, type: !102)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !99, file: !11, line: 647, type: !102)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !99, file: !11, line: 648, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !11, line: 635, size: 128, align: 64, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !109, file: !11, line: 635, baseType: !19, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !109, file: !11, line: 635, baseType: !19, size: 64, align: 64, offset: 64)
!113 = !DISubprogram(name: "__sincospif", scope: !11, file: !11, line: 652, type: !86, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !113, file: !11, line: 652, type: !8)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !113, file: !11, line: 652, type: !88)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !113, file: !11, line: 652, type: !88)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !113, file: !11, line: 653, type: !94)
!119 = !DISubprogram(name: "__sincospi", scope: !11, file: !11, line: 657, type: !100, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !119, file: !11, line: 657, type: !19)
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !119, file: !11, line: 657, type: !102)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !119, file: !11, line: 657, type: !102)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !119, file: !11, line: 658, type: !108)
!125 = !DISubprogram(name: "__sputc", scope: !126, file: !126, line: 348, type: !127, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !190)
!126 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !DISubroutineType(types: !128)
!128 = !{!4, !4, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 153, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !126, line: 122, size: 1216, align: 64, elements: !132)
!132 = !{!133, !136, !137, !138, !140, !141, !146, !147, !149, !153, !158, !168, !174, !175, !178, !179, !183, !187, !188, !189}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !131, file: !126, line: 123, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !131, file: !126, line: 124, baseType: !4, size: 32, align: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !131, file: !126, line: 125, baseType: !4, size: 32, align: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !131, file: !126, line: 126, baseType: !139, size: 16, align: 16, offset: 128)
!139 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !131, file: !126, line: 127, baseType: !139, size: 16, align: 16, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !131, file: !126, line: 128, baseType: !142, size: 128, align: 64, offset: 192)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !126, line: 88, size: 128, align: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !142, file: !126, line: 89, baseType: !134, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !142, file: !126, line: 90, baseType: !4, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !131, file: !126, line: 129, baseType: !4, size: 32, align: 32, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !131, file: !126, line: 132, baseType: !148, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !131, file: !126, line: 133, baseType: !150, size: 64, align: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!4, !148}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !131, file: !126, line: 134, baseType: !154, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!4, !148, !157, !4}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !131, file: !126, line: 135, baseType: !159, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !148, !162, !4}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !126, line: 77, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !164, line: 71, baseType: !165)
!164 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !166, line: 46, baseType: !167)
!166 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!167 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !131, file: !126, line: 136, baseType: !169, size: 64, align: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!4, !148, !172, !4}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !131, file: !126, line: 139, baseType: !142, size: 128, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !131, file: !126, line: 140, baseType: !176, size: 64, align: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !126, line: 94, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !131, file: !126, line: 141, baseType: !4, size: 32, align: 32, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !131, file: !126, line: 144, baseType: !180, size: 24, align: 8, offset: 928)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 24, align: 8, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 3)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !131, file: !126, line: 145, baseType: !184, size: 8, align: 8, offset: 952)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8, align: 8, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 1)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !131, file: !126, line: 148, baseType: !142, size: 128, align: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !131, file: !126, line: 151, baseType: !4, size: 32, align: 32, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !131, file: !126, line: 152, baseType: !162, size: 64, align: 64, offset: 1152)
!190 = !{!191, !192}
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !125, file: !126, line: 348, type: !4)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !125, file: !126, line: 348, type: !129)
!193 = !DISubprogram(name: "__sigbits", scope: !194, file: !194, line: 114, type: !195, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !197)
!194 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!195 = !DISubroutineType(types: !196)
!196 = !{!4, !4}
!197 = !{!198}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !193, file: !194, line: 114, type: !4)
!199 = !DISubprogram(name: "gmx_nint", scope: !1, file: !1, line: 45, type: !200, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @gmx_nint, variables: !204)
!200 = !DISubroutineType(types: !201)
!201 = !{!4, !202}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !203, line: 87, baseType: !8)
!203 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!204 = !{!205, !206, !208}
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !199, file: !1, line: 45, type: !202)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "half", scope: !199, file: !1, line: 47, type: !207)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !199, file: !1, line: 48, type: !4)
!209 = !DISubprogram(name: "sign", scope: !1, file: !1, line: 54, type: !210, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: float (float, float)* @sign, variables: !212)
!210 = !DISubroutineType(types: !211)
!211 = !{!202, !202, !202}
!212 = !{!213, !214}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !209, file: !1, line: 54, type: !202)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !209, file: !1, line: 54, type: !202)
!215 = !DISubprogram(name: "gmx_erf", scope: !1, file: !1, line: 471, type: !216, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, function: float (float)* @gmx_erf, variables: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!202, !8}
!218 = !{!219, !220, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !215, file: !1, line: 471, type: !8)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hx", scope: !215, file: !1, line: 473, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "erf_int32_t", file: !1, line: 79, baseType: !4)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !215, file: !1, line: 473, type: !221)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !215, file: !1, line: 473, type: !221)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "R", scope: !215, file: !1, line: 474, type: !8)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "S", scope: !215, file: !1, line: 474, type: !8)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "P", scope: !215, file: !1, line: 474, type: !8)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Q", scope: !215, file: !1, line: 474, type: !8)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !215, file: !1, line: 474, type: !8)
