; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/matio.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], i32 (i8*, i64, i8**)*, i32 (i32, i8*, i64, i8**)*, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, i8*, i32, i32, %struct._RuneCharClass* }
%struct._RuneRange = type { i32, %struct._RuneEntry* }
%struct._RuneEntry = type { i32, i32, i32, i32* }
%struct._RuneCharClass = type { [14 x i8], i32 }
%struct.t_xpmelmt = type { i8, i8 }
%struct.t_mapping = type { %struct.t_xpmelmt, i8*, %struct.t_rgb }
%struct.t_rgb = type { float, float, float }
%struct.t_matrix = type { i32, i32, i32, [256 x i8], [256 x i8], [256 x i8], [256 x i8], i32, float*, float*, i16**, i32, %struct.t_mapping* }

@.str = private unnamed_addr constant [2 x i8] c"m\00", align 1
@.str1 = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/matio.c\00", align 1
@.str2 = private unnamed_addr constant [5 x i8] c"m[0]\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8, globals: !466, imports: !2)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/matio.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !76, !82, !96, !104, !113, !125, !147, !168, !176, !184, !192, !209, !218, !223, !229, !236, !281, !291, !303, !313, !336, !354, !363, !378, !396, !406, !427, !446, !450, !458}
!9 = !DISubprogram(name: "__sputc", scope: !10, file: !10, line: 348, type: !11, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !73)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!11 = !DISubroutineType(types: !12)
!12 = !{!6, !6, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !10, line: 153, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !10, line: 122, size: 1216, align: 64, elements: !16)
!16 = !{!17, !20, !21, !22, !24, !25, !30, !31, !32, !36, !41, !51, !57, !58, !61, !62, !66, !70, !71, !72}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !15, file: !10, line: 123, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !15, file: !10, line: 124, baseType: !6, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !15, file: !10, line: 125, baseType: !6, size: 32, align: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !10, line: 126, baseType: !23, size: 16, align: 16, offset: 128)
!23 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !15, file: !10, line: 127, baseType: !23, size: 16, align: 16, offset: 144)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !15, file: !10, line: 128, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !10, line: 88, size: 128, align: 64, elements: !27)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !26, file: !10, line: 89, baseType: !18, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !26, file: !10, line: 90, baseType: !6, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !15, file: !10, line: 129, baseType: !6, size: 32, align: 32, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !15, file: !10, line: 132, baseType: !5, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !15, file: !10, line: 133, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!6, !5}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !15, file: !10, line: 134, baseType: !37, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!6, !5, !40, !6}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !15, file: !10, line: 135, baseType: !42, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !5, !45, !6}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !10, line: 77, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!50 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !15, file: !10, line: 136, baseType: !52, size: 64, align: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !5, !55, !6}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !15, file: !10, line: 139, baseType: !26, size: 128, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !15, file: !10, line: 140, baseType: !59, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !10, line: 94, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !15, file: !10, line: 141, baseType: !6, size: 32, align: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !15, file: !10, line: 144, baseType: !63, size: 24, align: 8, offset: 928)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !15, file: !10, line: 145, baseType: !67, size: 8, align: 8, offset: 952)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !15, file: !10, line: 148, baseType: !26, size: 128, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !15, file: !10, line: 151, baseType: !6, size: 32, align: 32, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !10, line: 152, baseType: !45, size: 64, align: 64, offset: 1152)
!73 = !{!74, !75}
!74 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !9, file: !10, line: 348, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !9, file: !10, line: 348, type: !13)
!76 = !DISubprogram(name: "__sigbits", scope: !77, file: !77, line: 114, type: !78, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !80)
!77 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DISubroutineType(types: !79)
!79 = !{!6, !6}
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !76, file: !77, line: 114, type: !6)
!82 = !DISubprogram(name: "mk_matrix", scope: !1, file: !1, line: 50, type: !83, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: float** (i32, i32, i32)* @mk_matrix, variables: !90)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !6, !6, !6}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !88, line: 87, baseType: !89)
!88 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!89 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!90 = !{!91, !92, !93, !94, !95}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !82, file: !1, line: 50, type: !6)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !82, file: !1, line: 50, type: !6)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b1D", arg: 3, scope: !82, file: !1, line: 50, type: !6)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !82, file: !1, line: 52, type: !6)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !82, file: !1, line: 53, type: !85)
!96 = !DISubprogram(name: "done_matrix", scope: !1, file: !1, line: 68, type: !97, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, float***)* @done_matrix, variables: !100)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !6, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!100 = !{!101, !102, !103}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !96, file: !1, line: 68, type: !6)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 2, scope: !96, file: !1, line: 68, type: !99)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !96, file: !1, line: 70, type: !6)
!104 = !DISubprogram(name: "clear_matrix", scope: !1, file: !1, line: 78, type: !105, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, float**)* @clear_matrix, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !6, !6, !85}
!107 = !{!108, !109, !110, !111, !112}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nx", arg: 1, scope: !104, file: !1, line: 78, type: !6)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ny", arg: 2, scope: !104, file: !1, line: 78, type: !6)
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 3, scope: !104, file: !1, line: 78, type: !85)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !104, file: !1, line: 80, type: !6)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !104, file: !1, line: 80, type: !6)
!113 = !DISubprogram(name: "matelmt_cmp", scope: !1, file: !1, line: 87, type: !114, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i16, i16)* @matelmt_cmp, variables: !122)
!114 = !DISubroutineType(types: !115)
!115 = !{!6, !116, !116}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_xpmelmt", file: !117, line: 46, baseType: !118)
!117 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/matrix.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 40, size: 16, align: 8, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !118, file: !117, line: 41, baseType: !4, size: 8, align: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !118, file: !117, line: 42, baseType: !4, size: 8, align: 8, offset: 8)
!122 = !{!123, !124}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e1", arg: 1, scope: !113, file: !1, line: 87, type: !116)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e2", arg: 2, scope: !113, file: !1, line: 87, type: !116)
!125 = !DISubprogram(name: "searchcmap", scope: !1, file: !1, line: 92, type: !126, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32, %struct.t_mapping*, i16)* @searchcmap, variables: !142)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !6, !129, !116}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_matelmt", file: !117, line: 48, baseType: !23)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mapping", file: !117, line: 54, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 50, size: 256, align: 64, elements: !132)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !131, file: !117, line: 51, baseType: !116, size: 16, align: 8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !131, file: !117, line: 52, baseType: !40, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !131, file: !117, line: 53, baseType: !136, size: 96, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_rgb", file: !117, line: 38, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 36, size: 96, align: 32, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !137, file: !117, line: 37, baseType: !87, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !137, file: !117, line: 37, baseType: !87, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !137, file: !117, line: 37, baseType: !87, size: 32, align: 32, offset: 64)
!142 = !{!143, !144, !145, !146}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !125, file: !1, line: 92, type: !6)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 2, scope: !125, file: !1, line: 92, type: !129)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 3, scope: !125, file: !1, line: 92, type: !116)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !125, file: !1, line: 94, type: !6)
!147 = !DISubprogram(name: "getcmap", scope: !1, file: !1, line: 103, type: !148, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, i8*, %struct.t_mapping**)* @getcmap, variables: !151)
!148 = !DISubroutineType(types: !149)
!149 = !{!6, !13, !40, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!151 = !{!152, !153, !154, !155, !156, !157, !161, !162, !163, !165, !166, !167}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !147, file: !1, line: 103, type: !13)
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !147, file: !1, line: 103, type: !40)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 3, scope: !147, file: !1, line: 103, type: !150)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !147, file: !1, line: 105, type: !6)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !147, file: !1, line: 105, type: !6)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !147, file: !1, line: 106, type: !158)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, align: 8, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 4096)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !147, file: !1, line: 107, type: !158)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "desc", scope: !147, file: !1, line: 107, type: !158)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !147, file: !1, line: 108, type: !164)
!164 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !147, file: !1, line: 108, type: !164)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !147, file: !1, line: 108, type: !164)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !147, file: !1, line: 109, type: !129)
!168 = !DISubprogram(name: "readcmap", scope: !1, file: !1, line: 133, type: !169, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.t_mapping**)* @readcmap, variables: !171)
!169 = !DISubroutineType(types: !170)
!170 = !{!6, !40, !150}
!171 = !{!172, !173, !174, !175}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !168, file: !1, line: 133, type: !40)
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 2, scope: !168, file: !1, line: 133, type: !150)
!174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !168, file: !1, line: 135, type: !13)
!175 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !168, file: !1, line: 136, type: !6)
!176 = !DISubprogram(name: "printcmap", scope: !1, file: !1, line: 145, type: !177, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_mapping*)* @printcmap, variables: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !13, !6, !129}
!179 = !{!180, !181, !182, !183}
!180 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !176, file: !1, line: 145, type: !13)
!181 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !176, file: !1, line: 145, type: !6)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 3, scope: !176, file: !1, line: 145, type: !129)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !176, file: !1, line: 147, type: !6)
!184 = !DISubprogram(name: "writecmap", scope: !1, file: !1, line: 157, type: !185, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, %struct.t_mapping*)* @writecmap, variables: !187)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !40, !6, !129}
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 1, scope: !184, file: !1, line: 157, type: !40)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !184, file: !1, line: 157, type: !6)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 3, scope: !184, file: !1, line: 157, type: !129)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !184, file: !1, line: 159, type: !13)
!192 = !DISubprogram(name: "do_wmap", scope: !1, file: !1, line: 166, type: !193, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, i32, <2 x float>, float, <2 x float>, float, float, float)* @do_wmap, variables: !195)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !13, !6, !6, !6, !136, !136, !87, !87}
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !192, file: !1, line: 166, type: !13)
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i0", arg: 2, scope: !192, file: !1, line: 166, type: !6)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imax", arg: 3, scope: !192, file: !1, line: 166, type: !6)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nlevels", arg: 4, scope: !192, file: !1, line: 167, type: !6)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rlo", arg: 5, scope: !192, file: !1, line: 167, type: !136)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rhi", arg: 6, scope: !192, file: !1, line: 167, type: !136)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lo", arg: 7, scope: !192, file: !1, line: 167, type: !87)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hi", arg: 8, scope: !192, file: !1, line: 167, type: !87)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !192, file: !1, line: 169, type: !6)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlo", scope: !192, file: !1, line: 169, type: !6)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !192, file: !1, line: 170, type: !87)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !192, file: !1, line: 170, type: !87)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !192, file: !1, line: 170, type: !87)
!209 = !DISubprogram(name: "fgetline", scope: !1, file: !1, line: 182, type: !210, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8**, i32, %struct.__sFILE*)* @fgetline, variables: !213)
!210 = !DISubroutineType(types: !211)
!211 = !{!40, !212, !6, !13}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!213 = !{!214, !215, !216, !217}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !209, file: !1, line: 182, type: !212)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "llmax", arg: 2, scope: !209, file: !1, line: 182, type: !6)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 3, scope: !209, file: !1, line: 182, type: !13)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fg", scope: !209, file: !1, line: 186, type: !40)
!218 = !DISubprogram(name: "skipstr", scope: !1, file: !1, line: 199, type: !219, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**)* @skipstr, variables: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !212}
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !218, file: !1, line: 199, type: !212)
!223 = !DISubprogram(name: "line2string", scope: !1, file: !1, line: 206, type: !224, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8**)* @line2string, variables: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!40, !212}
!226 = !{!227, !228}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !223, file: !1, line: 206, type: !212)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !223, file: !1, line: 208, type: !6)
!229 = !DISubprogram(name: "parsestring", scope: !1, file: !1, line: 231, type: !230, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, i8*)* @parsestring, variables: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !40, !40, !40}
!232 = !{!233, !234, !235}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !229, file: !1, line: 231, type: !40)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "label", arg: 2, scope: !229, file: !1, line: 231, type: !40)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string", arg: 3, scope: !229, file: !1, line: 231, type: !40)
!236 = !DISubprogram(name: "read_xpm_entry", scope: !1, file: !1, line: 241, type: !237, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_matrix*)* @read_xpm_entry, variables: !261)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !13, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_matrix", file: !117, line: 69, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 56, size: 8640, align: 64, elements: !242)
!242 = !{!243, !244, !245, !246, !250, !251, !252, !253, !254, !255, !256, !259, !260}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nx", scope: !241, file: !117, line: 57, baseType: !6, size: 32, align: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ny", scope: !241, file: !117, line: 57, baseType: !6, size: 32, align: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "y0", scope: !241, file: !117, line: 58, baseType: !6, size: 32, align: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !241, file: !117, line: 59, baseType: !247, size: 2048, align: 8, offset: 96)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, align: 8, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "legend", scope: !241, file: !117, line: 60, baseType: !247, size: 2048, align: 8, offset: 2144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "label_x", scope: !241, file: !117, line: 61, baseType: !247, size: 2048, align: 8, offset: 4192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "label_y", scope: !241, file: !117, line: 62, baseType: !247, size: 2048, align: 8, offset: 6240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bDiscrete", scope: !241, file: !117, line: 63, baseType: !6, size: 32, align: 32, offset: 8288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "axis_x", scope: !241, file: !117, line: 64, baseType: !86, size: 64, align: 64, offset: 8320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "axis_y", scope: !241, file: !117, line: 65, baseType: !86, size: 64, align: 64, offset: 8384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !241, file: !117, line: 66, baseType: !257, size: 64, align: 64, offset: 8448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nmap", scope: !241, file: !117, line: 67, baseType: !6, size: 32, align: 32, offset: 8512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !241, file: !117, line: 68, baseType: !129, size: 64, align: 64, offset: 8576)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !236, file: !1, line: 241, type: !13)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mm", arg: 2, scope: !236, file: !1, line: 241, type: !239)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !236, file: !1, line: 243, type: !129)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !236, file: !1, line: 244, type: !40)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !236, file: !1, line: 244, type: !40)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !236, file: !1, line: 244, type: !247)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !236, file: !1, line: 245, type: !6)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !236, file: !1, line: 245, type: !6)
!270 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col_len", scope: !236, file: !1, line: 245, type: !6)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nch", scope: !236, file: !1, line: 245, type: !6)
!272 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_axis_x", scope: !236, file: !1, line: 245, type: !6)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_axis_y", scope: !236, file: !1, line: 245, type: !6)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "llmax", scope: !236, file: !1, line: 245, type: !6)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !236, file: !1, line: 246, type: !7)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !236, file: !1, line: 246, type: !7)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !236, file: !1, line: 246, type: !7)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !236, file: !1, line: 247, type: !164)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bGetOnWithIt", scope: !236, file: !1, line: 248, type: !6)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !236, file: !1, line: 249, type: !116)
!281 = !DISubprogram(name: "read_xpm_matrix", scope: !1, file: !1, line: 413, type: !282, isLocal: false, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.t_matrix**)* @read_xpm_matrix, variables: !285)
!282 = !DISubroutineType(types: !283)
!283 = !{!6, !40, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fnm", arg: 1, scope: !281, file: !1, line: 413, type: !40)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "matrix", arg: 2, scope: !281, file: !1, line: 413, type: !284)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !281, file: !1, line: 415, type: !13)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !281, file: !1, line: 416, type: !40)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmat", scope: !281, file: !1, line: 417, type: !6)
!291 = !DISubprogram(name: "matrix2real", scope: !1, file: !1, line: 437, type: !292, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: true, function: float** (%struct.t_matrix*, float**)* @matrix2real, variables: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{!85, !239, !85}
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302}
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "matrix", arg: 1, scope: !291, file: !1, line: 437, type: !239)
!296 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mat", arg: 2, scope: !291, file: !1, line: 437, type: !85)
