; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mdatom.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_mdatoms = type { float, i32, float*, float*, float*, float*, float*, float*, float*, i32*, i32*, i32*, i32*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }

@.str = private unnamed_addr constant [3 x i8] c"md\00", align 1
@.str1 = private unnamed_addr constant [66 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mdatom.c\00", align 1
@.str2 = private unnamed_addr constant [10 x i8] c"md->massA\00", align 1
@.str3 = private unnamed_addr constant [10 x i8] c"md->massB\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !18, globals: !241, imports: !243)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mdatom.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15}
!6 = !DIEnumerator(name: "egcTC", value: 0)
!7 = !DIEnumerator(name: "egcENER", value: 1)
!8 = !DIEnumerator(name: "egcACC", value: 2)
!9 = !DIEnumerator(name: "egcFREEZE", value: 3)
!10 = !DIEnumerator(name: "egcUser1", value: 4)
!11 = !DIEnumerator(name: "egcUser2", value: 5)
!12 = !DIEnumerator(name: "egcVCM", value: 6)
!13 = !DIEnumerator(name: "egcXTC", value: 7)
!14 = !DIEnumerator(name: "egcORFIT", value: 8)
!15 = !DIEnumerator(name: "egcNR", value: 9)
!16 = !{!17}
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !{!19, !88, !94, !223, !231}
!19 = !DISubprogram(name: "__sputc", scope: !20, file: !20, line: 348, type: !21, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !85)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !23, !24}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 153, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !20, line: 122, size: 1216, align: 64, elements: !27)
!27 = !{!28, !31, !32, !33, !35, !36, !41, !42, !44, !48, !53, !63, !69, !70, !73, !74, !78, !82, !83, !84}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !26, file: !20, line: 123, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !26, file: !20, line: 124, baseType: !23, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !26, file: !20, line: 125, baseType: !23, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !26, file: !20, line: 126, baseType: !34, size: 16, align: 16, offset: 128)
!34 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !26, file: !20, line: 127, baseType: !34, size: 16, align: 16, offset: 144)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !26, file: !20, line: 128, baseType: !37, size: 128, align: 64, offset: 192)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !20, line: 88, size: 128, align: 64, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !37, file: !20, line: 89, baseType: !29, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !37, file: !20, line: 90, baseType: !23, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !26, file: !20, line: 129, baseType: !23, size: 32, align: 32, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !26, file: !20, line: 132, baseType: !43, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !26, file: !20, line: 133, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!23, !43}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !26, file: !20, line: 134, baseType: !49, size: 64, align: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!23, !43, !52, !23}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !26, file: !20, line: 135, baseType: !54, size: 64, align: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !43, !57, !23}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !20, line: 77, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !26, file: !20, line: 136, baseType: !64, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!23, !43, !67, !23}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !26, file: !20, line: 139, baseType: !37, size: 128, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !26, file: !20, line: 140, baseType: !71, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !20, line: 94, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !26, file: !20, line: 141, baseType: !23, size: 32, align: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !26, file: !20, line: 144, baseType: !75, size: 24, align: 8, offset: 928)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !26, file: !20, line: 145, baseType: !79, size: 8, align: 8, offset: 952)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !26, file: !20, line: 148, baseType: !37, size: 128, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !26, file: !20, line: 151, baseType: !23, size: 32, align: 32, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !26, file: !20, line: 152, baseType: !57, size: 64, align: 64, offset: 1152)
!85 = !{!86, !87}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !19, file: !20, line: 348, type: !23)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !19, file: !20, line: 348, type: !24)
!88 = !DISubprogram(name: "__sigbits", scope: !89, file: !89, line: 114, type: !90, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !92)
!89 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!90 = !DISubroutineType(types: !91)
!91 = !{!23, !23}
!92 = !{!93}
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !88, file: !89, line: 114, type: !23)
!94 = !DISubprogram(name: "atoms2md", scope: !1, file: !1, line: 41, type: !95, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_mdatoms* (%struct.__sFILE*, %struct.t_atoms*, [3 x i32]*, i32, float, float, float*, i32, i32)* @atoms2md, variables: !206)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !24, !132, !203, !23, !103, !103, !108, !23, !23}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !99, line: 51, baseType: !100)
!99 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!100 = !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 40, size: 1408, align: 64, elements: !101)
!101 = !{!102, !106, !107, !109, !110, !111, !112, !113, !114, !115, !117, !118, !119, !120, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !100, file: !99, line: 41, baseType: !103, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !104, line: 87, baseType: !105)
!104 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!105 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !100, file: !99, line: 42, baseType: !23, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !100, file: !99, line: 43, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !100, file: !99, line: 43, baseType: !108, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !100, file: !99, line: 43, baseType: !108, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !100, file: !99, line: 43, baseType: !108, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !100, file: !99, line: 44, baseType: !108, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !100, file: !99, line: 44, baseType: !108, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !100, file: !99, line: 44, baseType: !108, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !100, file: !99, line: 45, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !100, file: !99, line: 46, baseType: !116, size: 64, align: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !100, file: !99, line: 47, baseType: !116, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !100, file: !99, line: 47, baseType: !116, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !100, file: !99, line: 48, baseType: !121, size: 64, align: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !100, file: !99, line: 49, baseType: !121, size: 64, align: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !100, file: !99, line: 49, baseType: !121, size: 64, align: 64, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !100, file: !99, line: 49, baseType: !121, size: 64, align: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !100, file: !99, line: 49, baseType: !121, size: 64, align: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !100, file: !99, line: 49, baseType: !121, size: 64, align: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !100, file: !99, line: 49, baseType: !121, size: 64, align: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !100, file: !99, line: 50, baseType: !121, size: 64, align: 64, offset: 1216)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !100, file: !99, line: 50, baseType: !121, size: 64, align: 64, offset: 1280)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !100, file: !99, line: 50, baseType: !121, size: 64, align: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !4, line: 94, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 75, size: 10240, align: 64, elements: !135)
!135 = !{!136, !137, !155, !158, !159, !160, !161, !162, !163, !164, !179, !186}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !134, file: !4, line: 76, baseType: !23, size: 32, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !134, file: !4, line: 77, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !4, line: 57, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 48, size: 320, align: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !154}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !140, file: !4, line: 49, baseType: !103, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !140, file: !4, line: 49, baseType: !103, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !140, file: !4, line: 50, baseType: !103, size: 32, align: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !140, file: !4, line: 50, baseType: !103, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !4, line: 51, baseType: !122, size: 16, align: 16, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !140, file: !4, line: 52, baseType: !122, size: 16, align: 16, offset: 144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !140, file: !4, line: 53, baseType: !23, size: 32, align: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !140, file: !4, line: 54, baseType: !23, size: 32, align: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !140, file: !4, line: 55, baseType: !151, size: 72, align: 8, offset: 224)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 72, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 9)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !140, file: !4, line: 56, baseType: !30, size: 8, align: 8, offset: 296)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !134, file: !4, line: 80, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !134, file: !4, line: 82, baseType: !156, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !134, file: !4, line: 84, baseType: !156, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !134, file: !4, line: 86, baseType: !23, size: 32, align: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !134, file: !4, line: 87, baseType: !156, size: 64, align: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !134, file: !4, line: 89, baseType: !23, size: 32, align: 32, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !134, file: !4, line: 90, baseType: !156, size: 64, align: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !134, file: !4, line: 91, baseType: !165, size: 8448, align: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !166, line: 52, baseType: !167)
!166 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!167 = !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 36, size: 8448, align: 64, elements: !168)
!168 = !{!169, !173, !174, !177, !178}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !167, file: !166, line: 37, baseType: !170, size: 8192, align: 32)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, align: 32, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !167, file: !166, line: 43, baseType: !23, size: 32, align: 32, offset: 8192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !167, file: !166, line: 44, baseType: !175, size: 64, align: 64, offset: 8256)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !104, line: 73, baseType: !23)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !167, file: !166, line: 45, baseType: !23, size: 32, align: 32, offset: 8320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !167, file: !166, line: 46, baseType: !175, size: 64, align: 64, offset: 8384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !134, file: !4, line: 92, baseType: !180, size: 1152, align: 64, offset: 9024)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 1152, align: 64, elements: !152)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !4, line: 73, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 70, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !182, file: !4, line: 71, baseType: !23, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !182, file: !4, line: 72, baseType: !116, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !134, file: !4, line: 93, baseType: !187, size: 64, align: 64, offset: 10176)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !4, line: 68, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 59, size: 416, align: 32, elements: !190)
!190 = !{!191, !192, !193, !194, !198, !199, !200, !201}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !4, line: 60, baseType: !23, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !189, file: !4, line: 61, baseType: !23, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !189, file: !4, line: 62, baseType: !17, size: 8, align: 8, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !189, file: !4, line: 63, baseType: !195, size: 48, align: 8, offset: 72)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 48, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 6)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !189, file: !4, line: 64, baseType: !103, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !189, file: !4, line: 65, baseType: !103, size: 32, align: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !189, file: !4, line: 66, baseType: !23, size: 32, align: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !189, file: !4, line: 67, baseType: !202, size: 192, align: 32, offset: 224)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 192, align: 32, elements: !196)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !104, line: 107, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 96, align: 32, elements: !76)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !222}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !94, file: !1, line: 41, type: !24)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 2, scope: !94, file: !1, line: 41, type: !132)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nFreeze", arg: 3, scope: !94, file: !1, line: 41, type: !203)
!210 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bBD", arg: 4, scope: !94, file: !1, line: 42, type: !23)
!211 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delta_t", arg: 5, scope: !94, file: !1, line: 42, type: !103)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fric", arg: 6, scope: !94, file: !1, line: 42, type: !103)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tau_t", arg: 7, scope: !94, file: !1, line: 42, type: !108)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bPert", arg: 8, scope: !94, file: !1, line: 43, type: !23)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bFree", arg: 9, scope: !94, file: !1, line: 43, type: !23)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !94, file: !1, line: 45, type: !23)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !94, file: !1, line: 45, type: !23)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !94, file: !1, line: 45, type: !23)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fac", scope: !94, file: !1, line: 46, type: !103)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !94, file: !1, line: 47, type: !221)
!221 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "md", scope: !94, file: !1, line: 48, type: !97)
!223 = !DISubprogram(name: "md2atoms", scope: !1, file: !1, line: 143, type: !224, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_mdatoms*, %struct.t_atoms*, i32)* @md2atoms, variables: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !97, !132, !23}
!226 = !{!227, !228, !229, !230}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 1, scope: !223, file: !1, line: 143, type: !97)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 2, scope: !223, file: !1, line: 143, type: !132)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bFree", arg: 3, scope: !223, file: !1, line: 143, type: !23)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !223, file: !1, line: 145, type: !23)
!231 = !DISubprogram(name: "init_mdatoms", scope: !1, file: !1, line: 191, type: !232, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_mdatoms*, float, i32)* @init_mdatoms, variables: !234)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !97, !103, !23}
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 1, scope: !231, file: !1, line: 191, type: !97)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 2, scope: !231, file: !1, line: 191, type: !103)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bFirst", arg: 3, scope: !231, file: !1, line: 191, type: !23)
