; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mdrun.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_filenm = type { i32, i8*, i8*, i64 }
%struct.t_pargs = type { i8*, i32, i32, %union.anon.2, i8* }
%union.anon.2 = type { i8* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_edsamyn = type { i32, i8*, i8* }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !53, subprograms: !57, globals: !280, imports: !333)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mdrun.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/filenm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!6 = !DIEnumerator(name: "efMDP", value: 0)
!7 = !DIEnumerator(name: "efGCT", value: 1)
!8 = !DIEnumerator(name: "efTRX", value: 2)
!9 = !DIEnumerator(name: "efTRN", value: 3)
!10 = !DIEnumerator(name: "efTRR", value: 4)
!11 = !DIEnumerator(name: "efTRJ", value: 5)
!12 = !DIEnumerator(name: "efXTC", value: 6)
!13 = !DIEnumerator(name: "efG87", value: 7)
!14 = !DIEnumerator(name: "efENX", value: 8)
!15 = !DIEnumerator(name: "efEDR", value: 9)
!16 = !DIEnumerator(name: "efENE", value: 10)
!17 = !DIEnumerator(name: "efSTX", value: 11)
!18 = !DIEnumerator(name: "efSTO", value: 12)
!19 = !DIEnumerator(name: "efGRO", value: 13)
!20 = !DIEnumerator(name: "efG96", value: 14)
!21 = !DIEnumerator(name: "efPDB", value: 15)
!22 = !DIEnumerator(name: "efBRK", value: 16)
!23 = !DIEnumerator(name: "efENT", value: 17)
!24 = !DIEnumerator(name: "efLOG", value: 18)
!25 = !DIEnumerator(name: "efXVG", value: 19)
!26 = !DIEnumerator(name: "efOUT", value: 20)
!27 = !DIEnumerator(name: "efNDX", value: 21)
!28 = !DIEnumerator(name: "efTOP", value: 22)
!29 = !DIEnumerator(name: "efITP", value: 23)
!30 = !DIEnumerator(name: "efTPX", value: 24)
!31 = !DIEnumerator(name: "efTPS", value: 25)
!32 = !DIEnumerator(name: "efTPR", value: 26)
!33 = !DIEnumerator(name: "efTPA", value: 27)
!34 = !DIEnumerator(name: "efTPB", value: 28)
!35 = !DIEnumerator(name: "efTEX", value: 29)
!36 = !DIEnumerator(name: "efRTP", value: 30)
!37 = !DIEnumerator(name: "efATP", value: 31)
!38 = !DIEnumerator(name: "efHDB", value: 32)
!39 = !DIEnumerator(name: "efDAT", value: 33)
!40 = !DIEnumerator(name: "efDLG", value: 34)
!41 = !DIEnumerator(name: "efMAP", value: 35)
!42 = !DIEnumerator(name: "efEPS", value: 36)
!43 = !DIEnumerator(name: "efMAT", value: 37)
!44 = !DIEnumerator(name: "efM2P", value: 38)
!45 = !DIEnumerator(name: "efMTX", value: 39)
!46 = !DIEnumerator(name: "efEDI", value: 40)
!47 = !DIEnumerator(name: "efEDO", value: 41)
!48 = !DIEnumerator(name: "efPPA", value: 42)
!49 = !DIEnumerator(name: "efPDO", value: 43)
!50 = !DIEnumerator(name: "efHAT", value: 44)
!51 = !DIEnumerator(name: "efXPM", value: 45)
!52 = !DIEnumerator(name: "efNR", value: 46)
!53 = !{!54, !55, !56}
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!57 = !{!58, !125, !131, !138, !144, !150, !153, !156, !159, !162, !165, !168, !177, !186, !199, !202, !205, !208, !222, !236, !242, !248}
!58 = !DISubprogram(name: "__sputc", scope: !59, file: !59, line: 348, type: !60, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !122)
!59 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!60 = !DISubroutineType(types: !61)
!61 = !{!55, !55, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 153, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !59, line: 122, size: 1216, align: 64, elements: !65)
!65 = !{!66, !69, !70, !71, !73, !74, !79, !80, !81, !85, !90, !100, !106, !107, !110, !111, !115, !119, !120, !121}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !64, file: !59, line: 123, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !64, file: !59, line: 124, baseType: !55, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !64, file: !59, line: 125, baseType: !55, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !59, line: 126, baseType: !72, size: 16, align: 16, offset: 128)
!72 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !64, file: !59, line: 127, baseType: !72, size: 16, align: 16, offset: 144)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !64, file: !59, line: 128, baseType: !75, size: 128, align: 64, offset: 192)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !59, line: 88, size: 128, align: 64, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !75, file: !59, line: 89, baseType: !67, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !75, file: !59, line: 90, baseType: !55, size: 32, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !64, file: !59, line: 129, baseType: !55, size: 32, align: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !64, file: !59, line: 132, baseType: !56, size: 64, align: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !64, file: !59, line: 133, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!55, !56}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !64, file: !59, line: 134, baseType: !86, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!55, !56, !89, !55}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !64, file: !59, line: 135, baseType: !91, size: 64, align: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !56, !94, !55}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !59, line: 77, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !96, line: 71, baseType: !97)
!96 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !98, line: 46, baseType: !99)
!98 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!99 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !64, file: !59, line: 136, baseType: !101, size: 64, align: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!55, !56, !104, !55}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !64, file: !59, line: 139, baseType: !75, size: 128, align: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !64, file: !59, line: 140, baseType: !108, size: 64, align: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !59, line: 94, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !64, file: !59, line: 141, baseType: !55, size: 32, align: 32, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !64, file: !59, line: 144, baseType: !112, size: 24, align: 8, offset: 928)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 24, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 3)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !64, file: !59, line: 145, baseType: !116, size: 8, align: 8, offset: 952)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !64, file: !59, line: 148, baseType: !75, size: 128, align: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !64, file: !59, line: 151, baseType: !55, size: 32, align: 32, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !59, line: 152, baseType: !94, size: 64, align: 64, offset: 1152)
!122 = !{!123, !124}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !58, file: !59, line: 348, type: !55)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !58, file: !59, line: 348, type: !62)
!125 = !DISubprogram(name: "__sigbits", scope: !126, file: !126, line: 114, type: !127, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !129)
!126 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!127 = !DISubroutineType(types: !128)
!128 = !{!55, !55}
!129 = !{!130}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !125, file: !126, line: 114, type: !55)
!131 = !DISubprogram(name: "__inline_isfinitef", scope: !132, file: !132, line: 204, type: !133, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !136)
!132 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!133 = !DISubroutineType(types: !134)
!134 = !{!55, !135}
!135 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!136 = !{!137}
!137 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !131, file: !132, line: 204, type: !135)
!138 = !DISubprogram(name: "__inline_isfinited", scope: !132, file: !132, line: 207, type: !139, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !142)
!139 = !DISubroutineType(types: !140)
!140 = !{!55, !141}
!141 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!142 = !{!143}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !138, file: !132, line: 207, type: !141)
!144 = !DISubprogram(name: "__inline_isfinitel", scope: !132, file: !132, line: 210, type: !145, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !148)
!145 = !DISubroutineType(types: !146)
!146 = !{!55, !147}
!147 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!148 = !{!149}
!149 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !144, file: !132, line: 210, type: !147)
!150 = !DISubprogram(name: "__inline_isinff", scope: !132, file: !132, line: 213, type: !133, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !151)
!151 = !{!152}
!152 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !150, file: !132, line: 213, type: !135)
!153 = !DISubprogram(name: "__inline_isinfd", scope: !132, file: !132, line: 216, type: !139, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !154)
!154 = !{!155}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !153, file: !132, line: 216, type: !141)
!156 = !DISubprogram(name: "__inline_isinfl", scope: !132, file: !132, line: 219, type: !145, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !157)
!157 = !{!158}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !156, file: !132, line: 219, type: !147)
!159 = !DISubprogram(name: "__inline_isnanf", scope: !132, file: !132, line: 222, type: !133, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !160)
!160 = !{!161}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !159, file: !132, line: 222, type: !135)
!162 = !DISubprogram(name: "__inline_isnand", scope: !132, file: !132, line: 225, type: !139, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !163)
!163 = !{!164}
!164 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !162, file: !132, line: 225, type: !141)
!165 = !DISubprogram(name: "__inline_isnanl", scope: !132, file: !132, line: 228, type: !145, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !166)
!166 = !{!167}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !165, file: !132, line: 228, type: !147)
!168 = !DISubprogram(name: "__inline_signbitf", scope: !132, file: !132, line: 231, type: !133, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !169)
!169 = !{!170, !171}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !168, file: !132, line: 231, type: !135)
!171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !168, file: !132, line: 232, type: !172)
!172 = !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !132, line: 232, size: 32, align: 32, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !172, file: !132, line: 232, baseType: !135, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !172, file: !132, line: 232, baseType: !176, size: 32, align: 32)
!176 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!177 = !DISubprogram(name: "__inline_signbitd", scope: !132, file: !132, line: 236, type: !139, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !178)
!178 = !{!179, !180}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !177, file: !132, line: 236, type: !141)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !177, file: !132, line: 237, type: !181)
!181 = !DICompositeType(tag: DW_TAG_union_type, scope: !177, file: !132, line: 237, size: 64, align: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !181, file: !132, line: 237, baseType: !141, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !181, file: !132, line: 237, baseType: !185, size: 64, align: 64)
!185 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!186 = !DISubprogram(name: "__inline_signbitl", scope: !132, file: !132, line: 242, type: !145, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !187)
!187 = !{!188, !189}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !132, line: 242, type: !147)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !186, file: !132, line: 246, type: !190)
!190 = !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !132, line: 243, size: 128, align: 128, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !190, file: !132, line: 244, baseType: !147, size: 128, align: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !190, file: !132, line: 245, baseType: !194, size: 128, align: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !132, line: 245, size: 128, align: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !194, file: !132, line: 245, baseType: !185, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !194, file: !132, line: 245, baseType: !198, size: 16, align: 16, offset: 64)
!198 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!199 = !DISubprogram(name: "__inline_isnormalf", scope: !132, file: !132, line: 257, type: !133, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !200)
!200 = !{!201}
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !199, file: !132, line: 257, type: !135)
!202 = !DISubprogram(name: "__inline_isnormald", scope: !132, file: !132, line: 260, type: !139, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !203)
!203 = !{!204}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !202, file: !132, line: 260, type: !141)
!205 = !DISubprogram(name: "__inline_isnormall", scope: !132, file: !132, line: 263, type: !145, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !206)
!206 = !{!207}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !205, file: !132, line: 263, type: !147)
!208 = !DISubprogram(name: "__sincosf", scope: !132, file: !132, line: 642, type: !209, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !212)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !135, !211, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!212 = !{!213, !214, !215, !216}
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !208, file: !132, line: 642, type: !135)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !208, file: !132, line: 642, type: !211)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !208, file: !132, line: 642, type: !211)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !208, file: !132, line: 643, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !132, line: 634, size: 64, align: 32, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !218, file: !132, line: 634, baseType: !135, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !218, file: !132, line: 634, baseType: !135, size: 32, align: 32, offset: 32)
!222 = !DISubprogram(name: "__sincos", scope: !132, file: !132, line: 647, type: !223, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !226)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !141, !225, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!226 = !{!227, !228, !229, !230}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !222, file: !132, line: 647, type: !141)
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !222, file: !132, line: 647, type: !225)
!229 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !222, file: !132, line: 647, type: !225)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !222, file: !132, line: 648, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !132, line: 635, size: 128, align: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !232, file: !132, line: 635, baseType: !141, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !232, file: !132, line: 635, baseType: !141, size: 64, align: 64, offset: 64)
!236 = !DISubprogram(name: "__sincospif", scope: !132, file: !132, line: 652, type: !209, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !236, file: !132, line: 652, type: !135)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !236, file: !132, line: 652, type: !211)
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !236, file: !132, line: 652, type: !211)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !236, file: !132, line: 653, type: !217)
!242 = !DISubprogram(name: "__sincospi", scope: !132, file: !132, line: 657, type: !223, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !242, file: !132, line: 657, type: !141)
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !242, file: !132, line: 657, type: !225)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !242, file: !132, line: 657, type: !225)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !242, file: !132, line: 658, type: !231)
!248 = !DISubprogram(name: "main", scope: !1, file: !1, line: 48, type: !249, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8**)* @main, variables: !252)
!249 = !DISubroutineType(types: !250)
!250 = !{!55, !55, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!252 = !{!253, !254, !255, !267, !268, !276, !278, !279}
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !248, file: !1, line: 48, type: !55)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !248, file: !1, line: 48, type: !251)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr", scope: !248, file: !1, line: 116, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !258, line: 40, baseType: !259)
!258 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!259 = !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 36, size: 192, align: 32, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !259, file: !258, line: 37, baseType: !55, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !259, file: !258, line: 37, baseType: !55, size: 32, align: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !259, file: !258, line: 38, baseType: !55, size: 32, align: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !259, file: !258, line: 38, baseType: !55, size: 32, align: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !259, file: !258, line: 39, baseType: !55, size: 32, align: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !259, file: !258, line: 39, baseType: !55, size: 32, align: 32, offset: 160)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mcr", scope: !248, file: !1, line: 116, type: !256)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "edyn", scope: !248, file: !1, line: 172, type: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_edsamyn", file: !270, line: 40, baseType: !271)
!270 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/edsams.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!271 = !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 36, size: 192, align: 64, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bEdsam", scope: !271, file: !270, line: 37, baseType: !55, size: 32, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "edinam", scope: !271, file: !270, line: 38, baseType: !89, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "edonam", scope: !271, file: !270, line: 39, baseType: !89, size: 64, align: 64, offset: 128)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Flags", scope: !248, file: !1, line: 173, type: !277)
!277 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pca_quiet", scope: !248, file: !1, line: 174, type: !277)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !248, file: !1, line: 175, type: !55)
!280 = !{!281, !285, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!281 = !DIGlobalVariable(name: "desc", scope: !248, file: !1, line: 50, type: !282, isLocal: true, isDefinition: true, variable: [63 x i8*]* @main.desc)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 4032, align: 64, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 63)
!285 = !DIGlobalVariable(name: "fnm", scope: !248, file: !1, line: 117, type: !286, isLocal: true, isDefinition: true, variable: [22 x %struct.t_filenm]* @main.fnm)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 5632, align: 64, elements: !294)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_filenm", file: !4, line: 62, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 57, size: 256, align: 64, elements: !289)
!289 = !{!290, !291, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ftp", scope: !288, file: !4, line: 58, baseType: !55, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !288, file: !4, line: 59, baseType: !89, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !288, file: !4, line: 60, baseType: !89, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !4, line: 61, baseType: !277, size: 64, align: 64, offset: 192)
!294 = !{!295}
!295 = !DISubrange(count: 22)
!296 = !DIGlobalVariable(name: "bVerbose", scope: !248, file: !1, line: 144, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.bVerbose)
!297 = !DIGlobalVariable(name: "bCompact", scope: !248, file: !1, line: 145, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.bCompact)
!298 = !DIGlobalVariable(name: "bSepDVDL", scope: !248, file: !1, line: 146, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.bSepDVDL)
!299 = !DIGlobalVariable(name: "bMultiSim", scope: !248, file: !1, line: 147, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.bMultiSim)
!300 = !DIGlobalVariable(name: "bGlas", scope: !248, file: !1, line: 148, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.bGlas)
!301 = !DIGlobalVariable(name: "bIonize", scope: !248, file: !1, line: 149, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.bIonize)
!302 = !DIGlobalVariable(name: "nDLB", scope: !248, file: !1, line: 151, type: !55, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariable(name: "nnodes", scope: !248, file: !1, line: 152, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.nnodes)
!304 = !DIGlobalVariable(name: "nstepout", scope: !248, file: !1, line: 153, type: !55, isLocal: true, isDefinition: true, variable: i32* @main.nstepout)
!305 = !DIGlobalVariable(name: "pa", scope: !248, file: !1, line: 154, type: !306, isLocal: true, isDefinition: true, variable: [8 x %struct.t_pargs]* @main.pa)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 2048, align: 64, elements: !331)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pargs", file: !308, line: 105, baseType: !309)
!308 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/readinp.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!309 = !DICompositeType(tag: DW_TAG_structure_type, file: !308, line: 91, size: 256, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !330}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !309, file: !308, line: 92, baseType: !89, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bSet", scope: !309, file: !308, line: 93, baseType: !55, size: 32, align: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !308, line: 94, baseType: !55, size: 32, align: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !309, file: !308, line: 103, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !308, line: 95, size: 64, align: 64, elements: !316)
!316 = !{!317, !318, !320, !324, !325, !326}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !315, file: !308, line: 96, baseType: !56, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !315, file: !308, line: 97, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !315, file: !308, line: 98, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !323, line: 87, baseType: !135)
!323 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !315, file: !308, line: 99, baseType: !251, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !315, file: !308, line: 101, baseType: !319, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !315, file: !308, line: 102, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !323, line: 101, baseType: !329)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 96, align: 32, elements: !113)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !309, file: !308, line: 104, baseType: !89, size: 64, align: 64, offset: 192)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !{}
!334 = !{i32 2, !"Dwarf Version", i32 2}
!335 = !{i32 2, !"Debug Info Version", i32 700000003}
!336 = !{i32 1, !"PIC Level", i32 2}
!337 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!338 = !DIExpression()
!339 = !DILocation(line: 348, column: 40, scope: !58)
!340 = !DILocation(line: 348, column: 50, scope: !58)
!341 = !DILocation(line: 349, column: 12, scope: !342)
!342 = distinct !DILexicalBlock(scope: !58, file: !59, line: 349, column: 6)
!343 = !DILocation(line: 349, column: 6, scope: !342)
!344 = !{!345, !349, i64 12}
!345 = !{!"__sFILE", !346, i64 0, !349, i64 8, !349, i64 12, !350, i64 16, !350, i64 18, !351, i64 24, !349, i64 40, !346, i64 48, !346, i64 56, !346, i64 64, !346, i64 72, !346, i64 80, !351, i64 88, !346, i64 104, !349, i64 112, !347, i64 116, !347, i64 119, !351, i64 120, !349, i64 136, !352, i64 144}
!346 = !{!"any pointer", !347, i64 0}
!347 = !{!"omnipotent char", !348, i64 0}
!348 = !{!"Simple C/C++ TBAA"}
!349 = !{!"int", !347, i64 0}
!350 = !{!"short", !347, i64 0}
!351 = !{!"__sbuf", !346, i64 0, !349, i64 8}
!352 = !{!"long long", !347, i64 0}
!353 = !DILocation(line: 349, column: 15, scope: !342)
!354 = !DILocation(line: 349, column: 20, scope: !342)
!355 = !DILocation(line: 350, column: 10, scope: !342)
!356 = !DILocation(line: 349, column: 38, scope: !342)
!357 = !{!345, !349, i64 40}
!358 = !DILocation(line: 349, column: 31, scope: !342)
!359 = !DILocation(line: 349, column: 59, scope: !342)
!360 = !DILocation(line: 349, column: 47, scope: !342)
!361 = !DILocation(line: 350, column: 23, scope: !342)
!362 = !DILocation(line: 350, column: 16, scope: !342)
!363 = !DILocation(line: 350, column: 18, scope: !342)
!364 = !{!345, !346, i64 0}
!365 = !DILocation(line: 350, column: 21, scope: !342)
!366 = !{!347, !347, i64 0}
!367 = !DILocation(line: 350, column: 3, scope: !342)
!368 = !DILocation(line: 352, column: 11, scope: !342)
!369 = !DILocation(line: 352, column: 3, scope: !342)
!370 = !DILocation(line: 353, column: 1, scope: !58)
!371 = !DILocation(line: 114, column: 15, scope: !125)
!372 = !DILocation(line: 116, column: 20, scope: !125)
!373 = !DILocation(line: 116, column: 12, scope: !125)
!374 = !DILocation(line: 116, column: 57, scope: !125)
!375 = !DILocation(line: 116, column: 45, scope: !125)
!376 = !DILocation(line: 116, column: 5, scope: !125)
!377 = !DILocation(line: 204, column: 53, scope: !131)
!378 = !DILocation(line: 205, column: 16, scope: !131)
!379 = !DILocation(line: 205, column: 23, scope: !131)
!380 = !DILocation(line: 205, column: 26, scope: !131)
!381 = !DILocation(line: 205, column: 47, scope: !131)
!382 = !DILocation(line: 205, column: 5, scope: !131)
!383 = !DILocation(line: 207, column: 54, scope: !138)
!384 = !DILocation(line: 208, column: 16, scope: !138)
!385 = !DILocation(line: 208, column: 23, scope: !138)
!386 = !DILocation(line: 208, column: 26, scope: !138)
!387 = !DILocation(line: 208, column: 46, scope: !138)
!388 = !DILocation(line: 208, column: 5, scope: !138)
!389 = !DILocation(line: 210, column: 59, scope: !144)
!390 = !DILocation(line: 211, column: 16, scope: !144)
!391 = !DILocation(line: 211, column: 23, scope: !144)
!392 = !DILocation(line: 211, column: 26, scope: !144)
!393 = !DILocation(line: 211, column: 47, scope: !144)
!394 = !DILocation(line: 211, column: 5, scope: !144)
!395 = !DILocation(line: 213, column: 50, scope: !150)
!396 = !DILocation(line: 214, column: 12, scope: !150)
!397 = !DILocation(line: 214, column: 33, scope: !150)
!398 = !DILocation(line: 214, column: 5, scope: !150)
!399 = !DILocation(line: 216, column: 51, scope: !153)
!400 = !DILocation(line: 217, column: 12, scope: !153)
!401 = !DILocation(line: 217, column: 32, scope: !153)
!402 = !DILocation(line: 217, column: 5, scope: !153)
!403 = !DILocation(line: 219, column: 56, scope: !156)
