; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mshift.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.5 }
%struct.anon.5 = type { float, float, float, float, float, float }
%struct.t_forcerec = type { i32, float, float, float, float, float, float, i32, float, float, float, float, float, i32, i32, float, i32, float, float*, float*, float*, float*, float, float, float*, float, float, float, float, i32, float, float, i32, i32, i32, i32, i32, i32, i32, i32, [3 x float], i32, i32, i32, i32, i32*, i32*, [3 x float]*, [3 x float]*, [13 x %struct.t_nblist], [13 x %struct.t_nblist], i32, i32, [3 x float]*, [3 x float]*, [3 x float]*, i32, float, [3 x float]*, i32, i32*, float*, i32, i32, i32, float*, i32*, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !57, subprograms: !65, globals: !678, imports: !681)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mshift.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!6 = !DIEnumerator(name: "F_BONDS", value: 0)
!7 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!8 = !DIEnumerator(name: "F_MORSE", value: 2)
!9 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!10 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!11 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!12 = !DIEnumerator(name: "F_ANGLES", value: 6)
!13 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!14 = !DIEnumerator(name: "F_PDIHS", value: 8)
!15 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!16 = !DIEnumerator(name: "F_IDIHS", value: 10)
!17 = !DIEnumerator(name: "F_LJ14", value: 11)
!18 = !DIEnumerator(name: "F_COUL14", value: 12)
!19 = !DIEnumerator(name: "F_LJ", value: 13)
!20 = !DIEnumerator(name: "F_BHAM", value: 14)
!21 = !DIEnumerator(name: "F_LJLR", value: 15)
!22 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!23 = !DIEnumerator(name: "F_SR", value: 17)
!24 = !DIEnumerator(name: "F_LR", value: 18)
!25 = !DIEnumerator(name: "F_WPOL", value: 19)
!26 = !DIEnumerator(name: "F_POSRES", value: 20)
!27 = !DIEnumerator(name: "F_DISRES", value: 21)
!28 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!29 = !DIEnumerator(name: "F_ORIRES", value: 23)
!30 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!31 = !DIEnumerator(name: "F_ANGRES", value: 25)
!32 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!33 = !DIEnumerator(name: "F_SHAKE", value: 27)
!34 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!35 = !DIEnumerator(name: "F_SETTLE", value: 29)
!36 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!37 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!38 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!39 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!40 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!41 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!42 = !DIEnumerator(name: "F_EQM", value: 36)
!43 = !DIEnumerator(name: "F_EPOT", value: 37)
!44 = !DIEnumerator(name: "F_EKIN", value: 38)
!45 = !DIEnumerator(name: "F_ETOT", value: 39)
!46 = !DIEnumerator(name: "F_TEMP", value: 40)
!47 = !DIEnumerator(name: "F_PRES", value: 41)
!48 = !DIEnumerator(name: "F_DVDL", value: 42)
!49 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!50 = !DIEnumerator(name: "F_NRE", value: 44)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 58, size: 32, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "egcolWhite", value: 0)
!54 = !DIEnumerator(name: "egcolGrey", value: 1)
!55 = !DIEnumerator(name: "egcolBlack", value: 2)
!56 = !DIEnumerator(name: "egcolNR", value: 3)
!57 = !{!58, !59, !60}
!58 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 30, baseType: !62)
!61 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !63, line: 92, baseType: !64)
!63 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!64 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!65 = !{!66, !133, !139, !146, !152, !158, !161, !164, !167, !170, !173, !176, !185, !194, !207, !210, !213, !216, !230, !244, !250, !256, !286, !435, !440, !460, !472, !482, !498, !513, !527, !540, !551, !569, !588, !600, !611, !632, !646, !659, !670}
!66 = !DISubprogram(name: "__sputc", scope: !67, file: !67, line: 348, type: !68, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !130)
!67 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DISubroutineType(types: !69)
!69 = !{!59, !59, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !67, line: 153, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !67, line: 122, size: 1216, align: 64, elements: !73)
!73 = !{!74, !77, !78, !79, !81, !82, !87, !88, !90, !94, !99, !108, !114, !115, !118, !119, !123, !127, !128, !129}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !72, file: !67, line: 123, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !72, file: !67, line: 124, baseType: !59, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !72, file: !67, line: 125, baseType: !59, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !67, line: 126, baseType: !80, size: 16, align: 16, offset: 128)
!80 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !72, file: !67, line: 127, baseType: !80, size: 16, align: 16, offset: 144)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !72, file: !67, line: 128, baseType: !83, size: 128, align: 64, offset: 192)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !67, line: 88, size: 128, align: 64, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !83, file: !67, line: 89, baseType: !75, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !83, file: !67, line: 90, baseType: !59, size: 32, align: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !72, file: !67, line: 129, baseType: !59, size: 32, align: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !72, file: !67, line: 132, baseType: !89, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !72, file: !67, line: 133, baseType: !91, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!59, !89}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !72, file: !67, line: 134, baseType: !95, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!59, !89, !98, !59}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !72, file: !67, line: 135, baseType: !100, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !89, !103, !59}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !67, line: 77, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !63, line: 46, baseType: !107)
!107 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !72, file: !67, line: 136, baseType: !109, size: 64, align: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!59, !89, !112, !59}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !72, file: !67, line: 139, baseType: !83, size: 128, align: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !72, file: !67, line: 140, baseType: !116, size: 64, align: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !67, line: 94, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !72, file: !67, line: 141, baseType: !59, size: 32, align: 32, offset: 896)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !72, file: !67, line: 144, baseType: !120, size: 24, align: 8, offset: 928)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !72, file: !67, line: 145, baseType: !124, size: 8, align: 8, offset: 952)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !72, file: !67, line: 148, baseType: !83, size: 128, align: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !72, file: !67, line: 151, baseType: !59, size: 32, align: 32, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !67, line: 152, baseType: !103, size: 64, align: 64, offset: 1152)
!130 = !{!131, !132}
!131 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !66, file: !67, line: 348, type: !59)
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !66, file: !67, line: 348, type: !70)
!133 = !DISubprogram(name: "__sigbits", scope: !134, file: !134, line: 114, type: !135, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !137)
!134 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!135 = !DISubroutineType(types: !136)
!136 = !{!59, !59}
!137 = !{!138}
!138 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !133, file: !134, line: 114, type: !59)
!139 = !DISubprogram(name: "__inline_isfinitef", scope: !140, file: !140, line: 204, type: !141, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !144)
!140 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!141 = !DISubroutineType(types: !142)
!142 = !{!59, !143}
!143 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!144 = !{!145}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !139, file: !140, line: 204, type: !143)
!146 = !DISubprogram(name: "__inline_isfinited", scope: !140, file: !140, line: 207, type: !147, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !150)
!147 = !DISubroutineType(types: !148)
!148 = !{!59, !149}
!149 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!150 = !{!151}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !146, file: !140, line: 207, type: !149)
!152 = !DISubprogram(name: "__inline_isfinitel", scope: !140, file: !140, line: 210, type: !153, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !156)
!153 = !DISubroutineType(types: !154)
!154 = !{!59, !155}
!155 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !152, file: !140, line: 210, type: !155)
!158 = !DISubprogram(name: "__inline_isinff", scope: !140, file: !140, line: 213, type: !141, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !159)
!159 = !{!160}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !158, file: !140, line: 213, type: !143)
!161 = !DISubprogram(name: "__inline_isinfd", scope: !140, file: !140, line: 216, type: !147, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !162)
!162 = !{!163}
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !161, file: !140, line: 216, type: !149)
!164 = !DISubprogram(name: "__inline_isinfl", scope: !140, file: !140, line: 219, type: !153, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !165)
!165 = !{!166}
!166 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !164, file: !140, line: 219, type: !155)
!167 = !DISubprogram(name: "__inline_isnanf", scope: !140, file: !140, line: 222, type: !141, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !168)
!168 = !{!169}
!169 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !167, file: !140, line: 222, type: !143)
!170 = !DISubprogram(name: "__inline_isnand", scope: !140, file: !140, line: 225, type: !147, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !171)
!171 = !{!172}
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !170, file: !140, line: 225, type: !149)
!173 = !DISubprogram(name: "__inline_isnanl", scope: !140, file: !140, line: 228, type: !153, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !174)
!174 = !{!175}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !173, file: !140, line: 228, type: !155)
!176 = !DISubprogram(name: "__inline_signbitf", scope: !140, file: !140, line: 231, type: !141, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !177)
!177 = !{!178, !179}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !176, file: !140, line: 231, type: !143)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !176, file: !140, line: 232, type: !180)
!180 = !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !140, line: 232, size: 32, align: 32, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !180, file: !140, line: 232, baseType: !143, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !180, file: !140, line: 232, baseType: !184, size: 32, align: 32)
!184 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!185 = !DISubprogram(name: "__inline_signbitd", scope: !140, file: !140, line: 236, type: !147, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !186)
!186 = !{!187, !188}
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !185, file: !140, line: 236, type: !149)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !185, file: !140, line: 237, type: !189)
!189 = !DICompositeType(tag: DW_TAG_union_type, scope: !185, file: !140, line: 237, size: 64, align: 64, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !189, file: !140, line: 237, baseType: !149, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !189, file: !140, line: 237, baseType: !193, size: 64, align: 64)
!193 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!194 = !DISubprogram(name: "__inline_signbitl", scope: !140, file: !140, line: 242, type: !153, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !195)
!195 = !{!196, !197}
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !194, file: !140, line: 242, type: !155)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !194, file: !140, line: 246, type: !198)
!198 = !DICompositeType(tag: DW_TAG_union_type, scope: !194, file: !140, line: 243, size: 128, align: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !198, file: !140, line: 244, baseType: !155, size: 128, align: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !198, file: !140, line: 245, baseType: !202, size: 128, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !140, line: 245, size: 128, align: 64, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !202, file: !140, line: 245, baseType: !193, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !202, file: !140, line: 245, baseType: !206, size: 16, align: 16, offset: 64)
!206 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!207 = !DISubprogram(name: "__inline_isnormalf", scope: !140, file: !140, line: 257, type: !141, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !208)
!208 = !{!209}
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !207, file: !140, line: 257, type: !143)
!210 = !DISubprogram(name: "__inline_isnormald", scope: !140, file: !140, line: 260, type: !147, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !211)
!211 = !{!212}
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !210, file: !140, line: 260, type: !149)
!213 = !DISubprogram(name: "__inline_isnormall", scope: !140, file: !140, line: 263, type: !153, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !214)
!214 = !{!215}
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !213, file: !140, line: 263, type: !155)
!216 = !DISubprogram(name: "__sincosf", scope: !140, file: !140, line: 642, type: !217, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !220)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !143, !219, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!220 = !{!221, !222, !223, !224}
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !216, file: !140, line: 642, type: !143)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !216, file: !140, line: 642, type: !219)
!223 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !216, file: !140, line: 642, type: !219)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !216, file: !140, line: 643, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !140, line: 634, size: 64, align: 32, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !226, file: !140, line: 634, baseType: !143, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !226, file: !140, line: 634, baseType: !143, size: 32, align: 32, offset: 32)
!230 = !DISubprogram(name: "__sincos", scope: !140, file: !140, line: 647, type: !231, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !234)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !149, !233, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!234 = !{!235, !236, !237, !238}
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !230, file: !140, line: 647, type: !149)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !230, file: !140, line: 647, type: !233)
!237 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !230, file: !140, line: 647, type: !233)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !230, file: !140, line: 648, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !140, line: 635, size: 128, align: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !240, file: !140, line: 635, baseType: !149, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !240, file: !140, line: 635, baseType: !149, size: 64, align: 64, offset: 64)
!244 = !DISubprogram(name: "__sincospif", scope: !140, file: !140, line: 652, type: !217, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !245)
!245 = !{!246, !247, !248, !249}
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !244, file: !140, line: 652, type: !143)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !244, file: !140, line: 652, type: !219)
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !244, file: !140, line: 652, type: !219)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !244, file: !140, line: 653, type: !225)
!250 = !DISubprogram(name: "__sincospi", scope: !140, file: !140, line: 657, type: !231, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !250, file: !140, line: 657, type: !149)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !250, file: !140, line: 657, type: !233)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !250, file: !140, line: 657, type: !233)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !250, file: !140, line: 658, type: !239)
!256 = !DISubprogram(name: "p_graph", scope: !1, file: !1, line: 138, type: !257, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i8*, %struct.t_graph*)* @p_graph, variables: !280)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !70, !98, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_graph", file: !261, line: 47, baseType: !262)
!261 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 38, size: 384, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !271, !276}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "maxbond", scope: !262, file: !261, line: 39, baseType: !59, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !262, file: !261, line: 40, baseType: !59, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nbound", scope: !262, file: !261, line: 41, baseType: !59, size: 32, align: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !262, file: !261, line: 42, baseType: !59, size: 32, align: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !262, file: !261, line: 43, baseType: !59, size: 32, align: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nedge", scope: !262, file: !261, line: 44, baseType: !270, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "edge", scope: !262, file: !261, line: 45, baseType: !272, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !275, line: 73, baseType: !59)
!275 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ishift", scope: !262, file: !261, line: 46, baseType: !277, size: 64, align: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !275, line: 107, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 96, align: 32, elements: !121)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !256, file: !1, line: 138, type: !70)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 2, scope: !256, file: !1, line: 138, type: !98)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !256, file: !1, line: 138, type: !259)
!284 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !256, file: !1, line: 140, type: !59)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !256, file: !1, line: 140, type: !59)
!286 = !DISubprogram(name: "mk_graph", scope: !1, file: !1, line: 229, type: !287, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: %struct.t_graph* (%struct.t_idef*, i32, i32, i32)* @mk_graph, variables: !428)
!287 = !DISubroutineType(types: !288)
!288 = !{!259, !289, !59, !59, !59}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !4, line: 188, baseType: !291)
!291 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 179, size: 366336, align: 64, elements: !292)
!292 = !{!293, !294, !295, !296, !299, !413}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !291, file: !4, line: 181, baseType: !59, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !291, file: !4, line: 182, baseType: !59, size: 32, align: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !291, file: !4, line: 183, baseType: !59, size: 32, align: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !291, file: !4, line: 184, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !4, line: 133, baseType: !59)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !291, file: !4, line: 185, baseType: !300, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !4, line: 131, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_union_type, file: !4, line: 97, size: 192, align: 32, elements: !303)
!303 = !{!304, !311, !318, !324, !333, !338, !345, !353, !358, !363, !369, !375, !382, !391, !400, !409}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !302, file: !4, line: 105, baseType: !305, size: 96, align: 32)
!305 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 105, size: 96, align: 32, elements: !306)
!306 = !{!307, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !305, file: !4, line: 105, baseType: !308, size: 32, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !275, line: 87, baseType: !143)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !305, file: !4, line: 105, baseType: !308, size: 32, align: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !305, file: !4, line: 105, baseType: !308, size: 32, align: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !302, file: !4, line: 106, baseType: !312, size: 128, align: 32)
!312 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 106, size: 128, align: 32, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !312, file: !4, line: 106, baseType: !308, size: 32, align: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !312, file: !4, line: 106, baseType: !308, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !312, file: !4, line: 106, baseType: !308, size: 32, align: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !312, file: !4, line: 106, baseType: !308, size: 32, align: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !302, file: !4, line: 108, baseType: !319, size: 96, align: 32)
!319 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 108, size: 96, align: 32, elements: !320)
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !319, file: !4, line: 108, baseType: !308, size: 32, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !319, file: !4, line: 108, baseType: !308, size: 32, align: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !319, file: !4, line: 108, baseType: !308, size: 32, align: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !302, file: !4, line: 110, baseType: !325, size: 192, align: 32)
!325 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 110, size: 192, align: 32, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !325, file: !4, line: 110, baseType: !308, size: 32, align: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !325, file: !4, line: 110, baseType: !308, size: 32, align: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !325, file: !4, line: 110, baseType: !308, size: 32, align: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !325, file: !4, line: 110, baseType: !308, size: 32, align: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !325, file: !4, line: 110, baseType: !308, size: 32, align: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !325, file: !4, line: 110, baseType: !308, size: 32, align: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !302, file: !4, line: 111, baseType: !334, size: 64, align: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 111, size: 64, align: 32, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !334, file: !4, line: 111, baseType: !308, size: 32, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !334, file: !4, line: 111, baseType: !308, size: 32, align: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !302, file: !4, line: 112, baseType: !339, size: 128, align: 32)
!339 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 112, size: 128, align: 32, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !339, file: !4, line: 112, baseType: !308, size: 32, align: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !339, file: !4, line: 112, baseType: !308, size: 32, align: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !339, file: !4, line: 112, baseType: !308, size: 32, align: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !339, file: !4, line: 112, baseType: !308, size: 32, align: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !302, file: !4, line: 117, baseType: !346, size: 160, align: 32)
!346 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 117, size: 160, align: 32, elements: !347)
!347 = !{!348, !349, !350, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !346, file: !4, line: 117, baseType: !308, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !346, file: !4, line: 117, baseType: !308, size: 32, align: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !346, file: !4, line: 117, baseType: !59, size: 32, align: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !346, file: !4, line: 117, baseType: !308, size: 32, align: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !346, file: !4, line: 117, baseType: !308, size: 32, align: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !302, file: !4, line: 118, baseType: !354, size: 64, align: 32)
!354 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 118, size: 64, align: 32, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !354, file: !4, line: 118, baseType: !308, size: 32, align: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !354, file: !4, line: 118, baseType: !308, size: 32, align: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !302, file: !4, line: 123, baseType: !359, size: 64, align: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 123, size: 64, align: 32, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !359, file: !4, line: 123, baseType: !308, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !359, file: !4, line: 123, baseType: !308, size: 32, align: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !302, file: !4, line: 124, baseType: !364, size: 96, align: 32)
!364 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 124, size: 96, align: 32, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !364, file: !4, line: 124, baseType: !308, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !364, file: !4, line: 124, baseType: !308, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !364, file: !4, line: 124, baseType: !308, size: 32, align: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !302, file: !4, line: 125, baseType: !370, size: 192, align: 32)
!370 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 125, size: 192, align: 32, elements: !371)
!371 = !{!372, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !370, file: !4, line: 125, baseType: !373, size: 96, align: 32)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 96, align: 32, elements: !121)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !370, file: !4, line: 125, baseType: !373, size: 96, align: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !302, file: !4, line: 126, baseType: !376, size: 192, align: 32)
!376 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 126, size: 192, align: 32, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !376, file: !4, line: 126, baseType: !379, size: 192, align: 32)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 192, align: 32, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 6)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !302, file: !4, line: 127, baseType: !383, size: 192, align: 32)
!383 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 127, size: 192, align: 32, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !383, file: !4, line: 127, baseType: !308, size: 32, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !383, file: !4, line: 127, baseType: !308, size: 32, align: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !383, file: !4, line: 127, baseType: !308, size: 32, align: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !383, file: !4, line: 127, baseType: !308, size: 32, align: 32, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !383, file: !4, line: 127, baseType: !308, size: 32, align: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !383, file: !4, line: 127, baseType: !308, size: 32, align: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !302, file: !4, line: 128, baseType: !392, size: 192, align: 32)
!392 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 128, size: 192, align: 32, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !392, file: !4, line: 128, baseType: !308, size: 32, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !392, file: !4, line: 128, baseType: !308, size: 32, align: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !392, file: !4, line: 128, baseType: !308, size: 32, align: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !392, file: !4, line: 128, baseType: !308, size: 32, align: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !392, file: !4, line: 128, baseType: !59, size: 32, align: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !392, file: !4, line: 128, baseType: !59, size: 32, align: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !302, file: !4, line: 129, baseType: !401, size: 192, align: 32)
!401 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 129, size: 192, align: 32, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !401, file: !4, line: 129, baseType: !59, size: 32, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !401, file: !4, line: 129, baseType: !59, size: 32, align: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !401, file: !4, line: 129, baseType: !59, size: 32, align: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !401, file: !4, line: 129, baseType: !308, size: 32, align: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !401, file: !4, line: 129, baseType: !308, size: 32, align: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !401, file: !4, line: 129, baseType: !308, size: 32, align: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !302, file: !4, line: 130, baseType: !410, size: 192, align: 32)
!410 = !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !4, line: 130, size: 192, align: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !410, file: !4, line: 130, baseType: !379, size: 192, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !291, file: !4, line: 187, baseType: !414, size: 366080, align: 64, offset: 256)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 366080, align: 64, elements: !426)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !4, line: 140, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 135, size: 8320, align: 64, elements: !417)
!417 = !{!418, !419, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !416, file: !4, line: 137, baseType: !59, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !416, file: !4, line: 138, baseType: !420, size: 8192, align: 32, offset: 32)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8192, align: 32, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !416, file: !4, line: 139, baseType: !424, size: 64, align: 64, offset: 8256)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !4, line: 45, baseType: !274)
!426 = !{!427}
!427 = !DISubrange(count: 44)
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 1, scope: !286, file: !1, line: 229, type: !289)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "natoms", arg: 2, scope: !286, file: !1, line: 229, type: !59)
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bShakeOnly", arg: 3, scope: !286, file: !1, line: 229, type: !59)
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bSettle", arg: 4, scope: !286, file: !1, line: 229, type: !59)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !286, file: !1, line: 231, type: !259)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !286, file: !1, line: 232, type: !59)
!435 = !DISubprogram(name: "done_graph", scope: !1, file: !1, line: 291, type: !436, isLocal: false, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_graph*)* @done_graph, variables: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !259}
!438 = !{!439}
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !435, file: !1, line: 291, type: !259)
!440 = !DISubprogram(name: "mk_mshift", scope: !1, file: !1, line: 412, type: !441, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_graph*, [3 x float]*, [3 x float]*)* @mk_mshift, variables: !446)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !70, !259, !443, !444}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !275, line: 101, baseType: !373)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !440, file: !1, line: 412, type: !70)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !440, file: !1, line: 412, type: !259)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 3, scope: !440, file: !1, line: 412, type: !443)
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !440, file: !1, line: 412, type: !444)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ng", scope: !440, file: !1, line: 414, type: !59)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nnodes", scope: !440, file: !1, line: 414, type: !59)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !440, file: !1, line: 414, type: !59)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nW", scope: !440, file: !1, line: 415, type: !59)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nG", scope: !440, file: !1, line: 415, type: !59)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nB", scope: !440, file: !1, line: 415, type: !59)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fW", scope: !440, file: !1, line: 416, type: !59)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fG", scope: !440, file: !1, line: 416, type: !59)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nerror", scope: !440, file: !1, line: 417, type: !59)
!460 = !DISubprogram(name: "shift_atom", scope: !1, file: !1, line: 499, type: !461, isLocal: false, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_graph*, [3 x float]*, [3 x float]*, [3 x float]*, i32)* @shift_atom, variables: !463)
