; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mvdata.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_parm = type { %struct.t_inputrec, [3 x [3 x float]], [3 x [3 x float]], [3 x [3 x float]], [3 x [3 x float]], [3 x [3 x float]] }
%struct.t_inputrec = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, float, [3 x [3 x float]], [3 x [3 x float]], i32, float, float, i32, float, float, i32, float, float, float, i32, float, float, i32, float, float, float, float, float, i32, i32, i32, float, float, float, i32, float, float, i32, i32, i32, i32, i32, float, i32, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, %struct.t_grpopts, [3 x %struct.t_cosines], [3 x %struct.t_cosines] }

!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mvdata.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3, !10, !23}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/enums.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "ebCGS", value: 0)
!7 = !DIEnumerator(name: "ebMOLS", value: 1)
!8 = !DIEnumerator(name: "ebSBLOCKS", value: 2)
!9 = !DIEnumerator(name: "ebNR", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 41, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22}
!13 = !DIEnumerator(name: "egcTC", value: 0)
!14 = !DIEnumerator(name: "egcENER", value: 1)
!15 = !DIEnumerator(name: "egcACC", value: 2)
!16 = !DIEnumerator(name: "egcFREEZE", value: 3)
!17 = !DIEnumerator(name: "egcUser1", value: 4)
!18 = !DIEnumerator(name: "egcUser2", value: 5)
!19 = !DIEnumerator(name: "egcVCM", value: 6)
!20 = !DIEnumerator(name: "egcXTC", value: 7)
!21 = !DIEnumerator(name: "egcORFIT", value: 8)
!22 = !DIEnumerator(name: "egcNR", value: 9)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 49, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!26 = !DIEnumerator(name: "F_BONDS", value: 0)
!27 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!28 = !DIEnumerator(name: "F_MORSE", value: 2)
!29 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!30 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!31 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!32 = !DIEnumerator(name: "F_ANGLES", value: 6)
!33 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!34 = !DIEnumerator(name: "F_PDIHS", value: 8)
!35 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!36 = !DIEnumerator(name: "F_IDIHS", value: 10)
!37 = !DIEnumerator(name: "F_LJ14", value: 11)
!38 = !DIEnumerator(name: "F_COUL14", value: 12)
!39 = !DIEnumerator(name: "F_LJ", value: 13)
!40 = !DIEnumerator(name: "F_BHAM", value: 14)
!41 = !DIEnumerator(name: "F_LJLR", value: 15)
!42 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!43 = !DIEnumerator(name: "F_SR", value: 17)
!44 = !DIEnumerator(name: "F_LR", value: 18)
!45 = !DIEnumerator(name: "F_WPOL", value: 19)
!46 = !DIEnumerator(name: "F_POSRES", value: 20)
!47 = !DIEnumerator(name: "F_DISRES", value: 21)
!48 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!49 = !DIEnumerator(name: "F_ORIRES", value: 23)
!50 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!51 = !DIEnumerator(name: "F_ANGRES", value: 25)
!52 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!53 = !DIEnumerator(name: "F_SHAKE", value: 27)
!54 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!55 = !DIEnumerator(name: "F_SETTLE", value: 29)
!56 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!57 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!58 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!59 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!60 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!61 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!62 = !DIEnumerator(name: "F_EQM", value: 36)
!63 = !DIEnumerator(name: "F_EPOT", value: 37)
!64 = !DIEnumerator(name: "F_EKIN", value: 38)
!65 = !DIEnumerator(name: "F_ETOT", value: 39)
!66 = !DIEnumerator(name: "F_TEMP", value: 40)
!67 = !DIEnumerator(name: "F_PRES", value: 41)
!68 = !DIEnumerator(name: "F_DVDL", value: 42)
!69 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!70 = !DIEnumerator(name: "F_NRE", value: 44)
!71 = !{!72, !73, !74}
!72 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!73 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!75 = !{!76, !143, !149, !156, !162, !168, !171, !174, !177, !180, !183, !186, !195, !204, !217, !220, !223, !226, !240, !254, !260, !266, !653, !665, !672, !679, !686, !692, !702, !709, !718, !730, !738, !746, !753, !761, !766, !770, !774, !778, !786, !794, !800, !810, !815, !820, !824}
!76 = !DISubprogram(name: "__sputc", scope: !77, file: !77, line: 348, type: !78, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !140)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!78 = !DISubroutineType(types: !79)
!79 = !{!73, !73, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 153, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !77, line: 122, size: 1216, align: 64, elements: !83)
!83 = !{!84, !87, !88, !89, !91, !92, !97, !98, !99, !103, !108, !118, !124, !125, !128, !129, !133, !137, !138, !139}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !82, file: !77, line: 123, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !82, file: !77, line: 124, baseType: !73, size: 32, align: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !82, file: !77, line: 125, baseType: !73, size: 32, align: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !82, file: !77, line: 126, baseType: !90, size: 16, align: 16, offset: 128)
!90 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !82, file: !77, line: 127, baseType: !90, size: 16, align: 16, offset: 144)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !82, file: !77, line: 128, baseType: !93, size: 128, align: 64, offset: 192)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !77, line: 88, size: 128, align: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !93, file: !77, line: 89, baseType: !85, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !93, file: !77, line: 90, baseType: !73, size: 32, align: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !82, file: !77, line: 129, baseType: !73, size: 32, align: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !82, file: !77, line: 132, baseType: !74, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !82, file: !77, line: 133, baseType: !100, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!73, !74}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !82, file: !77, line: 134, baseType: !104, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!73, !74, !107, !73}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !82, file: !77, line: 135, baseType: !109, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !74, !112, !73}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !77, line: 77, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !114, line: 71, baseType: !115)
!114 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!117 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !82, file: !77, line: 136, baseType: !119, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!73, !74, !122, !73}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !82, file: !77, line: 139, baseType: !93, size: 128, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !82, file: !77, line: 140, baseType: !126, size: 64, align: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !77, line: 94, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !82, file: !77, line: 141, baseType: !73, size: 32, align: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !82, file: !77, line: 144, baseType: !130, size: 24, align: 8, offset: 928)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 24, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !82, file: !77, line: 145, baseType: !134, size: 8, align: 8, offset: 952)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !82, file: !77, line: 148, baseType: !93, size: 128, align: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !82, file: !77, line: 151, baseType: !73, size: 32, align: 32, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !82, file: !77, line: 152, baseType: !112, size: 64, align: 64, offset: 1152)
!140 = !{!141, !142}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !76, file: !77, line: 348, type: !73)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !76, file: !77, line: 348, type: !80)
!143 = !DISubprogram(name: "__sigbits", scope: !144, file: !144, line: 114, type: !145, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !147)
!144 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DISubroutineType(types: !146)
!146 = !{!73, !73}
!147 = !{!148}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !143, file: !144, line: 114, type: !73)
!149 = !DISubprogram(name: "__inline_isfinitef", scope: !150, file: !150, line: 204, type: !151, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !154)
!150 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!151 = !DISubroutineType(types: !152)
!152 = !{!73, !153}
!153 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!154 = !{!155}
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !149, file: !150, line: 204, type: !153)
!156 = !DISubprogram(name: "__inline_isfinited", scope: !150, file: !150, line: 207, type: !157, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !160)
!157 = !DISubroutineType(types: !158)
!158 = !{!73, !159}
!159 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!160 = !{!161}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !156, file: !150, line: 207, type: !159)
!162 = !DISubprogram(name: "__inline_isfinitel", scope: !150, file: !150, line: 210, type: !163, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !166)
!163 = !DISubroutineType(types: !164)
!164 = !{!73, !165}
!165 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!166 = !{!167}
!167 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !162, file: !150, line: 210, type: !165)
!168 = !DISubprogram(name: "__inline_isinff", scope: !150, file: !150, line: 213, type: !151, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !169)
!169 = !{!170}
!170 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !168, file: !150, line: 213, type: !153)
!171 = !DISubprogram(name: "__inline_isinfd", scope: !150, file: !150, line: 216, type: !157, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !172)
!172 = !{!173}
!173 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !171, file: !150, line: 216, type: !159)
!174 = !DISubprogram(name: "__inline_isinfl", scope: !150, file: !150, line: 219, type: !163, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !175)
!175 = !{!176}
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !174, file: !150, line: 219, type: !165)
!177 = !DISubprogram(name: "__inline_isnanf", scope: !150, file: !150, line: 222, type: !151, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !178)
!178 = !{!179}
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !177, file: !150, line: 222, type: !153)
!180 = !DISubprogram(name: "__inline_isnand", scope: !150, file: !150, line: 225, type: !157, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !181)
!181 = !{!182}
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !180, file: !150, line: 225, type: !159)
!183 = !DISubprogram(name: "__inline_isnanl", scope: !150, file: !150, line: 228, type: !163, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !184)
!184 = !{!185}
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !183, file: !150, line: 228, type: !165)
!186 = !DISubprogram(name: "__inline_signbitf", scope: !150, file: !150, line: 231, type: !151, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !187)
!187 = !{!188, !189}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !186, file: !150, line: 231, type: !153)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !186, file: !150, line: 232, type: !190)
!190 = !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !150, line: 232, size: 32, align: 32, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !190, file: !150, line: 232, baseType: !153, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !190, file: !150, line: 232, baseType: !194, size: 32, align: 32)
!194 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!195 = !DISubprogram(name: "__inline_signbitd", scope: !150, file: !150, line: 236, type: !157, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !196)
!196 = !{!197, !198}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !195, file: !150, line: 236, type: !159)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !195, file: !150, line: 237, type: !199)
!199 = !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !150, line: 237, size: 64, align: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !199, file: !150, line: 237, baseType: !159, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !199, file: !150, line: 237, baseType: !203, size: 64, align: 64)
!203 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!204 = !DISubprogram(name: "__inline_signbitl", scope: !150, file: !150, line: 242, type: !163, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !205)
!205 = !{!206, !207}
!206 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !204, file: !150, line: 242, type: !165)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !204, file: !150, line: 246, type: !208)
!208 = !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !150, line: 243, size: 128, align: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !208, file: !150, line: 244, baseType: !165, size: 128, align: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !208, file: !150, line: 245, baseType: !212, size: 128, align: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !150, line: 245, size: 128, align: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !212, file: !150, line: 245, baseType: !203, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !212, file: !150, line: 245, baseType: !216, size: 16, align: 16, offset: 64)
!216 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!217 = !DISubprogram(name: "__inline_isnormalf", scope: !150, file: !150, line: 257, type: !151, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !218)
!218 = !{!219}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !217, file: !150, line: 257, type: !153)
!220 = !DISubprogram(name: "__inline_isnormald", scope: !150, file: !150, line: 260, type: !157, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !221)
!221 = !{!222}
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !220, file: !150, line: 260, type: !159)
!223 = !DISubprogram(name: "__inline_isnormall", scope: !150, file: !150, line: 263, type: !163, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !224)
!224 = !{!225}
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !223, file: !150, line: 263, type: !165)
!226 = !DISubprogram(name: "__sincosf", scope: !150, file: !150, line: 642, type: !227, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !230)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !153, !229, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!230 = !{!231, !232, !233, !234}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !226, file: !150, line: 642, type: !153)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !226, file: !150, line: 642, type: !229)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !226, file: !150, line: 642, type: !229)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !226, file: !150, line: 643, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !150, line: 634, size: 64, align: 32, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !236, file: !150, line: 634, baseType: !153, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !236, file: !150, line: 634, baseType: !153, size: 32, align: 32, offset: 32)
!240 = !DISubprogram(name: "__sincos", scope: !150, file: !150, line: 647, type: !241, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !244)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !159, !243, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!244 = !{!245, !246, !247, !248}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !240, file: !150, line: 647, type: !159)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !240, file: !150, line: 647, type: !243)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !240, file: !150, line: 647, type: !243)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !240, file: !150, line: 648, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !150, line: 635, size: 128, align: 64, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !250, file: !150, line: 635, baseType: !159, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !250, file: !150, line: 635, baseType: !159, size: 64, align: 64, offset: 64)
!254 = !DISubprogram(name: "__sincospif", scope: !150, file: !150, line: 652, type: !227, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !254, file: !150, line: 652, type: !153)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !254, file: !150, line: 652, type: !229)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !254, file: !150, line: 652, type: !229)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !254, file: !150, line: 653, type: !235)
!260 = !DISubprogram(name: "__sincospi", scope: !150, file: !150, line: 657, type: !241, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !260, file: !150, line: 657, type: !159)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !260, file: !150, line: 657, type: !243)
!264 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !260, file: !150, line: 657, type: !243)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !260, file: !150, line: 658, type: !249)
!266 = !DISubprogram(name: "ld_data", scope: !1, file: !1, line: 209, type: !267, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.t_parm*, %struct.t_nsborder*, %struct.t_topology*, [3 x float]**, [3 x float]**)* @ld_data, variables: !644)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !73, !73, !269, !401, !420, !643, !643}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_parm", file: !271, line: 44, baseType: !272)
!271 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/parm.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!272 = !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 36, size: 6208, align: 64, elements: !273)
!273 = !{!274, !395, !397, !398, !399, !400}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ir", scope: !272, file: !271, line: 38, baseType: !275, size: 4736, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_inputrec", file: !276, line: 143, baseType: !277)
!276 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/inputrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!277 = !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 55, size: 4736, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !386, !394}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "eI", scope: !277, file: !276, line: 56, baseType: !73, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nsteps", scope: !277, file: !276, line: 57, baseType: !73, size: 32, align: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ns_type", scope: !277, file: !276, line: 58, baseType: !73, size: 32, align: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nstlist", scope: !277, file: !276, line: 59, baseType: !73, size: 32, align: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !277, file: !276, line: 60, baseType: !73, size: 32, align: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !277, file: !276, line: 61, baseType: !73, size: 32, align: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "decomp_dir", scope: !277, file: !276, line: 62, baseType: !73, size: 32, align: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nstcomm", scope: !277, file: !276, line: 63, baseType: !73, size: 32, align: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nstlog", scope: !277, file: !276, line: 65, baseType: !73, size: 32, align: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nstxout", scope: !277, file: !276, line: 66, baseType: !73, size: 32, align: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nstvout", scope: !277, file: !276, line: 67, baseType: !73, size: 32, align: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nstfout", scope: !277, file: !276, line: 68, baseType: !73, size: 32, align: 32, offset: 352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nstenergy", scope: !277, file: !276, line: 69, baseType: !73, size: 32, align: 32, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nstxtcout", scope: !277, file: !276, line: 70, baseType: !73, size: 32, align: 32, offset: 416)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "init_t", scope: !277, file: !276, line: 71, baseType: !294, size: 32, align: 32, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !295, line: 87, baseType: !153)
!295 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "delta_t", scope: !277, file: !276, line: 72, baseType: !294, size: 32, align: 32, offset: 480)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "xtcprec", scope: !277, file: !276, line: 73, baseType: !294, size: 32, align: 32, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nkx", scope: !277, file: !276, line: 74, baseType: !73, size: 32, align: 32, offset: 544)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nky", scope: !277, file: !276, line: 74, baseType: !73, size: 32, align: 32, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nkz", scope: !277, file: !276, line: 74, baseType: !73, size: 32, align: 32, offset: 608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pme_order", scope: !277, file: !276, line: 76, baseType: !73, size: 32, align: 32, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_rtol", scope: !277, file: !276, line: 77, baseType: !294, size: 32, align: 32, offset: 672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ewald_geometry", scope: !277, file: !276, line: 79, baseType: !73, size: 32, align: 32, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_surface", scope: !277, file: !276, line: 80, baseType: !73, size: 32, align: 32, offset: 736)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bOptFFT", scope: !277, file: !276, line: 81, baseType: !73, size: 32, align: 32, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !277, file: !276, line: 82, baseType: !73, size: 32, align: 32, offset: 800)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bUncStart", scope: !277, file: !276, line: 83, baseType: !73, size: 32, align: 32, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "etc", scope: !277, file: !276, line: 84, baseType: !73, size: 32, align: 32, offset: 864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "epc", scope: !277, file: !276, line: 85, baseType: !73, size: 32, align: 32, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "epct", scope: !277, file: !276, line: 86, baseType: !73, size: 32, align: 32, offset: 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tau_p", scope: !277, file: !276, line: 87, baseType: !294, size: 32, align: 32, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ref_p", scope: !277, file: !276, line: 88, baseType: !313, size: 288, align: 32, offset: 992)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !295, line: 105, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 288, align: 32, elements: !315)
!315 = !{!132, !132}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !277, file: !276, line: 89, baseType: !313, size: 288, align: 32, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bSimAnn", scope: !277, file: !276, line: 90, baseType: !73, size: 32, align: 32, offset: 1568)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "zero_temp_time", scope: !277, file: !276, line: 91, baseType: !294, size: 32, align: 32, offset: 1600)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !277, file: !276, line: 92, baseType: !294, size: 32, align: 32, offset: 1632)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "coulombtype", scope: !277, file: !276, line: 93, baseType: !73, size: 32, align: 32, offset: 1664)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !277, file: !276, line: 94, baseType: !294, size: 32, align: 32, offset: 1696)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !277, file: !276, line: 95, baseType: !294, size: 32, align: 32, offset: 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !277, file: !276, line: 96, baseType: !73, size: 32, align: 32, offset: 1760)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !277, file: !276, line: 97, baseType: !294, size: 32, align: 32, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !277, file: !276, line: 98, baseType: !294, size: 32, align: 32, offset: 1824)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !277, file: !276, line: 99, baseType: !294, size: 32, align: 32, offset: 1856)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "eDispCorr", scope: !277, file: !276, line: 100, baseType: !73, size: 32, align: 32, offset: 1888)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "shake_tol", scope: !277, file: !276, line: 101, baseType: !294, size: 32, align: 32, offset: 1920)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !277, file: !276, line: 102, baseType: !294, size: 32, align: 32, offset: 1952)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !277, file: !276, line: 103, baseType: !73, size: 32, align: 32, offset: 1984)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_lambda", scope: !277, file: !276, line: 104, baseType: !294, size: 32, align: 32, offset: 2016)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "delta_lambda", scope: !277, file: !276, line: 105, baseType: !294, size: 32, align: 32, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !277, file: !276, line: 106, baseType: !294, size: 32, align: 32, offset: 2080)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma", scope: !277, file: !276, line: 107, baseType: !294, size: 32, align: 32, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dr_fc", scope: !277, file: !276, line: 108, baseType: !294, size: 32, align: 32, offset: 2144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "eDisreWeighting", scope: !277, file: !276, line: 109, baseType: !73, size: 32, align: 32, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bDisreMixed", scope: !277, file: !276, line: 110, baseType: !73, size: 32, align: 32, offset: 2208)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "nstdisreout", scope: !277, file: !276, line: 111, baseType: !73, size: 32, align: 32, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dr_tau", scope: !277, file: !276, line: 112, baseType: !294, size: 32, align: 32, offset: 2272)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "orires_fc", scope: !277, file: !276, line: 113, baseType: !294, size: 32, align: 32, offset: 2304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "orires_tau", scope: !277, file: !276, line: 114, baseType: !294, size: 32, align: 32, offset: 2336)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nstorireout", scope: !277, file: !276, line: 115, baseType: !73, size: 32, align: 32, offset: 2368)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "em_stepsize", scope: !277, file: !276, line: 116, baseType: !294, size: 32, align: 32, offset: 2400)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "em_tol", scope: !277, file: !276, line: 117, baseType: !294, size: 32, align: 32, offset: 2432)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !277, file: !276, line: 118, baseType: !73, size: 32, align: 32, offset: 2464)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !277, file: !276, line: 120, baseType: !73, size: 32, align: 32, offset: 2496)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nstcgsteep", scope: !277, file: !276, line: 122, baseType: !73, size: 32, align: 32, offset: 2528)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "eConstrAlg", scope: !277, file: !276, line: 124, baseType: !73, size: 32, align: 32, offset: 2560)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nProjOrder", scope: !277, file: !276, line: 125, baseType: !73, size: 32, align: 32, offset: 2592)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "LincsWarnAngle", scope: !277, file: !276, line: 126, baseType: !294, size: 32, align: 32, offset: 2624)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "bShakeSOR", scope: !277, file: !276, line: 127, baseType: !73, size: 32, align: 32, offset: 2656)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bd_temp", scope: !277, file: !276, line: 128, baseType: !294, size: 32, align: 32, offset: 2688)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "bd_fric", scope: !277, file: !276, line: 129, baseType: !294, size: 32, align: 32, offset: 2720)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ld_seed", scope: !277, file: !276, line: 130, baseType: !73, size: 32, align: 32, offset: 2752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !277, file: !276, line: 131, baseType: !294, size: 32, align: 32, offset: 2784)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "userint1", scope: !277, file: !276, line: 132, baseType: !73, size: 32, align: 32, offset: 2816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "userint2", scope: !277, file: !276, line: 133, baseType: !73, size: 32, align: 32, offset: 2848)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "userint3", scope: !277, file: !276, line: 134, baseType: !73, size: 32, align: 32, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "userint4", scope: !277, file: !276, line: 135, baseType: !73, size: 32, align: 32, offset: 2912)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "userreal1", scope: !277, file: !276, line: 136, baseType: !294, size: 32, align: 32, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "userreal2", scope: !277, file: !276, line: 137, baseType: !294, size: 32, align: 32, offset: 2976)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "userreal3", scope: !277, file: !276, line: 138, baseType: !294, size: 32, align: 32, offset: 3008)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "userreal4", scope: !277, file: !276, line: 139, baseType: !294, size: 32, align: 32, offset: 3040)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !277, file: !276, line: 140, baseType: !365, size: 512, align: 64, offset: 3072)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grpopts", file: !276, line: 53, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 42, size: 512, align: 64, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !374, !375, !376, !380, !384}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ngtc", scope: !366, file: !276, line: 43, baseType: !73, size: 32, align: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ngacc", scope: !366, file: !276, line: 44, baseType: !73, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ngfrz", scope: !366, file: !276, line: 45, baseType: !73, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ngener", scope: !366, file: !276, line: 46, baseType: !73, size: 32, align: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nrdf", scope: !366, file: !276, line: 47, baseType: !373, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ref_t", scope: !366, file: !276, line: 48, baseType: !373, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tau_t", scope: !366, file: !276, line: 49, baseType: !373, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !366, file: !276, line: 50, baseType: !377, size: 64, align: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !295, line: 101, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 96, align: 32, elements: !131)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nFreeze", scope: !366, file: !276, line: 51, baseType: !381, size: 64, align: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !295, line: 107, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 96, align: 32, elements: !131)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !366, file: !276, line: 52, baseType: !385, size: 64, align: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !277, file: !276, line: 141, baseType: !387, size: 576, align: 64, offset: 3584)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 576, align: 64, elements: !131)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cosines", file: !276, line: 40, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 36, size: 192, align: 64, elements: !390)
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !389, file: !276, line: 37, baseType: !73, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !389, file: !276, line: 38, baseType: !373, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !389, file: !276, line: 39, baseType: !373, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "et", scope: !277, file: !276, line: 142, baseType: !387, size: 576, align: 64, offset: 4160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !272, file: !271, line: 39, baseType: !396, size: 288, align: 32, offset: 4736)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !295, line: 103, baseType: !314)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "boxv", scope: !272, file: !271, line: 40, baseType: !396, size: 288, align: 32, offset: 5024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vir", scope: !272, file: !271, line: 41, baseType: !313, size: 288, align: 32, offset: 5312)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pres", scope: !272, file: !271, line: 42, baseType: !313, size: 288, align: 32, offset: 5600)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ekin", scope: !272, file: !271, line: 43, baseType: !313, size: 288, align: 32, offset: 5888)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !403, line: 59, baseType: !404)
!403 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 36, size: 32992, align: 32, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !417, !418, !419}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !404, file: !403, line: 37, baseType: !73, size: 32, align: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !404, file: !403, line: 38, baseType: !73, size: 32, align: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !404, file: !403, line: 39, baseType: !73, size: 32, align: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !404, file: !403, line: 40, baseType: !73, size: 32, align: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !404, file: !403, line: 41, baseType: !73, size: 32, align: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !404, file: !403, line: 43, baseType: !73, size: 32, align: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !404, file: !403, line: 43, baseType: !73, size: 32, align: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !404, file: !403, line: 50, baseType: !414, size: 8192, align: 32, offset: 224)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8192, align: 32, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !404, file: !403, line: 51, baseType: !414, size: 8192, align: 32, offset: 8416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !404, file: !403, line: 52, baseType: !414, size: 8192, align: 32, offset: 16608)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !404, file: !403, line: 55, baseType: !414, size: 8192, align: 32, offset: 24800)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !422, line: 42, baseType: !423)
!422 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!423 = !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 36, size: 402112, align: 64, elements: !424)
!424 = !{!425, !427, !562, !626, !628}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !422, line: 37, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !423, file: !422, line: 38, baseType: !428, size: 366336, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !24, line: 188, baseType: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 179, size: 366336, align: 64, elements: !430)
!430 = !{!431, !432, !433, !434, !437, !549}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !429, file: !24, line: 181, baseType: !73, size: 32, align: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !429, file: !24, line: 182, baseType: !73, size: 32, align: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !429, file: !24, line: 183, baseType: !73, size: 32, align: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !429, file: !24, line: 184, baseType: !435, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !24, line: 133, baseType: !73)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !429, file: !24, line: 185, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !24, line: 131, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_union_type, file: !24, line: 97, size: 192, align: 32, elements: !441)
!441 = !{!442, !448, !455, !461, !470, !475, !482, !490, !495, !500, !506, !511, !518, !527, !536, !545}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !440, file: !24, line: 105, baseType: !443, size: 96, align: 32)
!443 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 105, size: 96, align: 32, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !443, file: !24, line: 105, baseType: !294, size: 32, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !443, file: !24, line: 105, baseType: !294, size: 32, align: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !443, file: !24, line: 105, baseType: !294, size: 32, align: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !440, file: !24, line: 106, baseType: !449, size: 128, align: 32)
!449 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 106, size: 128, align: 32, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !449, file: !24, line: 106, baseType: !294, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !449, file: !24, line: 106, baseType: !294, size: 32, align: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !449, file: !24, line: 106, baseType: !294, size: 32, align: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !449, file: !24, line: 106, baseType: !294, size: 32, align: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !440, file: !24, line: 108, baseType: !456, size: 96, align: 32)
!456 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 108, size: 96, align: 32, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !456, file: !24, line: 108, baseType: !294, size: 32, align: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !456, file: !24, line: 108, baseType: !294, size: 32, align: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !456, file: !24, line: 108, baseType: !294, size: 32, align: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !440, file: !24, line: 110, baseType: !462, size: 192, align: 32)
!462 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 110, size: 192, align: 32, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !462, file: !24, line: 110, baseType: !294, size: 32, align: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !462, file: !24, line: 110, baseType: !294, size: 32, align: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !462, file: !24, line: 110, baseType: !294, size: 32, align: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !462, file: !24, line: 110, baseType: !294, size: 32, align: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !462, file: !24, line: 110, baseType: !294, size: 32, align: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !462, file: !24, line: 110, baseType: !294, size: 32, align: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !440, file: !24, line: 111, baseType: !471, size: 64, align: 32)
!471 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 111, size: 64, align: 32, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !471, file: !24, line: 111, baseType: !294, size: 32, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !471, file: !24, line: 111, baseType: !294, size: 32, align: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !440, file: !24, line: 112, baseType: !476, size: 128, align: 32)
!476 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 112, size: 128, align: 32, elements: !477)
!477 = !{!478, !479, !480, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !476, file: !24, line: 112, baseType: !294, size: 32, align: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !476, file: !24, line: 112, baseType: !294, size: 32, align: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !476, file: !24, line: 112, baseType: !294, size: 32, align: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !476, file: !24, line: 112, baseType: !294, size: 32, align: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !440, file: !24, line: 117, baseType: !483, size: 160, align: 32)
!483 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 117, size: 160, align: 32, elements: !484)
!484 = !{!485, !486, !487, !488, !489}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !483, file: !24, line: 117, baseType: !294, size: 32, align: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !483, file: !24, line: 117, baseType: !294, size: 32, align: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !483, file: !24, line: 117, baseType: !73, size: 32, align: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !483, file: !24, line: 117, baseType: !294, size: 32, align: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !483, file: !24, line: 117, baseType: !294, size: 32, align: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !440, file: !24, line: 118, baseType: !491, size: 64, align: 32)
!491 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 118, size: 64, align: 32, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !491, file: !24, line: 118, baseType: !294, size: 32, align: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !491, file: !24, line: 118, baseType: !294, size: 32, align: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !440, file: !24, line: 123, baseType: !496, size: 64, align: 32)
!496 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 123, size: 64, align: 32, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !496, file: !24, line: 123, baseType: !294, size: 32, align: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !496, file: !24, line: 123, baseType: !294, size: 32, align: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !440, file: !24, line: 124, baseType: !501, size: 96, align: 32)
!501 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 124, size: 96, align: 32, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !501, file: !24, line: 124, baseType: !294, size: 32, align: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !501, file: !24, line: 124, baseType: !294, size: 32, align: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !501, file: !24, line: 124, baseType: !294, size: 32, align: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !440, file: !24, line: 125, baseType: !507, size: 192, align: 32)
!507 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 125, size: 192, align: 32, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !507, file: !24, line: 125, baseType: !379, size: 96, align: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !507, file: !24, line: 125, baseType: !379, size: 96, align: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !440, file: !24, line: 126, baseType: !512, size: 192, align: 32)
!512 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 126, size: 192, align: 32, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !512, file: !24, line: 126, baseType: !515, size: 192, align: 32)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 192, align: 32, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 6)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !440, file: !24, line: 127, baseType: !519, size: 192, align: 32)
!519 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 127, size: 192, align: 32, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !519, file: !24, line: 127, baseType: !294, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !519, file: !24, line: 127, baseType: !294, size: 32, align: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !519, file: !24, line: 127, baseType: !294, size: 32, align: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !519, file: !24, line: 127, baseType: !294, size: 32, align: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !519, file: !24, line: 127, baseType: !294, size: 32, align: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !519, file: !24, line: 127, baseType: !294, size: 32, align: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !440, file: !24, line: 128, baseType: !528, size: 192, align: 32)
!528 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 128, size: 192, align: 32, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !528, file: !24, line: 128, baseType: !294, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !528, file: !24, line: 128, baseType: !294, size: 32, align: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !528, file: !24, line: 128, baseType: !294, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !528, file: !24, line: 128, baseType: !294, size: 32, align: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !24, line: 128, baseType: !73, size: 32, align: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !528, file: !24, line: 128, baseType: !73, size: 32, align: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !440, file: !24, line: 129, baseType: !537, size: 192, align: 32)
!537 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 129, size: 192, align: 32, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !537, file: !24, line: 129, baseType: !73, size: 32, align: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !537, file: !24, line: 129, baseType: !73, size: 32, align: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !537, file: !24, line: 129, baseType: !73, size: 32, align: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !537, file: !24, line: 129, baseType: !294, size: 32, align: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !537, file: !24, line: 129, baseType: !294, size: 32, align: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !537, file: !24, line: 129, baseType: !294, size: 32, align: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !440, file: !24, line: 130, baseType: !546, size: 192, align: 32)
!546 = !DICompositeType(tag: DW_TAG_structure_type, scope: !440, file: !24, line: 130, size: 192, align: 32, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !546, file: !24, line: 130, baseType: !515, size: 192, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !429, file: !24, line: 187, baseType: !550, size: 366080, align: 64, offset: 256)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 366080, align: 64, elements: !560)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !24, line: 140, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 135, size: 8320, align: 64, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !552, file: !24, line: 137, baseType: !73, size: 32, align: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !552, file: !24, line: 138, baseType: !414, size: 8192, align: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !552, file: !24, line: 139, baseType: !557, size: 64, align: 64, offset: 8256)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !24, line: 45, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !295, line: 73, baseType: !73)
!560 = !{!561}
!561 = !DISubrange(count: 44)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !423, file: !422, line: 39, baseType: !563, size: 10240, align: 64, offset: 366400)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !11, line: 94, baseType: !564)
!564 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 75, size: 10240, align: 64, elements: !565)
!565 = !{!566, !567, !585, !587, !588, !589, !590, !591, !592, !593, !604, !611}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !564, file: !11, line: 76, baseType: !73, size: 32, align: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !564, file: !11, line: 77, baseType: !568, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !11, line: 57, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 48, size: 320, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !584}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !570, file: !11, line: 49, baseType: !294, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !570, file: !11, line: 49, baseType: !294, size: 32, align: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !570, file: !11, line: 50, baseType: !294, size: 32, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !570, file: !11, line: 50, baseType: !294, size: 32, align: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !570, file: !11, line: 51, baseType: !216, size: 16, align: 16, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !570, file: !11, line: 52, baseType: !216, size: 16, align: 16, offset: 144)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !570, file: !11, line: 53, baseType: !73, size: 32, align: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !570, file: !11, line: 54, baseType: !73, size: 32, align: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !570, file: !11, line: 55, baseType: !581, size: 72, align: 8, offset: 224)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 72, align: 8, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 9)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !570, file: !11, line: 56, baseType: !86, size: 8, align: 8, offset: 296)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !564, file: !11, line: 80, baseType: !586, size: 64, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !564, file: !11, line: 82, baseType: !586, size: 64, align: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !564, file: !11, line: 84, baseType: !586, size: 64, align: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !564, file: !11, line: 86, baseType: !73, size: 32, align: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !564, file: !11, line: 87, baseType: !586, size: 64, align: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !564, file: !11, line: 89, baseType: !73, size: 32, align: 32, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !564, file: !11, line: 90, baseType: !586, size: 64, align: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !564, file: !11, line: 91, baseType: !594, size: 8448, align: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !595, line: 52, baseType: !596)
!595 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!596 = !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 36, size: 8448, align: 64, elements: !597)
!597 = !{!598, !599, !600, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !596, file: !595, line: 37, baseType: !414, size: 8192, align: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !596, file: !595, line: 43, baseType: !73, size: 32, align: 32, offset: 8192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !596, file: !595, line: 44, baseType: !601, size: 64, align: 64, offset: 8256)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !596, file: !595, line: 45, baseType: !73, size: 32, align: 32, offset: 8320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !596, file: !595, line: 46, baseType: !601, size: 64, align: 64, offset: 8384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !564, file: !11, line: 92, baseType: !605, size: 1152, align: 64, offset: 9024)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 1152, align: 64, elements: !582)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !11, line: 73, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 70, size: 128, align: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !607, file: !11, line: 71, baseType: !73, size: 32, align: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !607, file: !11, line: 72, baseType: !385, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !564, file: !11, line: 93, baseType: !612, size: 64, align: 64, offset: 10176)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !11, line: 68, baseType: !614)
!614 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 59, size: 416, align: 32, elements: !615)
!615 = !{!616, !617, !618, !619, !621, !622, !623, !624}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !614, file: !11, line: 60, baseType: !73, size: 32, align: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !614, file: !11, line: 61, baseType: !73, size: 32, align: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !614, file: !11, line: 62, baseType: !72, size: 8, align: 8, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !614, file: !11, line: 63, baseType: !620, size: 48, align: 8, offset: 72)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 48, align: 8, elements: !516)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !614, file: !11, line: 64, baseType: !294, size: 32, align: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !614, file: !11, line: 65, baseType: !294, size: 32, align: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !614, file: !11, line: 66, baseType: !73, size: 32, align: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !614, file: !11, line: 67, baseType: !625, size: 192, align: 32, offset: 224)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, align: 32, elements: !516)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !423, file: !422, line: 40, baseType: !627, size: 25344, align: 64, offset: 376640)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 25344, align: 64, elements: !131)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !423, file: !422, line: 41, baseType: !629, size: 128, align: 64, offset: 401984)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !630, line: 46, baseType: !631)
!630 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!631 = !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 42, size: 128, align: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !631, file: !630, line: 44, baseType: !73, size: 32, align: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !631, file: !630, line: 45, baseType: !635, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !630, line: 40, baseType: !637)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !630, line: 36, size: 192, align: 64, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !637, file: !630, line: 37, baseType: !73, size: 32, align: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !637, file: !630, line: 38, baseType: !426, size: 64, align: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !630, line: 39, baseType: !642, size: 64, align: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 1, scope: !266, file: !1, line: 209, type: !73)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 2, scope: !266, file: !1, line: 209, type: !73)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parm", arg: 3, scope: !266, file: !1, line: 209, type: !269)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 4, scope: !266, file: !1, line: 209, type: !401)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 5, scope: !266, file: !1, line: 210, type: !420)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !266, file: !1, line: 210, type: !643)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 7, scope: !266, file: !1, line: 210, type: !643)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !266, file: !1, line: 212, type: !73)
!653 = !DISubprogram(name: "mv_data", scope: !1, file: !1, line: 379, type: !654, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.t_parm*, %struct.t_nsborder*, %struct.t_topology*, [3 x float]*, [3 x float]*)* @mv_data, variables: !656)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !73, !73, !269, !401, !420, !377, !377}
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 1, scope: !653, file: !1, line: 379, type: !73)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 2, scope: !653, file: !1, line: 379, type: !73)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parm", arg: 3, scope: !653, file: !1, line: 379, type: !269)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 4, scope: !653, file: !1, line: 379, type: !401)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 5, scope: !653, file: !1, line: 380, type: !420)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 6, scope: !653, file: !1, line: 380, type: !377)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 7, scope: !653, file: !1, line: 380, type: !377)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !653, file: !1, line: 382, type: !73)
!665 = !DISubprogram(name: "ld_parm", scope: !1, file: !1, line: 197, type: !666, isLocal: true, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, variables: !668)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !73, !269}
!668 = !{!669, !670, !671}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !665, file: !1, line: 197, type: !73)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parm", arg: 2, scope: !665, file: !1, line: 197, type: !269)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !665, file: !1, line: 199, type: !73)
!672 = !DISubprogram(name: "ld_grpopts", scope: !1, file: !1, line: 166, type: !673, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, variables: !676)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !73, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!676 = !{!677, !678}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !672, file: !1, line: 166, type: !73)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !672, file: !1, line: 166, type: !675)
