; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mvxvf.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%union.anon = type { float }
%union.anon.0 = type { double }
%union.anon.1 = type { x86_fp80 }
%struct.__float2 = type { float, float }
%struct.__double2 = type { double, double }
%struct.t_nsborder = type { i32, i32, i32, i32, i32, i32, i32, [256 x i32], [256 x i32], [256 x i32], [256 x i32] }
%struct.t_nrnb = type { [129 x double] }
%struct.t_commrec = type { i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [65 x i8] c"../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/mvxvf.c\00", align 1

; Function Attrs: alwaysinline nounwind optsize ssp uwtable
define i32 @__sputc(i32 %_c, %struct.__sFILE* %_p) #0 {
  tail call void @llvm.dbg.value(metadata i32 %_c, i64 0, metadata !207, metadata !450), !dbg !451
  tail call void @llvm.dbg.value(metadata %struct.__sFILE* %_p, i64 0, metadata !208, metadata !450), !dbg !452
  %1 = getelementptr inbounds %struct.__sFILE* %_p, i64 0, i32 2, !dbg !453
  %2 = load i32* %1, align 4, !dbg !455, !tbaa !456

!52 = !DIEnumerator(name: "eNR_INL2320", value: 46)
!53 = !DIEnumerator(name: "eNR_INL2330", value: 47)
!54 = !DIEnumerator(name: "eNR_INL2400", value: 48)
!55 = !DIEnumerator(name: "eNR_INL2410", value: 49)
!56 = !DIEnumerator(name: "eNR_INL2420", value: 50)
!57 = !DIEnumerator(name: "eNR_INL2430", value: 51)
!58 = !DIEnumerator(name: "eNR_INL3000", value: 52)
!59 = !DIEnumerator(name: "eNR_INL3001", value: 53)
!60 = !DIEnumerator(name: "eNR_INL3002", value: 54)
!61 = !DIEnumerator(name: "eNR_INL3010", value: 55)
!62 = !DIEnumerator(name: "eNR_INL3020", value: 56)
!63 = !DIEnumerator(name: "eNR_INL3030", value: 57)
!64 = !DIEnumerator(name: "eNR_INL3100", value: 58)
!65 = !DIEnumerator(name: "eNR_INL3110", value: 59)
!66 = !DIEnumerator(name: "eNR_INL3120", value: 60)
!67 = !DIEnumerator(name: "eNR_INL3130", value: 61)
!68 = !DIEnumerator(name: "eNR_INL3200", value: 62)
!69 = !DIEnumerator(name: "eNR_INL3210", value: 63)
!70 = !DIEnumerator(name: "eNR_INL3220", value: 64)
!71 = !DIEnumerator(name: "eNR_INL3230", value: 65)
!72 = !DIEnumerator(name: "eNR_INL3300", value: 66)
!73 = !DIEnumerator(name: "eNR_INL3301", value: 67)
!74 = !DIEnumerator(name: "eNR_INL3302", value: 68)
!75 = !DIEnumerator(name: "eNR_INL3310", value: 69)
!76 = !DIEnumerator(name: "eNR_INL3320", value: 70)
!77 = !DIEnumerator(name: "eNR_INL3330", value: 71)
!78 = !DIEnumerator(name: "eNR_INL3400", value: 72)
!79 = !DIEnumerator(name: "eNR_INL3401", value: 73)
!80 = !DIEnumerator(name: "eNR_INL3402", value: 74)
!81 = !DIEnumerator(name: "eNR_INL3410", value: 75)
!82 = !DIEnumerator(name: "eNR_INL3420", value: 76)
!83 = !DIEnumerator(name: "eNR_INL3430", value: 77)
!84 = !DIEnumerator(name: "eNR_INLOOP", value: 78)
!85 = !DIEnumerator(name: "eNR_INL_IATOM", value: 78)
!86 = !DIEnumerator(name: "eNR_WEIGHTS", value: 79)
!87 = !DIEnumerator(name: "eNR_SPREADQ", value: 80)
!88 = !DIEnumerator(name: "eNR_SPREADQBSP", value: 81)
!89 = !DIEnumerator(name: "eNR_GATHERF", value: 82)
!90 = !DIEnumerator(name: "eNR_GATHERFBSP", value: 83)
!91 = !DIEnumerator(name: "eNR_FFT", value: 84)
!92 = !DIEnumerator(name: "eNR_CONV", value: 85)
!93 = !DIEnumerator(name: "eNR_SOLVEPME", value: 86)
!94 = !DIEnumerator(name: "eNR_NS", value: 87)
!95 = !DIEnumerator(name: "eNR_RESETX", value: 88)
!96 = !DIEnumerator(name: "eNR_SHIFTX", value: 89)
!97 = !DIEnumerator(name: "eNR_CGCM", value: 90)
!98 = !DIEnumerator(name: "eNR_FSUM", value: 91)
!99 = !DIEnumerator(name: "eNR_BONDS", value: 92)
!100 = !DIEnumerator(name: "eNR_G96BONDS", value: 93)
!101 = !DIEnumerator(name: "eNR_ANGLES", value: 94)
!102 = !DIEnumerator(name: "eNR_G96ANGLES", value: 95)
!103 = !DIEnumerator(name: "eNR_PROPER", value: 96)
!104 = !DIEnumerator(name: "eNR_IMPROPER", value: 97)
!105 = !DIEnumerator(name: "eNR_RB", value: 98)
!106 = !DIEnumerator(name: "eNR_DISRES", value: 99)
!107 = !DIEnumerator(name: "eNR_ORIRES", value: 100)
!108 = !DIEnumerator(name: "eNR_POSRES", value: 101)
!109 = !DIEnumerator(name: "eNR_ANGRES", value: 102)
!110 = !DIEnumerator(name: "eNR_ANGRESZ", value: 103)
!111 = !DIEnumerator(name: "eNR_MORSE", value: 104)
!112 = !DIEnumerator(name: "eNR_CUBICBONDS", value: 105)
!113 = !DIEnumerator(name: "eNR_WPOL", value: 106)
!114 = !DIEnumerator(name: "eNR_VIRIAL", value: 107)
!115 = !DIEnumerator(name: "eNR_UPDATE", value: 108)
!116 = !DIEnumerator(name: "eNR_EXTUPDATE", value: 109)
!117 = !DIEnumerator(name: "eNR_STOPCM", value: 110)
!118 = !DIEnumerator(name: "eNR_PCOUPL", value: 111)
!119 = !DIEnumerator(name: "eNR_EKIN", value: 112)
!120 = !DIEnumerator(name: "eNR_LINCS", value: 113)
!121 = !DIEnumerator(name: "eNR_LINCSMAT", value: 114)
!122 = !DIEnumerator(name: "eNR_SHAKE", value: 115)
!123 = !DIEnumerator(name: "eNR_SHAKE_V", value: 116)
!124 = !DIEnumerator(name: "eNR_SHAKE_RIJ", value: 117)
!125 = !DIEnumerator(name: "eNR_SHAKE_VIR", value: 118)
!126 = !DIEnumerator(name: "eNR_SETTLE", value: 119)
!127 = !DIEnumerator(name: "eNR_PSHAKEINITLD", value: 120)
!128 = !DIEnumerator(name: "eNR_PSHAKEINITMD", value: 121)
!129 = !DIEnumerator(name: "eNR_PSHAKE", value: 122)
!130 = !DIEnumerator(name: "eNR_DUM2", value: 123)
!131 = !DIEnumerator(name: "eNR_DUM3", value: 124)
!132 = !DIEnumerator(name: "eNR_DUM3FD", value: 125)
!133 = !DIEnumerator(name: "eNR_DUM3FAD", value: 126)
!134 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!135 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!136 = !DIEnumerator(name: "eNRNB", value: 129)
!137 = !{!138, !139}
!138 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!139 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!140 = !{!141, !209, !215, !222, !228, !234, !237, !240, !243, !246, !249, !252, !261, !270, !283, !286, !289, !292, !306, !320, !326, !332, !384, !394, !405, !429, !436}
!141 = !DISubprogram(name: "__sputc", scope: !142, file: !142, line: 348, type: !143, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !206)
!142 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!143 = !DISubroutineType(types: !144)
!144 = !{!139, !139, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !142, line: 153, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !142, line: 122, size: 1216, align: 64, elements: !148)
!148 = !{!149, !152, !153, !154, !156, !157, !162, !163, !165, !169, !174, !184, !190, !191, !194, !195, !199, !203, !204, !205}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !147, file: !142, line: 123, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !147, file: !142, line: 124, baseType: !139, size: 32, align: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !147, file: !142, line: 125, baseType: !139, size: 32, align: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !147, file: !142, line: 126, baseType: !155, size: 16, align: 16, offset: 128)
!155 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !147, file: !142, line: 127, baseType: !155, size: 16, align: 16, offset: 144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !147, file: !142, line: 128, baseType: !158, size: 128, align: 64, offset: 192)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !142, line: 88, size: 128, align: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !158, file: !142, line: 89, baseType: !150, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !158, file: !142, line: 90, baseType: !139, size: 32, align: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !147, file: !142, line: 129, baseType: !139, size: 32, align: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !147, file: !142, line: 132, baseType: !164, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !147, file: !142, line: 133, baseType: !166, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!139, !164}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !147, file: !142, line: 134, baseType: !170, size: 64, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!139, !164, !173, !139}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !147, file: !142, line: 135, baseType: !175, size: 64, align: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !164, !178, !139}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !142, line: 77, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !180, line: 71, baseType: !181)
!180 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !182, line: 46, baseType: !183)
!182 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!183 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !147, file: !142, line: 136, baseType: !185, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!139, !164, !188, !139}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !147, file: !142, line: 139, baseType: !158, size: 128, align: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !147, file: !142, line: 140, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !142, line: 94, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !147, file: !142, line: 141, baseType: !139, size: 32, align: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !147, file: !142, line: 144, baseType: !196, size: 24, align: 8, offset: 928)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 24, align: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 3)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !147, file: !142, line: 145, baseType: !200, size: 8, align: 8, offset: 952)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !147, file: !142, line: 148, baseType: !158, size: 128, align: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !147, file: !142, line: 151, baseType: !139, size: 32, align: 32, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !147, file: !142, line: 152, baseType: !178, size: 64, align: 64, offset: 1152)
!206 = !{!207, !208}
!207 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !141, file: !142, line: 348, type: !139)
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !141, file: !142, line: 348, type: !145)
!209 = !DISubprogram(name: "__sigbits", scope: !210, file: !210, line: 114, type: !211, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !213)
!210 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!211 = !DISubroutineType(types: !212)
!212 = !{!139, !139}
!213 = !{!214}
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !209, file: !210, line: 114, type: !139)
!215 = !DISubprogram(name: "__inline_isfinitef", scope: !216, file: !216, line: 204, type: !217, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isfinitef, variables: !220)
!216 = !DIFile(filename: "/usr/include/math.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!217 = !DISubroutineType(types: !218)
!218 = !{!139, !219}
!219 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!220 = !{!221}
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !215, file: !216, line: 204, type: !219)
!222 = !DISubprogram(name: "__inline_isfinited", scope: !216, file: !216, line: 207, type: !223, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isfinited, variables: !226)
!223 = !DISubroutineType(types: !224)
!224 = !{!139, !225}
!225 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!226 = !{!227}
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !222, file: !216, line: 207, type: !225)
!228 = !DISubprogram(name: "__inline_isfinitel", scope: !216, file: !216, line: 210, type: !229, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isfinitel, variables: !232)
!229 = !DISubroutineType(types: !230)
!230 = !{!139, !231}
!231 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!232 = !{!233}
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !228, file: !216, line: 210, type: !231)
!234 = !DISubprogram(name: "__inline_isinff", scope: !216, file: !216, line: 213, type: !217, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isinff, variables: !235)
!235 = !{!236}
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !234, file: !216, line: 213, type: !219)
!237 = !DISubprogram(name: "__inline_isinfd", scope: !216, file: !216, line: 216, type: !223, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isinfd, variables: !238)
!238 = !{!239}
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !237, file: !216, line: 216, type: !225)
!240 = !DISubprogram(name: "__inline_isinfl", scope: !216, file: !216, line: 219, type: !229, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isinfl, variables: !241)
!241 = !{!242}
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !240, file: !216, line: 219, type: !231)
!243 = !DISubprogram(name: "__inline_isnanf", scope: !216, file: !216, line: 222, type: !217, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnanf, variables: !244)
!244 = !{!245}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !243, file: !216, line: 222, type: !219)
!246 = !DISubprogram(name: "__inline_isnand", scope: !216, file: !216, line: 225, type: !223, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnand, variables: !247)
!247 = !{!248}
!248 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !246, file: !216, line: 225, type: !225)
!249 = !DISubprogram(name: "__inline_isnanl", scope: !216, file: !216, line: 228, type: !229, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnanl, variables: !250)
!250 = !{!251}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !249, file: !216, line: 228, type: !231)
!252 = !DISubprogram(name: "__inline_signbitf", scope: !216, file: !216, line: 231, type: !217, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_signbitf, variables: !253)
!253 = !{!254, !255}
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !252, file: !216, line: 231, type: !219)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !252, file: !216, line: 232, type: !256)
!256 = !DICompositeType(tag: DW_TAG_union_type, scope: !252, file: !216, line: 232, size: 32, align: 32, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !256, file: !216, line: 232, baseType: !219, size: 32, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !256, file: !216, line: 232, baseType: !260, size: 32, align: 32)
!260 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!261 = !DISubprogram(name: "__inline_signbitd", scope: !216, file: !216, line: 236, type: !223, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_signbitd, variables: !262)
!262 = !{!263, !264}
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !261, file: !216, line: 236, type: !225)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !261, file: !216, line: 237, type: !265)
!265 = !DICompositeType(tag: DW_TAG_union_type, scope: !261, file: !216, line: 237, size: 64, align: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__f", scope: !265, file: !216, line: 237, baseType: !225, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__u", scope: !265, file: !216, line: 237, baseType: !269, size: 64, align: 64)
!269 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!270 = !DISubprogram(name: "__inline_signbitl", scope: !216, file: !216, line: 242, type: !229, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_signbitl, variables: !271)
!271 = !{!272, !273}
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !270, file: !216, line: 242, type: !231)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__u", scope: !270, file: !216, line: 246, type: !274)
!274 = !DICompositeType(tag: DW_TAG_union_type, scope: !270, file: !216, line: 243, size: 128, align: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__ld", scope: !274, file: !216, line: 244, baseType: !231, size: 128, align: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__p", scope: !274, file: !216, line: 245, baseType: !278, size: 128, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !216, line: 245, size: 128, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__m", scope: !278, file: !216, line: 245, baseType: !269, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__sexp", scope: !278, file: !216, line: 245, baseType: !282, size: 16, align: 16, offset: 64)
!282 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!283 = !DISubprogram(name: "__inline_isnormalf", scope: !216, file: !216, line: 257, type: !217, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (float)* @__inline_isnormalf, variables: !284)
!284 = !{!285}
!285 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !283, file: !216, line: 257, type: !219)
!286 = !DISubprogram(name: "__inline_isnormald", scope: !216, file: !216, line: 260, type: !223, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @__inline_isnormald, variables: !287)
!287 = !{!288}
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !286, file: !216, line: 260, type: !225)
!289 = !DISubprogram(name: "__inline_isnormall", scope: !216, file: !216, line: 263, type: !229, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (x86_fp80)* @__inline_isnormall, variables: !290)
!290 = !{!291}
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !289, file: !216, line: 263, type: !231)
!292 = !DISubprogram(name: "__sincosf", scope: !216, file: !216, line: 642, type: !293, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincosf, variables: !296)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !219, !295, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!296 = !{!297, !298, !299, !300}
!297 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !292, file: !216, line: 642, type: !219)
!298 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !292, file: !216, line: 642, type: !295)
!299 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !292, file: !216, line: 642, type: !295)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !292, file: !216, line: 643, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "__float2", file: !216, line: 634, size: 64, align: 32, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !302, file: !216, line: 634, baseType: !219, size: 32, align: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !302, file: !216, line: 634, baseType: !219, size: 32, align: 32, offset: 32)
!306 = !DISubprogram(name: "__sincos", scope: !216, file: !216, line: 647, type: !307, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincos, variables: !310)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !225, !309, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!310 = !{!311, !312, !313, !314}
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !306, file: !216, line: 647, type: !225)
!312 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !306, file: !216, line: 647, type: !309)
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !306, file: !216, line: 647, type: !309)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !306, file: !216, line: 648, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "__double2", file: !216, line: 635, size: 128, align: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__sinval", scope: !316, file: !216, line: 635, baseType: !225, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__cosval", scope: !316, file: !216, line: 635, baseType: !225, size: 64, align: 64, offset: 64)
!320 = !DISubprogram(name: "__sincospif", scope: !216, file: !216, line: 652, type: !293, isLocal: false, isDefinition: true, scopeLine: 652, flags: DIFlagPrototyped, isOptimized: true, function: void (float, float*, float*)* @__sincospif, variables: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !320, file: !216, line: 652, type: !219)
!323 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !320, file: !216, line: 652, type: !295)
!324 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !320, file: !216, line: 652, type: !295)
!325 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !320, file: !216, line: 653, type: !301)
!326 = !DISubprogram(name: "__sincospi", scope: !216, file: !216, line: 657, type: !307, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: void (double, double*, double*)* @__sincospi, variables: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__x", arg: 1, scope: !326, file: !216, line: 657, type: !225)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__sinp", arg: 2, scope: !326, file: !216, line: 657, type: !309)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__cosp", arg: 3, scope: !326, file: !216, line: 657, type: !309)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__stret", scope: !326, file: !216, line: 658, type: !315)
!332 = !DISubprogram(name: "move_rvecs", scope: !1, file: !1, line: 50, type: !333, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, i32, i32, [3 x float]*, [3 x float]*, i32, %struct.t_nsborder*, %struct.t_nrnb*)* @move_rvecs, variables: !367)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !145, !139, !139, !139, !139, !335, !335, !139, !340, !359}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !337, line: 101, baseType: !338)
!337 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 96, align: 32, elements: !197)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !337, line: 87, baseType: !219)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !342, line: 59, baseType: !343)
!342 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!343 = !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 36, size: 32992, align: 32, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !356, !357, !358}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !343, file: !342, line: 37, baseType: !139, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !343, file: !342, line: 38, baseType: !139, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !343, file: !342, line: 39, baseType: !139, size: 32, align: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !343, file: !342, line: 40, baseType: !139, size: 32, align: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !343, file: !342, line: 41, baseType: !139, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !343, file: !342, line: 43, baseType: !139, size: 32, align: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !343, file: !342, line: 43, baseType: !139, size: 32, align: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !343, file: !342, line: 50, baseType: !353, size: 8192, align: 32, offset: 224)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8192, align: 32, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !343, file: !342, line: 51, baseType: !353, size: 8192, align: 32, offset: 8416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !343, file: !342, line: 52, baseType: !353, size: 8192, align: 32, offset: 16608)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !343, file: !342, line: 55, baseType: !353, size: 8192, align: 32, offset: 24800)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !4, line: 95, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 93, size: 8256, align: 64, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !361, file: !4, line: 94, baseType: !364, size: 8256, align: 64)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 8256, align: 64, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 129)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !332, file: !1, line: 50, type: !145)
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bForward", arg: 2, scope: !332, file: !1, line: 50, type: !139)
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bSum", arg: 3, scope: !332, file: !1, line: 50, type: !139)
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 4, scope: !332, file: !1, line: 51, type: !139)
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 5, scope: !332, file: !1, line: 51, type: !139)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vecs", arg: 6, scope: !332, file: !1, line: 51, type: !335)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 7, scope: !332, file: !1, line: 51, type: !335)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shift", arg: 8, scope: !332, file: !1, line: 52, type: !139)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 9, scope: !332, file: !1, line: 52, type: !340)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 10, scope: !332, file: !1, line: 52, type: !359)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !332, file: !1, line: 54, type: !139)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !332, file: !1, line: 54, type: !139)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j0", scope: !332, file: !1, line: 54, type: !139)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j1", scope: !332, file: !1, line: 54, type: !139)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !332, file: !1, line: 55, type: !139)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsum", scope: !332, file: !1, line: 55, type: !139)
!384 = !DISubprogram(name: "move_x", scope: !1, file: !1, line: 121, type: !385, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, [3 x float]*, %struct.t_nsborder*, %struct.t_nrnb*)* @move_x, variables: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !145, !139, !139, !335, !340, !359}
!387 = !{!388, !389, !390, !391, !392, !393}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !384, file: !1, line: 121, type: !145)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 2, scope: !384, file: !1, line: 122, type: !139)
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 3, scope: !384, file: !1, line: 122, type: !139)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !384, file: !1, line: 122, type: !335)
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 5, scope: !384, file: !1, line: 122, type: !340)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 6, scope: !384, file: !1, line: 123, type: !359)
!394 = !DISubprogram(name: "move_f", scope: !1, file: !1, line: 131, type: !395, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, i32, [3 x float]*, [3 x float]*, %struct.t_nsborder*, %struct.t_nrnb*)* @move_f, variables: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !145, !139, !139, !335, !335, !340, !359}
!397 = !{!398, !399, !400, !401, !402, !403, !404}
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !394, file: !1, line: 131, type: !145)
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 2, scope: !394, file: !1, line: 132, type: !139)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 3, scope: !394, file: !1, line: 132, type: !139)
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 4, scope: !394, file: !1, line: 132, type: !335)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fadd", arg: 5, scope: !394, file: !1, line: 132, type: !335)
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 6, scope: !394, file: !1, line: 133, type: !340)
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 7, scope: !394, file: !1, line: 133, type: !359)
!405 = !DISubprogram(name: "move_cgcm", scope: !1, file: !1, line: 141, type: !406, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_commrec*, [3 x float]*, i32*)* @move_cgcm, variables: !420)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !145, !408, !335, !419}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !410, line: 40, baseType: !411)
!410 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!411 = !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 36, size: 192, align: 32, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !411, file: !410, line: 37, baseType: !139, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !411, file: !410, line: 37, baseType: !139, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !411, file: !410, line: 38, baseType: !139, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !411, file: !410, line: 38, baseType: !139, size: 32, align: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !411, file: !410, line: 39, baseType: !139, size: 32, align: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !411, file: !410, line: 39, baseType: !139, size: 32, align: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428}
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !405, file: !1, line: 141, type: !145)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !405, file: !1, line: 141, type: !408)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_cm", arg: 3, scope: !405, file: !1, line: 141, type: !335)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nload", arg: 4, scope: !405, file: !1, line: 141, type: !419)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !405, file: !1, line: 143, type: !139)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !405, file: !1, line: 143, type: !139)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr", scope: !405, file: !1, line: 143, type: !139)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !405, file: !1, line: 144, type: !139)
!429 = !DISubprogram(name: "clear_rvec", scope: !430, file: !430, line: 316, type: !431, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, variables: !434)
!430 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!431 = !DISubroutineType(types: !432)
!432 = !{null, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!434 = !{!435}
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !429, file: !430, line: 316, type: !433)
!436 = !DISubprogram(name: "rvec_inc", scope: !430, file: !430, line: 231, type: !437, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, variables: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !433, !433}
!439 = !{!440, !441, !442, !443, !444}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !436, file: !430, line: 231, type: !433)
!441 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !436, file: !430, line: 231, type: !433)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !436, file: !430, line: 233, type: !339)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !436, file: !430, line: 233, type: !339)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !436, file: !430, line: 233, type: !339)
!445 = !{}
!446 = !{i32 2, !"Dwarf Version", i32 2}
!447 = !{i32 2, !"Debug Info Version", i32 700000003}
!448 = !{i32 1, !"PIC Level", i32 2}
!449 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!450 = !DIExpression()
!451 = !DILocation(line: 348, column: 40, scope: !141)
!452 = !DILocation(line: 348, column: 50, scope: !141)
!453 = !DILocation(line: 349, column: 12, scope: !454)
!454 = distinct !DILexicalBlock(scope: !141, file: !142, line: 349, column: 6)
!455 = !DILocation(line: 349, column: 6, scope: !454)
!456 = !{!457, !461, i64 12}
!457 = !{!"__sFILE", !458, i64 0, !461, i64 8, !461, i64 12, !462, i64 16, !462, i64 18, !463, i64 24, !461, i64 40, !458, i64 48, !458, i64 56, !458, i64 64, !458, i64 72, !458, i64 80, !463, i64 88, !458, i64 104, !461, i64 112, !459, i64 116, !459, i64 119, !463, i64 120, !461, i64 136, !464, i64 144}
!458 = !{!"any pointer", !459, i64 0}
!459 = !{!"omnipotent char", !460, i64 0}
!460 = !{!"Simple C/C++ TBAA"}
!461 = !{!"int", !459, i64 0}
!462 = !{!"short", !459, i64 0}
!463 = !{!"__sbuf", !458, i64 0, !461, i64 8}
!464 = !{!"long long", !459, i64 0}
!465 = !DILocation(line: 349, column: 15, scope: !454)
!466 = !DILocation(line: 349, column: 20, scope: !454)
!467 = !DILocation(line: 350, column: 10, scope: !454)
