; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nrama.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_topology = type { i8**, %struct.t_idef, %struct.t_atoms, [3 x %struct.t_block], %struct.t_symtab }
%struct.t_idef = type { i32, i32, i32, i32*, %union.t_iparams*, [44 x %struct.t_ilist] }
%union.t_iparams = type { %struct.anon.2 }
%struct.anon.2 = type { float, float, float, float, float, float }
%struct.t_ilist = type { i32, [256 x i32], i32* }
%struct.t_atoms = type { i32, %struct.t_atom*, i8***, i8***, i8***, i32, i8***, i32, i8***, %struct.t_block, [9 x %struct.t_grps], %struct.t_pdbinfo* }
%struct.t_atom = type { float, float, float, float, i16, i16, i32, i32, [9 x i8], i8 }
%struct.t_block = type { [256 x i32], i32, i32*, i32, i32* }
%struct.t_grps = type { i32, i32* }
%struct.t_pdbinfo = type { i32, i32, i8, [6 x i8], float, float, i32, [6 x i32] }
%struct.t_symtab = type { i32, %struct.symbuf* }
%struct.symbuf = type { i32, i8**, %struct.symbuf* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 7.0.0 (clang-700.1.76)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !51, subprograms: !76, globals: !474, imports: !503)
!1 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nrama.c", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 49, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!6 = !DIEnumerator(name: "F_BONDS", value: 0)
!7 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!8 = !DIEnumerator(name: "F_MORSE", value: 2)
!9 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!10 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!11 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!12 = !DIEnumerator(name: "F_ANGLES", value: 6)
!13 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!14 = !DIEnumerator(name: "F_PDIHS", value: 8)
!15 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!16 = !DIEnumerator(name: "F_IDIHS", value: 10)
!17 = !DIEnumerator(name: "F_LJ14", value: 11)
!18 = !DIEnumerator(name: "F_COUL14", value: 12)
!19 = !DIEnumerator(name: "F_LJ", value: 13)
!20 = !DIEnumerator(name: "F_BHAM", value: 14)
!21 = !DIEnumerator(name: "F_LJLR", value: 15)
!22 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!23 = !DIEnumerator(name: "F_SR", value: 17)
!24 = !DIEnumerator(name: "F_LR", value: 18)
!25 = !DIEnumerator(name: "F_WPOL", value: 19)
!26 = !DIEnumerator(name: "F_POSRES", value: 20)
!27 = !DIEnumerator(name: "F_DISRES", value: 21)
!28 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!29 = !DIEnumerator(name: "F_ORIRES", value: 23)
!30 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!31 = !DIEnumerator(name: "F_ANGRES", value: 25)
!32 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!33 = !DIEnumerator(name: "F_SHAKE", value: 27)
!34 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!35 = !DIEnumerator(name: "F_SETTLE", value: 29)
!36 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!37 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!38 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!39 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!40 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!41 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!42 = !DIEnumerator(name: "F_EQM", value: 36)
!43 = !DIEnumerator(name: "F_EPOT", value: 37)
!44 = !DIEnumerator(name: "F_EKIN", value: 38)
!45 = !DIEnumerator(name: "F_ETOT", value: 39)
!46 = !DIEnumerator(name: "F_TEMP", value: 40)
!47 = !DIEnumerator(name: "F_PRES", value: 41)
!48 = !DIEnumerator(name: "F_DVDL", value: 42)
!49 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!50 = !DIEnumerator(name: "F_NRE", value: 44)
!51 = !{!52, !53, !58, !59}
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 30, baseType: !55)
!54 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !56, line: 92, baseType: !57)
!56 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!57 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dih", file: !61, line: 56, baseType: !62)
!61 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nrama.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!62 = !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 51, size: 224, align: 32, elements: !63)
!63 = !{!64, !71, !72, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ai", scope: !62, file: !61, line: 52, baseType: !65, size: 128, align: 32)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, align: 32, elements: !69)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !67, line: 73, baseType: !68)
!67 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 4)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !62, file: !61, line: 53, baseType: !68, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "phi0", scope: !62, file: !61, line: 54, baseType: !73, size: 32, align: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !67, line: 87, baseType: !74)
!74 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !62, file: !61, line: 55, baseType: !73, size: 32, align: 32, offset: 192)
!76 = !{!77, !143, !149, !321, !329, !343, !424, !433, !445, !458, !468}
!77 = !DISubprogram(name: "__sputc", scope: !78, file: !78, line: 348, type: !79, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !140)
!78 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!79 = !DISubroutineType(types: !80)
!80 = !{!68, !68, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 153, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !78, line: 122, size: 1216, align: 64, elements: !84)
!84 = !{!85, !88, !89, !90, !92, !93, !98, !99, !100, !104, !109, !118, !124, !125, !128, !129, !133, !137, !138, !139}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !83, file: !78, line: 123, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !83, file: !78, line: 124, baseType: !68, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !83, file: !78, line: 125, baseType: !68, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !78, line: 126, baseType: !91, size: 16, align: 16, offset: 128)
!91 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !83, file: !78, line: 127, baseType: !91, size: 16, align: 16, offset: 144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !83, file: !78, line: 128, baseType: !94, size: 128, align: 64, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !78, line: 88, size: 128, align: 64, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !94, file: !78, line: 89, baseType: !86, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !94, file: !78, line: 90, baseType: !68, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !83, file: !78, line: 129, baseType: !68, size: 32, align: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !83, file: !78, line: 132, baseType: !58, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !83, file: !78, line: 133, baseType: !101, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!68, !58}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !83, file: !78, line: 134, baseType: !105, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!68, !58, !108, !68}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !83, file: !78, line: 135, baseType: !110, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !58, !113, !68}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !78, line: 77, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !115, line: 71, baseType: !116)
!115 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !56, line: 46, baseType: !117)
!117 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !83, file: !78, line: 136, baseType: !119, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!68, !58, !122, !68}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !83, file: !78, line: 139, baseType: !94, size: 128, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !83, file: !78, line: 140, baseType: !126, size: 64, align: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !78, line: 94, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !83, file: !78, line: 141, baseType: !68, size: 32, align: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !83, file: !78, line: 144, baseType: !130, size: 24, align: 8, offset: 928)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 24, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 3)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !83, file: !78, line: 145, baseType: !134, size: 8, align: 8, offset: 952)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !83, file: !78, line: 148, baseType: !94, size: 128, align: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !83, file: !78, line: 151, baseType: !68, size: 32, align: 32, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !78, line: 152, baseType: !113, size: 64, align: 64, offset: 1152)
!140 = !{!141, !142}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !77, file: !78, line: 348, type: !68)
!142 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !77, file: !78, line: 348, type: !81)
!143 = !DISubprogram(name: "__sigbits", scope: !144, file: !144, line: 114, type: !145, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !147)
!144 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!145 = !DISubroutineType(types: !146)
!146 = !{!68, !68}
!147 = !{!148}
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !143, file: !144, line: 114, type: !68)
!149 = !DISubprogram(name: "new_data", scope: !1, file: !1, line: 84, type: !150, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_xrama*)* @new_data, variables: !319)
!150 = !DISubroutineType(types: !151)
!151 = !{!68, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_xrama", file: !61, line: 70, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 58, size: 896, align: 64, elements: !155)
!155 = !{!156, !157, !158, !159, !168, !169, !170, !171, !172, !173, !177, !181}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ndih", scope: !154, file: !61, line: 59, baseType: !68, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dih", scope: !154, file: !61, line: 60, baseType: !59, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "npp", scope: !154, file: !61, line: 61, baseType: !68, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pp", scope: !154, file: !61, line: 62, baseType: !160, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_phipsi", file: !61, line: 49, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 45, size: 192, align: 64, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bShow", scope: !162, file: !61, line: 46, baseType: !68, size: 32, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !162, file: !61, line: 47, baseType: !108, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "iphi", scope: !162, file: !61, line: 48, baseType: !68, size: 32, align: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ipsi", scope: !162, file: !61, line: 48, baseType: !68, size: 32, align: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "traj", scope: !154, file: !61, line: 63, baseType: !68, size: 32, align: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !154, file: !61, line: 64, baseType: !68, size: 32, align: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "amin", scope: !154, file: !61, line: 65, baseType: !68, size: 32, align: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "amax", scope: !154, file: !61, line: 65, baseType: !68, size: 32, align: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !154, file: !61, line: 66, baseType: !73, size: 32, align: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !154, file: !61, line: 67, baseType: !174, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !67, line: 101, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 96, align: 32, elements: !131)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !154, file: !61, line: 68, baseType: !178, size: 288, align: 32, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "matrix", file: !67, line: 103, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 288, align: 32, elements: !180)
!180 = !{!132, !132}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !154, file: !61, line: 69, baseType: !182, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !4, line: 188, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 179, size: 366336, align: 64, elements: !185)
!185 = !{!186, !187, !188, !189, !192, !304}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !184, file: !4, line: 181, baseType: !68, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !184, file: !4, line: 182, baseType: !68, size: 32, align: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !184, file: !4, line: 183, baseType: !68, size: 32, align: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !184, file: !4, line: 184, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !4, line: 133, baseType: !68)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !184, file: !4, line: 185, baseType: !193, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !4, line: 131, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_union_type, file: !4, line: 97, size: 192, align: 32, elements: !196)
!196 = !{!197, !203, !210, !216, !225, !230, !237, !245, !250, !255, !261, !266, !273, !282, !291, !300}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !195, file: !4, line: 105, baseType: !198, size: 96, align: 32)
!198 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 105, size: 96, align: 32, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !198, file: !4, line: 105, baseType: !73, size: 32, align: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !198, file: !4, line: 105, baseType: !73, size: 32, align: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !198, file: !4, line: 105, baseType: !73, size: 32, align: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !195, file: !4, line: 106, baseType: !204, size: 128, align: 32)
!204 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 106, size: 128, align: 32, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !204, file: !4, line: 106, baseType: !73, size: 32, align: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !204, file: !4, line: 106, baseType: !73, size: 32, align: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !204, file: !4, line: 106, baseType: !73, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !204, file: !4, line: 106, baseType: !73, size: 32, align: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !195, file: !4, line: 108, baseType: !211, size: 96, align: 32)
!211 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 108, size: 96, align: 32, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !211, file: !4, line: 108, baseType: !73, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !211, file: !4, line: 108, baseType: !73, size: 32, align: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !211, file: !4, line: 108, baseType: !73, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !195, file: !4, line: 110, baseType: !217, size: 192, align: 32)
!217 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 110, size: 192, align: 32, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !217, file: !4, line: 110, baseType: !73, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !217, file: !4, line: 110, baseType: !73, size: 32, align: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !217, file: !4, line: 110, baseType: !73, size: 32, align: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !217, file: !4, line: 110, baseType: !73, size: 32, align: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !217, file: !4, line: 110, baseType: !73, size: 32, align: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !217, file: !4, line: 110, baseType: !73, size: 32, align: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !195, file: !4, line: 111, baseType: !226, size: 64, align: 32)
!226 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 111, size: 64, align: 32, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !226, file: !4, line: 111, baseType: !73, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !226, file: !4, line: 111, baseType: !73, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !195, file: !4, line: 112, baseType: !231, size: 128, align: 32)
!231 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 112, size: 128, align: 32, elements: !232)
!232 = !{!233, !234, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !231, file: !4, line: 112, baseType: !73, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !231, file: !4, line: 112, baseType: !73, size: 32, align: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !231, file: !4, line: 112, baseType: !73, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !231, file: !4, line: 112, baseType: !73, size: 32, align: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !195, file: !4, line: 117, baseType: !238, size: 160, align: 32)
!238 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 117, size: 160, align: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !238, file: !4, line: 117, baseType: !73, size: 32, align: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !238, file: !4, line: 117, baseType: !73, size: 32, align: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !238, file: !4, line: 117, baseType: !68, size: 32, align: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !238, file: !4, line: 117, baseType: !73, size: 32, align: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !238, file: !4, line: 117, baseType: !73, size: 32, align: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !195, file: !4, line: 118, baseType: !246, size: 64, align: 32)
!246 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 118, size: 64, align: 32, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !246, file: !4, line: 118, baseType: !73, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !246, file: !4, line: 118, baseType: !73, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !195, file: !4, line: 123, baseType: !251, size: 64, align: 32)
!251 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 123, size: 64, align: 32, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !251, file: !4, line: 123, baseType: !73, size: 32, align: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !251, file: !4, line: 123, baseType: !73, size: 32, align: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !195, file: !4, line: 124, baseType: !256, size: 96, align: 32)
!256 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 124, size: 96, align: 32, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !256, file: !4, line: 124, baseType: !73, size: 32, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !256, file: !4, line: 124, baseType: !73, size: 32, align: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !256, file: !4, line: 124, baseType: !73, size: 32, align: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !195, file: !4, line: 125, baseType: !262, size: 192, align: 32)
!262 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 125, size: 192, align: 32, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !262, file: !4, line: 125, baseType: !176, size: 96, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !262, file: !4, line: 125, baseType: !176, size: 96, align: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !195, file: !4, line: 126, baseType: !267, size: 192, align: 32)
!267 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 126, size: 192, align: 32, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !267, file: !4, line: 126, baseType: !270, size: 192, align: 32)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, align: 32, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 6)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !195, file: !4, line: 127, baseType: !274, size: 192, align: 32)
!274 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 127, size: 192, align: 32, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !274, file: !4, line: 127, baseType: !73, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !274, file: !4, line: 127, baseType: !73, size: 32, align: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !274, file: !4, line: 127, baseType: !73, size: 32, align: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !274, file: !4, line: 127, baseType: !73, size: 32, align: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !274, file: !4, line: 127, baseType: !73, size: 32, align: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !274, file: !4, line: 127, baseType: !73, size: 32, align: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !195, file: !4, line: 128, baseType: !283, size: 192, align: 32)
!283 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 128, size: 192, align: 32, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !283, file: !4, line: 128, baseType: !73, size: 32, align: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !283, file: !4, line: 128, baseType: !73, size: 32, align: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !283, file: !4, line: 128, baseType: !73, size: 32, align: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !283, file: !4, line: 128, baseType: !73, size: 32, align: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !4, line: 128, baseType: !68, size: 32, align: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !283, file: !4, line: 128, baseType: !68, size: 32, align: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !195, file: !4, line: 129, baseType: !292, size: 192, align: 32)
!292 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 129, size: 192, align: 32, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !292, file: !4, line: 129, baseType: !68, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !292, file: !4, line: 129, baseType: !68, size: 32, align: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !292, file: !4, line: 129, baseType: !68, size: 32, align: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !292, file: !4, line: 129, baseType: !73, size: 32, align: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !292, file: !4, line: 129, baseType: !73, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !292, file: !4, line: 129, baseType: !73, size: 32, align: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !195, file: !4, line: 130, baseType: !301, size: 192, align: 32)
!301 = !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !4, line: 130, size: 192, align: 32, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !301, file: !4, line: 130, baseType: !270, size: 192, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !184, file: !4, line: 187, baseType: !305, size: 366080, align: 64, offset: 256)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 366080, align: 64, elements: !317)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !4, line: 140, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 135, size: 8320, align: 64, elements: !308)
!308 = !{!309, !310, !314}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !307, file: !4, line: 137, baseType: !68, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !307, file: !4, line: 138, baseType: !311, size: 8192, align: 32, offset: 32)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8192, align: 32, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !307, file: !4, line: 139, baseType: !315, size: 64, align: 64, offset: 8256)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !4, line: 45, baseType: !66)
!317 = !{!318}
!318 = !DISubrange(count: 44)
!319 = !{!320}
!320 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 1, scope: !149, file: !1, line: 84, type: !152)
!321 = !DISubprogram(name: "init_rama", scope: !1, file: !1, line: 291, type: !322, isLocal: false, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, %struct.t_xrama*)* @init_rama, variables: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !108, !108, !152}
!324 = !{!325, !326, !327, !328}
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "infile", arg: 1, scope: !321, file: !1, line: 291, type: !108)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "topfile", arg: 2, scope: !321, file: !1, line: 291, type: !108)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 3, scope: !321, file: !1, line: 291, type: !152)
!328 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !321, file: !1, line: 294, type: !73)
!329 = !DISubprogram(name: "calc_dihs", scope: !1, file: !1, line: 66, type: !330, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_xrama*)* @calc_dihs, variables: !332)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !152}
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!333 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 1, scope: !329, file: !1, line: 66, type: !152)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !329, file: !1, line: 68, type: !68)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r_ij", scope: !329, file: !1, line: 69, type: !175)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r_kj", scope: !329, file: !1, line: 69, type: !175)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r_kl", scope: !329, file: !1, line: 69, type: !175)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !329, file: !1, line: 69, type: !175)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !329, file: !1, line: 69, type: !175)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cos_phi", scope: !329, file: !1, line: 70, type: !73)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !329, file: !1, line: 70, type: !73)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dd", scope: !329, file: !1, line: 71, type: !59)
!343 = !DISubprogram(name: "get_dih", scope: !1, file: !1, line: 126, type: !344, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, variables: !414)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !152, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !348, line: 94, baseType: !349)
!348 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/atoms.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!349 = !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 75, size: 10240, align: 64, elements: !350)
!350 = !{!351, !352, !371, !374, !375, !376, !377, !378, !379, !380, !391, !399}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !349, file: !348, line: 76, baseType: !68, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !349, file: !348, line: 77, baseType: !353, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !348, line: 57, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 48, size: 320, align: 32, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !363, !364, !365, !366, !370}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !355, file: !348, line: 49, baseType: !73, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !355, file: !348, line: 49, baseType: !73, size: 32, align: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !355, file: !348, line: 50, baseType: !73, size: 32, align: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !355, file: !348, line: 50, baseType: !73, size: 32, align: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !348, line: 51, baseType: !362, size: 16, align: 16, offset: 128)
!362 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !355, file: !348, line: 52, baseType: !362, size: 16, align: 16, offset: 144)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !355, file: !348, line: 53, baseType: !68, size: 32, align: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !355, file: !348, line: 54, baseType: !68, size: 32, align: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !355, file: !348, line: 55, baseType: !367, size: 72, align: 8, offset: 224)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 72, align: 8, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 9)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !355, file: !348, line: 56, baseType: !87, size: 8, align: 8, offset: 296)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !349, file: !348, line: 80, baseType: !372, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !349, file: !348, line: 82, baseType: !372, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !349, file: !348, line: 84, baseType: !372, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !349, file: !348, line: 86, baseType: !68, size: 32, align: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !349, file: !348, line: 87, baseType: !372, size: 64, align: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !349, file: !348, line: 89, baseType: !68, size: 32, align: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !349, file: !348, line: 90, baseType: !372, size: 64, align: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !349, file: !348, line: 91, baseType: !381, size: 8448, align: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !382, line: 52, baseType: !383)
!382 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 36, size: 8448, align: 64, elements: !384)
!384 = !{!385, !386, !387, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !383, file: !382, line: 37, baseType: !311, size: 8192, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !383, file: !382, line: 43, baseType: !68, size: 32, align: 32, offset: 8192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !383, file: !382, line: 44, baseType: !388, size: 64, align: 64, offset: 8256)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !383, file: !382, line: 45, baseType: !68, size: 32, align: 32, offset: 8320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !383, file: !382, line: 46, baseType: !388, size: 64, align: 64, offset: 8384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !349, file: !348, line: 92, baseType: !392, size: 1152, align: 64, offset: 9024)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1152, align: 64, elements: !368)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !348, line: 73, baseType: !394)
!394 = !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 70, size: 128, align: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !394, file: !348, line: 71, baseType: !68, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !394, file: !348, line: 72, baseType: !398, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !349, file: !348, line: 93, baseType: !400, size: 64, align: 64, offset: 10176)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !348, line: 68, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 59, size: 416, align: 32, elements: !403)
!403 = !{!404, !405, !406, !407, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !348, line: 60, baseType: !68, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !402, file: !348, line: 61, baseType: !68, size: 32, align: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !402, file: !348, line: 62, baseType: !52, size: 8, align: 8, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !402, file: !348, line: 63, baseType: !408, size: 48, align: 8, offset: 72)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, align: 8, elements: !271)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !402, file: !348, line: 64, baseType: !73, size: 32, align: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !402, file: !348, line: 65, baseType: !73, size: 32, align: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !402, file: !348, line: 66, baseType: !68, size: 32, align: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !402, file: !348, line: 67, baseType: !413, size: 192, align: 32, offset: 224)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 192, align: 32, elements: !271)
!414 = !{!415, !416, !417, !418, !422, !423}
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 1, scope: !343, file: !1, line: 126, type: !152)
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 2, scope: !343, file: !1, line: 126, type: !346)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !343, file: !1, line: 128, type: !68)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ff", scope: !343, file: !1, line: 128, type: !419)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, align: 32, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !343, file: !1, line: 129, type: !68)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !343, file: !1, line: 129, type: !68)
!424 = !DISubprogram(name: "find_atom", scope: !1, file: !1, line: 94, type: !425, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, variables: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!68, !108, !372, !68, !68}
!427 = !{!428, !429, !430, !431, !432}
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "find", arg: 1, scope: !424, file: !1, line: 94, type: !108)
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "names", arg: 2, scope: !424, file: !1, line: 94, type: !372)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !424, file: !1, line: 94, type: !68)
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nr", arg: 4, scope: !424, file: !1, line: 94, type: !68)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !424, file: !1, line: 96, type: !68)
!433 = !DISubprogram(name: "add_xr", scope: !1, file: !1, line: 104, type: !434, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, variables: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !152, !398, !346}
!436 = !{!437, !438, !439, !440, !444}
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 1, scope: !433, file: !1, line: 104, type: !152)
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ff", arg: 2, scope: !433, file: !1, line: 104, type: !398)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atoms", arg: 3, scope: !433, file: !1, line: 104, type: !346)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !433, file: !1, line: 106, type: !441)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 96, align: 8, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 12)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !433, file: !1, line: 107, type: !68)
!445 = !DISubprogram(name: "get_dih_props", scope: !1, file: !1, line: 259, type: !446, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, variables: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !152, !182}
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457}
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 1, scope: !445, file: !1, line: 259, type: !152)
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idef", arg: 2, scope: !445, file: !1, line: 259, type: !182)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !445, file: !1, line: 261, type: !68)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ft", scope: !445, file: !1, line: 261, type: !68)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftype", scope: !445, file: !1, line: 261, type: !68)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nra", scope: !445, file: !1, line: 261, type: !68)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !445, file: !1, line: 262, type: !315)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dd", scope: !445, file: !1, line: 263, type: !59)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !445, file: !1, line: 263, type: !60)
!458 = !DISubprogram(name: "d_comp", scope: !1, file: !1, line: 50, type: !459, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @d_comp, variables: !463)
!459 = !DISubroutineType(types: !460)
!460 = !{!68, !461, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!463 = !{!464, !465, !466, !467}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !458, file: !1, line: 50, type: !461)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !458, file: !1, line: 50, type: !461)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "da", scope: !458, file: !1, line: 52, type: !59)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "db", scope: !458, file: !1, line: 52, type: !59)
!468 = !DISubprogram(name: "min_max", scope: !1, file: !1, line: 243, type: !330, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, variables: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xr", arg: 1, scope: !468, file: !1, line: 243, type: !152)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !468, file: !1, line: 245, type: !68)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !468, file: !1, line: 245, type: !68)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !468, file: !1, line: 245, type: !68)
!474 = !{!475, !501}
!475 = !DIGlobalVariable(name: "top", scope: !321, file: !1, line: 293, type: !476, isLocal: true, isDefinition: true, variable: %struct.t_topology** @init_rama.top)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !478, line: 42, baseType: !479)
!478 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!479 = !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 36, size: 402112, align: 64, elements: !480)
!480 = !{!481, !482, !483, !484, !486}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !478, line: 37, baseType: !373, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !479, file: !478, line: 38, baseType: !183, size: 366336, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !479, file: !478, line: 39, baseType: !347, size: 10240, align: 64, offset: 366400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !479, file: !478, line: 40, baseType: !485, size: 25344, align: 64, offset: 376640)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 25344, align: 64, elements: !131)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !479, file: !478, line: 41, baseType: !487, size: 128, align: 64, offset: 401984)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !488, line: 46, baseType: !489)
!488 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 42, size: 128, align: 64, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !489, file: !488, line: 44, baseType: !68, size: 32, align: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !489, file: !488, line: 45, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !488, line: 40, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !488, line: 36, size: 192, align: 64, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !495, file: !488, line: 37, baseType: !68, size: 32, align: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !495, file: !488, line: 38, baseType: !373, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !488, line: 39, baseType: !500, size: 64, align: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!501 = !DIGlobalVariable(name: "pp_pat", scope: !0, file: !1, line: 47, type: !502, isLocal: true, isDefinition: true, variable: [5 x i8*]* @pp_pat)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 320, align: 64, elements: !420)
!503 = !{}
!504 = !{i32 2, !"Dwarf Version", i32 2}
!505 = !{i32 2, !"Debug Info Version", i32 700000003}
!506 = !{i32 1, !"PIC Level", i32 2}
!507 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!508 = !DIExpression()
!509 = !DILocation(line: 348, column: 40, scope: !77)
!510 = !DILocation(line: 348, column: 50, scope: !77)
!511 = !DILocation(line: 349, column: 12, scope: !512)
!512 = distinct !DILexicalBlock(scope: !77, file: !78, line: 349, column: 6)
!513 = !DILocation(line: 349, column: 6, scope: !512)
!514 = !{!515, !519, i64 12}
!515 = !{!"__sFILE", !516, i64 0, !519, i64 8, !519, i64 12, !520, i64 16, !520, i64 18, !521, i64 24, !519, i64 40, !516, i64 48, !516, i64 56, !516, i64 64, !516, i64 72, !516, i64 80, !521, i64 88, !516, i64 104, !519, i64 112, !517, i64 116, !517, i64 119, !521, i64 120, !519, i64 136, !522, i64 144}
!516 = !{!"any pointer", !517, i64 0}
!517 = !{!"omnipotent char", !518, i64 0}
!518 = !{!"Simple C/C++ TBAA"}
!519 = !{!"int", !517, i64 0}
!520 = !{!"short", !517, i64 0}
!521 = !{!"__sbuf", !516, i64 0, !519, i64 8}
!522 = !{!"long long", !517, i64 0}
!523 = !DILocation(line: 349, column: 15, scope: !512)
!524 = !DILocation(line: 349, column: 20, scope: !512)
!525 = !DILocation(line: 350, column: 10, scope: !512)
!526 = !DILocation(line: 349, column: 38, scope: !512)
!527 = !{!515, !519, i64 40}
!528 = !DILocation(line: 349, column: 31, scope: !512)
!529 = !DILocation(line: 349, column: 59, scope: !512)
!530 = !DILocation(line: 349, column: 47, scope: !512)
!531 = !DILocation(line: 350, column: 23, scope: !512)
!532 = !DILocation(line: 350, column: 16, scope: !512)
!533 = !DILocation(line: 350, column: 18, scope: !512)
!534 = !{!515, !516, i64 0}
!535 = !DILocation(line: 350, column: 21, scope: !512)
!536 = !{!517, !517, i64 0}
!537 = !DILocation(line: 350, column: 3, scope: !512)
!538 = !DILocation(line: 352, column: 11, scope: !512)
!539 = !DILocation(line: 352, column: 3, scope: !512)
!540 = !DILocation(line: 353, column: 1, scope: !77)
!541 = !DILocation(line: 114, column: 15, scope: !143)
!542 = !DILocation(line: 116, column: 20, scope: !143)
!543 = !DILocation(line: 116, column: 12, scope: !143)
!544 = !DILocation(line: 116, column: 57, scope: !143)
!545 = !DILocation(line: 116, column: 45, scope: !143)
!546 = !DILocation(line: 116, column: 5, scope: !143)
!547 = !DILocation(line: 84, column: 24, scope: !149)
!548 = !DILocation(line: 86, column: 24, scope: !549)
!549 = distinct !DILexicalBlock(scope: !149, file: !1, line: 86, column: 7)
!550 = !{!551, !519, i64 32}
!551 = !{!"", !519, i64 0, !516, i64 8, !519, i64 16, !516, i64 24, !519, i64 32, !519, i64 36, !519, i64 40, !519, i64 44, !552, i64 48, !516, i64 56, !517, i64 64, !516, i64 104}
!552 = !{!"float", !517, i64 0}
!553 = !DILocation(line: 86, column: 34, scope: !549)
!554 = !DILocation(line: 86, column: 40, scope: !549)
!555 = !{!551, !519, i64 36}
!556 = !DILocation(line: 86, column: 51, scope: !549)
!557 = !{!551, !516, i64 56}
!558 = !DILocation(line: 86, column: 53, scope: !549)
!559 = !DILocation(line: 86, column: 8, scope: !549)
!560 = !DILocation(line: 86, column: 7, scope: !149)
!561 = !DILocation(line: 89, column: 3, scope: !149)
!562 = !DILocation(line: 91, column: 3, scope: !149)
!563 = !DILocation(line: 92, column: 1, scope: !149)
!564 = !DILocation(line: 66, column: 32, scope: !329)
!565 = !DILocation(line: 69, column: 10, scope: !329)
!566 = !DILocation(line: 69, column: 15, scope: !329)
!567 = !DILocation(line: 69, column: 20, scope: !329)
