; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/nrnb.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_nrnb_data = type { i8*, i32 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_nrnb = type { [129 x double] }

@.str = private unnamed_addr constant [15 x i8] c"%14s  %10.0f.\0A\00", align 1

!54 = !DIEnumerator(name: "eNR_INL2400", value: 48)
!55 = !DIEnumerator(name: "eNR_INL2410", value: 49)
!56 = !DIEnumerator(name: "eNR_INL2420", value: 50)
!57 = !DIEnumerator(name: "eNR_INL2430", value: 51)
!58 = !DIEnumerator(name: "eNR_INL3000", value: 52)
!59 = !DIEnumerator(name: "eNR_INL3001", value: 53)
!60 = !DIEnumerator(name: "eNR_INL3002", value: 54)
!61 = !DIEnumerator(name: "eNR_INL3010", value: 55)
!62 = !DIEnumerator(name: "eNR_INL3020", value: 56)
!63 = !DIEnumerator(name: "eNR_INL3030", value: 57)
!64 = !DIEnumerator(name: "eNR_INL3100", value: 58)
!65 = !DIEnumerator(name: "eNR_INL3110", value: 59)
!66 = !DIEnumerator(name: "eNR_INL3120", value: 60)
!67 = !DIEnumerator(name: "eNR_INL3130", value: 61)
!68 = !DIEnumerator(name: "eNR_INL3200", value: 62)
!69 = !DIEnumerator(name: "eNR_INL3210", value: 63)
!70 = !DIEnumerator(name: "eNR_INL3220", value: 64)
!71 = !DIEnumerator(name: "eNR_INL3230", value: 65)
!72 = !DIEnumerator(name: "eNR_INL3300", value: 66)
!73 = !DIEnumerator(name: "eNR_INL3301", value: 67)
!74 = !DIEnumerator(name: "eNR_INL3302", value: 68)
!75 = !DIEnumerator(name: "eNR_INL3310", value: 69)
!76 = !DIEnumerator(name: "eNR_INL3320", value: 70)
!77 = !DIEnumerator(name: "eNR_INL3330", value: 71)
!78 = !DIEnumerator(name: "eNR_INL3400", value: 72)
!79 = !DIEnumerator(name: "eNR_INL3401", value: 73)
!80 = !DIEnumerator(name: "eNR_INL3402", value: 74)
!81 = !DIEnumerator(name: "eNR_INL3410", value: 75)
!82 = !DIEnumerator(name: "eNR_INL3420", value: 76)
!83 = !DIEnumerator(name: "eNR_INL3430", value: 77)
!84 = !DIEnumerator(name: "eNR_INLOOP", value: 78)
!85 = !DIEnumerator(name: "eNR_INL_IATOM", value: 78)
!86 = !DIEnumerator(name: "eNR_WEIGHTS", value: 79)
!87 = !DIEnumerator(name: "eNR_SPREADQ", value: 80)
!88 = !DIEnumerator(name: "eNR_SPREADQBSP", value: 81)
!89 = !DIEnumerator(name: "eNR_GATHERF", value: 82)
!90 = !DIEnumerator(name: "eNR_GATHERFBSP", value: 83)
!91 = !DIEnumerator(name: "eNR_FFT", value: 84)
!92 = !DIEnumerator(name: "eNR_CONV", value: 85)
!93 = !DIEnumerator(name: "eNR_SOLVEPME", value: 86)
!94 = !DIEnumerator(name: "eNR_NS", value: 87)
!95 = !DIEnumerator(name: "eNR_RESETX", value: 88)
!96 = !DIEnumerator(name: "eNR_SHIFTX", value: 89)
!97 = !DIEnumerator(name: "eNR_CGCM", value: 90)
!98 = !DIEnumerator(name: "eNR_FSUM", value: 91)
!99 = !DIEnumerator(name: "eNR_BONDS", value: 92)
!100 = !DIEnumerator(name: "eNR_G96BONDS", value: 93)
!101 = !DIEnumerator(name: "eNR_ANGLES", value: 94)
!102 = !DIEnumerator(name: "eNR_G96ANGLES", value: 95)
!103 = !DIEnumerator(name: "eNR_PROPER", value: 96)
!104 = !DIEnumerator(name: "eNR_IMPROPER", value: 97)
!105 = !DIEnumerator(name: "eNR_RB", value: 98)
!106 = !DIEnumerator(name: "eNR_DISRES", value: 99)
!107 = !DIEnumerator(name: "eNR_ORIRES", value: 100)
!108 = !DIEnumerator(name: "eNR_POSRES", value: 101)
!109 = !DIEnumerator(name: "eNR_ANGRES", value: 102)
!110 = !DIEnumerator(name: "eNR_ANGRESZ", value: 103)
!111 = !DIEnumerator(name: "eNR_MORSE", value: 104)
!112 = !DIEnumerator(name: "eNR_CUBICBONDS", value: 105)
!113 = !DIEnumerator(name: "eNR_WPOL", value: 106)
!114 = !DIEnumerator(name: "eNR_VIRIAL", value: 107)
!115 = !DIEnumerator(name: "eNR_UPDATE", value: 108)
!116 = !DIEnumerator(name: "eNR_EXTUPDATE", value: 109)
!117 = !DIEnumerator(name: "eNR_STOPCM", value: 110)
!118 = !DIEnumerator(name: "eNR_PCOUPL", value: 111)
!119 = !DIEnumerator(name: "eNR_EKIN", value: 112)
!120 = !DIEnumerator(name: "eNR_LINCS", value: 113)
!121 = !DIEnumerator(name: "eNR_LINCSMAT", value: 114)
!122 = !DIEnumerator(name: "eNR_SHAKE", value: 115)
!123 = !DIEnumerator(name: "eNR_SHAKE_V", value: 116)
!124 = !DIEnumerator(name: "eNR_SHAKE_RIJ", value: 117)
!125 = !DIEnumerator(name: "eNR_SHAKE_VIR", value: 118)
!126 = !DIEnumerator(name: "eNR_SETTLE", value: 119)
!127 = !DIEnumerator(name: "eNR_PSHAKEINITLD", value: 120)
!128 = !DIEnumerator(name: "eNR_PSHAKEINITMD", value: 121)
!129 = !DIEnumerator(name: "eNR_PSHAKE", value: 122)
!130 = !DIEnumerator(name: "eNR_DUM2", value: 123)
!131 = !DIEnumerator(name: "eNR_DUM3", value: 124)
!132 = !DIEnumerator(name: "eNR_DUM3FD", value: 125)
!133 = !DIEnumerator(name: "eNR_DUM3FAD", value: 126)
!134 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!135 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!136 = !DIEnumerator(name: "eNRNB", value: 129)
!137 = !{!138, !139, !140}
!138 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!140 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!141 = !{!142, !210, !216, !230, !237, !245, !252, !261, !281, !284, !289, !309}
!142 = !DISubprogram(name: "__sputc", scope: !143, file: !143, line: 348, type: !144, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !207)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !146, !147}
!146 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 153, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !143, line: 122, size: 1216, align: 64, elements: !150)
!150 = !{!151, !154, !155, !156, !158, !159, !164, !165, !166, !170, !175, !185, !191, !192, !195, !196, !200, !204, !205, !206}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !149, file: !143, line: 123, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !149, file: !143, line: 124, baseType: !146, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !149, file: !143, line: 125, baseType: !146, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !149, file: !143, line: 126, baseType: !157, size: 16, align: 16, offset: 128)
!157 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !149, file: !143, line: 127, baseType: !157, size: 16, align: 16, offset: 144)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !149, file: !143, line: 128, baseType: !160, size: 128, align: 64, offset: 192)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !143, line: 88, size: 128, align: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !160, file: !143, line: 89, baseType: !152, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !160, file: !143, line: 90, baseType: !146, size: 32, align: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !149, file: !143, line: 129, baseType: !146, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !149, file: !143, line: 132, baseType: !139, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !149, file: !143, line: 133, baseType: !167, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!146, !139}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !149, file: !143, line: 134, baseType: !171, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!146, !139, !174, !146}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !149, file: !143, line: 135, baseType: !176, size: 64, align: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !139, !179, !146}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !143, line: 77, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !181, line: 71, baseType: !182)
!181 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !183, line: 46, baseType: !184)
!183 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!184 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !149, file: !143, line: 136, baseType: !186, size: 64, align: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!146, !139, !189, !146}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !149, file: !143, line: 139, baseType: !160, size: 128, align: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !149, file: !143, line: 140, baseType: !193, size: 64, align: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !143, line: 94, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !149, file: !143, line: 141, baseType: !146, size: 32, align: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !149, file: !143, line: 144, baseType: !197, size: 24, align: 8, offset: 928)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 24, align: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 3)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !149, file: !143, line: 145, baseType: !201, size: 8, align: 8, offset: 952)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 8, align: 8, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 1)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !149, file: !143, line: 148, baseType: !160, size: 128, align: 64, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !149, file: !143, line: 151, baseType: !146, size: 32, align: 32, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !149, file: !143, line: 152, baseType: !179, size: 64, align: 64, offset: 1152)
!207 = !{!208, !209}
!208 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !142, file: !143, line: 348, type: !146)
!209 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !142, file: !143, line: 348, type: !147)
!210 = !DISubprogram(name: "__sigbits", scope: !211, file: !211, line: 114, type: !212, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !214)
!211 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!212 = !DISubroutineType(types: !213)
!213 = !{!146, !146}
!214 = !{!215}
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !210, file: !211, line: 114, type: !146)
!216 = !DISubprogram(name: "init_nrnb", scope: !1, file: !1, line: 183, type: !217, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nrnb*)* @init_nrnb, variables: !227)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !4, line: 95, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 93, size: 8256, align: 64, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !221, file: !4, line: 94, baseType: !224, size: 8256, align: 64)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8256, align: 64, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 129)
!227 = !{!228, !229}
!228 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 1, scope: !216, file: !1, line: 183, type: !219)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !216, file: !1, line: 185, type: !146)
!230 = !DISubprogram(name: "cp_nrnb", scope: !1, file: !1, line: 191, type: !231, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nrnb*, %struct.t_nrnb*)* @cp_nrnb, variables: !233)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !219, !219}
!233 = !{!234, !235, !236}
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !230, file: !1, line: 191, type: !219)
!235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !230, file: !1, line: 191, type: !219)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !230, file: !1, line: 193, type: !146)
!237 = !DISubprogram(name: "add_nrnb", scope: !1, file: !1, line: 199, type: !238, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nrnb*, %struct.t_nrnb*, %struct.t_nrnb*)* @add_nrnb, variables: !240)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !219, !219, !219}
!240 = !{!241, !242, !243, !244}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !237, file: !1, line: 199, type: !219)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s1", arg: 2, scope: !237, file: !1, line: 199, type: !219)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s2", arg: 3, scope: !237, file: !1, line: 199, type: !219)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !237, file: !1, line: 201, type: !146)
!245 = !DISubprogram(name: "print_nrnb", scope: !1, file: !1, line: 207, type: !246, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_nrnb*)* @print_nrnb, variables: !248)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !147, !219}
!248 = !{!249, !250, !251}
!249 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !245, file: !1, line: 207, type: !147)
!250 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 2, scope: !245, file: !1, line: 207, type: !219)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !245, file: !1, line: 209, type: !146)
!252 = !DISubprogram(name: "_inc_nrnb", scope: !1, file: !1, line: 215, type: !253, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nrnb*, i32, i32, i8*, i32)* @_inc_nrnb, variables: !255)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !219, !146, !146, !174, !146}
!255 = !{!256, !257, !258, !259, !260}
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 1, scope: !252, file: !1, line: 215, type: !219)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enr", arg: 2, scope: !252, file: !1, line: 215, type: !146)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inc", arg: 3, scope: !252, file: !1, line: 215, type: !146)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 4, scope: !252, file: !1, line: 215, type: !174)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 5, scope: !252, file: !1, line: 215, type: !146)
!261 = !DISubprogram(name: "print_perf", scope: !1, file: !1, line: 224, type: !262, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, double, double, float, %struct.t_nrnb*, i32)* @print_perf, variables: !267)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !147, !140, !140, !264, !219, !146}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !265, line: 87, baseType: !266)
!265 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!266 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!268 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !261, file: !1, line: 224, type: !147)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nodetime", arg: 2, scope: !261, file: !1, line: 224, type: !140)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "realtime", arg: 3, scope: !261, file: !1, line: 224, type: !140)
!271 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "runtime", arg: 4, scope: !261, file: !1, line: 224, type: !264)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 5, scope: !261, file: !1, line: 225, type: !219)
!273 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 6, scope: !261, file: !1, line: 225, type: !146)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !261, file: !1, line: 227, type: !146)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbfs", scope: !261, file: !1, line: 228, type: !140)
!276 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mni", scope: !261, file: !1, line: 228, type: !140)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frac", scope: !261, file: !1, line: 228, type: !140)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tfrac", scope: !261, file: !1, line: 228, type: !140)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mflop", scope: !261, file: !1, line: 228, type: !140)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tflop", scope: !261, file: !1, line: 228, type: !140)
!281 = !DISubprogram(name: "cost_nrnb", scope: !1, file: !1, line: 294, type: !212, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @cost_nrnb, variables: !282)
!282 = !{!283}
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enr", arg: 1, scope: !281, file: !1, line: 294, type: !146)
!284 = !DISubprogram(name: "nrnb_str", scope: !1, file: !1, line: 299, type: !285, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @nrnb_str, variables: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!174, !146}
!287 = !{!288}
!288 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enr", arg: 1, scope: !284, file: !1, line: 299, type: !146)
!289 = !DISubprogram(name: "pr_load", scope: !1, file: !1, line: 342, type: !290, isLocal: false, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, i32, %struct.t_nrnb*)* @pr_load, variables: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !147, !146, !219}
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !305, !306, !307, !308}
!293 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !289, file: !1, line: 342, type: !147)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 2, scope: !289, file: !1, line: 342, type: !146)
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 3, scope: !289, file: !1, line: 342, type: !219)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !289, file: !1, line: 344, type: !146)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !289, file: !1, line: 344, type: !146)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perc", scope: !289, file: !1, line: 344, type: !146)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dperc", scope: !289, file: !1, line: 345, type: !140)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unb", scope: !289, file: !1, line: 345, type: !140)
!301 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uf", scope: !289, file: !1, line: 345, type: !140)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "us", scope: !289, file: !1, line: 345, type: !140)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ftot", scope: !289, file: !1, line: 346, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!305 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fav", scope: !289, file: !1, line: 346, type: !140)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stot", scope: !289, file: !1, line: 347, type: !304)
!307 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sav", scope: !289, file: !1, line: 347, type: !140)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "av", scope: !289, file: !1, line: 348, type: !219)
!309 = !DISubprogram(name: "pr_av", scope: !1, file: !1, line: 317, type: !310, isLocal: true, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct.__sFILE*, i32, double, double*, i8*)* @pr_av, variables: !312)
!310 = !DISubroutineType(types: !311)
!311 = !{!140, !147, !146, !140, !304, !174}
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321}
!313 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !309, file: !1, line: 317, type: !147)
!314 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nprocs", arg: 2, scope: !309, file: !1, line: 317, type: !146)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fav", arg: 3, scope: !309, file: !1, line: 317, type: !140)
!316 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ftot", arg: 4, scope: !309, file: !1, line: 317, type: !304)
!317 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "title", arg: 5, scope: !309, file: !1, line: 317, type: !174)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !309, file: !1, line: 319, type: !146)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perc", scope: !309, file: !1, line: 319, type: !146)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dperc", scope: !309, file: !1, line: 320, type: !140)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unb", scope: !309, file: !1, line: 320, type: !140)
!322 = !{!323, !330, !334}
!323 = !DIGlobalVariable(name: "nbdata", scope: !0, file: !1, line: 51, type: !324, isLocal: true, isDefinition: true, variable: [129 x %struct.t_nrnb_data]* @nbdata)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 16512, align: 64, elements: !225)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb_data", file: !1, line: 48, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 45, size: 128, align: 64, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !1, line: 46, baseType: !174, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flop", scope: !326, file: !1, line: 47, baseType: !146, size: 32, align: 32, offset: 64)
!330 = !DIGlobalVariable(name: "force_index", scope: !0, file: !1, line: 304, type: !331, isLocal: true, isDefinition: true, variable: [10 x i32]* @force_index)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 320, align: 32, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 10)
!334 = !DIGlobalVariable(name: "shake_index", scope: !0, file: !1, line: 311, type: !331, isLocal: true, isDefinition: true, variable: [10 x i32]* @shake_index)
!335 = !{}
!336 = !{i32 2, !"Dwarf Version", i32 2}
!337 = !{i32 2, !"Debug Info Version", i32 700000003}
!338 = !{i32 1, !"PIC Level", i32 2}
!339 = !{!"Apple LLVM version 7.0.0 (clang-700.1.76)"}
!340 = !DIExpression()
!341 = !DILocation(line: 348, column: 40, scope: !142)
!342 = !DILocation(line: 348, column: 50, scope: !142)
!343 = !DILocation(line: 349, column: 12, scope: !344)
!344 = distinct !DILexicalBlock(scope: !142, file: !143, line: 349, column: 6)
!345 = !DILocation(line: 349, column: 6, scope: !344)
!346 = !{!347, !351, i64 12}
!347 = !{!"__sFILE", !348, i64 0, !351, i64 8, !351, i64 12, !352, i64 16, !352, i64 18, !353, i64 24, !351, i64 40, !348, i64 48, !348, i64 56, !348, i64 64, !348, i64 72, !348, i64 80, !353, i64 88, !348, i64 104, !351, i64 112, !349, i64 116, !349, i64 119, !353, i64 120, !351, i64 136, !354, i64 144}
!348 = !{!"any pointer", !349, i64 0}
!349 = !{!"omnipotent char", !350, i64 0}
!350 = !{!"Simple C/C++ TBAA"}
!351 = !{!"int", !349, i64 0}
!352 = !{!"short", !349, i64 0}
!353 = !{!"__sbuf", !348, i64 0, !351, i64 8}
!354 = !{!"long long", !349, i64 0}
!355 = !DILocation(line: 349, column: 15, scope: !344)
!356 = !DILocation(line: 349, column: 20, scope: !344)
!357 = !DILocation(line: 350, column: 10, scope: !344)
!358 = !DILocation(line: 349, column: 38, scope: !344)
!359 = !{!347, !351, i64 40}
!360 = !DILocation(line: 349, column: 31, scope: !344)
!361 = !DILocation(line: 349, column: 59, scope: !344)
!362 = !DILocation(line: 349, column: 47, scope: !344)
!363 = !DILocation(line: 350, column: 23, scope: !344)
!364 = !DILocation(line: 350, column: 16, scope: !344)
!365 = !DILocation(line: 350, column: 18, scope: !344)
!366 = !{!347, !348, i64 0}
!367 = !DILocation(line: 350, column: 21, scope: !344)
!368 = !{!349, !349, i64 0}
!369 = !DILocation(line: 350, column: 3, scope: !344)
!370 = !DILocation(line: 352, column: 11, scope: !344)
!371 = !DILocation(line: 352, column: 3, scope: !344)
!372 = !DILocation(line: 353, column: 1, scope: !142)
!373 = !DILocation(line: 114, column: 15, scope: !210)
!374 = !DILocation(line: 116, column: 20, scope: !210)
!375 = !DILocation(line: 116, column: 12, scope: !210)
!376 = !DILocation(line: 116, column: 57, scope: !210)
!377 = !DILocation(line: 116, column: 45, scope: !210)
!378 = !DILocation(line: 116, column: 5, scope: !210)
!379 = !DILocation(line: 183, column: 24, scope: !216)
!380 = !DILocation(line: 185, column: 7, scope: !216)
!381 = !DILocation(line: 188, column: 15, scope: !382)
!382 = distinct !DILexicalBlock(scope: !383, file: !1, line: 187, column: 3)
!383 = distinct !DILexicalBlock(scope: !216, file: !1, line: 187, column: 3)
!384 = !DILocation(line: 189, column: 1, scope: !216)
!385 = !DILocation(line: 191, column: 22, scope: !230)
!386 = !DILocation(line: 191, column: 36, scope: !230)
!387 = !DILocation(line: 193, column: 7, scope: !230)
!388 = !DILocation(line: 195, column: 3, scope: !389)
!389 = distinct !DILexicalBlock(scope: !230, file: !1, line: 195, column: 3)
!390 = !DILocation(line: 196, column: 16, scope: !391)
!391 = distinct !DILexicalBlock(scope: !389, file: !1, line: 195, column: 3)
!392 = !{!393, !393, i64 0}
!393 = !{!"double", !349, i64 0}
!394 = !DILocation(line: 196, column: 5, scope: !391)
!395 = !DILocation(line: 196, column: 15, scope: !391)
!396 = !DILocation(line: 197, column: 1, scope: !230)
