; ModuleID = '../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/ns.c'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%struct.t_grid = type { i32, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32* }
%struct.t_ns_buf = type { i32, i32, [1024 x i32] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.t_interaction_function = type { i8*, i8*, i32, i32, i32, i64, i32, float (i32, i32*, %union.t_iparams*, [3 x float]*, [3 x float]*, %struct.t_forcerec*, %struct.t_graph*, [3 x float]*, float, float*, %struct.t_mdatoms*, i32, float*, float*, %struct.t_fcdata*)* }
%union.t_iparams = type { %struct.anon.2 }
%struct.anon.2 = type { float, float, float, float, float, float }

!188 = !DIEnumerator(name: "eNR_DUM3OUT", value: 127)
!189 = !DIEnumerator(name: "eNR_DUM4FD", value: 128)
!190 = !DIEnumerator(name: "eNRNB", value: 129)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !192, line: 49, size: 32, align: 32, elements: !193)
!192 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/idef.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!194 = !DIEnumerator(name: "F_BONDS", value: 0)
!195 = !DIEnumerator(name: "F_G96BONDS", value: 1)
!196 = !DIEnumerator(name: "F_MORSE", value: 2)
!197 = !DIEnumerator(name: "F_CUBICBONDS", value: 3)
!198 = !DIEnumerator(name: "F_CONNBONDS", value: 4)
!199 = !DIEnumerator(name: "F_HARMONIC", value: 5)
!200 = !DIEnumerator(name: "F_ANGLES", value: 6)
!201 = !DIEnumerator(name: "F_G96ANGLES", value: 7)
!202 = !DIEnumerator(name: "F_PDIHS", value: 8)
!203 = !DIEnumerator(name: "F_RBDIHS", value: 9)
!204 = !DIEnumerator(name: "F_IDIHS", value: 10)
!205 = !DIEnumerator(name: "F_LJ14", value: 11)
!206 = !DIEnumerator(name: "F_COUL14", value: 12)
!207 = !DIEnumerator(name: "F_LJ", value: 13)
!208 = !DIEnumerator(name: "F_BHAM", value: 14)
!209 = !DIEnumerator(name: "F_LJLR", value: 15)
!210 = !DIEnumerator(name: "F_DISPCORR", value: 16)
!211 = !DIEnumerator(name: "F_SR", value: 17)
!212 = !DIEnumerator(name: "F_LR", value: 18)
!213 = !DIEnumerator(name: "F_WPOL", value: 19)
!214 = !DIEnumerator(name: "F_POSRES", value: 20)
!215 = !DIEnumerator(name: "F_DISRES", value: 21)
!216 = !DIEnumerator(name: "F_DISRESVIOL", value: 22)
!217 = !DIEnumerator(name: "F_ORIRES", value: 23)
!218 = !DIEnumerator(name: "F_ORIRESDEV", value: 24)
!219 = !DIEnumerator(name: "F_ANGRES", value: 25)
!220 = !DIEnumerator(name: "F_ANGRESZ", value: 26)
!221 = !DIEnumerator(name: "F_SHAKE", value: 27)
!222 = !DIEnumerator(name: "F_SHAKENC", value: 28)
!223 = !DIEnumerator(name: "F_SETTLE", value: 29)
!224 = !DIEnumerator(name: "F_DUMMY2", value: 30)
!225 = !DIEnumerator(name: "F_DUMMY3", value: 31)
!226 = !DIEnumerator(name: "F_DUMMY3FD", value: 32)
!227 = !DIEnumerator(name: "F_DUMMY3FAD", value: 33)
!228 = !DIEnumerator(name: "F_DUMMY3OUT", value: 34)
!229 = !DIEnumerator(name: "F_DUMMY4FD", value: 35)
!230 = !DIEnumerator(name: "F_EQM", value: 36)
!231 = !DIEnumerator(name: "F_EPOT", value: 37)
!232 = !DIEnumerator(name: "F_EKIN", value: 38)
!233 = !DIEnumerator(name: "F_ETOT", value: 39)
!234 = !DIEnumerator(name: "F_TEMP", value: 40)
!235 = !DIEnumerator(name: "F_PRES", value: 41)
!236 = !DIEnumerator(name: "F_DVDL", value: 42)
!237 = !DIEnumerator(name: "F_DVDLKIN", value: 43)
!238 = !DIEnumerator(name: "F_NRE", value: 44)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 36, size: 32, align: 32, elements: !241)
!240 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/group.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249}
!242 = !DIEnumerator(name: "egCOUL", value: 0)
!243 = !DIEnumerator(name: "egLJ", value: 1)
!244 = !DIEnumerator(name: "egBHAM", value: 2)
!245 = !DIEnumerator(name: "egLR", value: 3)
!246 = !DIEnumerator(name: "egLJLR", value: 4)
!247 = !DIEnumerator(name: "egCOUL14", value: 5)
!248 = !DIEnumerator(name: "egLJ14", value: 6)
!249 = !DIEnumerator(name: "egNR", value: 7)
!250 = !{!251, !252, !253, !254, !257, !258}
!251 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!252 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "real", file: !255, line: 87, baseType: !256)
!255 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/simple.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!256 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "atom_id", file: !255, line: 73, baseType: !252)
!259 = !{!260, !327, !333, !466, !479, !486, !858, !866, !876, !883, !897, !902, !919, !924, !932, !935, !947, !958, !1066, !1077, !1095, !1149, !1163, !1170, !1175, !1202, !1208, !1214, !1255, !1260, !1268, !1295, !1313, !1329, !1357, !1377}
!260 = !DISubprogram(name: "__sputc", scope: !261, file: !261, line: 348, type: !262, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.__sFILE*)* @__sputc, variables: !324)
!261 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!262 = !DISubroutineType(types: !263)
!263 = !{!252, !252, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !261, line: 153, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !261, line: 122, size: 1216, align: 64, elements: !267)
!267 = !{!268, !271, !272, !273, !275, !276, !281, !282, !283, !287, !292, !302, !308, !309, !312, !313, !317, !321, !322, !323}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !266, file: !261, line: 123, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !266, file: !261, line: 124, baseType: !252, size: 32, align: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !266, file: !261, line: 125, baseType: !252, size: 32, align: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !266, file: !261, line: 126, baseType: !274, size: 16, align: 16, offset: 128)
!274 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !266, file: !261, line: 127, baseType: !274, size: 16, align: 16, offset: 144)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !266, file: !261, line: 128, baseType: !277, size: 128, align: 64, offset: 192)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !261, line: 88, size: 128, align: 64, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !277, file: !261, line: 89, baseType: !269, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !277, file: !261, line: 90, baseType: !252, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !266, file: !261, line: 129, baseType: !252, size: 32, align: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !266, file: !261, line: 132, baseType: !253, size: 64, align: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !266, file: !261, line: 133, baseType: !284, size: 64, align: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!252, !253}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !266, file: !261, line: 134, baseType: !288, size: 64, align: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!252, !253, !291, !252}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !266, file: !261, line: 135, baseType: !293, size: 64, align: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!296, !253, !296, !252}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !261, line: 77, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !298, line: 71, baseType: !299)
!298 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !300, line: 46, baseType: !301)
!300 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!301 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !266, file: !261, line: 136, baseType: !303, size: 64, align: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!252, !253, !306, !252}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !266, file: !261, line: 139, baseType: !277, size: 128, align: 64, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !266, file: !261, line: 140, baseType: !310, size: 64, align: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !261, line: 94, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !266, file: !261, line: 141, baseType: !252, size: 32, align: 32, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !266, file: !261, line: 144, baseType: !314, size: 24, align: 8, offset: 928)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 24, align: 8, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !266, file: !261, line: 145, baseType: !318, size: 8, align: 8, offset: 952)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 8, align: 8, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 1)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !266, file: !261, line: 148, baseType: !277, size: 128, align: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !266, file: !261, line: 151, baseType: !252, size: 32, align: 32, offset: 1088)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !266, file: !261, line: 152, baseType: !296, size: 64, align: 64, offset: 1152)
!324 = !{!325, !326}
!325 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_c", arg: 1, scope: !260, file: !261, line: 348, type: !252)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_p", arg: 2, scope: !260, file: !261, line: 348, type: !264)
!327 = !DISubprogram(name: "__sigbits", scope: !328, file: !328, line: 114, type: !329, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @__sigbits, variables: !331)
!328 = !DIFile(filename: "/usr/include/signal.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!329 = !DISubroutineType(types: !330)
!330 = !{!252, !252}
!331 = !{!332}
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__signo", arg: 1, scope: !327, file: !328, line: 114, type: !252)
!333 = !DISubprogram(name: "correct_box", scope: !1, file: !1, line: 240, type: !334, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: void ([3 x float]*, %struct.t_forcerec*, %struct.t_graph*)* @correct_box, variables: !453)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336, !338, !436}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 96, align: 32, elements: !315)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_forcerec", file: !4, line: 149, baseType: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 43, size: 22784, align: 64, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !393, !394, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ePBC", scope: !340, file: !4, line: 45, baseType: !252, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rlist", scope: !340, file: !4, line: 46, baseType: !254, size: 32, align: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rlistlong", scope: !340, file: !4, line: 46, baseType: !254, size: 32, align: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "zsquare", scope: !340, file: !4, line: 49, baseType: !254, size: 32, align: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !340, file: !4, line: 49, baseType: !254, size: 32, align: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon_r", scope: !340, file: !4, line: 50, baseType: !254, size: 32, align: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "epsfac", scope: !340, file: !4, line: 50, baseType: !254, size: 32, align: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bRF", scope: !340, file: !4, line: 53, baseType: !252, size: 32, align: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "kappa", scope: !340, file: !4, line: 54, baseType: !254, size: 32, align: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "k_rf", scope: !340, file: !4, line: 54, baseType: !254, size: 32, align: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "c_rf", scope: !340, file: !4, line: 54, baseType: !254, size: 32, align: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "avcsix", scope: !340, file: !4, line: 57, baseType: !254, size: 32, align: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fudgeQQ", scope: !340, file: !4, line: 60, baseType: !254, size: 32, align: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bcoultab", scope: !340, file: !4, line: 63, baseType: !252, size: 32, align: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bvdwtab", scope: !340, file: !4, line: 64, baseType: !252, size: 32, align: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rtab", scope: !340, file: !4, line: 65, baseType: !254, size: 32, align: 32, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ntab", scope: !340, file: !4, line: 66, baseType: !252, size: 32, align: 32, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale", scope: !340, file: !4, line: 67, baseType: !254, size: 32, align: 32, offset: 544)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "coultab", scope: !340, file: !4, line: 69, baseType: !361, size: 64, align: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtab", scope: !340, file: !4, line: 70, baseType: !361, size: 64, align: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdwtab", scope: !340, file: !4, line: 71, baseType: !361, size: 64, align: 64, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "coulvdw14tab", scope: !340, file: !4, line: 72, baseType: !361, size: 64, align: 64, offset: 768)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb_switch", scope: !340, file: !4, line: 75, baseType: !254, size: 32, align: 32, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rcoulomb", scope: !340, file: !4, line: 75, baseType: !254, size: 32, align: 32, offset: 864)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !340, file: !4, line: 76, baseType: !361, size: 64, align: 64, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw_switch", scope: !340, file: !4, line: 79, baseType: !254, size: 32, align: 32, offset: 960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rvdw", scope: !340, file: !4, line: 79, baseType: !254, size: 32, align: 32, offset: 992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bham_b_max", scope: !340, file: !4, line: 80, baseType: !254, size: 32, align: 32, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tabscale_exp", scope: !340, file: !4, line: 81, baseType: !254, size: 32, align: 32, offset: 1056)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "efep", scope: !340, file: !4, line: 84, baseType: !252, size: 32, align: 32, offset: 1088)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sc_alpha", scope: !340, file: !4, line: 85, baseType: !254, size: 32, align: 32, offset: 1120)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sc_sigma6", scope: !340, file: !4, line: 86, baseType: !254, size: 32, align: 32, offset: 1152)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bSepDVDL", scope: !340, file: !4, line: 87, baseType: !252, size: 32, align: 32, offset: 1184)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "eeltype", scope: !340, file: !4, line: 90, baseType: !252, size: 32, align: 32, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vdwtype", scope: !340, file: !4, line: 91, baseType: !252, size: 32, align: 32, offset: 1248)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cg0", scope: !340, file: !4, line: 92, baseType: !252, size: 32, align: 32, offset: 1280)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hcg", scope: !340, file: !4, line: 92, baseType: !252, size: 32, align: 32, offset: 1312)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ndelta", scope: !340, file: !4, line: 93, baseType: !252, size: 32, align: 32, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bSolvOpt", scope: !340, file: !4, line: 94, baseType: !252, size: 32, align: 32, offset: 1376)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOMol", scope: !340, file: !4, line: 95, baseType: !252, size: 32, align: 32, offset: 1408)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nMNOav", scope: !340, file: !4, line: 96, baseType: !337, size: 96, align: 32, offset: 1440)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nWatMol", scope: !340, file: !4, line: 97, baseType: !252, size: 32, align: 32, offset: 1536)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Dimension", scope: !340, file: !4, line: 98, baseType: !252, size: 32, align: 32, offset: 1568)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bGrid", scope: !340, file: !4, line: 99, baseType: !252, size: 32, align: 32, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bDomDecomp", scope: !340, file: !4, line: 99, baseType: !252, size: 32, align: 32, offset: 1632)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "solvent_type", scope: !340, file: !4, line: 100, baseType: !257, size: 64, align: 64, offset: 1664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mno_index", scope: !340, file: !4, line: 101, baseType: !257, size: 64, align: 64, offset: 1728)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cg_cm", scope: !340, file: !4, line: 102, baseType: !391, size: 64, align: 64, offset: 1792)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "rvec", file: !255, line: 101, baseType: !337)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "shift_vec", scope: !340, file: !4, line: 103, baseType: !391, size: 64, align: 64, offset: 1856)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_sr", scope: !340, file: !4, line: 108, baseType: !395, size: 9984, align: 64, offset: 1920)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 9984, align: 64, elements: !416)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nblist", file: !397, line: 60, baseType: !398)
!397 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nblist.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 36, size: 768, align: 64, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !409, !410, !411, !412, !413, !414, !415}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "il_code", scope: !398, file: !397, line: 37, baseType: !252, size: 32, align: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nri", scope: !398, file: !397, line: 39, baseType: !252, size: 32, align: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "maxnri", scope: !398, file: !397, line: 39, baseType: !252, size: 32, align: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "nrj", scope: !398, file: !397, line: 40, baseType: !252, size: 32, align: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "maxnrj", scope: !398, file: !397, line: 40, baseType: !252, size: 32, align: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !398, file: !397, line: 41, baseType: !252, size: 32, align: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "solvent", scope: !398, file: !397, line: 42, baseType: !252, size: 32, align: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "iinr", scope: !398, file: !397, line: 43, baseType: !408, size: 64, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !398, file: !397, line: 44, baseType: !257, size: 64, align: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !398, file: !397, line: 45, baseType: !257, size: 64, align: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "jindex", scope: !398, file: !397, line: 46, baseType: !257, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "jjnr", scope: !398, file: !397, line: 47, baseType: !408, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nsatoms", scope: !398, file: !397, line: 48, baseType: !257, size: 64, align: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !398, file: !397, line: 58, baseType: !252, size: 32, align: 32, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !398, file: !397, line: 58, baseType: !257, size: 64, align: 64, offset: 704)
!416 = !{!417}
!417 = !DISubrange(count: 13)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nlist_lr", scope: !340, file: !4, line: 109, baseType: !395, size: 9984, align: 64, offset: 11904)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bTwinRange", scope: !340, file: !4, line: 120, baseType: !252, size: 32, align: 32, offset: 21888)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nlr", scope: !340, file: !4, line: 121, baseType: !252, size: 32, align: 32, offset: 21920)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f_twin", scope: !340, file: !4, line: 122, baseType: !391, size: 64, align: 64, offset: 21952)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fshift_twin", scope: !340, file: !4, line: 123, baseType: !391, size: 64, align: 64, offset: 22016)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "f_pme", scope: !340, file: !4, line: 126, baseType: !391, size: 64, align: 64, offset: 22080)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bEwald", scope: !340, file: !4, line: 127, baseType: !252, size: 32, align: 32, offset: 22144)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ewaldcoeff", scope: !340, file: !4, line: 128, baseType: !254, size: 32, align: 32, offset: 22176)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fshift", scope: !340, file: !4, line: 131, baseType: !391, size: 64, align: 64, offset: 22208)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nmol", scope: !340, file: !4, line: 134, baseType: !252, size: 32, align: 32, offset: 22272)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mol_nr", scope: !340, file: !4, line: 135, baseType: !408, size: 64, align: 64, offset: 22336)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mol_epot", scope: !340, file: !4, line: 136, baseType: !361, size: 64, align: 64, offset: 22400)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nstcalc", scope: !340, file: !4, line: 137, baseType: !252, size: 32, align: 32, offset: 22464)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ntype", scope: !340, file: !4, line: 140, baseType: !252, size: 32, align: 32, offset: 22496)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "bBHAM", scope: !340, file: !4, line: 141, baseType: !252, size: 32, align: 32, offset: 22528)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nbfp", scope: !340, file: !4, line: 142, baseType: !361, size: 64, align: 64, offset: 22592)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "eg_excl", scope: !340, file: !4, line: 145, baseType: !257, size: 64, align: 64, offset: 22656)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fc_stepsize", scope: !340, file: !4, line: 148, baseType: !254, size: 32, align: 32, offset: 22720)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_graph", file: !438, line: 47, baseType: !439)
!438 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/graph.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!439 = !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 38, size: 384, align: 64, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !449}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "maxbond", scope: !439, file: !438, line: 39, baseType: !252, size: 32, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !439, file: !438, line: 40, baseType: !252, size: 32, align: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "nbound", scope: !439, file: !438, line: 41, baseType: !252, size: 32, align: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !439, file: !438, line: 42, baseType: !252, size: 32, align: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !439, file: !438, line: 43, baseType: !252, size: 32, align: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nedge", scope: !439, file: !438, line: 44, baseType: !257, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "edge", scope: !439, file: !438, line: 45, baseType: !448, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ishift", scope: !439, file: !438, line: 46, baseType: !450, size: 64, align: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ivec", file: !255, line: 107, baseType: !452)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 96, align: 32, elements: !315)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !333, file: !1, line: 240, type: !336)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !333, file: !1, line: 240, type: !338)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !333, file: !1, line: 240, type: !436)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zy", scope: !333, file: !1, line: 242, type: !252)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zx", scope: !333, file: !1, line: 242, type: !252)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yx", scope: !333, file: !1, line: 242, type: !252)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !333, file: !1, line: 242, type: !252)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !333, file: !1, line: 242, type: !252)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !333, file: !1, line: 242, type: !252)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !333, file: !1, line: 242, type: !252)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !333, file: !1, line: 242, type: !252)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !333, file: !1, line: 242, type: !252)
!466 = !DISubprogram(name: "init_neighbor_list", scope: !1, file: !1, line: 274, type: !467, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.__sFILE*, %struct.t_forcerec*, i32)* @init_neighbor_list, variables: !469)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !264, !338, !252}
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !466, file: !1, line: 274, type: !264)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !466, file: !1, line: 274, type: !338)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "homenr", arg: 3, scope: !466, file: !1, line: 274, type: !252)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxsr", scope: !466, file: !1, line: 281, type: !252)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxsr_mno", scope: !466, file: !1, line: 281, type: !252)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxsr_wat", scope: !466, file: !1, line: 281, type: !252)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlr", scope: !466, file: !1, line: 281, type: !252)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlr_mno", scope: !466, file: !1, line: 281, type: !252)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlr_wat", scope: !466, file: !1, line: 281, type: !252)
!479 = !DISubprogram(name: "calc_naaj", scope: !1, file: !1, line: 907, type: !480, isLocal: false, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @calc_naaj, variables: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!252, !252, !252}
!482 = !{!483, !484, !485}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "icg", arg: 1, scope: !479, file: !1, line: 907, type: !252)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cgtot", arg: 2, scope: !479, file: !1, line: 907, type: !252)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "naaj", scope: !479, file: !1, line: 909, type: !252)
!486 = !DISubprogram(name: "search_neighbours", scope: !1, file: !1, line: 1645, type: !487, isLocal: false, isDefinition: true, scopeLine: 1651, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.__sFILE*, %struct.t_forcerec*, [3 x float]*, [3 x float]*, %struct.t_topology*, %struct.t_groups*, %struct.t_commrec*, %struct.t_nsborder*, %struct.t_nrnb*, %struct.t_mdatoms*, float, float*)* @search_neighbours, variables: !823)
!487 = !DISubroutineType(types: !488)
!488 = !{!252, !264, !338, !391, !336, !489, !714, !758, !769, !785, !794, !254, !361}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_topology", file: !491, line: 42, baseType: !492)
!491 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/topology.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!492 = !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 36, size: 402112, align: 64, elements: !493)
!493 = !{!494, !496, !633, !697, !699}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !491, line: 37, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "idef", scope: !492, file: !491, line: 38, baseType: !497, size: 366336, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_idef", file: !192, line: 188, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 179, size: 366336, align: 64, elements: !499)
!499 = !{!500, !501, !502, !503, !506, !618}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ntypes", scope: !498, file: !192, line: 181, baseType: !252, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !498, file: !192, line: 182, baseType: !252, size: 32, align: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "atnr", scope: !498, file: !192, line: 183, baseType: !252, size: 32, align: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !498, file: !192, line: 184, baseType: !504, size: 64, align: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_functype", file: !192, line: 133, baseType: !252)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "iparams", scope: !498, file: !192, line: 185, baseType: !507, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iparams", file: !192, line: 131, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_union_type, file: !192, line: 97, size: 192, align: 32, elements: !510)
!510 = !{!511, !517, !524, !530, !539, !544, !551, !559, !564, !569, !575, !580, !587, !596, !605, !614}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bham", scope: !509, file: !192, line: 105, baseType: !512, size: 96, align: 32)
!512 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 105, size: 96, align: 32, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !512, file: !192, line: 105, baseType: !254, size: 32, align: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !512, file: !192, line: 105, baseType: !254, size: 32, align: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !512, file: !192, line: 105, baseType: !254, size: 32, align: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "harmonic", scope: !509, file: !192, line: 106, baseType: !518, size: 128, align: 32)
!518 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 106, size: 128, align: 32, elements: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rA", scope: !518, file: !192, line: 106, baseType: !254, size: 32, align: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "krA", scope: !518, file: !192, line: 106, baseType: !254, size: 32, align: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rB", scope: !518, file: !192, line: 106, baseType: !254, size: 32, align: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "krB", scope: !518, file: !192, line: 106, baseType: !254, size: 32, align: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cubic", scope: !509, file: !192, line: 108, baseType: !525, size: 96, align: 32)
!525 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 108, size: 96, align: 32, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !525, file: !192, line: 108, baseType: !254, size: 32, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !525, file: !192, line: 108, baseType: !254, size: 32, align: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "kcub", scope: !525, file: !192, line: 108, baseType: !254, size: 32, align: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "wpol", scope: !509, file: !192, line: 110, baseType: !531, size: 192, align: 32)
!531 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 110, size: 192, align: 32, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "kx", scope: !531, file: !192, line: 110, baseType: !254, size: 32, align: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ky", scope: !531, file: !192, line: 110, baseType: !254, size: 32, align: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "kz", scope: !531, file: !192, line: 110, baseType: !254, size: 32, align: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rOH", scope: !531, file: !192, line: 110, baseType: !254, size: 32, align: 32, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rHH", scope: !531, file: !192, line: 110, baseType: !254, size: 32, align: 32, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rOD", scope: !531, file: !192, line: 110, baseType: !254, size: 32, align: 32, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lj", scope: !509, file: !192, line: 111, baseType: !540, size: 64, align: 32)
!540 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 111, size: 64, align: 32, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "c6", scope: !540, file: !192, line: 111, baseType: !254, size: 32, align: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "c12", scope: !540, file: !192, line: 111, baseType: !254, size: 32, align: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lj14", scope: !509, file: !192, line: 112, baseType: !545, size: 128, align: 32)
!545 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 112, size: 128, align: 32, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "c6A", scope: !545, file: !192, line: 112, baseType: !254, size: 32, align: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "c12A", scope: !545, file: !192, line: 112, baseType: !254, size: 32, align: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "c6B", scope: !545, file: !192, line: 112, baseType: !254, size: 32, align: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "c12B", scope: !545, file: !192, line: 112, baseType: !254, size: 32, align: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pdihs", scope: !509, file: !192, line: 117, baseType: !552, size: 160, align: 32)
!552 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 117, size: 160, align: 32, elements: !553)
!553 = !{!554, !555, !556, !557, !558}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "phiA", scope: !552, file: !192, line: 117, baseType: !254, size: 32, align: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cpA", scope: !552, file: !192, line: 117, baseType: !254, size: 32, align: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !552, file: !192, line: 117, baseType: !252, size: 32, align: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "phiB", scope: !552, file: !192, line: 117, baseType: !254, size: 32, align: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cpB", scope: !552, file: !192, line: 117, baseType: !254, size: 32, align: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "shake", scope: !509, file: !192, line: 118, baseType: !560, size: 64, align: 32)
!560 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 118, size: 64, align: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dA", scope: !560, file: !192, line: 118, baseType: !254, size: 32, align: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dB", scope: !560, file: !192, line: 118, baseType: !254, size: 32, align: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "settle", scope: !509, file: !192, line: 123, baseType: !565, size: 64, align: 32)
!565 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 123, size: 64, align: 32, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "doh", scope: !565, file: !192, line: 123, baseType: !254, size: 32, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dhh", scope: !565, file: !192, line: 123, baseType: !254, size: 32, align: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "morse", scope: !509, file: !192, line: 124, baseType: !570, size: 96, align: 32)
!570 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 124, size: 96, align: 32, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b0", scope: !570, file: !192, line: 124, baseType: !254, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !570, file: !192, line: 124, baseType: !254, size: 32, align: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !570, file: !192, line: 124, baseType: !254, size: 32, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "posres", scope: !509, file: !192, line: 125, baseType: !576, size: 192, align: 32)
!576 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 125, size: 192, align: 32, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pos0", scope: !576, file: !192, line: 125, baseType: !337, size: 96, align: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !576, file: !192, line: 125, baseType: !337, size: 96, align: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rbdihs", scope: !509, file: !192, line: 126, baseType: !581, size: 192, align: 32)
!581 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 126, size: 192, align: 32, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rbc", scope: !581, file: !192, line: 126, baseType: !584, size: 192, align: 32)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 192, align: 32, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 6)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !509, file: !192, line: 127, baseType: !588, size: 192, align: 32)
!588 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 127, size: 192, align: 32, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !588, file: !192, line: 127, baseType: !254, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !588, file: !192, line: 127, baseType: !254, size: 32, align: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !588, file: !192, line: 127, baseType: !254, size: 32, align: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !588, file: !192, line: 127, baseType: !254, size: 32, align: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !588, file: !192, line: 127, baseType: !254, size: 32, align: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !588, file: !192, line: 127, baseType: !254, size: 32, align: 32, offset: 160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "disres", scope: !509, file: !192, line: 128, baseType: !597, size: 192, align: 32)
!597 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 128, size: 192, align: 32, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !597, file: !192, line: 128, baseType: !254, size: 32, align: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "up1", scope: !597, file: !192, line: 128, baseType: !254, size: 32, align: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "up2", scope: !597, file: !192, line: 128, baseType: !254, size: 32, align: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !597, file: !192, line: 128, baseType: !254, size: 32, align: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !192, line: 128, baseType: !252, size: 32, align: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !597, file: !192, line: 128, baseType: !252, size: 32, align: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "orires", scope: !509, file: !192, line: 129, baseType: !606, size: 192, align: 32)
!606 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 129, size: 192, align: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ex", scope: !606, file: !192, line: 129, baseType: !252, size: 32, align: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pow", scope: !606, file: !192, line: 129, baseType: !252, size: 32, align: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !606, file: !192, line: 129, baseType: !252, size: 32, align: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !606, file: !192, line: 129, baseType: !254, size: 32, align: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "obs", scope: !606, file: !192, line: 129, baseType: !254, size: 32, align: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "kfac", scope: !606, file: !192, line: 129, baseType: !254, size: 32, align: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !509, file: !192, line: 130, baseType: !615, size: 192, align: 32)
!615 = !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !192, line: 130, size: 192, align: 32, elements: !616)
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !615, file: !192, line: 130, baseType: !584, size: 192, align: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !498, file: !192, line: 187, baseType: !619, size: 366080, align: 64, offset: 256)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 366080, align: 64, elements: !631)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_ilist", file: !192, line: 140, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 135, size: 8320, align: 64, elements: !622)
!622 = !{!623, !624, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !621, file: !192, line: 137, baseType: !252, size: 32, align: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !621, file: !192, line: 138, baseType: !625, size: 8192, align: 32, offset: 32)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 8192, align: 32, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "iatoms", scope: !621, file: !192, line: 139, baseType: !629, size: 64, align: 64, offset: 8256)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_iatom", file: !192, line: 45, baseType: !258)
!631 = !{!632}
!632 = !DISubrange(count: 44)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "atoms", scope: !492, file: !491, line: 39, baseType: !634, size: 10240, align: 64, offset: 366400)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atoms", file: !40, line: 94, baseType: !635)
!635 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 75, size: 10240, align: 64, elements: !636)
!636 = !{!637, !638, !657, !659, !660, !661, !662, !663, !664, !665, !675, !682}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !635, file: !40, line: 76, baseType: !252, size: 32, align: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !635, file: !40, line: 77, baseType: !639, size: 64, align: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_atom", file: !40, line: 57, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 48, size: 320, align: 32, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !649, !650, !651, !652, !656}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !641, file: !40, line: 49, baseType: !254, size: 32, align: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !641, file: !40, line: 49, baseType: !254, size: 32, align: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mB", scope: !641, file: !40, line: 50, baseType: !254, size: 32, align: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "qB", scope: !641, file: !40, line: 50, baseType: !254, size: 32, align: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !40, line: 51, baseType: !648, size: 16, align: 16, offset: 128)
!648 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !641, file: !40, line: 52, baseType: !648, size: 16, align: 16, offset: 144)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !641, file: !40, line: 53, baseType: !252, size: 32, align: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !641, file: !40, line: 54, baseType: !252, size: 32, align: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "grpnr", scope: !641, file: !40, line: 55, baseType: !653, size: 72, align: 8, offset: 224)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 72, align: 8, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 9)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !641, file: !40, line: 56, baseType: !270, size: 8, align: 8, offset: 296)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "atomname", scope: !635, file: !40, line: 80, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "atomtype", scope: !635, file: !40, line: 82, baseType: !658, size: 64, align: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "atomtypeB", scope: !635, file: !40, line: 84, baseType: !658, size: 64, align: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nres", scope: !635, file: !40, line: 86, baseType: !252, size: 32, align: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "resname", scope: !635, file: !40, line: 87, baseType: !658, size: 64, align: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ngrpname", scope: !635, file: !40, line: 89, baseType: !252, size: 32, align: 32, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "grpname", scope: !635, file: !40, line: 90, baseType: !658, size: 64, align: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !635, file: !40, line: 91, baseType: !666, size: 8448, align: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_block", file: !667, line: 52, baseType: !668)
!667 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/block.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!668 = !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 36, size: 8448, align: 64, elements: !669)
!669 = !{!670, !671, !672, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "multinr", scope: !668, file: !667, line: 37, baseType: !625, size: 8192, align: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !668, file: !667, line: 43, baseType: !252, size: 32, align: 32, offset: 8192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !668, file: !667, line: 44, baseType: !408, size: 64, align: 64, offset: 8256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !668, file: !667, line: 45, baseType: !252, size: 32, align: 32, offset: 8320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !668, file: !667, line: 46, baseType: !408, size: 64, align: 64, offset: 8384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "grps", scope: !635, file: !40, line: 92, baseType: !676, size: 1152, align: 64, offset: 9024)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 1152, align: 64, elements: !654)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grps", file: !40, line: 73, baseType: !678)
!678 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 70, size: 128, align: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !678, file: !40, line: 71, baseType: !252, size: 32, align: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nm_ind", scope: !678, file: !40, line: 72, baseType: !257, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pdbinfo", scope: !635, file: !40, line: 93, baseType: !683, size: 64, align: 64, offset: 10176)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_pdbinfo", file: !40, line: 68, baseType: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 59, size: 416, align: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !692, !693, !694, !695}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !685, file: !40, line: 60, baseType: !252, size: 32, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "atomnr", scope: !685, file: !40, line: 61, baseType: !252, size: 32, align: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "altloc", scope: !685, file: !40, line: 62, baseType: !251, size: 8, align: 8, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pdbresnr", scope: !685, file: !40, line: 63, baseType: !691, size: 48, align: 8, offset: 72)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 48, align: 8, elements: !585)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "occup", scope: !685, file: !40, line: 64, baseType: !254, size: 32, align: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !685, file: !40, line: 65, baseType: !254, size: 32, align: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bAnisotropic", scope: !685, file: !40, line: 66, baseType: !252, size: 32, align: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "uij", scope: !685, file: !40, line: 67, baseType: !696, size: 192, align: 32, offset: 224)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 192, align: 32, elements: !585)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !492, file: !491, line: 40, baseType: !698, size: 25344, align: 64, offset: 376640)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 25344, align: 64, elements: !315)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !492, file: !491, line: 41, baseType: !700, size: 128, align: 64, offset: 401984)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symtab", file: !701, line: 46, baseType: !702)
!701 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/symtab.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!702 = !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 42, size: 128, align: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !702, file: !701, line: 44, baseType: !252, size: 32, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "symbuf", scope: !702, file: !701, line: 45, baseType: !706, size: 64, align: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_symbuf", file: !701, line: 40, baseType: !708)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "symbuf", file: !701, line: 36, size: 192, align: 64, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !708, file: !701, line: 37, baseType: !252, size: 32, align: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !708, file: !701, line: 38, baseType: !495, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !701, line: 39, baseType: !713, size: 64, align: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_groups", file: !240, line: 72, baseType: !716)
!716 = !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 67, size: 768, align: 64, elements: !717)
!717 = !{!718, !727, !740, !751}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "estat", scope: !716, file: !240, line: 68, baseType: !719, size: 512, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_ener", file: !240, line: 50, baseType: !720)
!720 = !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 46, size: 512, align: 64, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nn", scope: !720, file: !240, line: 47, baseType: !252, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !720, file: !240, line: 48, baseType: !724, size: 448, align: 64, offset: 64)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 448, align: 64, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 7)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tcstat", scope: !716, file: !240, line: 69, baseType: !728, size: 64, align: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_tcstat", file: !240, line: 44, baseType: !730)
!730 = !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 38, size: 416, align: 32, elements: !731)
!731 = !{!732, !733, !734, !738, !739}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !730, file: !240, line: 39, baseType: !254, size: 32, align: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !730, file: !240, line: 40, baseType: !254, size: 32, align: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ekin", scope: !730, file: !240, line: 41, baseType: !735, size: 288, align: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "tensor", file: !255, line: 105, baseType: !736)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 288, align: 32, elements: !737)
!737 = !{!316, !316}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !730, file: !240, line: 42, baseType: !254, size: 32, align: 32, offset: 352)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !730, file: !240, line: 43, baseType: !254, size: 32, align: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "grpstat", scope: !716, file: !240, line: 70, baseType: !741, size: 64, align: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grp_acc", file: !240, line: 59, baseType: !743)
!743 = !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 52, size: 448, align: 64, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nat", scope: !743, file: !240, line: 53, baseType: !252, size: 32, align: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "aid", scope: !743, file: !240, line: 54, baseType: !408, size: 64, align: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !743, file: !240, line: 55, baseType: !254, size: 32, align: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !743, file: !240, line: 56, baseType: !392, size: 96, align: 32, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "uold", scope: !743, file: !240, line: 57, baseType: !392, size: 96, align: 32, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ut", scope: !743, file: !240, line: 58, baseType: !392, size: 96, align: 32, offset: 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cosacc", scope: !716, file: !240, line: 71, baseType: !752, size: 96, align: 32, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cos_acc", file: !240, line: 65, baseType: !753)
!753 = !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 61, size: 96, align: 32, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cos_accel", scope: !753, file: !240, line: 62, baseType: !254, size: 32, align: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mvcos", scope: !753, file: !240, line: 63, baseType: !254, size: 32, align: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "vcos", scope: !753, file: !240, line: 64, baseType: !254, size: 32, align: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_commrec", file: !760, line: 40, baseType: !761)
!760 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/commrec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!761 = !DICompositeType(tag: DW_TAG_structure_type, file: !760, line: 36, size: 192, align: 32, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !761, file: !760, line: 37, baseType: !252, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !761, file: !760, line: 37, baseType: !252, size: 32, align: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !761, file: !760, line: 38, baseType: !252, size: 32, align: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !761, file: !760, line: 38, baseType: !252, size: 32, align: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !761, file: !760, line: 39, baseType: !252, size: 32, align: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "nthreads", scope: !761, file: !760, line: 39, baseType: !252, size: 32, align: 32, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nsborder", file: !771, line: 59, baseType: !772)
!771 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsborder.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!772 = !DICompositeType(tag: DW_TAG_structure_type, file: !771, line: 36, size: 32992, align: 32, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "nodeid", scope: !772, file: !771, line: 37, baseType: !252, size: 32, align: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nnodes", scope: !772, file: !771, line: 38, baseType: !252, size: 32, align: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cgtotal", scope: !772, file: !771, line: 39, baseType: !252, size: 32, align: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "natoms", scope: !772, file: !771, line: 40, baseType: !252, size: 32, align: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nstDlb", scope: !772, file: !771, line: 41, baseType: !252, size: 32, align: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !772, file: !771, line: 43, baseType: !252, size: 32, align: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bshift", scope: !772, file: !771, line: 43, baseType: !252, size: 32, align: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "homenr", scope: !772, file: !771, line: 50, baseType: !625, size: 8192, align: 32, offset: 224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !772, file: !771, line: 51, baseType: !625, size: 8192, align: 32, offset: 8416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cgload", scope: !772, file: !771, line: 52, baseType: !625, size: 8192, align: 32, offset: 16608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "workload", scope: !772, file: !771, line: 55, baseType: !625, size: 8192, align: 32, offset: 24800)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_nrnb", file: !58, line: 95, baseType: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 93, size: 8256, align: 64, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !787, file: !58, line: 94, baseType: !790, size: 8256, align: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 8256, align: 64, elements: !792)
!791 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!792 = !{!793}
!793 = !DISubrange(count: 129)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_mdatoms", file: !796, line: 51, baseType: !797)
!796 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/mdatom.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!797 = !DICompositeType(tag: DW_TAG_structure_type, file: !796, line: 40, size: 1408, align: 64, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tmass", scope: !797, file: !796, line: 41, baseType: !254, size: 32, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !797, file: !796, line: 42, baseType: !252, size: 32, align: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "massA", scope: !797, file: !796, line: 43, baseType: !361, size: 64, align: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "massB", scope: !797, file: !796, line: 43, baseType: !361, size: 64, align: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "massT", scope: !797, file: !796, line: 43, baseType: !361, size: 64, align: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "invmass", scope: !797, file: !796, line: 43, baseType: !361, size: 64, align: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "chargeA", scope: !797, file: !796, line: 44, baseType: !361, size: 64, align: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chargeB", scope: !797, file: !796, line: 44, baseType: !361, size: 64, align: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "chargeT", scope: !797, file: !796, line: 44, baseType: !361, size: 64, align: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "bPerturbed", scope: !797, file: !796, line: 45, baseType: !257, size: 64, align: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "resnr", scope: !797, file: !796, line: 46, baseType: !257, size: 64, align: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "typeA", scope: !797, file: !796, line: 47, baseType: !257, size: 64, align: 64, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "typeB", scope: !797, file: !796, line: 47, baseType: !257, size: 64, align: 64, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !797, file: !796, line: 48, baseType: !813, size: 64, align: 64, offset: 768)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cTC", scope: !797, file: !796, line: 49, baseType: !813, size: 64, align: 64, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cENER", scope: !797, file: !796, line: 49, baseType: !813, size: 64, align: 64, offset: 896)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cACC", scope: !797, file: !796, line: 49, baseType: !813, size: 64, align: 64, offset: 960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cFREEZE", scope: !797, file: !796, line: 49, baseType: !813, size: 64, align: 64, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cXTC", scope: !797, file: !796, line: 49, baseType: !813, size: 64, align: 64, offset: 1088)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cVCM", scope: !797, file: !796, line: 49, baseType: !813, size: 64, align: 64, offset: 1152)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cU1", scope: !797, file: !796, line: 50, baseType: !813, size: 64, align: 64, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cU2", scope: !797, file: !796, line: 50, baseType: !813, size: 64, align: 64, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cORF", scope: !797, file: !796, line: 50, baseType: !813, size: 64, align: 64, offset: 1344)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !852, !853, !854, !857}
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !486, file: !1, line: 1645, type: !264)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 2, scope: !486, file: !1, line: 1645, type: !338)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 3, scope: !486, file: !1, line: 1646, type: !391)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 4, scope: !486, file: !1, line: 1646, type: !336)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 5, scope: !486, file: !1, line: 1647, type: !489)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 6, scope: !486, file: !1, line: 1647, type: !714)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 7, scope: !486, file: !1, line: 1648, type: !758)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsb", arg: 8, scope: !486, file: !1, line: 1648, type: !769)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 9, scope: !486, file: !1, line: 1649, type: !785)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 10, scope: !486, file: !1, line: 1649, type: !794)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 11, scope: !486, file: !1, line: 1650, type: !254)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvdlambda", arg: 12, scope: !486, file: !1, line: 1650, type: !361)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgs", scope: !486, file: !1, line: 1660, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "box_size", scope: !486, file: !1, line: 1661, type: !392)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !486, file: !1, line: 1662, type: !252)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !486, file: !1, line: 1662, type: !252)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !486, file: !1, line: 1662, type: !252)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngid", scope: !486, file: !1, line: 1662, type: !252)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_size", scope: !486, file: !1, line: 1663, type: !254)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allexcl", scope: !486, file: !1, line: 1664, type: !252)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsearch", scope: !486, file: !1, line: 1665, type: !252)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bGrid", scope: !486, file: !1, line: 1666, type: !252)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !486, file: !1, line: 1667, type: !291)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i_eg_excl", scope: !486, file: !1, line: 1668, type: !257)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icg", scope: !850, file: !1, line: 1691, type: !252)
!850 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1690, column: 15)
!851 = distinct !DILexicalBlock(scope: !486, file: !1, line: 1690, column: 7)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nr_in_cg", scope: !850, file: !1, line: 1691, type: !252)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxcg", scope: !850, file: !1, line: 1691, type: !252)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !855, file: !1, line: 1804, type: !252)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 1801, column: 14)
!856 = distinct !DILexicalBlock(scope: !486, file: !1, line: 1801, column: 7)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !855, file: !1, line: 1805, type: !252)
!858 = !DISubprogram(name: "correct_box_elem", scope: !1, file: !1, line: 207, type: !859, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: i32 ([3 x float]*, i32, i32)* @correct_box_elem, variables: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!252, !336, !252, !252}
!861 = !{!862, !863, !864, !865}
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 1, scope: !858, file: !1, line: 207, type: !336)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !858, file: !1, line: 207, type: !252)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 3, scope: !858, file: !1, line: 207, type: !252)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !858, file: !1, line: 209, type: !252)
!866 = !DISubprogram(name: "rvec_dec", scope: !867, file: !867, line: 257, type: !868, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, variables: !870)
!867 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/vec.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!868 = !DISubroutineType(types: !869)
!869 = !{null, !361, !361}
!870 = !{!871, !872, !873, !874, !875}
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !866, file: !867, line: 257, type: !361)
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !866, file: !867, line: 257, type: !361)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !866, file: !867, line: 259, type: !254)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !866, file: !867, line: 259, type: !254)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !866, file: !867, line: 259, type: !254)
!876 = !DISubprogram(name: "rvec_inc", scope: !867, file: !867, line: 231, type: !868, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, variables: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !876, file: !867, line: 231, type: !361)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !876, file: !867, line: 231, type: !361)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !876, file: !867, line: 233, type: !254)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !876, file: !867, line: 233, type: !254)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !876, file: !867, line: 233, type: !254)
!883 = !DISubprogram(name: "init_nblist", scope: !1, file: !1, line: 105, type: !884, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nblist*, %struct.t_nblist*, i32, i32, i32, i32)* @init_nblist, variables: !887)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !886, !886, !252, !252, !252, !252}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896}
!888 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nl_sr", arg: 1, scope: !883, file: !1, line: 105, type: !886)
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nl_lr", arg: 2, scope: !883, file: !1, line: 105, type: !886)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxsr", arg: 3, scope: !883, file: !1, line: 106, type: !252)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxlr", arg: 4, scope: !883, file: !1, line: 106, type: !252)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "solvent", arg: 5, scope: !883, file: !1, line: 106, type: !252)
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "il_code", arg: 6, scope: !883, file: !1, line: 106, type: !252)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nl", scope: !883, file: !1, line: 108, type: !886)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "homenr", scope: !883, file: !1, line: 109, type: !252)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !883, file: !1, line: 110, type: !252)
!897 = !DISubprogram(name: "reallocate_nblist", scope: !1, file: !1, line: 92, type: !898, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.t_nblist*)* @reallocate_nblist, variables: !900)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !886}
!900 = !{!901}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nl", arg: 1, scope: !897, file: !1, line: 92, type: !886)
!902 = !DISubprogram(name: "nbf_index", scope: !1, file: !1, line: 149, type: !903, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.t_forcerec*, i32, i32, i32, i32)* @nbf_index, variables: !906)
!903 = !DISubroutineType(types: !904)
!904 = !{!905, !338, !252, !252, !252, !252}
!905 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!906 = !{!907, !908, !909, !910, !911, !912, !916, !917, !918}
!907 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 1, scope: !902, file: !1, line: 149, type: !338)
!908 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bvdw", arg: 2, scope: !902, file: !1, line: 149, type: !252)
!909 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bcoul", arg: 3, scope: !902, file: !1, line: 149, type: !252)
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bFree", arg: 4, scope: !902, file: !1, line: 149, type: !252)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "solopt", arg: 5, scope: !902, file: !1, line: 149, type: !252)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inloop", scope: !902, file: !1, line: 156, type: !913)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 640, align: 32, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 20)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !902, file: !1, line: 163, type: !905)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icoul", scope: !902, file: !1, line: 163, type: !905)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ivdw", scope: !902, file: !1, line: 163, type: !905)
!919 = !DISubprogram(name: "norm2", scope: !867, file: !867, line: 353, type: !920, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: true, variables: !922)
!920 = !DISubroutineType(types: !921)
!921 = !{!254, !361}
!922 = !{!923}
!923 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !919, file: !867, line: 353, type: !361)
!924 = !DISubprogram(name: "reset_neighbor_list", scope: !1, file: !1, line: 342, type: !925, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, variables: !927)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !338, !252, !252}
!927 = !{!928, !929, !930, !931}
!928 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 1, scope: !924, file: !1, line: 342, type: !338)
!929 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bLR", arg: 2, scope: !924, file: !1, line: 342, type: !252)
!930 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eNL", arg: 3, scope: !924, file: !1, line: 342, type: !252)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !924, file: !1, line: 344, type: !252)
!932 = !DISubprogram(name: "reset_nblist", scope: !1, file: !1, line: 328, type: !898, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, variables: !933)
!933 = !{!934}
!934 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nl", arg: 1, scope: !932, file: !1, line: 328, type: !886)
!935 = !DISubprogram(name: "sort_charge_groups", scope: !1, file: !1, line: 1622, type: !936, isLocal: true, isDefinition: true, scopeLine: 1624, flags: DIFlagPrototyped, isOptimized: true, variables: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !758, !257, !257, !391, !252}
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946}
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 1, scope: !935, file: !1, line: 1622, type: !758)
!940 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 2, scope: !935, file: !1, line: 1622, type: !257)
!941 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slab_index", arg: 3, scope: !935, file: !1, line: 1622, type: !257)
!942 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_cm", arg: 4, scope: !935, file: !1, line: 1623, type: !391)
!943 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Dimension", arg: 5, scope: !935, file: !1, line: 1623, type: !252)
!944 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !935, file: !1, line: 1625, type: !252)
!945 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrcg", scope: !935, file: !1, line: 1625, type: !252)
!946 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgind", scope: !935, file: !1, line: 1625, type: !252)
!947 = !DISubprogram(name: "rv_comp", scope: !1, file: !1, line: 1607, type: !948, isLocal: true, isDefinition: true, scopeLine: 1608, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @rv_comp, variables: !952)
!948 = !DISubroutineType(types: !949)
!949 = !{!252, !950, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!952 = !{!953, !954, !955, !956, !957}
!953 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !947, file: !1, line: 1607, type: !950)
!954 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !947, file: !1, line: 1607, type: !950)
!955 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ia", scope: !947, file: !1, line: 1609, type: !252)
!956 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ib", scope: !947, file: !1, line: 1610, type: !252)
!957 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !947, file: !1, line: 1611, type: !254)
!958 = !DISubprogram(name: "ns5_core", scope: !1, file: !1, line: 1284, type: !959, isLocal: true, isDefinition: true, scopeLine: 1291, flags: DIFlagPrototyped, isOptimized: true, variables: !981)
!959 = !DISubroutineType(types: !960)
!960 = !{!252, !264, !758, !338, !257, !336, !361, !252, !489, !714, !961, !391, !978, !257, !785, !794, !254, !361, !257}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_grid", file: !963, line: 49, baseType: !964)
!963 = !DIFile(filename: "../../SPEC_CPU2006v1.1/benchspec/CPU2006/435.gromacs/src/types/nsgrid.h", directory: "/Users/vaspol/Documents/classes/EECS583/ClassProject/source_extraction_scripts")
!964 = !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 36, size: 512, align: 64, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !964, file: !963, line: 37, baseType: !252, size: 32, align: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nrx", scope: !964, file: !963, line: 38, baseType: !252, size: 32, align: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "nry", scope: !964, file: !963, line: 38, baseType: !252, size: 32, align: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nrz", scope: !964, file: !963, line: 38, baseType: !252, size: 32, align: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ncells", scope: !964, file: !963, line: 39, baseType: !252, size: 32, align: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "maxcells", scope: !964, file: !963, line: 40, baseType: !252, size: 32, align: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !964, file: !963, line: 41, baseType: !252, size: 32, align: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gmax", scope: !964, file: !963, line: 42, baseType: !252, size: 32, align: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "cell_index", scope: !964, file: !963, line: 43, baseType: !257, size: 64, align: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !964, file: !963, line: 44, baseType: !257, size: 64, align: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nra", scope: !964, file: !963, line: 47, baseType: !257, size: 64, align: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !964, file: !963, line: 48, baseType: !257, size: 64, align: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_excl", file: !1, line: 65, baseType: !980)
!980 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!982 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "log", arg: 1, scope: !958, file: !1, line: 1284, type: !264)
!983 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cr", arg: 2, scope: !958, file: !1, line: 1284, type: !758)
!984 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fr", arg: 3, scope: !958, file: !1, line: 1284, type: !338)
!985 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cg_index", arg: 4, scope: !958, file: !1, line: 1284, type: !257)
!986 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box", arg: 5, scope: !958, file: !1, line: 1285, type: !336)
!987 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "box_size", arg: 6, scope: !958, file: !1, line: 1285, type: !361)
!988 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ngid", arg: 7, scope: !958, file: !1, line: 1285, type: !252)
!989 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "top", arg: 8, scope: !958, file: !1, line: 1286, type: !489)
!990 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grps", arg: 9, scope: !958, file: !1, line: 1286, type: !714)
!991 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "grid", arg: 10, scope: !958, file: !1, line: 1287, type: !961)
!992 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 11, scope: !958, file: !1, line: 1287, type: !391)
!993 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bexcl", arg: 12, scope: !958, file: !1, line: 1287, type: !978)
!994 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bExcludeAlleg", arg: 13, scope: !958, file: !1, line: 1287, type: !257)
!995 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nrnb", arg: 14, scope: !958, file: !1, line: 1288, type: !785)
!996 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md", arg: 15, scope: !958, file: !1, line: 1288, type: !794)
!997 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lambda", arg: 16, scope: !958, file: !1, line: 1289, type: !254)
!998 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dvdlambda", arg: 17, scope: !958, file: !1, line: 1289, type: !361)
!999 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bHaveLJ", arg: 18, scope: !958, file: !1, line: 1290, type: !257)
!1000 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgs", scope: !958, file: !1, line: 1296, type: !837)
!1001 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gid", scope: !958, file: !1, line: 1297, type: !813)
!1002 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tx", scope: !958, file: !1, line: 1299, type: !252)
!1003 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ty", scope: !958, file: !1, line: 1299, type: !252)
!1004 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tz", scope: !958, file: !1, line: 1299, type: !252)
!1005 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !958, file: !1, line: 1299, type: !252)
!1006 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !958, file: !1, line: 1299, type: !252)
!1007 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dz", scope: !958, file: !1, line: 1299, type: !252)
!1008 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cj", scope: !958, file: !1, line: 1299, type: !252)
!1009 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx0", scope: !958, file: !1, line: 1303, type: !252)
!1010 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx1", scope: !958, file: !1, line: 1303, type: !252)
!1011 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy0", scope: !958, file: !1, line: 1303, type: !252)
!1012 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy1", scope: !958, file: !1, line: 1303, type: !252)
!1013 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dz0", scope: !958, file: !1, line: 1303, type: !252)
!1014 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dz1", scope: !958, file: !1, line: 1303, type: !252)
!1015 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Nx", scope: !958, file: !1, line: 1304, type: !252)
!1016 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Ny", scope: !958, file: !1, line: 1304, type: !252)
!1017 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Nz", scope: !958, file: !1, line: 1304, type: !252)
!1018 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !958, file: !1, line: 1304, type: !252)
!1019 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !958, file: !1, line: 1304, type: !252)
!1020 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nrj", scope: !958, file: !1, line: 1304, type: !252)
!1021 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nns", scope: !958, file: !1, line: 1304, type: !252)
!1022 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nn", scope: !958, file: !1, line: 1304, type: !252)
!1023 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gridx", scope: !958, file: !1, line: 1305, type: !254)
!1024 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gridy", scope: !958, file: !1, line: 1305, type: !254)
!1025 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gridz", scope: !958, file: !1, line: 1305, type: !254)
!1026 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grid_x", scope: !958, file: !1, line: 1305, type: !254)
!1027 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grid_y", scope: !958, file: !1, line: 1305, type: !254)
!1028 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grid_z", scope: !958, file: !1, line: 1305, type: !254)
!1029 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margin_x", scope: !958, file: !1, line: 1306, type: !254)
!1030 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margin_y", scope: !958, file: !1, line: 1306, type: !254)
!1031 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icg", scope: !958, file: !1, line: 1307, type: !252)
!1032 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iicg", scope: !958, file: !1, line: 1307, type: !252)
!1033 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgsnr", scope: !958, file: !1, line: 1307, type: !252)
!1034 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i0", scope: !958, file: !1, line: 1307, type: !252)
!1035 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nri", scope: !958, file: !1, line: 1307, type: !252)
!1036 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "naaj", scope: !958, file: !1, line: 1307, type: !252)
!1037 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_icg", scope: !958, file: !1, line: 1307, type: !252)
!1038 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "icg_naaj", scope: !958, file: !1, line: 1307, type: !252)
!1039 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jjcg", scope: !958, file: !1, line: 1307, type: !252)
!1040 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgj0", scope: !958, file: !1, line: 1307, type: !252)
!1041 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jgid", scope: !958, file: !1, line: 1307, type: !252)
!1042 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "grida", scope: !958, file: !1, line: 1308, type: !257)
!1043 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gridnra", scope: !958, file: !1, line: 1308, type: !257)
!1044 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gridind", scope: !958, file: !1, line: 1308, type: !257)
!1045 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bVDWOnly", scope: !958, file: !1, line: 1309, type: !252)
!1046 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bCoulOnly", scope: !958, file: !1, line: 1309, type: !252)
!1047 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xi", scope: !958, file: !1, line: 1310, type: !392)
!1048 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cgcm", scope: !958, file: !1, line: 1310, type: !391)
!1049 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r2", scope: !958, file: !1, line: 1311, type: !254)
!1050 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rs2", scope: !958, file: !1, line: 1311, type: !254)
!1051 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rvdw2", scope: !958, file: !1, line: 1311, type: !254)
!1052 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rcoul2", scope: !958, file: !1, line: 1311, type: !254)
!1053 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rm2", scope: !958, file: !1, line: 1311, type: !254)
!1054 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rl2", scope: !958, file: !1, line: 1311, type: !254)
!1055 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "XI", scope: !958, file: !1, line: 1311, type: !254)
!1056 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "YI", scope: !958, file: !1, line: 1311, type: !254)
!1057 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ZI", scope: !958, file: !1, line: 1311, type: !254)
!1058 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dcx", scope: !958, file: !1, line: 1311, type: !254)
!1059 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dcy", scope: !958, file: !1, line: 1311, type: !254)
!1060 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dcz", scope: !958, file: !1, line: 1311, type: !254)
!1061 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp1", scope: !958, file: !1, line: 1311, type: !254)
!1062 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp2", scope: !958, file: !1, line: 1311, type: !254)
!1063 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i_eg_excl", scope: !958, file: !1, line: 1312, type: !257)
!1064 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_twinrange", scope: !958, file: !1, line: 1313, type: !252)
!1065 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "use_two_cutoffs", scope: !958, file: !1, line: 1313, type: !252)
!1066 = !DISubprogram(name: "setexcl", scope: !1, file: !1, line: 886, type: !1067, isLocal: true, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct.t_block*, i32, i64*)* @setexcl, variables: !1069)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !258, !258, !837, !252, !978}
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076}
!1070 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 1, scope: !1066, file: !1, line: 886, type: !258)
!1071 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !1066, file: !1, line: 886, type: !258)
!1072 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "excl", arg: 3, scope: !1066, file: !1, line: 886, type: !837)
!1073 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 4, scope: !1066, file: !1, line: 886, type: !252)
!1074 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bexcl", arg: 5, scope: !1066, file: !1, line: 887, type: !978)
